#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABLScript_Gorilla_Leap_Target

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABLScript_Gorilla_Leap_Target.ABLScript_Gorilla_Leap_Target_C.RunScript
// 0x0150 (0x0150 - 0x0000)
struct ABLScript_Gorilla_Leap_Target_C_RunScript final
{
public:
	struct FScriptActorInfo                       Target;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FScriptActorInfo                       Instigator;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FScriptActorInfo                       Source;                                            // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FVector                                AttackOrigin;                                      // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScriptTriggerInfo                     TriggerInfo;                                       // 0x0048(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinDis;                                            // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Closest_Target;                                    // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGorilla_C*                             K2Node_DynamicCast_AsGorilla;                      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnServer_ReturnValue;            // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGuid, struct FHateEntry>         CallFunc_GetHatedCharacters_ReturnValue;           // 0x00A8(0x0050)()
	TArray<struct FHateEntry>                     CallFunc_Map_Values_Values;                        // 0x00F8(0x0010)(ReferenceParm)
	struct FHateEntry                             CallFunc_Array_Get_Item;                           // 0x0108(0x0014)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_Gorilla_Leap_Target_C_RunScript) == 0x000008, "Wrong alignment on ABLScript_Gorilla_Leap_Target_C_RunScript");
static_assert(sizeof(ABLScript_Gorilla_Leap_Target_C_RunScript) == 0x000150, "Wrong size on ABLScript_Gorilla_Leap_Target_C_RunScript");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, Target) == 0x000000, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::Target' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, Instigator) == 0x000010, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::Instigator' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, Source) == 0x000020, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::Source' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, AttackOrigin) == 0x000030, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::AttackOrigin' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, TriggerInfo) == 0x000048, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::TriggerInfo' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, ReturnValue) == 0x000060, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, MinDis) == 0x000068, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::MinDis' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, Closest_Target) == 0x000070, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::Closest_Target' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, Temp_int_Array_Index_Variable) == 0x000078, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, K2Node_DynamicCast_AsGorilla) == 0x000080, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::K2Node_DynamicCast_AsGorilla' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, CallFunc_IsRunningOnServer_ReturnValue) == 0x000089, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::CallFunc_IsRunningOnServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, CallFunc_GetHatedCharacters_ReturnValue) == 0x0000A8, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::CallFunc_GetHatedCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, CallFunc_Map_Values_Values) == 0x0000F8, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, CallFunc_Array_Get_Item) == 0x000108, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, CallFunc_Array_Length_ReturnValue) == 0x00011C, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000120, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, CallFunc_Vector_Distance_ReturnValue) == 0x000138, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, Temp_int_Loop_Counter_Variable) == 0x000140, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000144, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, CallFunc_Less_IntInt_ReturnValue) == 0x000145, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Gorilla_Leap_Target_C_RunScript, CallFunc_Add_IntInt_ReturnValue) == 0x000148, "Member 'ABLScript_Gorilla_Leap_Target_C_RunScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

