#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABLScript_Ooze_DebuffApplication

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABLScript_Ooze_DebuffApplication.ABLScript_Ooze_DebuffApplication_C.RunScript
// 0x0FF0 (0x0FF0 - 0x0000)
struct ABLScript_Ooze_DebuffApplication_C_RunScript final
{
public:
	struct FScriptActorInfo                       Target;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FScriptActorInfo                       Instigator;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FScriptActorInfo                       Source;                                            // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FVector                                AttackOrigin;                                      // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScriptTriggerInfo                     TriggerInfo;                                       // 0x0048(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEffectId>                      ValidDebuffs;                                      // 0x0068(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectId                              CallFunc_Array_Random_OutItem;                     // 0x0088(0x0018)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectRecord                          CallFunc_GetEffectRecordById_ReturnValue;          // 0x00A8(0x0788)(ConstParm)
	bool                                          CallFunc_TryApplyEffect_ReturnValue;               // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_831[0x3];                                      // 0x0831(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0834(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEffectId                              CallFunc_Array_Get_Item;                           // 0x0838(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FEffectRecord                          CallFunc_GetEffectRecordById_ReturnValue_1;        // 0x0850(0x0788)(ConstParm)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0FD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0FDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasEffect_ReturnValue;                    // 0x0FE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE1[0x3];                                      // 0x0FE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0FE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0FE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_Ooze_DebuffApplication_C_RunScript) == 0x000008, "Wrong alignment on ABLScript_Ooze_DebuffApplication_C_RunScript");
static_assert(sizeof(ABLScript_Ooze_DebuffApplication_C_RunScript) == 0x000FF0, "Wrong size on ABLScript_Ooze_DebuffApplication_C_RunScript");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, Target) == 0x000000, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::Target' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, Instigator) == 0x000010, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::Instigator' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, Source) == 0x000020, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::Source' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, AttackOrigin) == 0x000030, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::AttackOrigin' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, TriggerInfo) == 0x000048, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::TriggerInfo' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, ReturnValue) == 0x000060, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, ValidDebuffs) == 0x000068, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::ValidDebuffs' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, Temp_int_Array_Index_Variable) == 0x000078, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_IsValid_ReturnValue) == 0x00007C, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_Array_Random_OutItem) == 0x000088, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_Array_Random_OutIndex) == 0x0000A0, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A4, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_GetEffectRecordById_ReturnValue) == 0x0000A8, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_GetEffectRecordById_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_TryApplyEffect_ReturnValue) == 0x000830, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_TryApplyEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, Temp_int_Loop_Counter_Variable) == 0x000834, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_Array_Get_Item) == 0x000838, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_GetEffectRecordById_ReturnValue_1) == 0x000850, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_GetEffectRecordById_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_Array_AddUnique_ReturnValue) == 0x000FD8, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_Add_IntInt_ReturnValue) == 0x000FDC, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_HasEffect_ReturnValue) == 0x000FE0, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_HasEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_Array_Length_ReturnValue_1) == 0x000FE4, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_DebuffApplication_C_RunScript, CallFunc_Less_IntInt_ReturnValue) == 0x000FE8, "Member 'ABLScript_Ooze_DebuffApplication_C_RunScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

