#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABLScript_Elderdragon_Fire_FlameAbsorption

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function ABLScript_Elderdragon_Fire_FlameAbsorption.ABLScript_Elderdragon_Fire_FlameAbsorption_C.ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption
// 0x1590 (0x1590 - 0x0000)
struct ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AElderDragon_Fire_C*                    K2Node_DynamicCast_AsElder_Dragon_Fire;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	struct FAbilityHitRecord                      CallFunc_GetHitRecordById_ReturnValue;             // 0x0050(0x0A30)(ConstParm)
	struct FHitHistory                            CallFunc_TriggerHitOnActors_HitHistory;            // 0x0A80(0x0018)(ContainsInstancedReference)
	TArray<struct FHitInst>                       CallFunc_TriggerHitOnActors_ReturnValue;           // 0x0A98(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FAbilityHitRecord                      CallFunc_GetHitRecordById_ReturnValue_1;           // 0x0AA8(0x0A30)(ConstParm)
	TArray<class AElderDragon_Fire_FlameMinion_C*> CallFunc_RefreshOwnedMinion_NewList;              // 0x14D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue; // 0x14E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14E9[0x7];                                     // 0x14E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AElderDragon_Fire_FlameMinion_C*        CallFunc_Array_Get_Item;                           // 0x14F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x14F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14FC[0x4];                                     // 0x14FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x1500(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x1508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x1520(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x1530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitHistory                            CallFunc_TriggerHitOnActors_HitHistory_1;          // 0x1538(0x0018)(ContainsInstancedReference)
	TArray<struct FHitInst>                       CallFunc_TriggerHitOnActors_ReturnValue_1;         // 0x1550(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x1560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue_1; // 0x1561(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1562[0x2];                                     // 0x1562(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x1564(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x156C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x1570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1571[0x3];                                     // 0x1571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x1574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x1578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_157C[0x4];                                     // 0x157C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AElderDragon_Fire_FlameMinion_C*        CallFunc_Array_Get_Item_1;                         // 0x1580(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x1588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Valid_Minion_Valid;                    // 0x158C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x158D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption) == 0x000008, "Wrong alignment on ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption");
static_assert(sizeof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption) == 0x001590, "Wrong size on ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, EntryPoint) == 0x000000, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, Temp_int_Array_Index_Variable) == 0x000004, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, K2Node_DynamicCast_AsElder_Dragon_Fire) == 0x000018, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::K2Node_DynamicCast_AsElder_Dragon_Fire' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, K2Node_MakeArray_Array) == 0x000040, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_GetHitRecordById_ReturnValue) == 0x000050, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_GetHitRecordById_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_TriggerHitOnActors_HitHistory) == 0x000A80, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_TriggerHitOnActors_HitHistory' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_TriggerHitOnActors_ReturnValue) == 0x000A98, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_TriggerHitOnActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_GetHitRecordById_ReturnValue_1) == 0x000AA8, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_GetHitRecordById_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_RefreshOwnedMinion_NewList) == 0x0014D8, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_RefreshOwnedMinion_NewList' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue) == 0x0014E8, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_Array_Get_Item) == 0x0014F0, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_Array_Length_ReturnValue) == 0x0014F8, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_GetBlackboard_ReturnValue) == 0x001500, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x001508, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, K2Node_MakeArray_Array_1) == 0x001520, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_Vector_Distance_ReturnValue) == 0x001530, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_TriggerHitOnActors_HitHistory_1) == 0x001538, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_TriggerHitOnActors_HitHistory_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_TriggerHitOnActors_ReturnValue_1) == 0x001550, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_TriggerHitOnActors_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x001560, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue_1) == 0x001561, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_MakeLiteralName_ReturnValue) == 0x001564, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, Temp_int_Loop_Counter_Variable_1) == 0x00156C, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_Less_IntInt_ReturnValue) == 0x001570, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_Add_IntInt_ReturnValue_1) == 0x001574, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_Array_Add_ReturnValue) == 0x001578, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_Array_Get_Item_1) == 0x001580, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_Array_Length_ReturnValue_1) == 0x001588, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_Is_Valid_Minion_Valid) == 0x00158C, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_Is_Valid_Minion_Valid' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption, CallFunc_Less_IntInt_ReturnValue_1) == 0x00158D, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function ABLScript_Elderdragon_Fire_FlameAbsorption.ABLScript_Elderdragon_Fire_FlameAbsorption_C.Is Valid Minion
// 0x0010 (0x0010 - 0x0000)
struct ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion final
{
public:
	class AElderDragon_Fire_FlameMinion_C*        Minion;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion) == 0x000008, "Wrong alignment on ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion");
static_assert(sizeof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion) == 0x000010, "Wrong size on ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion, Minion) == 0x000000, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion::Minion' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion, Valid) == 0x000008, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion::Valid' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion, CallFunc_IsDead_ReturnValue) == 0x000009, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_Is_Valid_Minion::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function ABLScript_Elderdragon_Fire_FlameAbsorption.ABLScript_Elderdragon_Fire_FlameAbsorption_C.RefreshOwnedMinion
// 0x0048 (0x0048 - 0x0000)
struct ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion final
{
public:
	TArray<class AElderDragon_Fire_FlameMinion_C*> NewList;                                          // 0x0000(0x0010)(Parm, OutParm)
	TArray<class AElderDragon_Fire_FlameMinion_C*> Refreshed;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AElderDragon_Fire_FlameMinion_C*        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Valid_Minion_Valid;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion) == 0x000008, "Wrong alignment on ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion");
static_assert(sizeof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion) == 0x000048, "Wrong size on ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion, NewList) == 0x000000, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion::NewList' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion, Refreshed) == 0x000010, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion::Refreshed' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion, Temp_int_Array_Index_Variable) == 0x000020, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion, CallFunc_Array_Get_Item) == 0x000030, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion, CallFunc_Is_Valid_Minion_Valid) == 0x000040, "Member 'ABLScript_Elderdragon_Fire_FlameAbsorption_C_RefreshOwnedMinion::CallFunc_Is_Valid_Minion_Valid' has a wrong offset!");

}

