#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABLScript_Ooze_Duplicate

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABLScript_Ooze_Duplicate.ABLScript_Ooze_Duplicate_C.RunScript
// 0x0140 (0x0140 - 0x0000)
struct ABLScript_Ooze_Duplicate_C_RunScript final
{
public:
	struct FScriptActorInfo                       Target;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FScriptActorInfo                       Instigator;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FScriptActorInfo                       Source;                                            // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FVector                                AttackOrigin;                                      // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScriptTriggerInfo                     TriggerInfo;                                       // 0x0048(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOoze_C*                                K2Node_DynamicCast_AsOoze;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthPercent_ReturnValue;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValueAsInt_ReturnValue;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00B0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPCCharacter*                          CallFunc_SpawnNPC_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValueAsFloat_FloatValue_ImplicitCast;  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_Ooze_Duplicate_C_RunScript) == 0x000010, "Wrong alignment on ABLScript_Ooze_Duplicate_C_RunScript");
static_assert(sizeof(ABLScript_Ooze_Duplicate_C_RunScript) == 0x000140, "Wrong size on ABLScript_Ooze_Duplicate_C_RunScript");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, Target) == 0x000000, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::Target' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, Instigator) == 0x000010, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::Instigator' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, Source) == 0x000020, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::Source' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, AttackOrigin) == 0x000030, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::AttackOrigin' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, TriggerInfo) == 0x000048, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::TriggerInfo' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, ReturnValue) == 0x000060, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_MakeLiteralName_ReturnValue) == 0x000064, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_MakeLiteralName_ReturnValue_1) == 0x00006C, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, K2Node_DynamicCast_AsOoze) == 0x000078, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::K2Node_DynamicCast_AsOoze' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_MakeLiteralName_ReturnValue_2) == 0x000084, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_GetHealthPercent_ReturnValue) == 0x00008C, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_GetHealthPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_GetBlackboard_ReturnValue) == 0x000090, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000098, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_GetValueAsInt_ReturnValue) == 0x0000A0, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_GetValueAsInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_IsValid_ReturnValue) == 0x0000A4, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_GetTransform_ReturnValue) == 0x0000B0, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_SpawnNPC_ReturnValue) == 0x000110, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_SpawnNPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_GetBlackboard_ReturnValue_1) == 0x000118, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_IsValid_ReturnValue_1) == 0x000120, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_BooleanAND_ReturnValue) == 0x000121, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000128, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABLScript_Ooze_Duplicate_C_RunScript, CallFunc_SetValueAsFloat_FloatValue_ImplicitCast) == 0x000130, "Member 'ABLScript_Ooze_Duplicate_C_RunScript::CallFunc_SetValueAsFloat_FloatValue_ImplicitCast' has a wrong offset!");

}

