#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABLScript_Elderdragon_Fire_FlameAbsorption

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ABLScript_Elderdragon_Fire_FlameAbsorption.ABLScript_Elderdragon_Fire_FlameAbsorption_C
// 0x0058 (0x10C8 - 0x1070)
class UABLScript_Elderdragon_Fire_FlameAbsorption_C final : public UAoCNotifyBlueprint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AElderDragon_Fire_C*                    Agent;                                             // 0x1078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Range;                                             // 0x1080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AElderDragon_Fire_FlameMinion_C*> Absorbing_Flame_Minions;                          // 0x1088(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FAbilityHitId                          BuffHit;                                           // 0x1098(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAbilityHitId                          AbsorptionHit;                                     // 0x10B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlameAbsorption(int32 EntryPoint);
	void Is_Valid_Minion(class AElderDragon_Fire_FlameMinion_C* Minion, bool* Valid);
	void NotifyBegin();
	void NotifyEnd();
	void RefreshOwnedMinion(TArray<class AElderDragon_Fire_FlameMinion_C*>* NewList);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABLScript_Elderdragon_Fire_FlameAbsorption_C">();
	}
	static class UABLScript_Elderdragon_Fire_FlameAbsorption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABLScript_Elderdragon_Fire_FlameAbsorption_C>();
	}
};
static_assert(alignof(UABLScript_Elderdragon_Fire_FlameAbsorption_C) == 0x000008, "Wrong alignment on UABLScript_Elderdragon_Fire_FlameAbsorption_C");
static_assert(sizeof(UABLScript_Elderdragon_Fire_FlameAbsorption_C) == 0x0010C8, "Wrong size on UABLScript_Elderdragon_Fire_FlameAbsorption_C");
static_assert(offsetof(UABLScript_Elderdragon_Fire_FlameAbsorption_C, UberGraphFrame) == 0x001070, "Member 'UABLScript_Elderdragon_Fire_FlameAbsorption_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABLScript_Elderdragon_Fire_FlameAbsorption_C, Agent) == 0x001078, "Member 'UABLScript_Elderdragon_Fire_FlameAbsorption_C::Agent' has a wrong offset!");
static_assert(offsetof(UABLScript_Elderdragon_Fire_FlameAbsorption_C, Range) == 0x001080, "Member 'UABLScript_Elderdragon_Fire_FlameAbsorption_C::Range' has a wrong offset!");
static_assert(offsetof(UABLScript_Elderdragon_Fire_FlameAbsorption_C, Absorbing_Flame_Minions) == 0x001088, "Member 'UABLScript_Elderdragon_Fire_FlameAbsorption_C::Absorbing_Flame_Minions' has a wrong offset!");
static_assert(offsetof(UABLScript_Elderdragon_Fire_FlameAbsorption_C, BuffHit) == 0x001098, "Member 'UABLScript_Elderdragon_Fire_FlameAbsorption_C::BuffHit' has a wrong offset!");
static_assert(offsetof(UABLScript_Elderdragon_Fire_FlameAbsorption_C, AbsorptionHit) == 0x0010B0, "Member 'UABLScript_Elderdragon_Fire_FlameAbsorption_C::AbsorptionHit' has a wrong offset!");

}

