#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABLScript_ElderDragon_Fire_RainofFire

#include "Basic.hpp"

#include "ElderDragon_Fire_RainofFireQueryPoint_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function ABLScript_ElderDragon_Fire_RainofFire.ABLScript_ElderDragon_Fire_RainofFire_C.ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire
// 0x0080 (0x0080 - 0x0000)
struct ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AElderDragon_Fire_C*                    K2Node_DynamicCast_AsElder_Dragon_Fire;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FrameDeltaTime;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue_1; // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire) == 0x000008, "Wrong alignment on ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire");
static_assert(sizeof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire) == 0x000080, "Wrong size on ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, EntryPoint) == 0x000000, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, Temp_int_Variable) == 0x000004, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, K2Node_DynamicCast_AsElder_Dragon_Fire) == 0x000008, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::K2Node_DynamicCast_AsElder_Dragon_Fire' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, Temp_int_Variable_1) == 0x000014, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_FFloor_ReturnValue) == 0x000020, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_FFloor_ReturnValue_1) == 0x000030, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_Multiply_IntInt_ReturnValue) == 0x000034, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, K2Node_Event_FrameDeltaTime) == 0x000038, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::K2Node_Event_FrameDeltaTime' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000040, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, Temp_int_Variable_2) == 0x000048, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00004C, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000058, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_Add_IntInt_ReturnValue_2) == 0x000064, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue) == 0x000068, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue_1) == 0x000069, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_Add_IntInt_ReturnValue_3) == 0x00006C, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000070, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_ExecuteUbergraph_ABLScript_ElderDragon_Fire_RainofFire::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABLScript_ElderDragon_Fire_RainofFire.ABLScript_ElderDragon_Fire_RainofFire_C.Generate Query Points
// 0x01D0 (0x01D0 - 0x0000)
struct ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points final
{
public:
	double                                        Offset;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAoCAbilityLingeringEffect*>     CallFunc_GetOwnedLingeringZones_ReturnValue;       // 0x0070(0x0010)(ReferenceParm)
	class AAoCAbilityLingeringEffect*             CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AElderDragon_Fire_FlamePatch_C*         K2Node_DynamicCast_AsElder_Dragon_Fire_Flame_Patch; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FElderDragon_Fire_RainofFireQueryPoint K2Node_MakeStruct_ElderDragon_Fire_RainofFireQueryPoint; // 0x0180(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points) == 0x000008, "Wrong alignment on ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points");
static_assert(sizeof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points) == 0x0001D0, "Wrong size on ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, Offset) == 0x000000, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::Offset' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, Temp_int_Array_Index_Variable) == 0x000008, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000014, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, Temp_int_Variable) == 0x000024, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, Temp_int_Variable_1) == 0x00003C, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000040, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000048, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000050, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Add_IntInt_ReturnValue_2) == 0x000058, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_FTrunc_ReturnValue) == 0x00005C, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000064, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Max_ReturnValue) == 0x000068, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_GetOwnedLingeringZones_ReturnValue) == 0x000070, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_GetOwnedLingeringZones_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Array_Get_Item) == 0x000080, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, K2Node_DynamicCast_AsElder_Dragon_Fire_Flame_Patch) == 0x0000A0, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::K2Node_DynamicCast_AsElder_Dragon_Fire_Flame_Patch' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Vector_Distance_ReturnValue) == 0x0000B0, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000B8, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000D1, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Array_Length_ReturnValue_1) == 0x0000D4, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_BooleanOR_ReturnValue) == 0x0000D8, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Less_IntInt_ReturnValue) == 0x0000D9, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000DA, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000DB, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Divide_IntInt_ReturnValue) == 0x0000DC, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0000E8, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000F0, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000F8, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_MakeVector_ReturnValue) == 0x000100, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000118, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_MakeVector_ReturnValue_1) == 0x000120, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000138, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Add_VectorVector_ReturnValue) == 0x000150, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000168, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, K2Node_MakeStruct_ElderDragon_Fire_RainofFireQueryPoint) == 0x000180, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::K2Node_MakeStruct_ElderDragon_Fire_RainofFireQueryPoint' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001A8, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Array_Add_ReturnValue) == 0x0001B0, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_FFloor_ReturnValue) == 0x0001B4, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x0001B8, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0001C0, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0001C8, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Generate_Query_Points::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");

// Function ABLScript_ElderDragon_Fire_RainofFire.ABLScript_ElderDragon_Fire_RainofFire_C.GetSpawnNumber
// 0x0024 (0x0024 - 0x0000)
struct ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber) == 0x000004, "Wrong alignment on ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber");
static_assert(sizeof(ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber) == 0x000024, "Wrong size on ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber, CallFunc_Divide_IntInt_ReturnValue) == 0x000008, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber, CallFunc_Multiply_IntInt_ReturnValue) == 0x00000C, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber, CallFunc_Array_Length_ReturnValue_1) == 0x000010, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000014, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber, CallFunc_Array_Length_ReturnValue_2) == 0x000018, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber, CallFunc_Divide_IntInt_ReturnValue_1) == 0x00001C, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_GetSpawnNumber::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ABLScript_ElderDragon_Fire_RainofFire.ABLScript_ElderDragon_Fire_RainofFire_C.Invalidate Proximity Query Points
// 0x0140 (0x0140 - 0x0000)
struct ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points final
{
public:
	struct FVector                                Loc;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Bottom;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Top;                                               // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Right;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Left;                                              // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TestingIndex;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FElderDragon_Fire_RainofFireQueryPoint Testing;                                           // 0x0030(0x0028)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSizeXY_ReturnValue;                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points) == 0x000008, "Wrong alignment on ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points");
static_assert(sizeof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points) == 0x000140, "Wrong size on ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, Loc) == 0x000000, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::Loc' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, Bottom) == 0x000018, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::Bottom' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, Top) == 0x00001C, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::Top' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, Right) == 0x000020, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::Right' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, Left) == 0x000024, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::Left' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, TestingIndex) == 0x000028, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::TestingIndex' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, Testing) == 0x000030, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::Testing' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, Temp_int_Variable) == 0x000058, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, CallFunc_Divide_IntInt_ReturnValue) == 0x000064, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000068, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, CallFunc_VSizeXY_ReturnValue) == 0x000080, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::CallFunc_VSizeXY_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, CallFunc_BreakVector_X) == 0x000088, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, CallFunc_BreakVector_Y) == 0x000090, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, CallFunc_BreakVector_Z) == 0x000098, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A0, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, CallFunc_BreakVector_X_1) == 0x0000B8, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points, CallFunc_BreakVector_Y_1) == 0x0000C0, "Member 'ABLScript_ElderDragon_Fire_RainofFire_C_Invalidate_Proximity_Query_Points::CallFunc_BreakVector_Y_1' has a wrong offset!");
