#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABLScript_BogBrute_MudSummon

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ABLScript_BogBrute_MudSummon.ABLScript_BogBrute_MudSummon_C
// 0x0078 (0x10E8 - 0x1070)
class UABLScript_BogBrute_MudSummon_C final : public UAoCNotifyBlueprint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        QueryPointGap;                                     // 0x1078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Range;                                             // 0x1080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DenialRange;                                       // 0x1088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MudPoolNumber;                                     // 0x1090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1094[0x4];                                     // 0x1094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLingeringEffectId                     MudPoolPreparation;                                // 0x1098(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  QueryPoints;                                       // 0x10B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 ValidQueryPointIndexes;                            // 0x10C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         GridSize;                                          // 0x10D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DenialSize;                                        // 0x10D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABogBrute_C*                            Agent;                                             // 0x10D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedIndex;                                     // 0x10E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BuildQueryPoints();
	void DenyQueryPoint(int32 Denial_Index);
	void ExecuteUbergraph_ABLScript_BogBrute_MudSummon(int32 EntryPoint);
	void NotifyBegin();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABLScript_BogBrute_MudSummon_C">();
	}
	static class UABLScript_BogBrute_MudSummon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABLScript_BogBrute_MudSummon_C>();
	}
};
static_assert(alignof(UABLScript_BogBrute_MudSummon_C) == 0x000008, "Wrong alignment on UABLScript_BogBrute_MudSummon_C");
static_assert(sizeof(UABLScript_BogBrute_MudSummon_C) == 0x0010E8, "Wrong size on UABLScript_BogBrute_MudSummon_C");
static_assert(offsetof(UABLScript_BogBrute_MudSummon_C, UberGraphFrame) == 0x001070, "Member 'UABLScript_BogBrute_MudSummon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABLScript_BogBrute_MudSummon_C, QueryPointGap) == 0x001078, "Member 'UABLScript_BogBrute_MudSummon_C::QueryPointGap' has a wrong offset!");
static_assert(offsetof(UABLScript_BogBrute_MudSummon_C, Range) == 0x001080, "Member 'UABLScript_BogBrute_MudSummon_C::Range' has a wrong offset!");
static_assert(offsetof(UABLScript_BogBrute_MudSummon_C, DenialRange) == 0x001088, "Member 'UABLScript_BogBrute_MudSummon_C::DenialRange' has a wrong offset!");
static_assert(offsetof(UABLScript_BogBrute_MudSummon_C, MudPoolNumber) == 0x001090, "Member 'UABLScript_BogBrute_MudSummon_C::MudPoolNumber' has a wrong offset!");
static_assert(offsetof(UABLScript_BogBrute_MudSummon_C, MudPoolPreparation) == 0x001098, "Member 'UABLScript_BogBrute_MudSummon_C::MudPoolPreparation' has a wrong offset!");
static_assert(offsetof(UABLScript_BogBrute_MudSummon_C, QueryPoints) == 0x0010B0, "Member 'UABLScript_BogBrute_MudSummon_C::QueryPoints' has a wrong offset!");
static_assert(offsetof(UABLScript_BogBrute_MudSummon_C, ValidQueryPointIndexes) == 0x0010C0, "Member 'UABLScript_BogBrute_MudSummon_C::ValidQueryPointIndexes' has a wrong offset!");
static_assert(offsetof(UABLScript_BogBrute_MudSummon_C, GridSize) == 0x0010D0, "Member 'UABLScript_BogBrute_MudSummon_C::GridSize' has a wrong offset!");
static_assert(offsetof(UABLScript_BogBrute_MudSummon_C, DenialSize) == 0x0010D4, "Member 'UABLScript_BogBrute_MudSummon_C::DenialSize' has a wrong offset!");
static_assert(offsetof(UABLScript_BogBrute_MudSummon_C, Agent) == 0x0010D8, "Member 'UABLScript_BogBrute_MudSummon_C::Agent' has a wrong offset!");
static_assert(offsetof(UABLScript_BogBrute_MudSummon_C, SelectedIndex) == 0x0010E0, "Member 'UABLScript_BogBrute_MudSummon_C::SelectedIndex' has a wrong offset!");

}

