#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABLScript_Elderdragon_Fire_FlamePillarSummon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABLScript_Elderdragon_Fire_FlamePillarSummon.ABLScript_Elderdragon_Fire_FlamePillarSummon_C.ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon
// 0x01B0 (0x01B0 - 0x0000)
struct ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AElderDragon_Fire_C*                    K2Node_DynamicCast_AsElder_Dragon_Fire;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAoCAbilityLingeringEffect*>     CallFunc_GetOwnedLingeringZones_ReturnValue;       // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAoCAbilityLingeringEffect*             CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AElderDragon_Fire_FlamePatch_C*         K2Node_DynamicCast_AsElder_Dragon_Fire_Flame_Patch; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0120(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPCCharacter*                          CallFunc_SpawnNPC_ReturnValue;                     // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AElderDragon_Fire_FlameMinion_C*        K2Node_DynamicCast_AsElder_Dragon_Fire_Flame_Minion; // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon) == 0x000010, "Wrong alignment on ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon");
static_assert(sizeof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon) == 0x0001B0, "Wrong size on ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, EntryPoint) == 0x000000, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, Temp_int_Array_Index_Variable) == 0x000004, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, K2Node_DynamicCast_AsElder_Dragon_Fire) == 0x000010, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::K2Node_DynamicCast_AsElder_Dragon_Fire' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue) == 0x000038, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_MakeLiteralName_ReturnValue) == 0x00003C, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_GetOwnedLingeringZones_ReturnValue) == 0x000048, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_GetOwnedLingeringZones_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_Array_Get_Item) == 0x000060, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, K2Node_DynamicCast_AsElder_Dragon_Fire_Flame_Patch) == 0x000070, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::K2Node_DynamicCast_AsElder_Dragon_Fire_Flame_Patch' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000080, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A0, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_Not_PreBool_ReturnValue) == 0x0000B8, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_BreakVector_X) == 0x0000C0, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_BreakVector_Y) == 0x0000C8, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_BreakVector_Z) == 0x0000D0, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_Vector_Distance_ReturnValue) == 0x0000D8, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_MakeVector_ReturnValue) == 0x0000E0, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_MakeRotFromX_ReturnValue) == 0x000100, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_BooleanAND_ReturnValue) == 0x000118, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_MakeTransform_ReturnValue) == 0x000120, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_SpawnNPC_ReturnValue) == 0x000180, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_SpawnNPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, K2Node_DynamicCast_AsElder_Dragon_Fire_Flame_Minion) == 0x000188, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::K2Node_DynamicCast_AsElder_Dragon_Fire_Flame_Minion' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, K2Node_DynamicCast_bSuccess_2) == 0x000190, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_GetBlackboard_ReturnValue) == 0x000198, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon, CallFunc_Array_Add_ReturnValue) == 0x0001A0, "Member 'ABLScript_Elderdragon_Fire_FlamePillarSummon_C_ExecuteUbergraph_ABLScript_Elderdragon_Fire_FlamePillarSummon::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

