#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABLScript_BogBrute_MudSummon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function ABLScript_BogBrute_MudSummon.ABLScript_BogBrute_MudSummon_C.BuildQueryPoints
// 0x0040 (0x0040 - 0x0000)
struct ABLScript_BogBrute_MudSummon_C_BuildQueryPoints final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints) == 0x000008, "Wrong alignment on ABLScript_BogBrute_MudSummon_C_BuildQueryPoints");
static_assert(sizeof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints) == 0x000040, "Wrong size on ABLScript_BogBrute_MudSummon_C_BuildQueryPoints");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, Temp_int_Variable) == 0x000000, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, CallFunc_Array_Add_ReturnValue) == 0x00000C, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, CallFunc_FCeil_ReturnValue) == 0x000018, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, CallFunc_Multiply_IntInt_ReturnValue) == 0x00001C, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, Temp_bool_Variable) == 0x000021, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, CallFunc_Array_Add_ReturnValue_1) == 0x000024, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, CallFunc_FFloor_ReturnValue) == 0x000030, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000034, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_BuildQueryPoints, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'ABLScript_BogBrute_MudSummon_C_BuildQueryPoints::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function ABLScript_BogBrute_MudSummon.ABLScript_BogBrute_MudSummon_C.DenyQueryPoint
// 0x0050 (0x0050 - 0x0000)
struct ABLScript_BogBrute_MudSummon_C_DenyQueryPoint final
{
public:
	int32                                         Denial_Index;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_2;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint) == 0x000004, "Wrong alignment on ABLScript_BogBrute_MudSummon_C_DenyQueryPoint");
static_assert(sizeof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint) == 0x000050, "Wrong size on ABLScript_BogBrute_MudSummon_C_DenyQueryPoint");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, Denial_Index) == 0x000000, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::Denial_Index' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, Temp_int_Variable) == 0x000004, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, Temp_bool_Variable) == 0x00000C, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, Temp_int_Variable_1) == 0x000010, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_Array_Get_Item) == 0x000020, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_Array_Add_ReturnValue) == 0x000024, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_Multiply_IntInt_ReturnValue) == 0x000028, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x00002C, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_Add_IntInt_ReturnValue_2) == 0x000030, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_Add_IntInt_ReturnValue_3) == 0x000034, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_Add_IntInt_ReturnValue_4) == 0x000040, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_Multiply_IntInt_ReturnValue_2) == 0x000048, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_Multiply_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_DenyQueryPoint, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00004C, "Member 'ABLScript_BogBrute_MudSummon_C_DenyQueryPoint::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function ABLScript_BogBrute_MudSummon.ABLScript_BogBrute_MudSummon_C.ExecuteUbergraph_ABLScript_BogBrute_MudSummon
// 0x0570 (0x0570 - 0x0000)
struct ABLScript_BogBrute_MudSummon_C_ExecuteUbergraph_ABLScript_BogBrute_MudSummon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCasterRunningOnAuthoritativeServer_ReturnValue; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABogBrute_C*                            K2Node_DynamicCast_AsBog_Brute;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLingeringEffectRecord                 CallFunc_GetLingeringEffectRecordById_ReturnValue; // 0x0050(0x03B8)(ConstParm)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0470(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0488(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0500(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAoCAbilityLingeringEffect*             CallFunc_SpawnLingeringZoneAtLocation_ReturnValue; // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLScript_BogBrute_MudSummon_C_ExecuteUbergraph_ABLScript_BogBrute_MudSummon) == 0x000010, "Wrong alignment on ABLScript_BogBrute_MudSummon_C_ExecuteUbergraph_ABLScript_BogBrute_MudSummon");
static_assert(sizeof(ABLScript_BogBrute_MudSummon_C_ExecuteUbergraph_ABLScript_BogBrute_MudSummon) == 0x000570, "Wrong size on ABLScript_BogBrute_MudSummon_C_ExecuteUbergraph_ABLScript_BogBrute_MudSummon");
static_assert(offsetof(ABLScript_BogBrute_MudSummon_C_ExecuteUbergraph_ABLScript_BogBrute_MudSummon, EntryPoint) == 0x000000, "Member 'ABLScript_BogBrute_MudSummon_C_ExecuteUbergraph_ABLScript_BogBrute_MudSummon::EntryPoint' has a wrong offset!");
