#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABLT_ArcaneVolley_Projectile_Grow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABLT_ArcaneVolley_Projectile_Grow.ABLT_ArcaneVolley_Projectile_Grow_C.ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow
// 0x0048 (0x0048 - 0x0000)
struct ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow) == 0x000008, "Wrong alignment on ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow");
static_assert(sizeof(ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow) == 0x000048, "Wrong size on ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow");
static_assert(offsetof(ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow, EntryPoint) == 0x000000, "Member 'ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow, CallFunc_FClamp_ReturnValue) == 0x000038, "Member 'ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'ABLT_ArcaneVolley_Projectile_Grow_C_ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABLT_ArcaneVolley_Projectile_Grow.ABLT_ArcaneVolley_Projectile_Grow_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ABLT_ArcaneVolley_Projectile_Grow_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABLT_ArcaneVolley_Projectile_Grow_C_ReceiveTick) == 0x000004, "Wrong alignment on ABLT_ArcaneVolley_Projectile_Grow_C_ReceiveTick");
static_assert(sizeof(ABLT_ArcaneVolley_Projectile_Grow_C_ReceiveTick) == 0x000004, "Wrong size on ABLT_ArcaneVolley_Projectile_Grow_C_ReceiveTick");
static_assert(offsetof(ABLT_ArcaneVolley_Projectile_Grow_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ABLT_ArcaneVolley_Projectile_Grow_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

