#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABLT_ArcaneVolley_Projectile_Grow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ABLT_ArcaneVolley_Projectile_Grow.ABLT_ArcaneVolley_Projectile_Grow_C
// 0x0028 (0x05C0 - 0x0598)
class AABLT_ArcaneVolley_Projectile_Grow_C final : public AAoCAbilityProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem2;                                   // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem1;                                   // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABLT_ArcaneVolley_Projectile_Grow(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABLT_ArcaneVolley_Projectile_Grow_C">();
	}
	static class AABLT_ArcaneVolley_Projectile_Grow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AABLT_ArcaneVolley_Projectile_Grow_C>();
	}
};
static_assert(alignof(AABLT_ArcaneVolley_Projectile_Grow_C) == 0x000008, "Wrong alignment on AABLT_ArcaneVolley_Projectile_Grow_C");
static_assert(sizeof(AABLT_ArcaneVolley_Projectile_Grow_C) == 0x0005C0, "Wrong size on AABLT_ArcaneVolley_Projectile_Grow_C");
static_assert(offsetof(AABLT_ArcaneVolley_Projectile_Grow_C, UberGraphFrame) == 0x000598, "Member 'AABLT_ArcaneVolley_Projectile_Grow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AABLT_ArcaneVolley_Projectile_Grow_C, ParticleSystem2) == 0x0005A0, "Member 'AABLT_ArcaneVolley_Projectile_Grow_C::ParticleSystem2' has a wrong offset!");
static_assert(offsetof(AABLT_ArcaneVolley_Projectile_Grow_C, Audio) == 0x0005A8, "Member 'AABLT_ArcaneVolley_Projectile_Grow_C::Audio' has a wrong offset!");
static_assert(offsetof(AABLT_ArcaneVolley_Projectile_Grow_C, ParticleSystem1) == 0x0005B0, "Member 'AABLT_ArcaneVolley_Projectile_Grow_C::ParticleSystem1' has a wrong offset!");
static_assert(offsetof(AABLT_ArcaneVolley_Projectile_Grow_C, Scale) == 0x0005B8, "Member 'AABLT_ArcaneVolley_Projectile_Grow_C::Scale' has a wrong offset!");

}

