#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MNT_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_MNT_Template.ABP_MNT_Template_C.AnimBlueprintGeneratedConstantData
// 0x03A7 (0x03A8 - 0x0001)
struct ABP_MNT_Template::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_3278;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3279;                               // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3280;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3281;                               // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3282;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3283;                               // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3284;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3285;                               // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3286;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3287;                               // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3288;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3289;                              // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3290;                               // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3291;                               // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3292;                               // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3293;                               // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3294;                               // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3295;                               // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3296;                               // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3297;                               // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3298;                              // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_3299;                              // 0x00A0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_3300;                               // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3301;                              // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3302;                               // 0x00BC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3303;                               // 0x00C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3304;                               // 0x00CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3305;                               // 0x00D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3306;                              // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	EAnimGroupRole                                __ByteProperty_3307;                               // 0x00F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_3308;                               // 0x00F4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_3309;                             // 0x00FC(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_3310;                               // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_3311;                              // 0x0130(0x0010)(BlueprintVisible, EditFixedSize)
	EAlphaBlendOption                             __EnumProperty_3312;                               // 0x0140(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3313;                              // 0x0148(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_3314;                              // 0x0158(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_3315;                               // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3316;                               // 0x0170(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3317;                               // 0x0178(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3318;                               // 0x0180(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3319;                               // 0x0188(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3320;                               // 0x0190(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_3321;                               // 0x0198(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_3322;                                 // 0x01A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_3323;                               // 0x01A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_3324;                               // 0x01A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3325;                              // 0x01B0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_3326;                               // 0x01C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3327;                               // 0x01C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3328;                               // 0x01D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_3329;                             // 0x01D8(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_3330;                               // 0x0204(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3331;                               // 0x020C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3332;                                // 0x0214(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3333;                               // 0x0218(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3334;                               // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3335;                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3336;                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3337;                               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3338;                               // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_3339;                             // 0x0248(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_3340;                               // 0x0274(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3341;                               // 0x027C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3342;                               // 0x0284(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3343;                              // 0x028C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3344;                               // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3345;                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3346;                                // 0x02A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3347;                               // 0x02A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3348;                                // 0x02AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3349;                              // 0x02B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_3350;                               // 0x02B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_3351;                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3352;                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3353;                                // 0x02C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3354;                              // 0x02CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_3355;                               // 0x02D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3356;                              // 0x02D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3357;                               // 0x02D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3358;                               // 0x02D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_3359;                               // 0x02DA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_3360;                               // 0x02DB(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3361;                               // 0x02DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3362;                               // 0x02E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3363;                                // 0x02EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_3364;                             // 0x02F0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0310(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0390(0x0018)()
};
static_assert(alignof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_MNT_Template::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData) == 0x0003A8, "Wrong size on ABP_MNT_Template::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3278) == 0x000004, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3278' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3279) == 0x00000C, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3279' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_3280) == 0x000014, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_3280' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3281) == 0x000018, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3281' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_3282) == 0x000020, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_3282' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3283) == 0x000024, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3283' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_3284) == 0x00002C, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_3284' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3285) == 0x000030, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3285' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_3286) == 0x000038, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_3286' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3287) == 0x00003C, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3287' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_3288) == 0x000044, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_3288' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __FloatProperty_3289) == 0x000048, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__FloatProperty_3289' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3290) == 0x00004C, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3290' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3291) == 0x000054, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3291' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3292) == 0x00005C, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3292' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3293) == 0x000064, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3293' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3294) == 0x00006C, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3294' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3295) == 0x000074, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3295' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3296) == 0x00007C, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3296' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3297) == 0x000084, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3297' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3298) == 0x000090, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3298' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3299) == 0x0000A0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3299' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3300) == 0x0000B0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3300' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __FloatProperty_3301) == 0x0000B8, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__FloatProperty_3301' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3302) == 0x0000BC, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3302' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3303) == 0x0000C4, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3303' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3304) == 0x0000CC, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3304' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3305) == 0x0000D4, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3305' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3306) == 0x0000E0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3306' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __ByteProperty_3307) == 0x0000F0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__ByteProperty_3307' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3308) == 0x0000F4, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3308' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __StructProperty_3309) == 0x0000FC, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__StructProperty_3309' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3310) == 0x000128, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3310' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3311) == 0x000130, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3311' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_3312) == 0x000140, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_3312' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3313) == 0x000148, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3313' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3314) == 0x000158, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3314' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3315) == 0x000168, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3315' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3316) == 0x000170, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3316' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3317) == 0x000178, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3317' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3318) == 0x000180, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3318' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3319) == 0x000188, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3319' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3320) == 0x000190, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3320' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __BlendProfile_3321) == 0x000198, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__BlendProfile_3321' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __CurveFloat_3322) == 0x0001A0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__CurveFloat_3322' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_3323) == 0x0001A8, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_3323' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_3324) == 0x0001A9, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_3324' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3325) == 0x0001B0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3325' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3326) == 0x0001C0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3326' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3327) == 0x0001C8, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3327' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3328) == 0x0001D0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3328' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __StructProperty_3329) == 0x0001D8, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__StructProperty_3329' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3330) == 0x000204, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3330' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3331) == 0x00020C, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3331' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_3332) == 0x000214, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_3332' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3333) == 0x000218, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3333' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3334) == 0x000220, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3334' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3335) == 0x000228, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3335' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3336) == 0x000230, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3336' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3337) == 0x000238, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3337' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3338) == 0x000240, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3338' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __StructProperty_3339) == 0x000248, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__StructProperty_3339' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3340) == 0x000274, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3340' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3341) == 0x00027C, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3341' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3342) == 0x000284, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3342' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __FloatProperty_3343) == 0x00028C, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__FloatProperty_3343' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3344) == 0x000290, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3344' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3345) == 0x000298, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3345' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_3346) == 0x0002A0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_3346' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3347) == 0x0002A4, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3347' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_3348) == 0x0002AC, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_3348' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __FloatProperty_3349) == 0x0002B0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__FloatProperty_3349' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_3350) == 0x0002B4, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_3350' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3351) == 0x0002B8, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3351' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3352) == 0x0002C0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3352' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_3353) == 0x0002C8, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_3353' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __FloatProperty_3354) == 0x0002CC, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__FloatProperty_3354' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __ByteProperty_3355) == 0x0002D0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__ByteProperty_3355' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __FloatProperty_3356) == 0x0002D4, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__FloatProperty_3356' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __BoolProperty_3357) == 0x0002D8, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__BoolProperty_3357' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __BoolProperty_3358) == 0x0002D9, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__BoolProperty_3358' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_3359) == 0x0002DA, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_3359' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __ByteProperty_3360) == 0x0002DB, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__ByteProperty_3360' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3361) == 0x0002DC, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3361' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_3362) == 0x0002E4, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_3362' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_3363) == 0x0002EC, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_3363' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, __StructProperty_3364) == 0x0002F0, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::__StructProperty_3364' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000310, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_MNT_Template::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000390, "Member 'ABP_MNT_Template::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_MNT_Template.ABP_MNT_Template_C.AnimBlueprintGeneratedMutableData
// 0x0337 (0x0338 - 0x0001)
struct ABP_MNT_Template::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_24;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_28;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_29;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_30;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_31;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_32;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_33;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_34;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_35;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_37;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_38;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_39;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_40;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_41;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_42;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_43;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_44;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_45;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_46;                                // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_47;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_48;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_49;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_50;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_51;                                // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_52;                                // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_53;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_54;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_55;                                // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_56;                                // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_57;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_58;                                // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_59;                                // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_60;                                 // 0x00EC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_61;                                // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_62;                                // 0x00F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_63;                                 // 0x00F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_64;                                // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_65;                                // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_66;                                // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_67;                                // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_68;                                // 0x010C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_69;                                // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_70;                                 // 0x0114(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_71;                                // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_72;                                // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_73;                                // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_74;                                // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_75;                                // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_76;                                // 0x012C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_77;                                // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_78;                                // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_79;                                // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_80;                                // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_81;                                 // 0x0140(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_82;                                // 0x0144(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_83;                                // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_84;                                 // 0x014C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_85;                                // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_86;                                // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_87;                                // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_88;                                // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_89;                                // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_90;                                 // 0x0164(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_91;                                // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_92;                                // 0x016C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_93;                                 // 0x0170(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_94;                                // 0x0178(0x0010)(BlueprintVisible, EditFixedSize)
	int32                                         __IntProperty_95;                                  // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
