#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MNT_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_MNT_Template_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_MNT_Template.ABP_MNT_Template_C
// 0xB710 (0xD480 - 0x1D70)
class UABP_MNT_Template_C : public UAoCMountAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1D70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_MNT_Template::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;             // 0x1D78(0x0338)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x20B0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x20B8(0x0008)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x20C0(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x21E8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x2208(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_18;                  // 0x2228(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_17;                  // 0x2270(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x22B8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x2338(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x23B8(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x2438(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x2560(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x2588(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x25A8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x25C8(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x25F0(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x2718(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2740(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2760(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_16;                  // 0x2780(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x27C8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x27F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_161;                // 0x2818(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_160;                // 0x2840(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_159;                // 0x2868(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_158;                // 0x2890(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_157;                // 0x28B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_156;                // 0x28E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_155;                // 0x2908(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_154;                // 0x2930(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_153;                // 0x2958(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_94;                      // 0x2980(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x29A0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_93;                      // 0x29C8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x29E8(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_52;         // 0x2A10(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_92;                      // 0x2B28(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_19;                 // 0x2B48(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_91;                      // 0x2BB8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_24;                     // 0x2BD8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x2CA0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_152;                // 0x2D20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_151;                // 0x2D48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_150;                // 0x2D70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_149;                // 0x2D98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_148;                // 0x2DC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_147;                // 0x2DE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_146;                // 0x2E10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_145;                // 0x2E38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_144;                // 0x2E60(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_90;                      // 0x2E88(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_143;                // 0x2EA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_142;                // 0x2ED0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_141;                // 0x2EF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_140;                // 0x2F20(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x2F48(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_89;                      // 0x2F90(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x2FB0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_88;                      // 0x2FF8(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_87;                      // 0x3018(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_23;                     // 0x3038(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_86;                      // 0x3100(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_139;                // 0x3120(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_138;                // 0x3148(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_137;                // 0x3170(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_136;                // 0x3198(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_135;                // 0x31C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_134;                // 0x31E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_133;                // 0x3210(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_85;                      // 0x3238(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_18;                 // 0x3258(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_84;                      // 0x32C8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_17;                 // 0x32E8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_83;                      // 0x3358(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_16;                 // 0x3378(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_82;                      // 0x33E8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_22;                     // 0x3408(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_81;                      // 0x34D0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_15;                 // 0x34F0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_80;                      // 0x3560(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_21;                     // 0x3580(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x3648(0x0080)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_51;         // 0x36C8(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_14;                 // 0x37E0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_79;                      // 0x3850(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_20;                     // 0x3870(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x3938(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_132;                // 0x39B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_131;                // 0x39E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_130;                // 0x3A08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_129;                // 0x3A30(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_78;                      // 0x3A58(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_50;         // 0x3A78(0x0118)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_128;                // 0x3B90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_127;                // 0x3BB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_126;                // 0x3BE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_125;                // 0x3C08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_124;                // 0x3C30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_123;                // 0x3C58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_122;                // 0x3C80(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_77;                      // 0x3CA8(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_49;         // 0x3CC8(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_13;                 // 0x3DE0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_76;                      // 0x3E50(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_12;                 // 0x3E70(0x0070)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_48;         // 0x3EE0(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75;                      // 0x3FF8(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_47;         // 0x4018(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_11;                 // 0x4130(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74;                      // 0x41A0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_19;                     // 0x41C0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73;                      // 0x4288(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10;                 // 0x42A8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_72;                      // 0x4318(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_18;                     // 0x4338(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x4400(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x4480(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x44C8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_121;                // 0x4510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_120;                // 0x4538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_119;                // 0x4560(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118;                // 0x4588(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_117;                // 0x45B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116;                // 0x45D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_115;                // 0x4600(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_114;                // 0x4628(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_113;                // 0x4650(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_112;                // 0x4678(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_111;                // 0x46A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_110;                // 0x46C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_109;                // 0x46F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_108;                // 0x4718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_107;                // 0x4740(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_106;                // 0x4768(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0x4790(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0x47B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0x47E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0x4808(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0x4830(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0x4858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0x4880(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x48A8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x48F0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x49B8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71;                      // 0x49E0(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_46;         // 0x4A00(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x4B18(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70;                      // 0x4B60(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0x4B80(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x4BA8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_69;                      // 0x4BF0(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_45;         // 0x4C10(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x4D28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68;                      // 0x4D70(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x4D90(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_67;                      // 0x4DB8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0x4DD8(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_44;         // 0x4E00(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x4F18(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66;                      // 0x4F60(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_43;         // 0x4F80(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x5098(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_65;                      // 0x50E0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0x5100(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x5128(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64;                      // 0x5150(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_17;                     // 0x5170(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_15;                  // 0x5238(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x5280(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x53A8(0x0020)()
	uint8                                         Pad_53C8[0x8];                                     // 0x53C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x53D0(0x0950)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0x5D20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0x5D48(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x5D70(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_63;                      // 0x5DB8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x5DD8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_62;                      // 0x5E20(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x5E40(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0x5E88(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_16;                     // 0x5EA8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x5F70(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0x5FF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0x6018(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0x6040(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0x6068(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0x6090(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0x60B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0x60E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0x6108(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_42;         // 0x6130(0x0118)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_14;                  // 0x6248(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_41;         // 0x6290(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_40;         // 0x63A8(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x64C0(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_39;         // 0x6508(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x6620(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_13;                  // 0x6668(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_38;         // 0x66B0(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_37;         // 0x67C8(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x68E0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0x6928(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_36;         // 0x6948(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_35;         // 0x6A60(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_34;         // 0x6B78(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x6C90(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0x6CB8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x6D00(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_33;         // 0x6D28(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x6E40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x6E68(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0x6E90(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_32;         // 0x6ED8(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_31;         // 0x6FF0(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_30;         // 0x7108(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_29;         // 0x7220(0x0118)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x7338(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_28;         // 0x7380(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0x7498(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x74B8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0x74E0(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0x7500(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_15;                     // 0x7520(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x75E8(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0x7668(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0x7690(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0x76B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0x76E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x7708(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x7730(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x7778(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0x77C0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x77E0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0x7808(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x7828(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x7870(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x78B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x7900(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x7948(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x7990(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x79D8(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x7A20(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x7A68(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x7AB0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0x7AF8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_14;                     // 0x7B18(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x7BE0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0x7C60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0x7C88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0x7CB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0x7CD8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0x7D00(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x7D20(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_27;         // 0x7D48(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_26;         // 0x7E60(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0x7F78(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_25;         // 0x7F98(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x80B0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x80F8(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_24;         // 0x8140(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x8258(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0x82A0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_13;                     // 0x82C0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x8388(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0x8408(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0x8430(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0x8458(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0x8480(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0x84A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0x84D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0x84F8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x8520(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0x8568(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0x8588(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0x85F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x8618(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0x8660(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x8680(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x86C8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x8710(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0x8758(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0x8778(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_12;                     // 0x8798(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x8860(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x88E0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0x8960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0x8988(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0x89B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0x89D8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x8A00(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0x8A48(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x8A68(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0x8AB0(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0x8AD0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0x8AF0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x8BB8(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x8C38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x8C60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x8C88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x8CB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x8CD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x8D00(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x8D28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0x8D70(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_23;         // 0x8D90(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8;                  // 0x8EA8(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x8F18(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_22;         // 0x8F60(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_21;         // 0x9078(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x9190(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x9200(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_20;         // 0x9248(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x9360(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x93A8(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_19;         // 0x93F0(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x9508(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x9550(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x9598(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x95E0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x9628(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0x9670(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x9690(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0x96D8(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0x96F8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_10;                     // 0x9718(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x97E0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x9860(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x9888(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x98B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x98D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x9900(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x9928(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x9950(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x9978(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x99A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x99C8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0x99F0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x9A10(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0x9A58(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x9A78(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_18;         // 0x9AA0(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0x9BB8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x9BD8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x9C00(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x9C20(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0x9C40(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x9D08(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x9D88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x9DB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x9DD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x9E00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x9E28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x9E50(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_17;         // 0x9E78(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_16;         // 0x9F90(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0xA0A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0xA0F0(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_15;         // 0xA110(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_14;         // 0xA228(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0xA340(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0xA388(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0xA3D0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0xA418(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_13;         // 0xA438(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0xA550(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0xA578(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0xA598(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0xA5C0(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0xA5E0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0xA600(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0xA6C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0xA6F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0xA718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0xA740(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0xA768(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0xA7B0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0xA7D0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0xA7F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0xA818(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0xA860(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0xA880(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0xA948(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0xA9C8(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0xAA48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0xAA70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0xAA98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0xAAC0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0xAAE8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0xAB30(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0xAB50(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0xAB98(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0xABB8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0xABD8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0xACA0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0xAD20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0xAD48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0xAD70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0xAD98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0xADC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0xADE8(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_12;         // 0xAE10(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0xAF28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0xAF70(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_11;         // 0xAF90(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0xB0A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0xB0F0(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_10;         // 0xB110(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0xB228(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0xB250(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_9;          // 0xB270(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0xB388(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0xB3B0(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0xB3D0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0xB3F0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0xB4B8(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0xB538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0xB560(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0xB588(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0xB5B0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0xB5D8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0xB620(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0xB640(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0xB688(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0xB6A8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0xB6C8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0xB790(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0xB810(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0xB838(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0xB860(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0xB888(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0xB8B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0xB8D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0xB900(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0xB928(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_8;          // 0xB948(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0xBA60(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0xBAD0(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_7;          // 0xBAF0(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0xBC08(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0xBC78(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_6;          // 0xBC98(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0xBDB0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0xBE20(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0xBE40(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0xBF08(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0xBF88(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0xC008(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0xC050(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0xC078(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0xC0A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0xC0C8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0xC0F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0xC138(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0xC158(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0xC1A0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0xC1C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0xC208(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0xC228(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0xC2F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0xC318(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0xC340(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0xC368(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0xC390(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0xC3B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0xC3E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0xC408(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0xC430(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0xC458(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0xC4A0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0xC4C0(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_5;          // 0xC4E8(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0xC600(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0xC620(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_4;          // 0xC648(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0xC760(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_3;          // 0xC780(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0xC898(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0xC908(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0xC928(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0xC9F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0xCA18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0xCA40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0xCA68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0xCA90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0xCAB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0xCAE0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0xCB08(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_2;          // 0xCB28(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0xCC40(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0xCCB0(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0xCCD0(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0xCDE8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0xCE58(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0xCE78(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0xCF90(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0xD000(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0xD020(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0xD0E8(0x0080)()
	TArray<class FName>                           AttachPoints_VFX;                                  // 0xD168(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UNiagaraComponent*>              ParticleSystems_Water;                             // 0xD178(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
