#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CharacterStable

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_CharacterStable.ABP_CharacterStable_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_CharacterStable_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_CharacterStable_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_CharacterStable_C_AnimGraph");
static_assert(sizeof(ABP_CharacterStable_C_AnimGraph) == 0x000010, "Wrong size on ABP_CharacterStable_C_AnimGraph");
static_assert(offsetof(ABP_CharacterStable_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_CharacterStable_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_CharacterStable.ABP_CharacterStable_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_CharacterStable_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CharacterStable_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_CharacterStable_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_CharacterStable_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_CharacterStable_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_CharacterStable_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_CharacterStable_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_CharacterStable.ABP_CharacterStable_C.ExecuteUbergraph_ABP_CharacterStable
// 0x00C0 (0x00C0 - 0x0000)
struct ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UniqueObjectNameForCooking_NotifyName_4;           // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       UniqueObjectNameForCooking_OutputDelegate;         // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   UniqueObjectNameForCooking_NotifyName_3;           // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       UniqueObjectNameForCooking_OutputDelegate_1;       // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   UniqueObjectNameForCooking_NotifyName_2;           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       UniqueObjectNameForCooking_OutputDelegate_2;       // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   UniqueObjectNameForCooking_NotifyName_1;           // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       UniqueObjectNameForCooking_OutputDelegate_3;       // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   UniqueObjectNameForCooking_NotifyName;             // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       UniqueObjectNameForCooking_OutputDelegate_4;       // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable) == 0x000008, "Wrong alignment on ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable");
static_assert(sizeof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable) == 0x0000C0, "Wrong size on ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, EntryPoint) == 0x000000, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000B, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, Temp_name_Variable) == 0x00000C, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, UniqueObjectNameForCooking_NotifyName_4) == 0x000014, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::UniqueObjectNameForCooking_NotifyName_4' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, UniqueObjectNameForCooking_OutputDelegate) == 0x00001C, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::UniqueObjectNameForCooking_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, UniqueObjectNameForCooking_NotifyName_3) == 0x00002C, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::UniqueObjectNameForCooking_NotifyName_3' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, UniqueObjectNameForCooking_OutputDelegate_1) == 0x000034, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::UniqueObjectNameForCooking_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, UniqueObjectNameForCooking_NotifyName_2) == 0x000044, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::UniqueObjectNameForCooking_NotifyName_2' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, UniqueObjectNameForCooking_OutputDelegate_2) == 0x00004C, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::UniqueObjectNameForCooking_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, UniqueObjectNameForCooking_NotifyName_1) == 0x00005C, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::UniqueObjectNameForCooking_NotifyName_1' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, UniqueObjectNameForCooking_OutputDelegate_3) == 0x000064, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::UniqueObjectNameForCooking_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, UniqueObjectNameForCooking_NotifyName) == 0x000074, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::UniqueObjectNameForCooking_NotifyName' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, UniqueObjectNameForCooking_OutputDelegate_4) == 0x00007C, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::UniqueObjectNameForCooking_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x00008C, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000090, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_BooleanAND_ReturnValue_1) == 0x000091, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, K2Node_Event_DeltaTimeX) == 0x000094, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_GetOwningComponent_ReturnValue) == 0x000098, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000A0, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0000B0, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000B8, "Member 'ABP_CharacterStable_C_ExecuteUbergraph_ABP_CharacterStable::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABP_CharacterStable.ABP_CharacterStable_C.OnBlendOut_736A704B4938DBA5AE4F799B96F7BDEB
// 0x0008 (0x0008 - 0x0000)
struct ABP_CharacterStable_C_OnBlendOut_736A704B4938DBA5AE4F799B96F7BDEB final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CharacterStable_C_OnBlendOut_736A704B4938DBA5AE4F799B96F7BDEB) == 0x000004, "Wrong alignment on ABP_CharacterStable_C_OnBlendOut_736A704B4938DBA5AE4F799B96F7BDEB");
static_assert(sizeof(ABP_CharacterStable_C_OnBlendOut_736A704B4938DBA5AE4F799B96F7BDEB) == 0x000008, "Wrong size on ABP_CharacterStable_C_OnBlendOut_736A704B4938DBA5AE4F799B96F7BDEB");
static_assert(offsetof(ABP_CharacterStable_C_OnBlendOut_736A704B4938DBA5AE4F799B96F7BDEB, NotifyName) == 0x000000, "Member 'ABP_CharacterStable_C_OnBlendOut_736A704B4938DBA5AE4F799B96F7BDEB::NotifyName' has a wrong offset!");

// Function ABP_CharacterStable.ABP_CharacterStable_C.OnCompleted_736A704B4938DBA5AE4F799B96F7BDEB
// 0x0008 (0x0008 - 0x0000)
struct ABP_CharacterStable_C_OnCompleted_736A704B4938DBA5AE4F799B96F7BDEB final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CharacterStable_C_OnCompleted_736A704B4938DBA5AE4F799B96F7BDEB) == 0x000004, "Wrong alignment on ABP_CharacterStable_C_OnCompleted_736A704B4938DBA5AE4F799B96F7BDEB");
static_assert(sizeof(ABP_CharacterStable_C_OnCompleted_736A704B4938DBA5AE4F799B96F7BDEB) == 0x000008, "Wrong size on ABP_CharacterStable_C_OnCompleted_736A704B4938DBA5AE4F799B96F7BDEB");
static_assert(offsetof(ABP_CharacterStable_C_OnCompleted_736A704B4938DBA5AE4F799B96F7BDEB, NotifyName) == 0x000000, "Member 'ABP_CharacterStable_C_OnCompleted_736A704B4938DBA5AE4F799B96F7BDEB::NotifyName' has a wrong offset!");

// Function ABP_CharacterStable.ABP_CharacterStable_C.OnInterrupted_736A704B4938DBA5AE4F799B96F7BDEB
// 0x0008 (0x0008 - 0x0000)
struct ABP_CharacterStable_C_OnInterrupted_736A704B4938DBA5AE4F799B96F7BDEB final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CharacterStable_C_OnInterrupted_736A704B4938DBA5AE4F799B96F7BDEB) == 0x000004, "Wrong alignment on ABP_CharacterStable_C_OnInterrupted_736A704B4938DBA5AE4F799B96F7BDEB");
static_assert(sizeof(ABP_CharacterStable_C_OnInterrupted_736A704B4938DBA5AE4F799B96F7BDEB) == 0x000008, "Wrong size on ABP_CharacterStable_C_OnInterrupted_736A704B4938DBA5AE4F799B96F7BDEB");
static_assert(offsetof(ABP_CharacterStable_C_OnInterrupted_736A704B4938DBA5AE4F799B96F7BDEB, NotifyName) == 0x000000, "Member 'ABP_CharacterStable_C_OnInterrupted_736A704B4938DBA5AE4F799B96F7BDEB::NotifyName' has a wrong offset!");

// Function ABP_CharacterStable.ABP_CharacterStable_C.OnNotifyBegin_736A704B4938DBA5AE4F799B96F7BDEB
// 0x0008 (0x0008 - 0x0000)
struct ABP_CharacterStable_C_OnNotifyBegin_736A704B4938DBA5AE4F799B96F7BDEB final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CharacterStable_C_OnNotifyBegin_736A704B4938DBA5AE4F799B96F7BDEB) == 0x000004, "Wrong alignment on ABP_CharacterStable_C_OnNotifyBegin_736A704B4938DBA5AE4F799B96F7BDEB");
static_assert(sizeof(ABP_CharacterStable_C_OnNotifyBegin_736A704B4938DBA5AE4F799B96F7BDEB) == 0x000008, "Wrong size on ABP_CharacterStable_C_OnNotifyBegin_736A704B4938DBA5AE4F799B96F7BDEB");
static_assert(offsetof(ABP_CharacterStable_C_OnNotifyBegin_736A704B4938DBA5AE4F799B96F7BDEB, NotifyName) == 0x000000, "Member 'ABP_CharacterStable_C_OnNotifyBegin_736A704B4938DBA5AE4F799B96F7BDEB::NotifyName' has a wrong offset!");

// Function ABP_CharacterStable.ABP_CharacterStable_C.OnNotifyEnd_736A704B4938DBA5AE4F799B96F7BDEB
// 0x0008 (0x0008 - 0x0000)
struct ABP_CharacterStable_C_OnNotifyEnd_736A704B4938DBA5AE4F799B96F7BDEB final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CharacterStable_C_OnNotifyEnd_736A704B4938DBA5AE4F799B96F7BDEB) == 0x000004, "Wrong alignment on ABP_CharacterStable_C_OnNotifyEnd_736A704B4938DBA5AE4F799B96F7BDEB");
static_assert(sizeof(ABP_CharacterStable_C_OnNotifyEnd_736A704B4938DBA5AE4F799B96F7BDEB) == 0x000008, "Wrong size on ABP_CharacterStable_C_OnNotifyEnd_736A704B4938DBA5AE4F799B96F7BDEB");
static_assert(offsetof(ABP_CharacterStable_C_OnNotifyEnd_736A704B4938DBA5AE4F799B96F7BDEB, NotifyName) == 0x000000, "Member 'ABP_CharacterStable_C_OnNotifyEnd_736A704B4938DBA5AE4F799B96F7BDEB::NotifyName' has a wrong offset!");

}

