#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PC_MNT_Caravel

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_PC_MNT_Caravel.ABP_PC_MNT_Caravel_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PC_MNT_Caravel_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PC_MNT_Caravel_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_PC_MNT_Caravel_C_AnimGraph");
static_assert(sizeof(ABP_PC_MNT_Caravel_C_AnimGraph) == 0x000010, "Wrong size on ABP_PC_MNT_Caravel_C_AnimGraph");
static_assert(offsetof(ABP_PC_MNT_Caravel_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_PC_MNT_Caravel_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_PC_MNT_Caravel.ABP_PC_MNT_Caravel_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_PC_MNT_Caravel_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PC_MNT_Caravel_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_PC_MNT_Caravel_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_PC_MNT_Caravel_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_PC_MNT_Caravel_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_PC_MNT_Caravel_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_PC_MNT_Caravel_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_PC_MNT_Caravel.ABP_PC_MNT_Caravel_C.ExecuteUbergraph_ABP_PC_MNT_Caravel
// 0x0020 (0x0020 - 0x0000)
struct ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel) == 0x000008, "Wrong alignment on ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel");
static_assert(sizeof(ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel) == 0x000020, "Wrong size on ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel");
static_assert(offsetof(ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel, EntryPoint) == 0x000000, "Member 'ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel, CallFunc_BreakVector2D_X) == 0x000008, "Member 'ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000018, "Member 'ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000019, "Member 'ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00001B, "Member 'ABP_PC_MNT_Caravel_C_ExecuteUbergraph_ABP_PC_MNT_Caravel::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

}

