#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CharacterStable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_CharacterStable_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_CharacterStable.ABP_CharacterStable_C
// 0x6FE0 (0x7F50 - 0x0F70)
class UABP_CharacterStable_C final : public UCharacterStableAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_CharacterStable::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0F78(0x0018)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0F90(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0F98(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0FA0(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0FC0(0x0048)()
	struct FAnimNode_ModifyBones                  AnimGraphNode_ModifyBones_1;                       // 0x1008(0x0120)()
	struct FAnimNode_ModifyBones                  AnimGraphNode_ModifyBones;                         // 0x1128(0x0120)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1248(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1268(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1288(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x1308(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x1350(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x1398(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x13E0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x1428(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x1470(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x14B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x1500(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5;                   // 0x1548(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x1590(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x15D8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x15F8(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x16C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x16E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x1710(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x1738(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x1760(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x1788(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x17B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x17D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1800(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1828(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x1850(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x1898(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x18E0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x1928(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x1970(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x19B8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x1A00(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x1A20(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x1A68(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x1AB0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x1AF8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x1B40(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x1B88(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x1BD0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x1BF0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x1C38(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x1C80(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x1CC8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x1D10(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x1D58(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x1DA0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x1DE8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x1E30(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x1E78(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x1EC0(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x1EE0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x1F00(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x1F48(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x1F90(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x1FD8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x2020(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x2068(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x20B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x20F8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x2140(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x2188(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x21D0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x21F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x2218(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x2240(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x2288(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x22A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x22F0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x2310(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x23D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x2400(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x2428(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x2470(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x2490(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x24D8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x24F8(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x25C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x25E8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x2610(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x2658(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x2678(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x26C0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x26E0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x27A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x27D0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x27F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x2840(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x2860(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x28A8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x28C8(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2990(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x29B8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x29E0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x2A28(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2A48(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2A90(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x2AB0(0x00C8)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x2B78(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2BC0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x2BE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x2C08(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x2C30(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2D20(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x2D68(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2E30(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2E50(0x00C8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x2F18(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_16;                       // 0x2F60(0x0460)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x33C0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x3408(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x3430(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x3478(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_15;                       // 0x34A0(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_14;                       // 0x3900(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_13;                       // 0x3D60(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_12;                       // 0x41C0(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_11;                       // 0x4620(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_10;                       // 0x4A80(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_9;                        // 0x4EE0(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_8;                        // 0x5340(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x57A0(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_7;                        // 0x57C8(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_6;                        // 0x5C28(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_5;                        // 0x6088(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_4;                        // 0x64E8(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_3;                        // 0x6948(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_2;                        // 0x6DA8(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x7208(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x7230(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x7258(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x7280(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x72A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x72D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x72F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x7320(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x7348(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x7370(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x7398(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x73C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x73E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x7410(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x7438(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x7460(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x78C0(0x0460)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x7D20(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x7DA0(0x0028)()
	double                                        __CustomProperty_Hands_Idle_Offset_B1F6AC2445E4807DD582F98C1F288DD7; // 0x7DC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_B1F6AC2445E4807DD582F98C1F288DD7; // 0x7DD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DD1[0x7];                                     // 0x7DD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_9ACDF2DE41E8423B8CBD1BBAA9945D1C; // 0x7DD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_9ACDF2DE41E8423B8CBD1BBAA9945D1C; // 0x7DE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_9ACDF2DE41E8423B8CBD1BBAA9945D1C; // 0x7DE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DE9[0x7];                                     // 0x7DE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_7969365A4B7062EFC40A42A347642E73; // 0x7DF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_7969365A4B7062EFC40A42A347642E73; // 0x7DF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_7969365A4B7062EFC40A42A347642E73; // 0x7E00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E01[0x7];                                     // 0x7E01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_8FC488FF4547062B6F441A8C46BF3CDE; // 0x7E08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_8FC488FF4547062B6F441A8C46BF3CDE; // 0x7E10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_8FC488FF4547062B6F441A8C46BF3CDE; // 0x7E18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E19[0x7];                                     // 0x7E19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_E36AA692455E1787A52169B6354E8AAE; // 0x7E20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_E36AA692455E1787A52169B6354E8AAE; // 0x7E28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_E36AA692455E1787A52169B6354E8AAE; // 0x7E30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E31[0x7];                                     // 0x7E31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_746F392A44FDB20870816792A5CCC540; // 0x7E38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_746F392A44FDB20870816792A5CCC540; // 0x7E40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_746F392A44FDB20870816792A5CCC540; // 0x7E48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E49[0x7];                                     // 0x7E49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_9E0FD63B4F9637171EF93D9CA41F5C45; // 0x7E50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_9E0FD63B4F9637171EF93D9CA41F5C45; // 0x7E58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_9E0FD63B4F9637171EF93D9CA41F5C45; // 0x7E60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E61[0x7];                                     // 0x7E61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_0CD0E1594F058E64B367AC84E0923369; // 0x7E68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_0CD0E1594F058E64B367AC84E0923369; // 0x7E70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_0CD0E1594F058E64B367AC84E0923369; // 0x7E78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E79[0x7];                                     // 0x7E79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_C37316884241633BB4B47E891DB26BF0; // 0x7E80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_C37316884241633BB4B47E891DB26BF0; // 0x7E88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_C37316884241633BB4B47E891DB26BF0; // 0x7E90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E91[0x7];                                     // 0x7E91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_F9D0AA994C2B1F524C96EFB6067E679E; // 0x7E98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_F9D0AA994C2B1F524C96EFB6067E679E; // 0x7EA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_F9D0AA994C2B1F524C96EFB6067E679E; // 0x7EA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EA9[0x7];                                     // 0x7EA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_D9AB794F4058F284919C2E9C954E904A; // 0x7EB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_D9AB794F4058F284919C2E9C954E904A; // 0x7EB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_D9AB794F4058F284919C2E9C954E904A; // 0x7EC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EC1[0x7];                                     // 0x7EC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_C5A9CBAC40E3269580347BA38F8896EA; // 0x7EC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_C5A9CBAC40E3269580347BA38F8896EA; // 0x7ED0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_C5A9CBAC40E3269580347BA38F8896EA; // 0x7ED8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7ED9[0x7];                                     // 0x7ED9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_1B443FEE413E018A7F9944AB2C9247B8; // 0x7EE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_1B443FEE413E018A7F9944AB2C9247B8; // 0x7EE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_1B443FEE413E018A7F9944AB2C9247B8; // 0x7EF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EF1[0x7];                                     // 0x7EF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_DD3433F349929F235B675EBD8C5E376F; // 0x7EF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_DD3433F349929F235B675EBD8C5E376F; // 0x7F00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_DD3433F349929F235B675EBD8C5E376F; // 0x7F08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F09[0x7];                                     // 0x7F09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_DE322F9E4EE47E47BC6F11AB8D2ADE83; // 0x7F10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_DE322F9E4EE47E47BC6F11AB8D2ADE83; // 0x7F18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_DE322F9E4EE47E47BC6F11AB8D2ADE83; // 0x7F20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F21[0x7];                                     // 0x7F21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_9969D9BD410C0F4FBCF1C2A5D2BAD006; // 0x7F28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_9969D9BD410C0F4FBCF1C2A5D2BAD006; // 0x7F30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_9969D9BD410C0F4FBCF1C2A5D2BAD006; // 0x7F38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F39[0x7];                                     // 0x7F39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IdlePlayRate;                                      // 0x7F40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Height_Scale;                                      // 0x7F48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterStable_AnimGraphNode_TransitionResult_08A65DB040B95993CBFF1E89106F6AE1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterStable_AnimGraphNode_TransitionResult_298C162141C407011F63AA995F8A5818();
	void ExecuteUbergraph_ABP_CharacterStable(int32 EntryPoint);
	void OnBlendOut_736A704B4938DBA5AE4F799B96F7BDEB(class FName NotifyName);
	void OnCompleted_736A704B4938DBA5AE4F799B96F7BDEB(class FName NotifyName);
	void OnInterrupted_736A704B4938DBA5AE4F799B96F7BDEB(class FName NotifyName);
	void OnNotifyBegin_736A704B4938DBA5AE4F799B96F7BDEB(class FName NotifyName);
	void OnNotifyEnd_736A704B4938DBA5AE4F799B96F7BDEB(class FName NotifyName);
	void OnRaceChange_1();

