#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PC_MNT_Caravel

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_PC_MNT_Caravel.ABP_PC_MNT_Caravel_C.AnimBlueprintGeneratedConstantData
// 0x0117 (0x0118 - 0x0001)
struct ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_35;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_37;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_38;                                  // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_39;                                 // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_40;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_41;                               // 0x0024(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_42;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_43;                                 // 0x0054(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_44;                                 // 0x0055(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_45;                                 // 0x0056(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_46;                                 // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_47;                               // 0x0060(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0080(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0100(0x0018)()
};
static_assert(alignof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData) == 0x000118, "Wrong size on ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __NameProperty_35) == 0x000004, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__NameProperty_35' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __FloatProperty_36) == 0x00000C, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__FloatProperty_36' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __NameProperty_37) == 0x000010, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__NameProperty_37' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __IntProperty_38) == 0x000018, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__IntProperty_38' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __BoolProperty_39) == 0x00001C, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__BoolProperty_39' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __FloatProperty_40) == 0x000020, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__FloatProperty_40' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __StructProperty_41) == 0x000024, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__StructProperty_41' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __FloatProperty_42) == 0x000050, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__FloatProperty_42' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __BoolProperty_43) == 0x000054, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__BoolProperty_43' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __EnumProperty_44) == 0x000055, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__EnumProperty_44' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __ByteProperty_45) == 0x000056, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__ByteProperty_45' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __NameProperty_46) == 0x000058, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__NameProperty_46' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, __StructProperty_47) == 0x000060, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::__StructProperty_47' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000080, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000100, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_PC_MNT_Caravel.ABP_PC_MNT_Caravel_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_PC_MNT_Caravel::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

