#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Starcrawler_Lobby

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_Starcrawler_Lobby_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Starcrawler_Lobby.ABP_Starcrawler_Lobby_C
// 0x0370 (0x1FC0 - 0x1C50)
class UABP_Starcrawler_Lobby_C final : public UAoCNPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1C50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Starcrawler_Lobby::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x1C58(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1C60(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1C68(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1C70(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1C90(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1CD8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1D20(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1D68(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1DB0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1DF8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1E40(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x1E88(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1ED0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1EF0(0x00C8)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_Starcrawler_Lobby(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Starcrawler_Lobby_C">();
	}
	static class UABP_Starcrawler_Lobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Starcrawler_Lobby_C>();
	}
};
static_assert(alignof(UABP_Starcrawler_Lobby_C) == 0x000010, "Wrong alignment on UABP_Starcrawler_Lobby_C");
static_assert(sizeof(UABP_Starcrawler_Lobby_C) == 0x001FC0, "Wrong size on UABP_Starcrawler_Lobby_C");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, UberGraphFrame) == 0x001C50, "Member 'UABP_Starcrawler_Lobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, __AnimBlueprintMutables) == 0x001C58, "Member 'UABP_Starcrawler_Lobby_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimBlueprintExtension_PropertyAccess) == 0x001C60, "Member 'UABP_Starcrawler_Lobby_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimBlueprintExtension_Base) == 0x001C68, "Member 'UABP_Starcrawler_Lobby_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimGraphNode_Root) == 0x001C70, "Member 'UABP_Starcrawler_Lobby_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimGraphNode_SequencePlayer_6) == 0x001C90, "Member 'UABP_Starcrawler_Lobby_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimGraphNode_SequencePlayer_5) == 0x001CD8, "Member 'UABP_Starcrawler_Lobby_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimGraphNode_SequencePlayer_4) == 0x001D20, "Member 'UABP_Starcrawler_Lobby_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimGraphNode_SequencePlayer_3) == 0x001D68, "Member 'UABP_Starcrawler_Lobby_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimGraphNode_SequencePlayer_2) == 0x001DB0, "Member 'UABP_Starcrawler_Lobby_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimGraphNode_SequencePlayer_1) == 0x001DF8, "Member 'UABP_Starcrawler_Lobby_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimGraphNode_SequencePlayer) == 0x001E40, "Member 'UABP_Starcrawler_Lobby_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimGraphNode_BlendListByInt) == 0x001E88, "Member 'UABP_Starcrawler_Lobby_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimGraphNode_StateResult) == 0x001ED0, "Member 'UABP_Starcrawler_Lobby_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Starcrawler_Lobby_C, AnimGraphNode_StateMachine) == 0x001EF0, "Member 'UABP_Starcrawler_Lobby_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

