#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CharacterStable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CharacterStable.ABP_CharacterStable_C.AnimBlueprintGeneratedConstantData
// 0x024F (0x0250 - 0x0001)
struct ABP_CharacterStable::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1069;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1070;                               // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1071;                               // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1072;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1073;                               // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1074;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1075;                               // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1076;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1077;                               // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1078;                              // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1079;                              // 0x0050(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1080;                               // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1081;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1082;                               // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1083;                               // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1084;                               // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1085;                               // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1086;                               // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1087;                               // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1088;                               // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1089;                               // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1090;                               // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1091;                               // 0x00B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1092;                               // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1093;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1094;                              // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1095;                               // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1096;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1097;                               // 0x00E4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1098;                              // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1099;                             // 0x00EC(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1100;                              // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1101;                               // 0x011C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1102;                               // 0x011D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1103;                               // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1104;                               // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1105;                               // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1106;                                // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1107;                              // 0x0140(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1108;                              // 0x0150(0x0010)(BlueprintVisible)
	class UBlendProfile*                          __BlendProfile_1109;                               // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1110;                                 // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1111;                               // 0x0170(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1112;                               // 0x0171(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1113;                               // 0x0172(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_173[0x5];                                      // 0x0173(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1114;                              // 0x0178(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1115;                              // 0x0188(0x0010)(BlueprintVisible)
	struct FAnimNodeFunctionRef                   __StructProperty_1116;                             // 0x0198(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x01B8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0238(0x0018)()
};
static_assert(alignof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CharacterStable::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData) == 0x000250, "Wrong size on ABP_CharacterStable::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1069) == 0x000004, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1069' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1070) == 0x00000C, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1070' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1071) == 0x000014, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1071' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __IntProperty_1072) == 0x00001C, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__IntProperty_1072' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1073) == 0x000020, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1073' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __IntProperty_1074) == 0x000028, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__IntProperty_1074' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1075) == 0x00002C, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1075' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __IntProperty_1076) == 0x000034, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__IntProperty_1076' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1077) == 0x000038, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1077' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1078) == 0x000040, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1078' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1079) == 0x000050, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1079' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1080) == 0x000060, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1080' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __IntProperty_1081) == 0x000068, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__IntProperty_1081' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1082) == 0x00006C, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1082' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1083) == 0x000074, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1083' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1084) == 0x00007C, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1084' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1085) == 0x000084, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1085' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1086) == 0x00008C, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1086' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1087) == 0x000094, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1087' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1088) == 0x00009C, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1088' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1089) == 0x0000A4, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1089' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1090) == 0x0000AC, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1090' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __EnumProperty_1091) == 0x0000B4, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__EnumProperty_1091' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1092) == 0x0000B8, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1092' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __IntProperty_1093) == 0x0000C0, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__IntProperty_1093' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1094) == 0x0000C8, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1094' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1095) == 0x0000D8, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1095' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __IntProperty_1096) == 0x0000E0, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__IntProperty_1096' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __BoolProperty_1097) == 0x0000E4, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__BoolProperty_1097' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __FloatProperty_1098) == 0x0000E8, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__FloatProperty_1098' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __StructProperty_1099) == 0x0000EC, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__StructProperty_1099' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __FloatProperty_1100) == 0x000118, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__FloatProperty_1100' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __EnumProperty_1101) == 0x00011C, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__EnumProperty_1101' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __ByteProperty_1102) == 0x00011D, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__ByteProperty_1102' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1103) == 0x000120, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1103' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1104) == 0x000128, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1104' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __NameProperty_1105) == 0x000130, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__NameProperty_1105' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __IntProperty_1106) == 0x000138, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__IntProperty_1106' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1107) == 0x000140, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1107' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1108) == 0x000150, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1108' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __BlendProfile_1109) == 0x000160, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__BlendProfile_1109' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __CurveFloat_1110) == 0x000168, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__CurveFloat_1110' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __BoolProperty_1111) == 0x000170, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__BoolProperty_1111' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __EnumProperty_1112) == 0x000171, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__EnumProperty_1112' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __EnumProperty_1113) == 0x000172, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__EnumProperty_1113' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1114) == 0x000178, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1114' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1115) == 0x000188, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1115' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, __StructProperty_1116) == 0x000198, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::__StructProperty_1116' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0001B8, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000238, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_CharacterStable.ABP_CharacterStable_C.AnimBlueprintGeneratedMutableData
// 0x0017 (0x0018 - 0x0001)
struct ABP_CharacterStable::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_0;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1;                                   // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_2;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_3;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_4;                                   // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_5;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_6;                                  // 0x0015(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_7;                                  // 0x0016(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CharacterStable::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_CharacterStable::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_CharacterStable::FAnimBlueprintGeneratedMutableData) == 0x000018, "Wrong size on ABP_CharacterStable::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedMutableData, __IntProperty_0) == 0x000004, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedMutableData::__IntProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedMutableData, __IntProperty_1) == 0x000008, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedMutableData::__IntProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedMutableData, __ByteProperty_2) == 0x00000C, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedMutableData::__ByteProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedMutableData, __ByteProperty_3) == 0x00000D, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedMutableData::__ByteProperty_3' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedMutableData, __IntProperty_4) == 0x000010, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedMutableData::__IntProperty_4' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedMutableData, __ByteProperty_5) == 0x000014, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedMutableData::__ByteProperty_5' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedMutableData, __ByteProperty_6) == 0x000015, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedMutableData::__ByteProperty_6' has a wrong offset!");
static_assert(offsetof(ABP_CharacterStable::FAnimBlueprintGeneratedMutableData, __ByteProperty_7) == 0x000016, "Member 'ABP_CharacterStable::FAnimBlueprintGeneratedMutableData::__ByteProperty_7' has a wrong offset!");

}

