#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALSV4_CPP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum ALSV4_CPP.EALSGaitType
// NumValues: 0x0004
enum class EALSGaitType : uint8
{
	Walking                                  = 0,
	Running                                  = 1,
	Sprinting                                = 2,
	EALSGaitType_MAX                         = 3,
};

// Enum ALSV4_CPP.EALSMovementActionType
// NumValues: 0x0006
enum class EALSMovementActionType : uint8
{
	None                                     = 0,
	LowMantle                                = 1,
	HighMantle                               = 2,
	Rolling                                  = 3,
	GettingUp                                = 4,
	EALSMovementActionType_MAX               = 5,
};

// Enum ALSV4_CPP.EALSMovementStateType
// NumValues: 0x0006
enum class EALSMovementStateType : uint8
{
	None                                     = 0,
	Grounded                                 = 1,
	InAir                                    = 2,
	Mantling                                 = 3,
	Ragdoll                                  = 4,
	EALSMovementStateType_MAX                = 5,
};

// Enum ALSV4_CPP.EALSOverlayStateType
// NumValues: 0x000E
enum class EALSOverlayStateType : uint8
{
	Default                                  = 0,
	Masculine                                = 1,
	Feminine                                 = 2,
	Injured                                  = 3,
	HandsTied                                = 4,
	Rifle                                    = 5,
	PistolOneHanded                          = 6,
	PistolTwoHanded                          = 7,
	Bow                                      = 8,
	Torch                                    = 9,
	Binoculars                               = 10,
	Box                                      = 11,
	Barrel                                   = 12,
	EALSOverlayStateType_MAX                 = 13,
};

// Enum ALSV4_CPP.EALSRotationModeType
// NumValues: 0x0004
enum class EALSRotationModeType : uint8
{
	VelocityDirection                        = 0,
	LookingDirection                         = 1,
	Aiming                                   = 2,
	EALSRotationModeType_MAX                 = 3,
};

// Enum ALSV4_CPP.EALSStanceType
// NumValues: 0x0004
enum class EALSStanceType : uint8
{
	Standing                                 = 0,
	Crouching                                = 1,
	Swimming                                 = 2,
	EALSStanceType_MAX                       = 3,
};

// Enum ALSV4_CPP.EALSViewMode
// NumValues: 0x0003
enum class EALSViewMode : uint8
{
	ThirdPerson                              = 0,
	FirstPerson                              = 1,
	EALSViewMode_MAX                         = 2,
};

// Enum ALSV4_CPP.EALSAnimFeatureExample
// NumValues: 0x0004
enum class EALSAnimFeatureExample : uint8
{
	StrideBlending                           = 0,
	AdditiveBlending                         = 1,
	SprintImpulse                            = 2,
	EALSAnimFeatureExample_MAX               = 3,
};

// Enum ALSV4_CPP.EALSFootstepType
// NumValues: 0x0005
enum class EALSFootstepType : uint8
{
	Step                                     = 0,
	WalkRun                                  = 1,
	Jump                                     = 2,
	Land                                     = 3,
	EALSFootstepType_MAX                     = 4,
};

// Enum ALSV4_CPP.EALSGroundedEntryStateType
// NumValues: 0x0003
enum class EALSGroundedEntryStateType : uint8
{
	None                                     = 0,
	Roll                                     = 1,
	EALSGroundedEntryStateType_MAX           = 2,
};

// Enum ALSV4_CPP.EALSHipsDirection
// NumValues: 0x0007
enum class EALSHipsDirection : uint8
{
	F                                        = 0,
	B                                        = 1,
	RF                                       = 2,
	RB                                       = 3,
	LF                                       = 4,
	LB                                       = 5,
	EALSHipsDirection_MAX                    = 6,
};

// Enum ALSV4_CPP.EALSMantleType
// NumValues: 0x0004
enum class EALSMantleType : uint8
{
	HighMantle                               = 0,
	LowMantle                                = 1,
	FallingCatch                             = 2,
	EALSMantleType_MAX                       = 3,
};

// Enum ALSV4_CPP.EALSMovementDirectionType
// NumValues: 0x0005
enum class EALSMovementDirectionType : uint8
{
	Forward                                  = 0,
	Right                                    = 1,
	Left                                     = 2,
	Backward                                 = 3,
	EALSMovementDirectionType_MAX            = 4,
};

// Enum ALSV4_CPP.EALSSpawnType
// NumValues: 0x0003
enum class EALSSpawnType : uint8
{
	Location                                 = 0,
	Attached                                 = 1,
	EALSSpawnType_MAX                        = 2,
};

// ScriptStruct ALSV4_CPP.ALSDynamicMontageParams
// 0x0018 (0x0018 - 0x0000)
struct FALSDynamicMontageParams final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FALSDynamicMontageParams) == 0x000008, "Wrong alignment on FALSDynamicMontageParams");
static_assert(sizeof(FALSDynamicMontageParams) == 0x000018, "Wrong size on FALSDynamicMontageParams");
static_assert(offsetof(FALSDynamicMontageParams, Animation) == 0x000000, "Member 'FALSDynamicMontageParams::Animation' has a wrong offset!");
static_assert(offsetof(FALSDynamicMontageParams, BlendInTime) == 0x000008, "Member 'FALSDynamicMontageParams::BlendInTime' has a wrong offset!");
static_assert(offsetof(FALSDynamicMontageParams, BlendOutTime) == 0x00000C, "Member 'FALSDynamicMontageParams::BlendOutTime' has a wrong offset!");
static_assert(offsetof(FALSDynamicMontageParams, PlayRate) == 0x000010, "Member 'FALSDynamicMontageParams::PlayRate' has a wrong offset!");
static_assert(offsetof(FALSDynamicMontageParams, StartTime) == 0x000014, "Member 'FALSDynamicMontageParams::StartTime' has a wrong offset!");

// ScriptStruct ALSV4_CPP.ALSLeanAmount
// 0x0008 (0x0008 - 0x0000)
struct FALSLeanAmount final
{
public:
	float                                         LR;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FB;                                                // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FALSLeanAmount) == 0x000004, "Wrong alignment on FALSLeanAmount");
static_assert(sizeof(FALSLeanAmount) == 0x000008, "Wrong size on FALSLeanAmount");
static_assert(offsetof(FALSLeanAmount, LR) == 0x000000, "Member 'FALSLeanAmount::LR' has a wrong offset!");
static_assert(offsetof(FALSLeanAmount, FB) == 0x000004, "Member 'FALSLeanAmount::FB' has a wrong offset!");

// ScriptStruct ALSV4_CPP.ALSVelocityBlend
// 0x0010 (0x0010 - 0x0000)
struct FALSVelocityBlend final
{
public:
	float                                         F;                                                 // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         B;                                                 // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         L;                                                 // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         R;                                                 // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FALSVelocityBlend) == 0x000004, "Wrong alignment on FALSVelocityBlend");
static_assert(sizeof(FALSVelocityBlend) == 0x000010, "Wrong size on FALSVelocityBlend");
static_assert(offsetof(FALSVelocityBlend, F) == 0x000000, "Member 'FALSVelocityBlend::F' has a wrong offset!");
static_assert(offsetof(FALSVelocityBlend, B) == 0x000004, "Member 'FALSVelocityBlend::B' has a wrong offset!");
static_assert(offsetof(FALSVelocityBlend, L) == 0x000008, "Member 'FALSVelocityBlend::L' has a wrong offset!");
static_assert(offsetof(FALSVelocityBlend, R) == 0x00000C, "Member 'FALSVelocityBlend::R' has a wrong offset!");

// ScriptStruct ALSV4_CPP.ALSTurnInPlaceAsset
// 0x0020 (0x0020 - 0x0000)
struct FALSTurnInPlaceAsset final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimatedAngle;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotName;                                          // 0x000C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ScaleTurnAngle;                                    // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FALSTurnInPlaceAsset) == 0x000008, "Wrong alignment on FALSTurnInPlaceAsset");
static_assert(sizeof(FALSTurnInPlaceAsset) == 0x000020, "Wrong size on FALSTurnInPlaceAsset");
static_assert(offsetof(FALSTurnInPlaceAsset, Animation) == 0x000000, "Member 'FALSTurnInPlaceAsset::Animation' has a wrong offset!");
static_assert(offsetof(FALSTurnInPlaceAsset, AnimatedAngle) == 0x000008, "Member 'FALSTurnInPlaceAsset::AnimatedAngle' has a wrong offset!");
static_assert(offsetof(FALSTurnInPlaceAsset, SlotName) == 0x00000C, "Member 'FALSTurnInPlaceAsset::SlotName' has a wrong offset!");
static_assert(offsetof(FALSTurnInPlaceAsset, PlayRate) == 0x000014, "Member 'FALSTurnInPlaceAsset::PlayRate' has a wrong offset!");
static_assert(offsetof(FALSTurnInPlaceAsset, ScaleTurnAngle) == 0x000018, "Member 'FALSTurnInPlaceAsset::ScaleTurnAngle' has a wrong offset!");

// ScriptStruct ALSV4_CPP.ALSAnimCharacterInformation
// 0x00B0 (0x00B0 - 0x0000)
struct FALSAnimCharacterInformation final
{
public:
	struct FRotator                               AnimationRotation;                                 // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               CharacterActorRotation;                            // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EMovementMode                                 MovementMode;                                      // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Velocity;                                          // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RelativeVelocityDirection;                         // 0x0050(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Acceleration;                                      // 0x0068(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MovementInput;                                     // 0x0080(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMoving;                                         // 0x0098(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasMovementInput;                                 // 0x0099(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x009C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementInputAmount;                               // 0x00A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimationYawRate;                                  // 0x00A4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZoomAmount;                                        // 0x00A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EALSMovementStateType                         PrevMovementState;                                 // 0x00AC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EALSViewMode                                  ViewMode;                                          // 0x00AD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FALSAnimCharacterInformation) == 0x000008, "Wrong alignment on FALSAnimCharacterInformation");
static_assert(sizeof(FALSAnimCharacterInformation) == 0x0000B0, "Wrong size on FALSAnimCharacterInformation");
static_assert(offsetof(FALSAnimCharacterInformation, AnimationRotation) == 0x000000, "Member 'FALSAnimCharacterInformation::AnimationRotation' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, CharacterActorRotation) == 0x000018, "Member 'FALSAnimCharacterInformation::CharacterActorRotation' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, MovementMode) == 0x000030, "Member 'FALSAnimCharacterInformation::MovementMode' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, Velocity) == 0x000038, "Member 'FALSAnimCharacterInformation::Velocity' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, RelativeVelocityDirection) == 0x000050, "Member 'FALSAnimCharacterInformation::RelativeVelocityDirection' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, Acceleration) == 0x000068, "Member 'FALSAnimCharacterInformation::Acceleration' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, MovementInput) == 0x000080, "Member 'FALSAnimCharacterInformation::MovementInput' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, bIsMoving) == 0x000098, "Member 'FALSAnimCharacterInformation::bIsMoving' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, bHasMovementInput) == 0x000099, "Member 'FALSAnimCharacterInformation::bHasMovementInput' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, Speed) == 0x00009C, "Member 'FALSAnimCharacterInformation::Speed' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, MovementInputAmount) == 0x0000A0, "Member 'FALSAnimCharacterInformation::MovementInputAmount' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, AnimationYawRate) == 0x0000A4, "Member 'FALSAnimCharacterInformation::AnimationYawRate' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, ZoomAmount) == 0x0000A8, "Member 'FALSAnimCharacterInformation::ZoomAmount' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, PrevMovementState) == 0x0000AC, "Member 'FALSAnimCharacterInformation::PrevMovementState' has a wrong offset!");
static_assert(offsetof(FALSAnimCharacterInformation, ViewMode) == 0x0000AD, "Member 'FALSAnimCharacterInformation::ViewMode' has a wrong offset!");

// ScriptStruct ALSV4_CPP.ALSAnimGraphGrounded
// 0x0054 (0x0054 - 0x0000)
struct FALSAnimGraphGrounded final
{
public:
	EALSHipsDirection                             TrackedHipsDirection;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldMove;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateL;                                          // 0x0002(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateR;                                          // 0x0003(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPivot;                                            // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotateRate;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationScale;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSharpRotation;                                    // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPanningRotation;                                  // 0x0011(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DiagonalScaleAmount;                               // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WalkRunBlend;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandingPlayRate;                                  // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CrouchingPlayRate;                                 // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwimmingPlayRate;                                  // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StrideBlend;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FYaw;                                              // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BYaw;                                              // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LYaw;                                              // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RYaw;                                              // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InclineAlpha;                                      // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeclineAlpha;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlatAlpha;                                         // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityToSurfaceAlpha;                            // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HipTwistAngle;                                     // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HipTwistRootYawOffset;                             // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FALSAnimGraphGrounded) == 0x000004, "Wrong alignment on FALSAnimGraphGrounded");
static_assert(sizeof(FALSAnimGraphGrounded) == 0x000054, "Wrong size on FALSAnimGraphGrounded");
static_assert(offsetof(FALSAnimGraphGrounded, TrackedHipsDirection) == 0x000000, "Member 'FALSAnimGraphGrounded::TrackedHipsDirection' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, bShouldMove) == 0x000001, "Member 'FALSAnimGraphGrounded::bShouldMove' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, bRotateL) == 0x000002, "Member 'FALSAnimGraphGrounded::bRotateL' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, bRotateR) == 0x000003, "Member 'FALSAnimGraphGrounded::bRotateR' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, bPivot) == 0x000004, "Member 'FALSAnimGraphGrounded::bPivot' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, RotateRate) == 0x000008, "Member 'FALSAnimGraphGrounded::RotateRate' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, RotationScale) == 0x00000C, "Member 'FALSAnimGraphGrounded::RotationScale' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, bSharpRotation) == 0x000010, "Member 'FALSAnimGraphGrounded::bSharpRotation' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, bPanningRotation) == 0x000011, "Member 'FALSAnimGraphGrounded::bPanningRotation' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, DiagonalScaleAmount) == 0x000014, "Member 'FALSAnimGraphGrounded::DiagonalScaleAmount' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, WalkRunBlend) == 0x000018, "Member 'FALSAnimGraphGrounded::WalkRunBlend' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, StandingPlayRate) == 0x00001C, "Member 'FALSAnimGraphGrounded::StandingPlayRate' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, CrouchingPlayRate) == 0x000020, "Member 'FALSAnimGraphGrounded::CrouchingPlayRate' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, SwimmingPlayRate) == 0x000024, "Member 'FALSAnimGraphGrounded::SwimmingPlayRate' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, StrideBlend) == 0x000028, "Member 'FALSAnimGraphGrounded::StrideBlend' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, FYaw) == 0x00002C, "Member 'FALSAnimGraphGrounded::FYaw' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, BYaw) == 0x000030, "Member 'FALSAnimGraphGrounded::BYaw' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, LYaw) == 0x000034, "Member 'FALSAnimGraphGrounded::LYaw' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, RYaw) == 0x000038, "Member 'FALSAnimGraphGrounded::RYaw' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, InclineAlpha) == 0x00003C, "Member 'FALSAnimGraphGrounded::InclineAlpha' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, DeclineAlpha) == 0x000040, "Member 'FALSAnimGraphGrounded::DeclineAlpha' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, FlatAlpha) == 0x000044, "Member 'FALSAnimGraphGrounded::FlatAlpha' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, VelocityToSurfaceAlpha) == 0x000048, "Member 'FALSAnimGraphGrounded::VelocityToSurfaceAlpha' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, HipTwistAngle) == 0x00004C, "Member 'FALSAnimGraphGrounded::HipTwistAngle' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphGrounded, HipTwistRootYawOffset) == 0x000050, "Member 'FALSAnimGraphGrounded::HipTwistRootYawOffset' has a wrong offset!");

// ScriptStruct ALSV4_CPP.ALSAnimGraphInAir
// 0x0010 (0x0010 - 0x0000)
struct FALSAnimGraphInAir final
{
public:
	bool                                          bJumped;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JumpPlayRate;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallSpeed;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandPrediction;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FALSAnimGraphInAir) == 0x000004, "Wrong alignment on FALSAnimGraphInAir");
static_assert(sizeof(FALSAnimGraphInAir) == 0x000010, "Wrong size on FALSAnimGraphInAir");
static_assert(offsetof(FALSAnimGraphInAir, bJumped) == 0x000000, "Member 'FALSAnimGraphInAir::bJumped' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphInAir, JumpPlayRate) == 0x000004, "Member 'FALSAnimGraphInAir::JumpPlayRate' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphInAir, FallSpeed) == 0x000008, "Member 'FALSAnimGraphInAir::FallSpeed' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphInAir, LandPrediction) == 0x00000C, "Member 'FALSAnimGraphInAir::LandPrediction' has a wrong offset!");

// ScriptStruct ALSV4_CPP.ALSAnimGraphAimingValues
// 0x0058 (0x0058 - 0x0000)
struct FALSAnimGraphAimingValues final
{
public:
	struct FRotator                               SmoothedAimingRotation;                            // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               SpineRotation;                                     // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              AimingAngle;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimSweepTime;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InputYawOffsetTime;                                // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardYawTime;                                    // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeftYawTime;                                       // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightYawTime;                                      // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FALSAnimGraphAimingValues) == 0x000008, "Wrong alignment on FALSAnimGraphAimingValues");
static_assert(sizeof(FALSAnimGraphAimingValues) == 0x000058, "Wrong size on FALSAnimGraphAimingValues");
static_assert(offsetof(FALSAnimGraphAimingValues, SmoothedAimingRotation) == 0x000000, "Member 'FALSAnimGraphAimingValues::SmoothedAimingRotation' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphAimingValues, SpineRotation) == 0x000018, "Member 'FALSAnimGraphAimingValues::SpineRotation' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphAimingValues, AimingAngle) == 0x000030, "Member 'FALSAnimGraphAimingValues::AimingAngle' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphAimingValues, AimSweepTime) == 0x000040, "Member 'FALSAnimGraphAimingValues::AimSweepTime' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphAimingValues, InputYawOffsetTime) == 0x000044, "Member 'FALSAnimGraphAimingValues::InputYawOffsetTime' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphAimingValues, ForwardYawTime) == 0x000048, "Member 'FALSAnimGraphAimingValues::ForwardYawTime' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphAimingValues, LeftYawTime) == 0x00004C, "Member 'FALSAnimGraphAimingValues::LeftYawTime' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphAimingValues, RightYawTime) == 0x000050, "Member 'FALSAnimGraphAimingValues::RightYawTime' has a wrong offset!");

// ScriptStruct ALSV4_CPP.ALSAnimGraphLayerBlending
// 0x0064 (0x0064 - 0x0000)
struct FALSAnimGraphLayerBlending final
{
public:
	int32                                         OverlayOverrideState;                              // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableAimOffset;                                   // 0x0004(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AimOffset;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BasePose_N;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BasePose_CLF;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_L;                                             // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_L_Add;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_L_LS;                                          // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_L_MS;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_R;                                             // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_R_Add;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_R_LS;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_R_MS;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Hand_L;                                            // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Hand_R;                                            // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Legs;                                              // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Legs_Add;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pelvis;                                            // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pelvis_Add;                                        // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Spine;                                             // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Spine_Add;                                         // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Head;                                              // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Head_Add;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EnableHandIK_L;                                    // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EnableHandIK_R;                                    // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FALSAnimGraphLayerBlending) == 0x000004, "Wrong alignment on FALSAnimGraphLayerBlending");
static_assert(sizeof(FALSAnimGraphLayerBlending) == 0x000064, "Wrong size on FALSAnimGraphLayerBlending");
static_assert(offsetof(FALSAnimGraphLayerBlending, OverlayOverrideState) == 0x000000, "Member 'FALSAnimGraphLayerBlending::OverlayOverrideState' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, EnableAimOffset) == 0x000004, "Member 'FALSAnimGraphLayerBlending::EnableAimOffset' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, AimOffset) == 0x000008, "Member 'FALSAnimGraphLayerBlending::AimOffset' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, BasePose_N) == 0x00000C, "Member 'FALSAnimGraphLayerBlending::BasePose_N' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, BasePose_CLF) == 0x000010, "Member 'FALSAnimGraphLayerBlending::BasePose_CLF' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Arm_L) == 0x000014, "Member 'FALSAnimGraphLayerBlending::Arm_L' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Arm_L_Add) == 0x000018, "Member 'FALSAnimGraphLayerBlending::Arm_L_Add' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Arm_L_LS) == 0x00001C, "Member 'FALSAnimGraphLayerBlending::Arm_L_LS' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Arm_L_MS) == 0x000020, "Member 'FALSAnimGraphLayerBlending::Arm_L_MS' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Arm_R) == 0x000024, "Member 'FALSAnimGraphLayerBlending::Arm_R' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Arm_R_Add) == 0x000028, "Member 'FALSAnimGraphLayerBlending::Arm_R_Add' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Arm_R_LS) == 0x00002C, "Member 'FALSAnimGraphLayerBlending::Arm_R_LS' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Arm_R_MS) == 0x000030, "Member 'FALSAnimGraphLayerBlending::Arm_R_MS' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Hand_L) == 0x000034, "Member 'FALSAnimGraphLayerBlending::Hand_L' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Hand_R) == 0x000038, "Member 'FALSAnimGraphLayerBlending::Hand_R' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Legs) == 0x00003C, "Member 'FALSAnimGraphLayerBlending::Legs' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Legs_Add) == 0x000040, "Member 'FALSAnimGraphLayerBlending::Legs_Add' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Pelvis) == 0x000044, "Member 'FALSAnimGraphLayerBlending::Pelvis' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Pelvis_Add) == 0x000048, "Member 'FALSAnimGraphLayerBlending::Pelvis_Add' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Spine) == 0x00004C, "Member 'FALSAnimGraphLayerBlending::Spine' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Spine_Add) == 0x000050, "Member 'FALSAnimGraphLayerBlending::Spine_Add' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Head) == 0x000054, "Member 'FALSAnimGraphLayerBlending::Head' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, Head_Add) == 0x000058, "Member 'FALSAnimGraphLayerBlending::Head_Add' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, EnableHandIK_L) == 0x00005C, "Member 'FALSAnimGraphLayerBlending::EnableHandIK_L' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphLayerBlending, EnableHandIK_R) == 0x000060, "Member 'FALSAnimGraphLayerBlending::EnableHandIK_R' has a wrong offset!");

// ScriptStruct ALSV4_CPP.ALSAnimGraphFootIK
// 0x0130 (0x0130 - 0x0000)
struct FALSAnimGraphFootIK final
{
public:
	float                                         FootLock_L_Alpha;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootLock_R_Alpha;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FootLock_L_Location;                               // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetFootLock_R_Location;                         // 0x0020(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FootLock_R_Location;                               // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TargetFootLock_L_Rotation;                         // 0x0050(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               FootLock_L_Rotation;                               // 0x0068(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               TargetFootLock_R_Rotation;                         // 0x0080(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               FootLock_R_Rotation;                               // 0x0098(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                FootOffset_L_Location;                             // 0x00B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FootOffset_R_Location;                             // 0x00C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               FootOffset_L_Rotation;                             // 0x00E0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               FootOffset_R_Rotation;                             // 0x00F8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                PelvisOffset;                                      // 0x0110(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PelvisAlpha;                                       // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FALSAnimGraphFootIK) == 0x000008, "Wrong alignment on FALSAnimGraphFootIK");
static_assert(sizeof(FALSAnimGraphFootIK) == 0x000130, "Wrong size on FALSAnimGraphFootIK");
static_assert(offsetof(FALSAnimGraphFootIK, FootLock_L_Alpha) == 0x000000, "Member 'FALSAnimGraphFootIK::FootLock_L_Alpha' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, FootLock_R_Alpha) == 0x000004, "Member 'FALSAnimGraphFootIK::FootLock_R_Alpha' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, FootLock_L_Location) == 0x000008, "Member 'FALSAnimGraphFootIK::FootLock_L_Location' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, TargetFootLock_R_Location) == 0x000020, "Member 'FALSAnimGraphFootIK::TargetFootLock_R_Location' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, FootLock_R_Location) == 0x000038, "Member 'FALSAnimGraphFootIK::FootLock_R_Location' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, TargetFootLock_L_Rotation) == 0x000050, "Member 'FALSAnimGraphFootIK::TargetFootLock_L_Rotation' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, FootLock_L_Rotation) == 0x000068, "Member 'FALSAnimGraphFootIK::FootLock_L_Rotation' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, TargetFootLock_R_Rotation) == 0x000080, "Member 'FALSAnimGraphFootIK::TargetFootLock_R_Rotation' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, FootLock_R_Rotation) == 0x000098, "Member 'FALSAnimGraphFootIK::FootLock_R_Rotation' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, FootOffset_L_Location) == 0x0000B0, "Member 'FALSAnimGraphFootIK::FootOffset_L_Location' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, FootOffset_R_Location) == 0x0000C8, "Member 'FALSAnimGraphFootIK::FootOffset_R_Location' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, FootOffset_L_Rotation) == 0x0000E0, "Member 'FALSAnimGraphFootIK::FootOffset_L_Rotation' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, FootOffset_R_Rotation) == 0x0000F8, "Member 'FALSAnimGraphFootIK::FootOffset_R_Rotation' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, PelvisOffset) == 0x000110, "Member 'FALSAnimGraphFootIK::PelvisOffset' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphFootIK, PelvisAlpha) == 0x000128, "Member 'FALSAnimGraphFootIK::PelvisAlpha' has a wrong offset!");

// ScriptStruct ALSV4_CPP.ALSAnimGraphHandIK
// 0x0030 (0x0030 - 0x0000)
struct FALSAnimGraphHandIK final
{
public:
	struct FVector                                HandOffset_R_Location;                             // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HandOffset_L_Location;                             // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FALSAnimGraphHandIK) == 0x000008, "Wrong alignment on FALSAnimGraphHandIK");
static_assert(sizeof(FALSAnimGraphHandIK) == 0x000030, "Wrong size on FALSAnimGraphHandIK");
static_assert(offsetof(FALSAnimGraphHandIK, HandOffset_R_Location) == 0x000000, "Member 'FALSAnimGraphHandIK::HandOffset_R_Location' has a wrong offset!");
static_assert(offsetof(FALSAnimGraphHandIK, HandOffset_L_Location) == 0x000018, "Member 'FALSAnimGraphHandIK::HandOffset_L_Location' has a wrong offset!");

// ScriptStruct ALSV4_CPP.ALSAnimTurnInPlace
// 0x0118 (0x0118 - 0x0000)
struct FALSAnimTurnInPlace final
{
public:
	float                                         TurnCheckMinAngle;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Turn180Threshold;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimYawRateLimit;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedDelayTime;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinAngleDelay;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAngleDelay;                                     // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   N_TurnIP_L90;                                      // 0x0018(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   N_TurnIP_R90;                                      // 0x0038(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   N_TurnIP_L180;                                     // 0x0058(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   N_TurnIP_R180;                                     // 0x0078(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
