#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AncestralBolas_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AncestralBolas_Projectile.AncestralBolas_Projectile_C.ExecuteUbergraph_AncestralBolas_Projectile
// 0x0158 (0x0158 - 0x0000)
struct AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile) == 0x000008, "Wrong alignment on AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile");
static_assert(sizeof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile) == 0x000158, "Wrong size on AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, EntryPoint) == 0x000000, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, Temp_bool_Variable) == 0x000004, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, Temp_real_Variable) == 0x000008, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_IsServer_ReturnValue) == 0x000010, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_HasAuthority_ReturnValue) == 0x000011, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_IsServer_ReturnValue_1) == 0x000012, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_HasAuthority_ReturnValue_1) == 0x000013, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, K2Node_Event_EndPlayReason) == 0x000018, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, Temp_real_Variable_1) == 0x000028, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000038, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_RandomFloatInRange_ReturnValue) == 0x000040, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_MakeRotator_ReturnValue) == 0x000048, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000060, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000148, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000150, "Member 'AncestralBolas_Projectile_C_ExecuteUbergraph_AncestralBolas_Projectile::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

// Function AncestralBolas_Projectile.AncestralBolas_Projectile_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct AncestralBolas_Projectile_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AncestralBolas_Projectile_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on AncestralBolas_Projectile_C_ReceiveEndPlay");
static_assert(sizeof(AncestralBolas_Projectile_C_ReceiveEndPlay) == 0x000001, "Wrong size on AncestralBolas_Projectile_C_ReceiveEndPlay");
static_assert(offsetof(AncestralBolas_Projectile_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'AncestralBolas_Projectile_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function AncestralBolas_Projectile.AncestralBolas_Projectile_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AncestralBolas_Projectile_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AncestralBolas_Projectile_C_ReceiveTick) == 0x000004, "Wrong alignment on AncestralBolas_Projectile_C_ReceiveTick");
static_assert(sizeof(AncestralBolas_Projectile_C_ReceiveTick) == 0x000004, "Wrong size on AncestralBolas_Projectile_C_ReceiveTick");
static_assert(offsetof(AncestralBolas_Projectile_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'AncestralBolas_Projectile_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

