#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AncestralBolas_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AncestralBolas_Projectile.AncestralBolas_Projectile_C
// 0x0018 (0x05A8 - 0x0590)
class AAncestralBolas_Projectile_C final : public AAoCAbilityProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Stalagmite;                                        // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AncestralBolas_Projectile(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AncestralBolas_Projectile_C">();
	}
	static class AAncestralBolas_Projectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAncestralBolas_Projectile_C>();
	}
};
static_assert(alignof(AAncestralBolas_Projectile_C) == 0x000008, "Wrong alignment on AAncestralBolas_Projectile_C");
static_assert(sizeof(AAncestralBolas_Projectile_C) == 0x0005A8, "Wrong size on AAncestralBolas_Projectile_C");
static_assert(offsetof(AAncestralBolas_Projectile_C, UberGraphFrame) == 0x000590, "Member 'AAncestralBolas_Projectile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAncestralBolas_Projectile_C, Niagara) == 0x000598, "Member 'AAncestralBolas_Projectile_C::Niagara' has a wrong offset!");
static_assert(offsetof(AAncestralBolas_Projectile_C, Stalagmite) == 0x0005A0, "Member 'AAncestralBolas_Projectile_C::Stalagmite' has a wrong offset!");

}

