#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimatedArmor_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct AnimatedArmor_AnimBP.AnimatedArmor_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01FF (0x0200 - 0x0001)
struct AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_744;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_745;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_746;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_747;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_748;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_749;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_750;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_751;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_752;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_753;                                 // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_754;                               // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_755;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_756;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_757;                                 // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_758;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_759;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_760;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_761;                                // 0x0094(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_762;                               // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_763;                              // 0x009C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_764;                               // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_765;                                // 0x00CC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_766;                                // 0x00CD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_767;                                 // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_768;                                // 0x00D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_769;                                // 0x00DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_770;                                // 0x00E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_771;                                 // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_772;                               // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_773;                               // 0x0100(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_774;                               // 0x0110(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_775;                                // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_776;                                  // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_777;                                // 0x0130(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_778;                                // 0x0131(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_779;                                // 0x0132(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_780;                               // 0x0138(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_781;                              // 0x0148(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0168(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01E8(0x0018)()
};
static_assert(alignof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000200, "Wrong size on AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_744) == 0x000004, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_744' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_745) == 0x00000C, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_745' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_746) == 0x000018, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_746' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_747) == 0x000028, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_747' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_748) == 0x000030, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_748' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_749) == 0x000038, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_749' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_750) == 0x00003C, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_750' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_751) == 0x000044, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_751' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_752) == 0x000048, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_752' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_753) == 0x000050, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_753' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_754) == 0x000058, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_754' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_755) == 0x000068, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_755' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_756) == 0x000070, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_756' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_757) == 0x000078, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_757' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_758) == 0x00007C, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_758' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_759) == 0x000084, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_759' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_760) == 0x00008C, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_760' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_761) == 0x000094, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_761' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_762) == 0x000098, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_762' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_763) == 0x00009C, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_763' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_764) == 0x0000C8, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_764' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_765) == 0x0000CC, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_765' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_766) == 0x0000CD, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_766' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_767) == 0x0000D0, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_767' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_768) == 0x0000D4, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_768' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_769) == 0x0000DC, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_769' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_770) == 0x0000E4, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_770' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_771) == 0x0000EC, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_771' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_772) == 0x0000F0, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_772' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_773) == 0x000100, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_773' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_774) == 0x000110, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_774' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_775) == 0x000120, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_775' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_776) == 0x000128, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_776' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_777) == 0x000130, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_777' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_778) == 0x000131, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_778' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_779) == 0x000132, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_779' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_780) == 0x000138, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_780' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_781) == 0x000148, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_781' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000168, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001E8, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimatedArmor_AnimBP.AnimatedArmor_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x003B (0x003C - 0x0001)
struct AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_9;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0025(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0026(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0027(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x002A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_18;                                  // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_19;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_20;                                  // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_21;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00003C, "Wrong size on AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000004, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000008, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_4) == 0x00000C, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_4' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x00000D, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000010, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000014, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_8) == 0x000018, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_8' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x00001C, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000020, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_11) == 0x000024, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_11' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_12) == 0x000025, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_12' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_13) == 0x000026, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_13' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_14) == 0x000027, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_14' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_15) == 0x000028, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_15' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_16) == 0x000029, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_16' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_17) == 0x00002A, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_17' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_18) == 0x00002C, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_18' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_19) == 0x000030, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_19' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_20) == 0x000034, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_20' has a wrong offset!");
static_assert(offsetof(AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_21) == 0x000038, "Member 'AnimatedArmor_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_21' has a wrong offset!");

}

