#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AoCCorruptedPlayerRespawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AoCCorruptedPlayerRespawner.AoCCorruptedPlayerRespawner_C
// 0x0078 (0x0410 - 0x0398)
class AAoCCorruptedPlayerRespawner_C final : public AAoCCorruptedPlayerSpawner
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_PlayerRespawnPoint;                             // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pivot_Translation;                                 // 0x03D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Rotation_In_Local_Space;                           // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Rotation_Rate;                                     // 0x03F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMesh*                            NewVar_0;                                          // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AoCCorruptedPlayerRespawner_C">();
	}
	static class AAoCCorruptedPlayerRespawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAoCCorruptedPlayerRespawner_C>();
	}
};
static_assert(alignof(AAoCCorruptedPlayerRespawner_C) == 0x000008, "Wrong alignment on AAoCCorruptedPlayerRespawner_C");
static_assert(sizeof(AAoCCorruptedPlayerRespawner_C) == 0x000410, "Wrong size on AAoCCorruptedPlayerRespawner_C");
static_assert(offsetof(AAoCCorruptedPlayerRespawner_C, StaticMesh) == 0x000398, "Member 'AAoCCorruptedPlayerRespawner_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AAoCCorruptedPlayerRespawner_C, NS_PlayerRespawnPoint) == 0x0003A0, "Member 'AAoCCorruptedPlayerRespawner_C::NS_PlayerRespawnPoint' has a wrong offset!");
static_assert(offsetof(AAoCCorruptedPlayerRespawner_C, Audio) == 0x0003A8, "Member 'AAoCCorruptedPlayerRespawner_C::Audio' has a wrong offset!");
static_assert(offsetof(AAoCCorruptedPlayerRespawner_C, Billboard) == 0x0003B0, "Member 'AAoCCorruptedPlayerRespawner_C::Billboard' has a wrong offset!");
static_assert(offsetof(AAoCCorruptedPlayerRespawner_C, Capsule) == 0x0003B8, "Member 'AAoCCorruptedPlayerRespawner_C::Capsule' has a wrong offset!");
static_assert(offsetof(AAoCCorruptedPlayerRespawner_C, RotatingMovement) == 0x0003C0, "Member 'AAoCCorruptedPlayerRespawner_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(AAoCCorruptedPlayerRespawner_C, Arrow) == 0x0003C8, "Member 'AAoCCorruptedPlayerRespawner_C::Arrow' has a wrong offset!");
static_assert(offsetof(AAoCCorruptedPlayerRespawner_C, Pivot_Translation) == 0x0003D0, "Member 'AAoCCorruptedPlayerRespawner_C::Pivot_Translation' has a wrong offset!");
static_assert(offsetof(AAoCCorruptedPlayerRespawner_C, Rotation_In_Local_Space) == 0x0003E8, "Member 'AAoCCorruptedPlayerRespawner_C::Rotation_In_Local_Space' has a wrong offset!");
static_assert(offsetof(AAoCCorruptedPlayerRespawner_C, Rotation_Rate) == 0x0003F0, "Member 'AAoCCorruptedPlayerRespawner_C::Rotation_Rate' has a wrong offset!");
static_assert(offsetof(AAoCCorruptedPlayerRespawner_C, NewVar_0) == 0x000408, "Member 'AAoCCorruptedPlayerRespawner_C::NewVar_0' has a wrong offset!");

}

