#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AoCGameModeBaseBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AoCGameModeBaseBP.AoCGameModeBaseBP_C.SetupTutorialQuests
// 0x0008 (0x0008 - 0x0000)
struct AoCGameModeBaseBP_C_SetupTutorialQuests final
{
public:
	class APawn*                                  NewPawn;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCGameModeBaseBP_C_SetupTutorialQuests) == 0x000008, "Wrong alignment on AoCGameModeBaseBP_C_SetupTutorialQuests");
static_assert(sizeof(AoCGameModeBaseBP_C_SetupTutorialQuests) == 0x000008, "Wrong size on AoCGameModeBaseBP_C_SetupTutorialQuests");
static_assert(offsetof(AoCGameModeBaseBP_C_SetupTutorialQuests, NewPawn) == 0x000000, "Member 'AoCGameModeBaseBP_C_SetupTutorialQuests::NewPawn' has a wrong offset!");

// Function AoCGameModeBaseBP.AoCGameModeBaseBP_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct AoCGameModeBaseBP_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCGameModeBaseBP_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on AoCGameModeBaseBP_C_ReceiveEndPlay");
static_assert(sizeof(AoCGameModeBaseBP_C_ReceiveEndPlay) == 0x000001, "Wrong size on AoCGameModeBaseBP_C_ReceiveEndPlay");
static_assert(offsetof(AoCGameModeBaseBP_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'AoCGameModeBaseBP_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function AoCGameModeBaseBP.AoCGameModeBaseBP_C.ExecuteUbergraph_AoCGameModeBaseBP
// 0x0018 (0x0018 - 0x0000)
struct AoCGameModeBaseBP_C_ExecuteUbergraph_AoCGameModeBaseBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_newPawn;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCGameModeBaseBP_C_ExecuteUbergraph_AoCGameModeBaseBP) == 0x000008, "Wrong alignment on AoCGameModeBaseBP_C_ExecuteUbergraph_AoCGameModeBaseBP");
static_assert(sizeof(AoCGameModeBaseBP_C_ExecuteUbergraph_AoCGameModeBaseBP) == 0x000018, "Wrong size on AoCGameModeBaseBP_C_ExecuteUbergraph_AoCGameModeBaseBP");
static_assert(offsetof(AoCGameModeBaseBP_C_ExecuteUbergraph_AoCGameModeBaseBP, EntryPoint) == 0x000000, "Member 'AoCGameModeBaseBP_C_ExecuteUbergraph_AoCGameModeBaseBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(AoCGameModeBaseBP_C_ExecuteUbergraph_AoCGameModeBaseBP, K2Node_Event_newPawn) == 0x000008, "Member 'AoCGameModeBaseBP_C_ExecuteUbergraph_AoCGameModeBaseBP::K2Node_Event_newPawn' has a wrong offset!");
static_assert(offsetof(AoCGameModeBaseBP_C_ExecuteUbergraph_AoCGameModeBaseBP, K2Node_Event_EndPlayReason) == 0x000010, "Member 'AoCGameModeBaseBP_C_ExecuteUbergraph_AoCGameModeBaseBP::K2Node_Event_EndPlayReason' has a wrong offset!");

}

