#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AoCGameModeBaseBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AoCGameModeBaseBP.AoCGameModeBaseBP_C
// 0x0080 (0x0A40 - 0x09C0)
class AAoCGameModeBaseBP_C final : public AAoCGameModeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x09C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FName>                CharacterInformation;                              // 0x09D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              ResetLevelTriggers;                                // 0x0A20(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         NodeLevel;                                         // 0x0A30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetupTutorialQuests(class APawn* NewPawn);
	void ResetMapBP();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_AoCGameModeBaseBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AoCGameModeBaseBP_C">();
	}
	static class AAoCGameModeBaseBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAoCGameModeBaseBP_C>();
	}
};
static_assert(alignof(AAoCGameModeBaseBP_C) == 0x000010, "Wrong alignment on AAoCGameModeBaseBP_C");
static_assert(sizeof(AAoCGameModeBaseBP_C) == 0x000A40, "Wrong size on AAoCGameModeBaseBP_C");
static_assert(offsetof(AAoCGameModeBaseBP_C, UberGraphFrame) == 0x0009C0, "Member 'AAoCGameModeBaseBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAoCGameModeBaseBP_C, DefaultSceneRoot) == 0x0009C8, "Member 'AAoCGameModeBaseBP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAoCGameModeBaseBP_C, CharacterInformation) == 0x0009D0, "Member 'AAoCGameModeBaseBP_C::CharacterInformation' has a wrong offset!");
static_assert(offsetof(AAoCGameModeBaseBP_C, ResetLevelTriggers) == 0x000A20, "Member 'AAoCGameModeBaseBP_C::ResetLevelTriggers' has a wrong offset!");
static_assert(offsetof(AAoCGameModeBaseBP_C, NodeLevel) == 0x000A30, "Member 'AAoCGameModeBaseBP_C::NodeLevel' has a wrong offset!");

}

