#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AoCGameInstanceBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AoCGameInstanceBP.AoCGameInstanceBP_C
// 0x0068 (0x1A10 - 0x19A8)
class UAoCGameInstanceBP_C final : public UAoCGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x19A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UObject*                                LoginMenuWB;                                       // 0x19B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class AActor*>            ConstructionControllers;                           // 0x19B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ConstructionControllerMaps;                        // 0x1A08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DestroySessionCaller(class AAoCPlayerController* PlayerController);
	void ExecuteUbergraph_AoCGameInstanceBP(int32 EntryPoint);
	void OnFailure_31997CA241093C228A72F6B27C0D477D();
	void OnSuccess_31997CA241093C228A72F6B27C0D477D();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AoCGameInstanceBP_C">();
	}
	static class UAoCGameInstanceBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAoCGameInstanceBP_C>();
	}
};
static_assert(alignof(UAoCGameInstanceBP_C) == 0x000008, "Wrong alignment on UAoCGameInstanceBP_C");
static_assert(sizeof(UAoCGameInstanceBP_C) == 0x001A10, "Wrong size on UAoCGameInstanceBP_C");
static_assert(offsetof(UAoCGameInstanceBP_C, UberGraphFrame) == 0x0019A8, "Member 'UAoCGameInstanceBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAoCGameInstanceBP_C, LoginMenuWB) == 0x0019B0, "Member 'UAoCGameInstanceBP_C::LoginMenuWB' has a wrong offset!");
static_assert(offsetof(UAoCGameInstanceBP_C, ConstructionControllers) == 0x0019B8, "Member 'UAoCGameInstanceBP_C::ConstructionControllers' has a wrong offset!");
static_assert(offsetof(UAoCGameInstanceBP_C, ConstructionControllerMaps) == 0x001A08, "Member 'UAoCGameInstanceBP_C::ConstructionControllerMaps' has a wrong offset!");

}

