#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AoCNotificationTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function AoCNotificationTrigger.AoCNotificationTrigger_C.BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_EnterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function AoCNotificationTrigger.AoCNotificationTrigger_C.BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'AoCNotificationTrigger_C_BndEvt__AoCNotificationTrigger_ExitBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function AoCNotificationTrigger.AoCNotificationTrigger_C.ExecuteUbergraph_AoCNotificationTrigger
// 0x03C0 (0x03C0 - 0x0000)
struct AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       CallFunc_GetActualPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       CallFunc_GetActualPlayer_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0050(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0158(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnClient_ReturnValue;            // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnClient_ReturnValue_1;          // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAoCPlayerController*                   K2Node_DynamicCast_AsAo_CPlayer_Controller;        // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCalloutQueueInfo                      K2Node_MakeStruct_CalloutQueueInfo;                // 0x0278(0x0138)()
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger) == 0x000008, "Wrong alignment on AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger");
static_assert(sizeof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger) == 0x0003C0, "Wrong size on AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, EntryPoint) == 0x000000, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_GetActualPlayer_ReturnValue) == 0x000008, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_GetActualPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_IsValid_ReturnValue_2) == 0x000020, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_GetActualPlayer_ReturnValue_1) == 0x000028, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_GetActualPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000030, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000038, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000040, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000048, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x00004C, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000050, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000138, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_ComponentBoundEvent_OtherActor) == 0x000140, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_ComponentBoundEvent_OtherComp) == 0x000148, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000150, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_ComponentBoundEvent_bFromSweep) == 0x000154, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_ComponentBoundEvent_SweepResult) == 0x000158, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000240, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000241, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_IsRunningOnClient_ReturnValue) == 0x000242, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_IsRunningOnClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_IsRunningOnClient_ReturnValue_1) == 0x000243, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_IsRunningOnClient_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_GetPlayerController_ReturnValue) == 0x000248, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_DynamicCast_AsAo_CPlayer_Controller) == 0x000250, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_DynamicCast_AsAo_CPlayer_Controller' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_DynamicCast_bSuccess) == 0x000258, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_Conv_TextToString_ReturnValue) == 0x000260, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000270, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, K2Node_MakeStruct_CalloutQueueInfo) == 0x000278, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::K2Node_MakeStruct_CalloutQueueInfo' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0003B0, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_BooleanAND_ReturnValue) == 0x0003B8, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0003BC, "Member 'AoCNotificationTrigger_C_ExecuteUbergraph_AoCNotificationTrigger::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

}

