#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AoCPlayerControllerBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.TargetMember
// 0x00B8 (0x00B8 - 0x0000)
struct AoCPlayerControllerBP_C_TargetMember final
{
public:
	struct FAoCPartyMember                        Member;                                            // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AoCPlayerControllerBP_C_TargetMember) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_TargetMember");
static_assert(sizeof(AoCPlayerControllerBP_C_TargetMember) == 0x0000B8, "Wrong size on AoCPlayerControllerBP_C_TargetMember");
static_assert(offsetof(AoCPlayerControllerBP_C_TargetMember, Member) == 0x000000, "Member 'AoCPlayerControllerBP_C_TargetMember::Member' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.TalkToNPCClientCallback
// 0x0010 (0x0010 - 0x0000)
struct AoCPlayerControllerBP_C_TalkToNPCClientCallback final
{
public:
	class ANPCPawn_C*                             NPC_ToTalkTo;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         BaseChar;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_TalkToNPCClientCallback) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_TalkToNPCClientCallback");
static_assert(sizeof(AoCPlayerControllerBP_C_TalkToNPCClientCallback) == 0x000010, "Wrong size on AoCPlayerControllerBP_C_TalkToNPCClientCallback");
static_assert(offsetof(AoCPlayerControllerBP_C_TalkToNPCClientCallback, NPC_ToTalkTo) == 0x000000, "Member 'AoCPlayerControllerBP_C_TalkToNPCClientCallback::NPC_ToTalkTo' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_TalkToNPCClientCallback, BaseChar) == 0x000008, "Member 'AoCPlayerControllerBP_C_TalkToNPCClientCallback::BaseChar' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.StopTalkToNPClientCallback
// 0x0010 (0x0010 - 0x0000)
struct AoCPlayerControllerBP_C_StopTalkToNPClientCallback final
{
public:
	class ANPCPawn_C*                             NPC_Talking_With;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         BaseChar;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_StopTalkToNPClientCallback) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_StopTalkToNPClientCallback");
static_assert(sizeof(AoCPlayerControllerBP_C_StopTalkToNPClientCallback) == 0x000010, "Wrong size on AoCPlayerControllerBP_C_StopTalkToNPClientCallback");
static_assert(offsetof(AoCPlayerControllerBP_C_StopTalkToNPClientCallback, NPC_Talking_With) == 0x000000, "Member 'AoCPlayerControllerBP_C_StopTalkToNPClientCallback::NPC_Talking_With' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_StopTalkToNPClientCallback, BaseChar) == 0x000008, "Member 'AoCPlayerControllerBP_C_StopTalkToNPClientCallback::BaseChar' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.SpawnPFXAtLocation
// 0x0060 (0x0060 - 0x0000)
struct AoCPlayerControllerBP_C_SpawnPFXAtLocation final
{
public:
	double                                        Activation_Delay;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ParticleToSpawn;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Scale;                                             // 0x0040(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoDestroy;                                       // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoActivate;                                      // 0x0059(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_SpawnPFXAtLocation) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_SpawnPFXAtLocation");
static_assert(sizeof(AoCPlayerControllerBP_C_SpawnPFXAtLocation) == 0x000060, "Wrong size on AoCPlayerControllerBP_C_SpawnPFXAtLocation");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnPFXAtLocation, Activation_Delay) == 0x000000, "Member 'AoCPlayerControllerBP_C_SpawnPFXAtLocation::Activation_Delay' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnPFXAtLocation, ParticleToSpawn) == 0x000008, "Member 'AoCPlayerControllerBP_C_SpawnPFXAtLocation::ParticleToSpawn' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnPFXAtLocation, Location) == 0x000010, "Member 'AoCPlayerControllerBP_C_SpawnPFXAtLocation::Location' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnPFXAtLocation, Rotation) == 0x000028, "Member 'AoCPlayerControllerBP_C_SpawnPFXAtLocation::Rotation' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnPFXAtLocation, Scale) == 0x000040, "Member 'AoCPlayerControllerBP_C_SpawnPFXAtLocation::Scale' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnPFXAtLocation, AutoDestroy) == 0x000058, "Member 'AoCPlayerControllerBP_C_SpawnPFXAtLocation::AutoDestroy' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnPFXAtLocation, AutoActivate) == 0x000059, "Member 'AoCPlayerControllerBP_C_SpawnPFXAtLocation::AutoActivate' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.SpawnDecalAtLocation
// 0x0088 (0x0088 - 0x0000)
struct AoCPlayerControllerBP_C_SpawnDecalAtLocation final
{
public:
	class UMaterialInterface*                     Decal_Material;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Decal_Size;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        Life_Span;                                         // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FadeIn_;                                           // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FadeOut_;                                          // 0x0059(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FadeInDelay;                                       // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeInDuration;                                    // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeOutDelay;                                      // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeOutDuration;                                   // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isMeteorStorm;                                     // 0x0080(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_SpawnDecalAtLocation) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_SpawnDecalAtLocation");
static_assert(sizeof(AoCPlayerControllerBP_C_SpawnDecalAtLocation) == 0x000088, "Wrong size on AoCPlayerControllerBP_C_SpawnDecalAtLocation");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnDecalAtLocation, Decal_Material) == 0x000000, "Member 'AoCPlayerControllerBP_C_SpawnDecalAtLocation::Decal_Material' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnDecalAtLocation, Decal_Size) == 0x000008, "Member 'AoCPlayerControllerBP_C_SpawnDecalAtLocation::Decal_Size' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnDecalAtLocation, Location) == 0x000020, "Member 'AoCPlayerControllerBP_C_SpawnDecalAtLocation::Location' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnDecalAtLocation, Rotation) == 0x000038, "Member 'AoCPlayerControllerBP_C_SpawnDecalAtLocation::Rotation' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnDecalAtLocation, Life_Span) == 0x000050, "Member 'AoCPlayerControllerBP_C_SpawnDecalAtLocation::Life_Span' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnDecalAtLocation, FadeIn_) == 0x000058, "Member 'AoCPlayerControllerBP_C_SpawnDecalAtLocation::FadeIn_' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnDecalAtLocation, FadeOut_) == 0x000059, "Member 'AoCPlayerControllerBP_C_SpawnDecalAtLocation::FadeOut_' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnDecalAtLocation, FadeInDelay) == 0x000060, "Member 'AoCPlayerControllerBP_C_SpawnDecalAtLocation::FadeInDelay' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnDecalAtLocation, FadeInDuration) == 0x000068, "Member 'AoCPlayerControllerBP_C_SpawnDecalAtLocation::FadeInDuration' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnDecalAtLocation, FadeOutDelay) == 0x000070, "Member 'AoCPlayerControllerBP_C_SpawnDecalAtLocation::FadeOutDelay' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnDecalAtLocation, FadeOutDuration) == 0x000078, "Member 'AoCPlayerControllerBP_C_SpawnDecalAtLocation::FadeOutDuration' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnDecalAtLocation, isMeteorStorm) == 0x000080, "Member 'AoCPlayerControllerBP_C_SpawnDecalAtLocation::isMeteorStorm' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.SpawnActorAtLocation
// 0x0068 (0x0068 - 0x0000)
struct AoCPlayerControllerBP_C_SpawnActorAtLocation final
{
public:
	bool                                          AttachToCharacter;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         OwningCharacter;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Attach_Socket;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Spawn_Location;                                    // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Spawn_Rotation;                                    // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Spawn_Scale;                                       // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ClassToSpawn;                                      // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_SpawnActorAtLocation) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_SpawnActorAtLocation");
static_assert(sizeof(AoCPlayerControllerBP_C_SpawnActorAtLocation) == 0x000068, "Wrong size on AoCPlayerControllerBP_C_SpawnActorAtLocation");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnActorAtLocation, AttachToCharacter) == 0x000000, "Member 'AoCPlayerControllerBP_C_SpawnActorAtLocation::AttachToCharacter' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnActorAtLocation, OwningCharacter) == 0x000008, "Member 'AoCPlayerControllerBP_C_SpawnActorAtLocation::OwningCharacter' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnActorAtLocation, Attach_Socket) == 0x000010, "Member 'AoCPlayerControllerBP_C_SpawnActorAtLocation::Attach_Socket' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnActorAtLocation, Spawn_Location) == 0x000018, "Member 'AoCPlayerControllerBP_C_SpawnActorAtLocation::Spawn_Location' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnActorAtLocation, Spawn_Rotation) == 0x000030, "Member 'AoCPlayerControllerBP_C_SpawnActorAtLocation::Spawn_Rotation' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnActorAtLocation, Spawn_Scale) == 0x000048, "Member 'AoCPlayerControllerBP_C_SpawnActorAtLocation::Spawn_Scale' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_SpawnActorAtLocation, ClassToSpawn) == 0x000060, "Member 'AoCPlayerControllerBP_C_SpawnActorAtLocation::ClassToSpawn' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.Set Hide All Characters In World
// 0x0070 (0x0070 - 0x0000)
struct AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World final
{
public:
	bool                                          bHide;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         IgnoreActors;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class ABaseCharacter*>                 OutCharacters;                                     // 0x0018(0x0010)(Parm, OutParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         CallFunc_GetBaseCharacter_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABaseCharacter*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_ActorIsAutonomousOnClient_ReturnValue;    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World");
static_assert(sizeof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World) == 0x000070, "Wrong size on AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, bHide) == 0x000000, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::bHide' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, IgnoreActors) == 0x000008, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::IgnoreActors' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, OutCharacters) == 0x000018, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::OutCharacters' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, Temp_int_Array_Index_Variable) == 0x000028, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, CallFunc_GetBaseCharacter_ReturnValue) == 0x000038, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::CallFunc_GetBaseCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, CallFunc_ActorIsAutonomousOnClient_ReturnValue) == 0x000050, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::CallFunc_ActorIsAutonomousOnClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, CallFunc_Array_Get_Item) == 0x000058, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, CallFunc_Array_Contains_ReturnValue) == 0x000060, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'AoCPlayerControllerBP_C_Set_Hide_All_Characters_In_World::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.OpenFastTravelWidget
// 0x0008 (0x0008 - 0x0000)
struct AoCPlayerControllerBP_C_OpenFastTravelWidget final
{
public:
	class ANPCPawn_C*                             FastTravelNPC;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_OpenFastTravelWidget) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_OpenFastTravelWidget");
static_assert(sizeof(AoCPlayerControllerBP_C_OpenFastTravelWidget) == 0x000008, "Wrong size on AoCPlayerControllerBP_C_OpenFastTravelWidget");
static_assert(offsetof(AoCPlayerControllerBP_C_OpenFastTravelWidget, FastTravelNPC) == 0x000000, "Member 'AoCPlayerControllerBP_C_OpenFastTravelWidget::FastTravelNPC' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.OnUpdatePlayerItemsBP
// 0x0001 (0x0001 - 0x0000)
struct AoCPlayerControllerBP_C_OnUpdatePlayerItemsBP final
{
public:
	EItemLocation                                 Loc_0;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_OnUpdatePlayerItemsBP) == 0x000001, "Wrong alignment on AoCPlayerControllerBP_C_OnUpdatePlayerItemsBP");
static_assert(sizeof(AoCPlayerControllerBP_C_OnUpdatePlayerItemsBP) == 0x000001, "Wrong size on AoCPlayerControllerBP_C_OnUpdatePlayerItemsBP");
static_assert(offsetof(AoCPlayerControllerBP_C_OnUpdatePlayerItemsBP, Loc_0) == 0x000000, "Member 'AoCPlayerControllerBP_C_OnUpdatePlayerItemsBP::Loc_0' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.LogRegisteredEmail
// 0x0010 (0x0010 - 0x0000)
struct AoCPlayerControllerBP_C_LogRegisteredEmail final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_LogRegisteredEmail) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_LogRegisteredEmail");
static_assert(sizeof(AoCPlayerControllerBP_C_LogRegisteredEmail) == 0x000010, "Wrong size on AoCPlayerControllerBP_C_LogRegisteredEmail");
static_assert(offsetof(AoCPlayerControllerBP_C_LogRegisteredEmail, Email) == 0x000000, "Member 'AoCPlayerControllerBP_C_LogRegisteredEmail::Email' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.InpActEvt_ToggleFPS_UniqueObjectNameForCooking_5
// 0x0018 (0x0018 - 0x0000)
struct AoCPlayerControllerBP_C_InpActEvt_ToggleFPS_UniqueObjectNameForCooking_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_InpActEvt_ToggleFPS_UniqueObjectNameForCooking_5) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_InpActEvt_ToggleFPS_UniqueObjectNameForCooking_5");
static_assert(sizeof(AoCPlayerControllerBP_C_InpActEvt_ToggleFPS_UniqueObjectNameForCooking_5) == 0x000018, "Wrong size on AoCPlayerControllerBP_C_InpActEvt_ToggleFPS_UniqueObjectNameForCooking_5");
static_assert(offsetof(AoCPlayerControllerBP_C_InpActEvt_ToggleFPS_UniqueObjectNameForCooking_5, Key) == 0x000000, "Member 'AoCPlayerControllerBP_C_InpActEvt_ToggleFPS_UniqueObjectNameForCooking_5::Key' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.InpActEvt_PageUp_UniqueObjectNameForCooking_15
// 0x0018 (0x0018 - 0x0000)
struct AoCPlayerControllerBP_C_InpActEvt_PageUp_UniqueObjectNameForCooking_15 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_InpActEvt_PageUp_UniqueObjectNameForCooking_15) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_InpActEvt_PageUp_UniqueObjectNameForCooking_15");
static_assert(sizeof(AoCPlayerControllerBP_C_InpActEvt_PageUp_UniqueObjectNameForCooking_15) == 0x000018, "Wrong size on AoCPlayerControllerBP_C_InpActEvt_PageUp_UniqueObjectNameForCooking_15");
static_assert(offsetof(AoCPlayerControllerBP_C_InpActEvt_PageUp_UniqueObjectNameForCooking_15, Key) == 0x000000, "Member 'AoCPlayerControllerBP_C_InpActEvt_PageUp_UniqueObjectNameForCooking_15::Key' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.InpActEvt_Ctrl+Alt+Shift_P_UniqueObjectNameForCooking_3
// 0x0018 (0x0018 - 0x0000)
struct AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_P_UniqueObjectNameForCooking_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_P_UniqueObjectNameForCooking_3) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_P_UniqueObjectNameForCooking_3");
static_assert(sizeof(AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_P_UniqueObjectNameForCooking_3) == 0x000018, "Wrong size on AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_P_UniqueObjectNameForCooking_3");
static_assert(offsetof(AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_P_UniqueObjectNameForCooking_3, Key) == 0x000000, "Member 'AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_P_UniqueObjectNameForCooking_3::Key' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.InpActEvt_Ctrl+Alt+Shift_N_UniqueObjectNameForCooking_4
// 0x0018 (0x0018 - 0x0000)
struct AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_N_UniqueObjectNameForCooking_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_N_UniqueObjectNameForCooking_4) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_N_UniqueObjectNameForCooking_4");
static_assert(sizeof(AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_N_UniqueObjectNameForCooking_4) == 0x000018, "Wrong size on AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_N_UniqueObjectNameForCooking_4");
static_assert(offsetof(AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_N_UniqueObjectNameForCooking_4, Key) == 0x000000, "Member 'AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_N_UniqueObjectNameForCooking_4::Key' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.InpActEvt_Ctrl+Alt+Shift_M_UniqueObjectNameForCooking_6
// 0x0018 (0x0018 - 0x0000)
struct AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_M_UniqueObjectNameForCooking_6 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_M_UniqueObjectNameForCooking_6) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_M_UniqueObjectNameForCooking_6");
static_assert(sizeof(AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_M_UniqueObjectNameForCooking_6) == 0x000018, "Wrong size on AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_M_UniqueObjectNameForCooking_6");
static_assert(offsetof(AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_M_UniqueObjectNameForCooking_6, Key) == 0x000000, "Member 'AoCPlayerControllerBP_C_InpActEvt_Ctrl_Alt_Shift_M_UniqueObjectNameForCooking_6::Key' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.InpActEvt_Comma_UniqueObjectNameForCooking_12
// 0x0018 (0x0018 - 0x0000)
struct AoCPlayerControllerBP_C_InpActEvt_Comma_UniqueObjectNameForCooking_12 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_InpActEvt_Comma_UniqueObjectNameForCooking_12) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_InpActEvt_Comma_UniqueObjectNameForCooking_12");
static_assert(sizeof(AoCPlayerControllerBP_C_InpActEvt_Comma_UniqueObjectNameForCooking_12) == 0x000018, "Wrong size on AoCPlayerControllerBP_C_InpActEvt_Comma_UniqueObjectNameForCooking_12");
static_assert(offsetof(AoCPlayerControllerBP_C_InpActEvt_Comma_UniqueObjectNameForCooking_12, Key) == 0x000000, "Member 'AoCPlayerControllerBP_C_InpActEvt_Comma_UniqueObjectNameForCooking_12::Key' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.GetInputDirection
// 0x00F0 (0x00F0 - 0x0000)
struct AoCPlayerControllerBP_C_GetInputDirection final
{
public:
	struct FVector                                InputDir;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputAxisValue_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputAxisValue_ReturnValue_1;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_VectorFloat_B_ImplicitCast;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_VectorFloat_B_ImplicitCast_1;    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AoCPlayerControllerBP_C_GetInputDirection) == 0x000008, "Wrong alignment on AoCPlayerControllerBP_C_GetInputDirection");
static_assert(sizeof(AoCPlayerControllerBP_C_GetInputDirection) == 0x0000F0, "Wrong size on AoCPlayerControllerBP_C_GetInputDirection");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, InputDir) == 0x000000, "Member 'AoCPlayerControllerBP_C_GetInputDirection::InputDir' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_GetActorRightVector_ReturnValue) == 0x000018, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_GetActorForwardVector_ReturnValue) == 0x000030, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_GetInputAxisValue_ReturnValue) == 0x000048, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_GetInputAxisValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_GetInputAxisValue_ReturnValue_1) == 0x00004C, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_GetInputAxisValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000050, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000068, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_Add_VectorVector_ReturnValue) == 0x000080, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_BreakVector_X) == 0x000098, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_BreakVector_Y) == 0x0000A0, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_MakeVector_ReturnValue) == 0x0000B0, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_Normal_ReturnValue) == 0x0000C8, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_Multiply_VectorFloat_B_ImplicitCast) == 0x0000E0, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_Multiply_VectorFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AoCPlayerControllerBP_C_GetInputDirection, CallFunc_Multiply_VectorFloat_B_ImplicitCast_1) == 0x0000E8, "Member 'AoCPlayerControllerBP_C_GetInputDirection::CallFunc_Multiply_VectorFloat_B_ImplicitCast_1' has a wrong offset!");

// Function AoCPlayerControllerBP.AoCPlayerControllerBP_C.ExecuteUbergraph_AoCPlayerControllerBP
// 0x0780 (0x0780 - 0x0000)
struct AoCPlayerControllerBP_C_ExecuteUbergraph_AoCPlayerControllerBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   UniqueObjectNameForCooking_Key;                    // 0x0008(0x0018)(HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLocationData_ReturnValue;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	struct FKey                                   UniqueObjectNameForCooking_Key_1;                  // 0x0070(0x0018)(HasGetValueTypeHash)
	struct FKey                                   UniqueObjectNameForCooking_Key_2;                  // 0x0088(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemLocation                                 K2Node_Event_loc;                                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAoCHUDBase*                            CallFunc_GetAoCHUD_ReturnValue;                    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESiegeTeamType                                K2Node_Event_VictorTeamType;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Friendly_;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_2;                 // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAoCPartyMember                        K2Node_CustomEvent_Member;                         // 0x00D8(0x00B8)()
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character_1;             // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAoCPlayerController*                   CallFunc_GetRaidMemberByGuid_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAoCPlayerController*                   CallFunc_GetPartyMemberByGuid_ReturnValue;         // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       CallFunc_GetActualPlayer_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       CallFunc_GetActualPlayer_ReturnValue_1;            // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   UniqueObjectNameForCooking_Key_3;                  // 0x01C8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPCPawn_C*                             K2Node_CustomEvent_FastTravelNPC;                  // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFastTravelComponent*                   CallFunc_GetFastTravelComponent_ReturnValue;       // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FTravelRoute>              CallFunc_GetTravelRoutes_ReturnValue;              // 0x0208(0x0050)()
	bool                                          K2Node_CustomEvent_AttachToCharacter;              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         K2Node_CustomEvent_OwningCharacter;                // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Attach_Socket;                  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Spawn_Location;                 // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Spawn_Rotation;                 // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_Spawn_Scale;                    // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_ClassToSpawn;                   // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetPlayerMesh_ReturnValue;                // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0xF];                                      // 0x0341(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0350(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0400(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAoCHUDBase*                            CallFunc_GetAoCHUD_ReturnValue_1;                  // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsActionMode;                        // 0x0479(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A[0x2];                                      // 0x047A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_ForwardAxis;                          // 0x047C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RightAxis;                            // 0x0480(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_485[0x3];                                      // 0x0485(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             UniqueObjectNameForCooking_AsText;                 // 0x0490(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueObjectNameForCooking_bSuccess;               // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x049B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bHide;                          // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49D[0x3];                                      // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_CustomEvent_IgnoreActors;                   // 0x04A0(0x0010)(ConstParm, ReferenceParm)
	TArray<class ABaseCharacter*>                 CallFunc_Set_Hide_All_Characters_In_World_OutCharacters; // 0x04B0(0x0010)(ReferenceParm)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_3;                 // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character_2;             // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x04E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x04F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_CustomEvent_Decal_Material;                 // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Decal_Size;                     // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        K2Node_CustomEvent_Life_Span;                      // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_FadeIn_;                        // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_FadeOut_;                       // 0x0561(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_562[0x6];                                      // 0x0562(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_FadeInDelay;                    // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_FadeInDuration;                 // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_FadeOutDelay;                   // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_FadeOutDuration;                // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isMeteorStorm;                  // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0590(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPCPawn_C*                             K2Node_CustomEvent_NPC_Talking_With;               // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         K2Node_CustomEvent_BaseChar_1;                     // 0x05A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANPCPawn_C*                             K2Node_CustomEvent_NPC_ToTalkTo;                   // 0x05B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         K2Node_CustomEvent_BaseChar;                       // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x05C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character_3;             // 0x05D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsProxying_ReturnValue;                   // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
