#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Arrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Arrow.Arrow_C
// 0x0018 (0x0360 - 0x0348)
class AArrow_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Arrow(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Arrow_C">();
	}
	static class AArrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArrow_C>();
	}
};
static_assert(alignof(AArrow_C) == 0x000008, "Wrong alignment on AArrow_C");
static_assert(sizeof(AArrow_C) == 0x000360, "Wrong size on AArrow_C");
static_assert(offsetof(AArrow_C, UberGraphFrame) == 0x000348, "Member 'AArrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AArrow_C, Arrow) == 0x000350, "Member 'AArrow_C::Arrow' has a wrong offset!");
static_assert(offsetof(AArrow_C, DefaultSceneRoot) == 0x000358, "Member 'AArrow_C::DefaultSceneRoot' has a wrong offset!");

}

