#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ashes_MMO_InvisibleWall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ashes_MMO_InvisibleWall.Ashes_MMO_InvisibleWall_C
// 0x0038 (0x0380 - 0x0348)
class AAshes_MMO_InvisibleWall_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Root;                                              // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Wall_Height;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        wall_Width;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Sink_Amount;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Draw_Disance;                                  // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Ashes_MMO_InvisibleWall(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ashes_MMO_InvisibleWall_C">();
	}
	static class AAshes_MMO_InvisibleWall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAshes_MMO_InvisibleWall_C>();
	}
};
static_assert(alignof(AAshes_MMO_InvisibleWall_C) == 0x000008, "Wrong alignment on AAshes_MMO_InvisibleWall_C");
static_assert(sizeof(AAshes_MMO_InvisibleWall_C) == 0x000380, "Wrong size on AAshes_MMO_InvisibleWall_C");
static_assert(offsetof(AAshes_MMO_InvisibleWall_C, UberGraphFrame) == 0x000348, "Member 'AAshes_MMO_InvisibleWall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAshes_MMO_InvisibleWall_C, Spline) == 0x000350, "Member 'AAshes_MMO_InvisibleWall_C::Spline' has a wrong offset!");
static_assert(offsetof(AAshes_MMO_InvisibleWall_C, Root) == 0x000358, "Member 'AAshes_MMO_InvisibleWall_C::Root' has a wrong offset!");
static_assert(offsetof(AAshes_MMO_InvisibleWall_C, Wall_Height) == 0x000360, "Member 'AAshes_MMO_InvisibleWall_C::Wall_Height' has a wrong offset!");
static_assert(offsetof(AAshes_MMO_InvisibleWall_C, wall_Width) == 0x000368, "Member 'AAshes_MMO_InvisibleWall_C::wall_Width' has a wrong offset!");
static_assert(offsetof(AAshes_MMO_InvisibleWall_C, Sink_Amount) == 0x000370, "Member 'AAshes_MMO_InvisibleWall_C::Sink_Amount' has a wrong offset!");
static_assert(offsetof(AAshes_MMO_InvisibleWall_C, Max_Draw_Disance) == 0x000378, "Member 'AAshes_MMO_InvisibleWall_C::Max_Draw_Disance' has a wrong offset!");

}

