#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bandit_Captain1

#include "Basic.hpp"


namespace SDK::Params
{

// Function Bandit_Captain1.Bandit_Captain1_C.ExecuteUbergraph_Bandit_Captain1
// 0x0008 (0x0008 - 0x0000)
struct Bandit_Captain1_C_ExecuteUbergraph_Bandit_Captain1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bandit_Captain1_C_ExecuteUbergraph_Bandit_Captain1) == 0x000004, "Wrong alignment on Bandit_Captain1_C_ExecuteUbergraph_Bandit_Captain1");
static_assert(sizeof(Bandit_Captain1_C_ExecuteUbergraph_Bandit_Captain1) == 0x000008, "Wrong size on Bandit_Captain1_C_ExecuteUbergraph_Bandit_Captain1");
static_assert(offsetof(Bandit_Captain1_C_ExecuteUbergraph_Bandit_Captain1, EntryPoint) == 0x000000, "Member 'Bandit_Captain1_C_ExecuteUbergraph_Bandit_Captain1::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bandit_Captain1_C_ExecuteUbergraph_Bandit_Captain1, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Bandit_Captain1_C_ExecuteUbergraph_Bandit_Captain1::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function Bandit_Captain1.Bandit_Captain1_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Bandit_Captain1_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bandit_Captain1_C_ReceiveTick) == 0x000004, "Wrong alignment on Bandit_Captain1_C_ReceiveTick");
static_assert(sizeof(Bandit_Captain1_C_ReceiveTick) == 0x000004, "Wrong size on Bandit_Captain1_C_ReceiveTick");
static_assert(offsetof(Bandit_Captain1_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Bandit_Captain1_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

