#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BFL_RoadSetDressing

#include "Basic.hpp"

#include "S_RoadSetDressingData_structs.hpp"


namespace SDK::Params
{

// Function BFL_RoadSetDressing.BFL_RoadSetDressing_C.Retrieve Set Dressing Data
// 0x0080 (0x0080 - 0x0000)
struct BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data final
{
public:
	class AActor*                                 In_Actor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_RoadSetDressingData>         Set_Dressing_Data;                                 // 0x0010(0x0010)(Parm, OutParm)
	bool                                          Is_Intersection;                                   // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Out_Is_Intersection;                               // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_RoadSetDressingData>         Out_Data;                                          // 0x0028(0x0010)(Edit, BlueprintVisible)
	class AActor*                                 Actor;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_LandscapeBrushRoad_C*               K2Node_DynamicCast_AsBP_Landscape_Brush_Road;      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LandscapeBrushRoadIntersection_C*   K2Node_DynamicCast_AsBP_Landscape_Brush_Road_Intersection; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NodeIntersectionProxy_C*            K2Node_DynamicCast_AsBP_Node_Intersection_Proxy;   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NodeRoadProxy_C*                    K2Node_DynamicCast_AsBP_Node_Road_Proxy;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data) == 0x000008, "Wrong alignment on BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data");
static_assert(sizeof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data) == 0x000080, "Wrong size on BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, In_Actor) == 0x000000, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::In_Actor' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, __WorldContext) == 0x000008, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::__WorldContext' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, Set_Dressing_Data) == 0x000010, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::Set_Dressing_Data' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, Is_Intersection) == 0x000020, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::Is_Intersection' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, Out_Is_Intersection) == 0x000021, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::Out_Is_Intersection' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, Out_Data) == 0x000028, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::Out_Data' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, Actor) == 0x000038, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::Actor' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, K2Node_DynamicCast_AsBP_Landscape_Brush_Road) == 0x000040, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::K2Node_DynamicCast_AsBP_Landscape_Brush_Road' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, K2Node_DynamicCast_AsBP_Landscape_Brush_Road_Intersection) == 0x000050, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::K2Node_DynamicCast_AsBP_Landscape_Brush_Road_Intersection' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, K2Node_DynamicCast_AsBP_Node_Intersection_Proxy) == 0x000060, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::K2Node_DynamicCast_AsBP_Node_Intersection_Proxy' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, K2Node_DynamicCast_AsBP_Node_Road_Proxy) == 0x000070, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::K2Node_DynamicCast_AsBP_Node_Road_Proxy' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data, CallFunc_Array_Add_ReturnValue_1) == 0x00007C, "Member 'BFL_RoadSetDressing_C_Retrieve_Set_Dressing_Data::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

}

