#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BOW_NPC_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct BOW_NPC_AnimBP.BOW_NPC_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x022F (0x0230 - 0x0001)
struct BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1247;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1248;                               // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1249;                               // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1250;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1251;                               // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1252;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1253;                               // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1254;                               // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1255;                               // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1256;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1257;                               // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1258;                               // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1259;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1260;                               // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1261;                               // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 __ArrayProperty_1262;                              // 0x0068(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_1263;                              // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1264;                              // 0x0088(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_1265;                              // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1266;                               // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1267;                              // 0x00B0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1268;                               // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1269;                               // 0x00C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1270;                               // 0x00C9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1271;                              // 0x00D0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1272;                               // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1273;                               // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_1274;                               // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1275;                                 // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1276;                               // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1277;                               // 0x0101(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1278;                              // 0x0108(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1279;                               // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1280;                                // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1281;                               // 0x0124(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1282;                               // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1283;                               // 0x0130(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1284;                             // 0x0138(0x0020)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1285;                              // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1286;                             // 0x015C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1287;                              // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1288;                               // 0x018C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1289;                               // 0x018D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1290;                               // 0x018E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18F[0x1];                                      // 0x018F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1291;                               // 0x0190(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0198(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0218(0x0018)()
};
static_assert(alignof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000230, "Wrong size on BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1247) == 0x000004, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1247' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1248) == 0x00000C, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1248' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1249) == 0x000010, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1249' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1250) == 0x000018, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1250' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1251) == 0x00001C, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1251' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1252) == 0x000024, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1252' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1253) == 0x000028, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1253' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1254) == 0x000030, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1254' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1255) == 0x000038, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1255' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1256) == 0x000040, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1256' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1257) == 0x000044, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1257' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1258) == 0x00004C, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1258' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1259) == 0x000054, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1259' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1260) == 0x000058, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1260' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1261) == 0x000060, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1261' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1262) == 0x000068, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1262' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1263) == 0x000078, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1263' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1264) == 0x000088, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1264' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1265) == 0x000098, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1265' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1266) == 0x0000A8, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1266' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1267) == 0x0000B0, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1267' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1268) == 0x0000C0, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1268' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1269) == 0x0000C8, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1269' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1270) == 0x0000C9, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1270' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1271) == 0x0000D0, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1271' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1272) == 0x0000E0, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1272' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1273) == 0x0000E8, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1273' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1274) == 0x0000F0, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1274' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1275) == 0x0000F8, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1275' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1276) == 0x000100, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1276' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1277) == 0x000101, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1277' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1278) == 0x000108, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1278' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1279) == 0x000118, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1279' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1280) == 0x000120, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1280' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1281) == 0x000124, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1281' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1282) == 0x000128, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1282' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1283) == 0x000130, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1283' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1284) == 0x000138, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1284' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1285) == 0x000158, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1285' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1286) == 0x00015C, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1286' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1287) == 0x000188, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1287' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1288) == 0x00018C, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1288' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1289) == 0x00018D, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1289' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1290) == 0x00018E, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1290' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1291) == 0x000190, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1291' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000198, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000218, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct BOW_NPC_AnimBP.BOW_NPC_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0053 (0x0054 - 0x0001)
struct BOW_NPC_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_3;                                  // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_4;                                  // 0x0006(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0007(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x000A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x000B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_11;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_15;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_21;                                 // 0x0035(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_22;                                 // 0x0036(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_23;                                 // 0x0037(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_24;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_25;                                 // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_26;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_28;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_29;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_30;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_31;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on BOW_NPC_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000054, "Wrong size on BOW_NPC_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");
static_assert(offsetof(BOW_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'BOW_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
