#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Audio_SplineClosedLoopFollow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Audio_SplineClosedLoopFollow.BP_Audio_SplineClosedLoopFollow_C
// 0x00A8 (0x03F0 - 0x0348)
class ABP_Audio_SplineClosedLoopFollow_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIntrepidAkComponent*                   IntrepidAK;                                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HiddenInGame;                                      // 0x0369(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FollowPlayerElevation;                             // 0x036A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B[0x5];                                      // 0x036B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          AK_Event_Emitter;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   StateGroup;                                        // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StateInside;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StateOutside;                                      // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxRangeFadeDistance;                              // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInsideSpline;                                    // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DotValue;                                          // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AKEmitterLocation;                                 // 0x03A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimerLazy;                                         // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLazy;                                            // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitialized;                                     // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA[0x6];                                      // 0x03CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SplineCurveLocationClosestToPlayer;                // 0x03D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkRtpc*                                SplineDistanceFade;                                // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Audio_SplineClosedLoopFollow(int32 EntryPoint);
	void GetControlledPawnLocation(class APawn** ControlledPawnReference, struct FVector* ControlledPawnLocation);
	void GetDistanceFromPlayerToClosestSplintPoint(double* DistanceToPlayerFromClosestSpawnPoint);
	void GetInsideSpline(bool* IsInsideSpine_, bool* IsInsideSplineChanged_);
	void GetPlayerControllerCameraRotation(struct FRotator* PlayerControllerCameraRotation);
	class USplineComponent* GetSplineComponent();
	void PostNodeInit();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Update_Emitter_Slowly();
	void UpdateEmitterLocationProxy();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Audio_SplineClosedLoopFollow_C">();
	}
	static class ABP_Audio_SplineClosedLoopFollow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Audio_SplineClosedLoopFollow_C>();
	}
};
static_assert(alignof(ABP_Audio_SplineClosedLoopFollow_C) == 0x000008, "Wrong alignment on ABP_Audio_SplineClosedLoopFollow_C");
static_assert(sizeof(ABP_Audio_SplineClosedLoopFollow_C) == 0x0003F0, "Wrong size on ABP_Audio_SplineClosedLoopFollow_C");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, UberGraphFrame) == 0x000348, "Member 'ABP_Audio_SplineClosedLoopFollow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, IntrepidAK) == 0x000350, "Member 'ABP_Audio_SplineClosedLoopFollow_C::IntrepidAK' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, Spline) == 0x000358, "Member 'ABP_Audio_SplineClosedLoopFollow_C::Spline' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, DefaultSceneRoot) == 0x000360, "Member 'ABP_Audio_SplineClosedLoopFollow_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, Debug) == 0x000368, "Member 'ABP_Audio_SplineClosedLoopFollow_C::Debug' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, HiddenInGame) == 0x000369, "Member 'ABP_Audio_SplineClosedLoopFollow_C::HiddenInGame' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, FollowPlayerElevation) == 0x00036A, "Member 'ABP_Audio_SplineClosedLoopFollow_C::FollowPlayerElevation' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, AK_Event_Emitter) == 0x000370, "Member 'ABP_Audio_SplineClosedLoopFollow_C::AK_Event_Emitter' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, StateGroup) == 0x000378, "Member 'ABP_Audio_SplineClosedLoopFollow_C::StateGroup' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, StateInside) == 0x000380, "Member 'ABP_Audio_SplineClosedLoopFollow_C::StateInside' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, StateOutside) == 0x000388, "Member 'ABP_Audio_SplineClosedLoopFollow_C::StateOutside' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, MaxRangeFadeDistance) == 0x000390, "Member 'ABP_Audio_SplineClosedLoopFollow_C::MaxRangeFadeDistance' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, IsInsideSpline) == 0x000398, "Member 'ABP_Audio_SplineClosedLoopFollow_C::IsInsideSpline' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, DotValue) == 0x0003A0, "Member 'ABP_Audio_SplineClosedLoopFollow_C::DotValue' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, AKEmitterLocation) == 0x0003A8, "Member 'ABP_Audio_SplineClosedLoopFollow_C::AKEmitterLocation' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, TimerLazy) == 0x0003C0, "Member 'ABP_Audio_SplineClosedLoopFollow_C::TimerLazy' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, IsLazy) == 0x0003C8, "Member 'ABP_Audio_SplineClosedLoopFollow_C::IsLazy' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, IsInitialized) == 0x0003C9, "Member 'ABP_Audio_SplineClosedLoopFollow_C::IsInitialized' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, SplineCurveLocationClosestToPlayer) == 0x0003D0, "Member 'ABP_Audio_SplineClosedLoopFollow_C::SplineCurveLocationClosestToPlayer' has a wrong offset!");
static_assert(offsetof(ABP_Audio_SplineClosedLoopFollow_C, SplineDistanceFade) == 0x0003E8, "Member 'ABP_Audio_SplineClosedLoopFollow_C::SplineDistanceFade' has a wrong offset!");

}

