#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioManager

#include "Basic.hpp"

#include "S_EnvironmentSettingsSwitches_structs.hpp"
#include "SStartStopAudioEvents_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EReverbSet_structs.hpp"


namespace SDK::Params
{

// Function BP_AudioManager.BP_AudioManager_C.AddInteriorOverride
// 0x0030 (0x0030 - 0x0000)
struct BP_AudioManager_C_AddInteriorOverride final
{
public:
	struct FSStartStopAudioEvents                 StartStopOverride;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteriorAudioSystem*                   CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateInteriorAudio_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioManager_C_AddInteriorOverride) == 0x000008, "Wrong alignment on BP_AudioManager_C_AddInteriorOverride");
static_assert(sizeof(BP_AudioManager_C_AddInteriorOverride) == 0x000030, "Wrong size on BP_AudioManager_C_AddInteriorOverride");
static_assert(offsetof(BP_AudioManager_C_AddInteriorOverride, StartStopOverride) == 0x000000, "Member 'BP_AudioManager_C_AddInteriorOverride::StartStopOverride' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_AddInteriorOverride, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_AudioManager_C_AddInteriorOverride::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_AddInteriorOverride, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000018, "Member 'BP_AudioManager_C_AddInteriorOverride::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_AddInteriorOverride, CallFunc_UpdateInteriorAudio_ReturnValue) == 0x000020, "Member 'BP_AudioManager_C_AddInteriorOverride::CallFunc_UpdateInteriorAudio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_AddInteriorOverride, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_AudioManager_C_AddInteriorOverride::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_AddInteriorOverride, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AudioManager_C_AddInteriorOverride::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_AddInteriorOverride, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'BP_AudioManager_C_AddInteriorOverride::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AudioManager.BP_AudioManager_C.Apply Override Biome Settings
// 0x0018 (0x0018 - 0x0000)
struct BP_AudioManager_C_Apply_Override_Biome_Settings final
{
public:
	struct FSStartStopAudioEvents                 CallFunc_Map_Find_Value;                           // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioManager_C_Apply_Override_Biome_Settings) == 0x000008, "Wrong alignment on BP_AudioManager_C_Apply_Override_Biome_Settings");
static_assert(sizeof(BP_AudioManager_C_Apply_Override_Biome_Settings) == 0x000018, "Wrong size on BP_AudioManager_C_Apply_Override_Biome_Settings");
static_assert(offsetof(BP_AudioManager_C_Apply_Override_Biome_Settings, CallFunc_Map_Find_Value) == 0x000000, "Member 'BP_AudioManager_C_Apply_Override_Biome_Settings::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Override_Biome_Settings, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'BP_AudioManager_C_Apply_Override_Biome_Settings::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_AudioManager.BP_AudioManager_C.Apply Per Biome Settings
// 0x0198 (0x0198 - 0x0000)
struct BP_AudioManager_C_Apply_Per_Biome_Settings final
{
public:
	EBiomeType                                    MusicBiome;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Max_Biome_Amount;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2; // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3; // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UIntrepidMusicPlayer*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvironmentAudioSubsystem*             CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4; // 0x0084(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5; // 0x0094(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_4;       // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6; // 0x00AC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostOnComponent_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_5;       // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostOnComponent_ReturnValue_1;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_6;       // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7[0x1];                                       // 0x00D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostOnComponent_ReturnValue_2;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_7;       // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostOnComponent_ReturnValue_3;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x1];                                       // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_7; // 0x00FC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_2;                       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_3;                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_4;                       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_5;                       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_6;                       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast_1; // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast_2; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast_3; // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioManager_C_Apply_Per_Biome_Settings) == 0x000008, "Wrong alignment on BP_AudioManager_C_Apply_Per_Biome_Settings");
static_assert(sizeof(BP_AudioManager_C_Apply_Per_Biome_Settings) == 0x000198, "Wrong size on BP_AudioManager_C_Apply_Per_Biome_Settings");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, MusicBiome) == 0x000000, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::MusicBiome' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, Max_Biome_Amount) == 0x000008, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::Max_Biome_Amount' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, Temp_delegate_Variable) == 0x000010, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, Temp_delegate_Variable_1) == 0x000020, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, Temp_delegate_Variable_2) == 0x000030, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, Temp_delegate_Variable_3) == 0x000040, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000050, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000060, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000069, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x00006A, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x00006B, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x00006C, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000070, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000074, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000078, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00007C, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000080, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, Temp_delegate_Variable_4) == 0x000084, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, Temp_delegate_Variable_5) == 0x000094, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Not_PreBool_ReturnValue) == 0x0000A5, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Greater_DoubleDouble_ReturnValue_4) == 0x0000A6, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Greater_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_BooleanAND_ReturnValue) == 0x0000A7, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_IsValid_ReturnValue_2) == 0x0000A8, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_IsValid_ReturnValue_3) == 0x0000A9, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000AA, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_BooleanAND_ReturnValue_1) == 0x0000AB, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, Temp_delegate_Variable_6) == 0x0000AC, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::Temp_delegate_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_PostOnComponent_ReturnValue) == 0x0000BC, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_PostOnComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000C0, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000C1, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Greater_DoubleDouble_ReturnValue_5) == 0x0000C2, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Greater_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_BooleanAND_ReturnValue_2) == 0x0000C3, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_PostOnComponent_ReturnValue_1) == 0x0000C4, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_PostOnComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_IsValid_ReturnValue_4) == 0x0000C8, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_PostAkEvent_ReturnValue) == 0x0000CC, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_IsValid_ReturnValue_5) == 0x0000D0, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000D1, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_BooleanAND_ReturnValue_3) == 0x0000D2, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000D3, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Not_PreBool_ReturnValue_4) == 0x0000D4, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Greater_DoubleDouble_ReturnValue_6) == 0x0000D5, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Greater_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_BooleanAND_ReturnValue_4) == 0x0000D6, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_PostOnComponent_ReturnValue_2) == 0x0000D8, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_PostOnComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_IsValid_ReturnValue_6) == 0x0000DC, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_PostAkEvent_ReturnValue_1) == 0x0000E0, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_IsValid_ReturnValue_7) == 0x0000E4, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Not_PreBool_ReturnValue_5) == 0x0000E5, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_BooleanAND_ReturnValue_5) == 0x0000E6, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x0000E7, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Not_PreBool_ReturnValue_6) == 0x0000E8, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Greater_DoubleDouble_ReturnValue_7) == 0x0000E9, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Greater_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_BooleanAND_ReturnValue_6) == 0x0000EA, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_PostOnComponent_ReturnValue_3) == 0x0000EC, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_PostOnComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_IsValid_ReturnValue_8) == 0x0000F0, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_PostAkEvent_ReturnValue_2) == 0x0000F4, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_IsValid_ReturnValue_9) == 0x0000F8, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Not_PreBool_ReturnValue_7) == 0x0000F9, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_BooleanAND_ReturnValue_7) == 0x0000FA, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, Temp_delegate_Variable_7) == 0x0000FC, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::Temp_delegate_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_PostAkEvent_ReturnValue_3) == 0x00010C, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_IsValid_ReturnValue_10) == 0x000110, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_BooleanAND_ReturnValue_8) == 0x000111, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_SelectFloat_ReturnValue) == 0x000118, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_IsValid_ReturnValue_11) == 0x000120, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_BooleanAND_ReturnValue_9) == 0x000121, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_SelectFloat_ReturnValue_1) == 0x000128, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_FMax_ReturnValue) == 0x000130, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_FMax_ReturnValue_1) == 0x000138, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_FMax_ReturnValue_2) == 0x000140, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000148, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000150, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_FMax_ReturnValue_3) == 0x000158, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_FMax_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_FMax_ReturnValue_4) == 0x000160, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_FMax_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000168, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x000170, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_FMax_ReturnValue_5) == 0x000178, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_FMax_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_FMax_ReturnValue_6) == 0x000180, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_FMax_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast) == 0x000188, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast_1) == 0x00018C, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast_2) == 0x000190, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Per_Biome_Settings, CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast_3) == 0x000194, "Member 'BP_AudioManager_C_Apply_Per_Biome_Settings::CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast_3' has a wrong offset!");

// Function BP_AudioManager.BP_AudioManager_C.Apply Spline Modifiers
// 0x00F0 (0x00F0 - 0x0000)
struct BP_AudioManager_C_Apply_Spline_Modifiers final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2; // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostOnComponent_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3; // 0x006C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue_2;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue_3;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_4;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostOnComponent_ReturnValue_1;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteriorAudioSystem*                   CallFunc_GetWorldSubsystem_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayInteriorAudio_ReturnValue;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOutputBusVolume_BusVolume_ImplicitCast_1; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioManager_C_Apply_Spline_Modifiers) == 0x000008, "Wrong alignment on BP_AudioManager_C_Apply_Spline_Modifiers");
static_assert(sizeof(BP_AudioManager_C_Apply_Spline_Modifiers) == 0x0000F0, "Wrong size on BP_AudioManager_C_Apply_Spline_Modifiers");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, Temp_delegate_Variable) == 0x000000, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, Temp_delegate_Variable_1) == 0x000010, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, Temp_delegate_Variable_2) == 0x000020, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000032, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_Not_PreBool_ReturnValue_1) == 0x000033, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_FMax_ReturnValue) == 0x000038, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_FMax_ReturnValue_1) == 0x000058, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_Not_PreBool_ReturnValue_2) == 0x000060, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_BooleanAND_ReturnValue_1) == 0x000061, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_PostOnComponent_ReturnValue) == 0x000064, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_PostOnComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, Temp_delegate_Variable_3) == 0x00006C, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_PostAkEvent_ReturnValue) == 0x00007C, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000080, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_Not_PreBool_ReturnValue_3) == 0x000081, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_FMax_ReturnValue_2) == 0x000088, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_FMax_ReturnValue_3) == 0x000098, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_FMax_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_BooleanAND_ReturnValue_2) == 0x0000A0, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000A8, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_FMax_ReturnValue_4) == 0x0000B0, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_FMax_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_Not_PreBool_ReturnValue_4) == 0x0000B8, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_BooleanAND_ReturnValue_3) == 0x0000B9, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_PostOnComponent_ReturnValue_1) == 0x0000BC, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_PostOnComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_IsValid_ReturnValue_2) == 0x0000C0, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_PostAkEvent_ReturnValue_1) == 0x0000C4, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_IsValid_ReturnValue_3) == 0x0000C8, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioManager_C_Apply_Spline_Modifiers, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0000D0, "Member 'BP_AudioManager_C_Apply_Spline_Modifiers::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
