#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Audio_SplineInteriorOverride

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SStartStopAudioEvents_structs.hpp"


namespace SDK::Params
{

// Function BP_Audio_SplineInteriorOverride.BP_Audio_SplineInteriorOverride_C.ExecuteUbergraph_BP_Audio_SplineInteriorOverride
// 0x0138 (0x0138 - 0x0000)
struct BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetControlledPawnLocation_ControlledPawnReference; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetControlledPawnLocation_ControlledPawnLocation; // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInsideSpline_IsInsideSpine_;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInsideSpline_IsInsideSplineChanged_;   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindLocationClosestToWorldLocation_ReturnValue; // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetDistanceFromPlayerToClosestSplintPoint_DistanceToPlayerFromClosestSpawnPoint; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIntrepidSkyBase*                       CallFunc_GetIntrepidSkyInstance_IntrepidSky;       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             UniqueObjectNameForCooking_OutputDelegate;         // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_VerraWorld_GlobalSky_C*             K2Node_DynamicCast_AsBP_Verra_World_Global_Sky;    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AIntrepidSkyBase*                       CallFunc_GetIntrepidSkyInstance_IntrepidSky_1;     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_VerraWorld_GlobalSky_C*             K2Node_DynamicCast_AsBP_Verra_World_Global_Sky_1;  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSStartStopAudioEvents                 K2Node_MakeStruct_SStartStopAudioEvents;           // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSStartStopAudioEvents                 K2Node_MakeStruct_SStartStopAudioEvents_1;         // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteriorAudioSystem*                   CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             UniqueObjectNameForCooking_OutputDelegate_1;       // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride) == 0x000008, "Wrong alignment on BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride");
static_assert(sizeof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride) == 0x000138, "Wrong size on BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, EntryPoint) == 0x000000, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_IsServer_ReturnValue) == 0x000008, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_GetControlledPawnLocation_ControlledPawnReference) == 0x000030, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_GetControlledPawnLocation_ControlledPawnReference' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_GetControlledPawnLocation_ControlledPawnLocation) == 0x000038, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_GetControlledPawnLocation_ControlledPawnLocation' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_GetInsideSpline_IsInsideSpine_) == 0x000050, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_GetInsideSpline_IsInsideSpine_' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_GetInsideSpline_IsInsideSplineChanged_) == 0x000051, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_GetInsideSpline_IsInsideSplineChanged_' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_FindLocationClosestToWorldLocation_ReturnValue) == 0x000058, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_FindLocationClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_HasAuthority_ReturnValue) == 0x000070, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_IsServer_ReturnValue_1) == 0x000071, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_GetDistanceFromPlayerToClosestSplintPoint_DistanceToPlayerFromClosestSpawnPoint) == 0x000078, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_GetDistanceFromPlayerToClosestSplintPoint_DistanceToPlayerFromClosestSpawnPoint' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000089, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_GetIntrepidSkyInstance_IntrepidSky) == 0x000098, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_GetIntrepidSkyInstance_IntrepidSky' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, UniqueObjectNameForCooking_OutputDelegate) == 0x0000A0, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::UniqueObjectNameForCooking_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, K2Node_DynamicCast_AsBP_Verra_World_Global_Sky) == 0x0000B0, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::K2Node_DynamicCast_AsBP_Verra_World_Global_Sky' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C0, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_GetIntrepidSkyInstance_IntrepidSky_1) == 0x0000C8, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_GetIntrepidSkyInstance_IntrepidSky_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, K2Node_DynamicCast_AsBP_Verra_World_Global_Sky_1) == 0x0000D0, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::K2Node_DynamicCast_AsBP_Verra_World_Global_Sky_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_IsValid_ReturnValue_2) == 0x0000D9, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_IsValid_ReturnValue_3) == 0x0000DA, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_HasAuthority_ReturnValue_1) == 0x0000DB, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, K2Node_MakeStruct_SStartStopAudioEvents) == 0x0000E0, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::K2Node_MakeStruct_SStartStopAudioEvents' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, K2Node_MakeStruct_SStartStopAudioEvents_1) == 0x0000F0, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::K2Node_MakeStruct_SStartStopAudioEvents_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_IsServer_ReturnValue_2) == 0x000100, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000108, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, UniqueObjectNameForCooking_OutputDelegate_1) == 0x000110, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::UniqueObjectNameForCooking_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000120, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_IsValid_ReturnValue_4) == 0x000128, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_IsValid_ReturnValue_5) == 0x000129, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_BooleanAND_ReturnValue) == 0x00012A, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x00012C, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x000130, "Member 'BP_Audio_SplineInteriorOverride_C_ExecuteUbergraph_BP_Audio_SplineInteriorOverride::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");

// Function BP_Audio_SplineInteriorOverride.BP_Audio_SplineInteriorOverride_C.GetControlledPawnLocation
// 0x0050 (0x0050 - 0x0000)
struct BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation final
{
public:
	class APawn*                                  ControlledPawnReference;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ControlledPawnLocation;                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation) == 0x000008, "Wrong alignment on BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation");
static_assert(sizeof(BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation) == 0x000050, "Wrong size on BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation, ControlledPawnReference) == 0x000000, "Member 'BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation::ControlledPawnReference' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation, ControlledPawnLocation) == 0x000008, "Member 'BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation::ControlledPawnLocation' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation, CallFunc_K2_GetPawn_ReturnValue) == 0x000028, "Member 'BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_Audio_SplineInteriorOverride_C_GetControlledPawnLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Audio_SplineInteriorOverride.BP_Audio_SplineInteriorOverride_C.GetDistanceFromPlayerToClosestSplintPoint
// 0x0058 (0x0058 - 0x0000)
struct BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint final
{
public:
	double                                        DistanceToPlayerFromClosestSpawnPoint;             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint) == 0x000008, "Wrong alignment on BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint");
static_assert(sizeof(BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint) == 0x000058, "Wrong size on BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint, DistanceToPlayerFromClosestSpawnPoint) == 0x000000, "Member 'BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint::DistanceToPlayerFromClosestSpawnPoint' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000038, "Member 'BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint, CallFunc_VSize_ReturnValue) == 0x000050, "Member 'BP_Audio_SplineInteriorOverride_C_GetDistanceFromPlayerToClosestSplintPoint::CallFunc_VSize_ReturnValue' has a wrong offset!");

// Function BP_Audio_SplineInteriorOverride.BP_Audio_SplineInteriorOverride_C.GetInsideSpline
// 0x0088 (0x0088 - 0x0000)
struct BP_Audio_SplineInteriorOverride_C_GetInsideSpline final
{
public:
	bool                                          IsInsideSpine_;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInsideSplineChanged_;                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetControlledPawnLocation_ControlledPawnReference; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetControlledPawnLocation_ControlledPawnLocation; // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetControlledPawnLocation_ControlledPawnReference_1; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetControlledPawnLocation_ControlledPawnLocation_1; // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindRightVectorClosestToWorldLocation_ReturnValue; // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline) == 0x000008, "Wrong alignment on BP_Audio_SplineInteriorOverride_C_GetInsideSpline");
static_assert(sizeof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline) == 0x000088, "Wrong size on BP_Audio_SplineInteriorOverride_C_GetInsideSpline");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline, IsInsideSpine_) == 0x000000, "Member 'BP_Audio_SplineInteriorOverride_C_GetInsideSpline::IsInsideSpine_' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline, IsInsideSplineChanged_) == 0x000001, "Member 'BP_Audio_SplineInteriorOverride_C_GetInsideSpline::IsInsideSplineChanged_' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline, CallFunc_GetControlledPawnLocation_ControlledPawnReference) == 0x000008, "Member 'BP_Audio_SplineInteriorOverride_C_GetInsideSpline::CallFunc_GetControlledPawnLocation_ControlledPawnReference' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline, CallFunc_GetControlledPawnLocation_ControlledPawnLocation) == 0x000010, "Member 'BP_Audio_SplineInteriorOverride_C_GetInsideSpline::CallFunc_GetControlledPawnLocation_ControlledPawnLocation' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline, CallFunc_GetControlledPawnLocation_ControlledPawnReference_1) == 0x000028, "Member 'BP_Audio_SplineInteriorOverride_C_GetInsideSpline::CallFunc_GetControlledPawnLocation_ControlledPawnReference_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline, CallFunc_GetControlledPawnLocation_ControlledPawnLocation_1) == 0x000030, "Member 'BP_Audio_SplineInteriorOverride_C_GetInsideSpline::CallFunc_GetControlledPawnLocation_ControlledPawnLocation_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline, CallFunc_FindRightVectorClosestToWorldLocation_ReturnValue) == 0x000048, "Member 'BP_Audio_SplineInteriorOverride_C_GetInsideSpline::CallFunc_FindRightVectorClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000060, "Member 'BP_Audio_SplineInteriorOverride_C_GetInsideSpline::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline, CallFunc_Dot_VectorVector_ReturnValue) == 0x000078, "Member 'BP_Audio_SplineInteriorOverride_C_GetInsideSpline::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000080, "Member 'BP_Audio_SplineInteriorOverride_C_GetInsideSpline::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetInsideSpline, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000081, "Member 'BP_Audio_SplineInteriorOverride_C_GetInsideSpline::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_Audio_SplineInteriorOverride.BP_Audio_SplineInteriorOverride_C.GetPlayerControllerCameraRotation
// 0x0038 (0x0038 - 0x0000)
struct BP_Audio_SplineInteriorOverride_C_GetPlayerControllerCameraRotation final
{
public:
	struct FRotator                               PlayerControllerCameraRotation;                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Audio_SplineInteriorOverride_C_GetPlayerControllerCameraRotation) == 0x000008, "Wrong alignment on BP_Audio_SplineInteriorOverride_C_GetPlayerControllerCameraRotation");
static_assert(sizeof(BP_Audio_SplineInteriorOverride_C_GetPlayerControllerCameraRotation) == 0x000038, "Wrong size on BP_Audio_SplineInteriorOverride_C_GetPlayerControllerCameraRotation");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetPlayerControllerCameraRotation, PlayerControllerCameraRotation) == 0x000000, "Member 'BP_Audio_SplineInteriorOverride_C_GetPlayerControllerCameraRotation::PlayerControllerCameraRotation' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetPlayerControllerCameraRotation, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BP_Audio_SplineInteriorOverride_C_GetPlayerControllerCameraRotation::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetPlayerControllerCameraRotation, CallFunc_GetCameraRotation_ReturnValue) == 0x000020, "Member 'BP_Audio_SplineInteriorOverride_C_GetPlayerControllerCameraRotation::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");

// Function BP_Audio_SplineInteriorOverride.BP_Audio_SplineInteriorOverride_C.GetSplineComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_Audio_SplineInteriorOverride_C_GetSplineComponent final
{
public:
	class USplineComponent*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_SplineInteriorOverride_C_GetSplineComponent) == 0x000008, "Wrong alignment on BP_Audio_SplineInteriorOverride_C_GetSplineComponent");
static_assert(sizeof(BP_Audio_SplineInteriorOverride_C_GetSplineComponent) == 0x000008, "Wrong size on BP_Audio_SplineInteriorOverride_C_GetSplineComponent");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetSplineComponent, ReturnValue) == 0x000000, "Member 'BP_Audio_SplineInteriorOverride_C_GetSplineComponent::ReturnValue' has a wrong offset!");

// Function BP_Audio_SplineInteriorOverride.BP_Audio_SplineInteriorOverride_C.GetSplineEmitterComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_Audio_SplineInteriorOverride_C_GetSplineEmitterComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_SplineInteriorOverride_C_GetSplineEmitterComponent) == 0x000008, "Wrong alignment on BP_Audio_SplineInteriorOverride_C_GetSplineEmitterComponent");
static_assert(sizeof(BP_Audio_SplineInteriorOverride_C_GetSplineEmitterComponent) == 0x000008, "Wrong size on BP_Audio_SplineInteriorOverride_C_GetSplineEmitterComponent");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_GetSplineEmitterComponent, ReturnValue) == 0x000000, "Member 'BP_Audio_SplineInteriorOverride_C_GetSplineEmitterComponent::ReturnValue' has a wrong offset!");

// Function BP_Audio_SplineInteriorOverride.BP_Audio_SplineInteriorOverride_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Audio_SplineInteriorOverride_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_SplineInteriorOverride_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Audio_SplineInteriorOverride_C_ReceiveTick");
static_assert(sizeof(BP_Audio_SplineInteriorOverride_C_ReceiveTick) == 0x000004, "Wrong size on BP_Audio_SplineInteriorOverride_C_ReceiveTick");
static_assert(offsetof(BP_Audio_SplineInteriorOverride_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Audio_SplineInteriorOverride_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

