#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AncientLeader_LingeringEffect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AncientLeader_LingeringEffect.BP_AncientLeader_LingeringEffect_C.ExecuteUbergraph_BP_AncientLeader_LingeringEffect
// 0x0140 (0x0140 - 0x0000)
struct BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetLowestLineTracedGroundImpact_Result;   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLowestLineTracedGroundImpact_ReturnValue; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0050(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect) == 0x000008, "Wrong alignment on BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect");
static_assert(sizeof(BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect) == 0x000140, "Wrong size on BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect");
static_assert(offsetof(BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect, EntryPoint) == 0x000000, "Member 'BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect, CallFunc_IsServer_ReturnValue) == 0x000005, "Member 'BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect, K2Node_MakeArray_Array) == 0x000020, "Member 'BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect, CallFunc_GetLowestLineTracedGroundImpact_Result) == 0x000030, "Member 'BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect::CallFunc_GetLowestLineTracedGroundImpact_Result' has a wrong offset!");
static_assert(offsetof(BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect, CallFunc_GetLowestLineTracedGroundImpact_ReturnValue) == 0x000048, "Member 'BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect::CallFunc_GetLowestLineTracedGroundImpact_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000050, "Member 'BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000138, "Member 'BP_AncientLeader_LingeringEffect_C_ExecuteUbergraph_BP_AncientLeader_LingeringEffect::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

}

