#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bld_Sign_Tool

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Bld_Sign_Tool.BP_Bld_Sign_Tool_C.UserConstructionScript
// 0x0078 (0x0078 - 0x0000)
struct BP_Bld_Sign_Tool_C_UserConstructionScript final
{
public:
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetDecalMaterial_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bld_Sign_Tool_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Bld_Sign_Tool_C_UserConstructionScript");
static_assert(sizeof(BP_Bld_Sign_Tool_C_UserConstructionScript) == 0x000078, "Wrong size on BP_Bld_Sign_Tool_C_UserConstructionScript");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000000, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_Divide_IntInt_ReturnValue) == 0x000008, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_Percent_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000018, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_GetDecalMaterial_ReturnValue) == 0x000030, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_GetDecalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000040, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_Max_ReturnValue) == 0x00004C, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_Clamp_ReturnValue) == 0x000050, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000061, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000064, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000068, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x00006C, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Bld_Sign_Tool_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000070, "Member 'BP_Bld_Sign_Tool_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");

}

