#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BogBrute_MudSummon_MudPoolPreparation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function BP_BogBrute_MudSummon_MudPoolPreparation.BP_BogBrute_MudSummon_MudPoolPreparation_C.ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation
// 0x0450 (0x0450 - 0x0000)
struct BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLingeringEffectRecord                 CallFunc_GetLingeringEffectRecordById_ReturnValue; // 0x0088(0x03B8)(ConstParm)
	class AAoCAbilityLingeringEffect*             CallFunc_SpawnLingeringZoneAtLocation_ReturnValue; // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation) == 0x000010, "Wrong alignment on BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation");
static_assert(sizeof(BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation) == 0x000450, "Wrong size on BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation");
static_assert(offsetof(BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation, EntryPoint) == 0x000000, "Member 'BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation, CallFunc_HasAuthority_ReturnValue) == 0x000080, "Member 'BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation, CallFunc_GetLingeringEffectRecordById_ReturnValue) == 0x000088, "Member 'BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation::CallFunc_GetLingeringEffectRecordById_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation, CallFunc_SpawnLingeringZoneAtLocation_ReturnValue) == 0x000440, "Member 'BP_BogBrute_MudSummon_MudPoolPreparation_C_ExecuteUbergraph_BP_BogBrute_MudSummon_MudPoolPreparation::CallFunc_SpawnLingeringZoneAtLocation_ReturnValue' has a wrong offset!");

}

