#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BounceCardActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BounceCardActor.BP_BounceCardActor_C.PlanarBounceCard
// 0x0110 (0x0110 - 0x0000)
struct BP_BounceCardActor_C_PlanarBounceCard final
{
public:
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_AddComponent_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CallFunc_AddComponent_ReturnValue_1;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_2;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        CallFunc_AddComponent_ReturnValue_3;               // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BounceCardActor_C_PlanarBounceCard) == 0x000010, "Wrong alignment on BP_BounceCardActor_C_PlanarBounceCard");
static_assert(sizeof(BP_BounceCardActor_C_PlanarBounceCard) == 0x000110, "Wrong size on BP_BounceCardActor_C_PlanarBounceCard");
static_assert(offsetof(BP_BounceCardActor_C_PlanarBounceCard, CallFunc_IsWithEditor_ReturnValue) == 0x000000, "Member 'BP_BounceCardActor_C_PlanarBounceCard::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_PlanarBounceCard, CallFunc_AddComponent_ReturnValue) == 0x000008, "Member 'BP_BounceCardActor_C_PlanarBounceCard::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_PlanarBounceCard, CallFunc_Conv_LinearColorToColor_ReturnValue) == 0x000010, "Member 'BP_BounceCardActor_C_PlanarBounceCard::CallFunc_Conv_LinearColorToColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_PlanarBounceCard, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_BounceCardActor_C_PlanarBounceCard::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_PlanarBounceCard, CallFunc_AddComponent_ReturnValue_1) == 0x000080, "Member 'BP_BounceCardActor_C_PlanarBounceCard::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_PlanarBounceCard, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000088, "Member 'BP_BounceCardActor_C_PlanarBounceCard::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_PlanarBounceCard, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000090, "Member 'BP_BounceCardActor_C_PlanarBounceCard::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_PlanarBounceCard, CallFunc_AddComponent_ReturnValue_2) == 0x000098, "Member 'BP_BounceCardActor_C_PlanarBounceCard::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_PlanarBounceCard, CallFunc_MakeTransform_ReturnValue_1) == 0x0000A0, "Member 'BP_BounceCardActor_C_PlanarBounceCard::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_PlanarBounceCard, CallFunc_AddComponent_ReturnValue_3) == 0x000100, "Member 'BP_BounceCardActor_C_PlanarBounceCard::CallFunc_AddComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_PlanarBounceCard, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000108, "Member 'BP_BounceCardActor_C_PlanarBounceCard::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");

// Function BP_BounceCardActor.BP_BounceCardActor_C.SpericalBounceCard
// 0x0020 (0x0020 - 0x0000)
struct BP_BounceCardActor_C_SpericalBounceCard final
{
public:
	class AActor*                                 NewLocalVar;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BounceCardActor_C_SpericalBounceCard) == 0x000008, "Wrong alignment on BP_BounceCardActor_C_SpericalBounceCard");
static_assert(sizeof(BP_BounceCardActor_C_SpericalBounceCard) == 0x000020, "Wrong size on BP_BounceCardActor_C_SpericalBounceCard");
static_assert(offsetof(BP_BounceCardActor_C_SpericalBounceCard, NewLocalVar) == 0x000000, "Member 'BP_BounceCardActor_C_SpericalBounceCard::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_SpericalBounceCard, CallFunc_IsWithEditor_ReturnValue) == 0x000008, "Member 'BP_BounceCardActor_C_SpericalBounceCard::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_SpericalBounceCard, CallFunc_AddComponent_ReturnValue) == 0x000010, "Member 'BP_BounceCardActor_C_SpericalBounceCard::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BounceCardActor_C_SpericalBounceCard, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'BP_BounceCardActor_C_SpericalBounceCard::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

