#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BiomeManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_BiomeClimate_structs.hpp"
#include "EBiomes_structs.hpp"
#include "STRUCT_GlobalAtmosphereOutput_ExponentialHeightFog_structs.hpp"
#include "STRUCT_GlobalAtmosphereOutput_structs.hpp"
#include "STRUCT_SingularClimateData_structs.hpp"
#include "STRUCT_GlobalOverrideAndBool_structs.hpp"
#include "STRUCT_GlobalAtmosphereOutput_Skylight_structs.hpp"
#include "STRUCT_GlobalAtmosphereOutput_SkyAtmosphere_structs.hpp"
#include "STRUCT_GlobalAtmosphereOutput_Sun_structs.hpp"
#include "STRUCT_GlobalAtmosphereOutput_Moon_structs.hpp"
#include "STRUCT_BiomeSwitch_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function BP_BiomeManager.BP_BiomeManager_C.Adds Random to Todays Climate
// 0x01D0 (0x01D0 - 0x0000)
struct BP_BiomeManager_C_Adds_Random_to_Todays_Climate final
{
public:
	double                                        Degrees_High;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Degrees_Low;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Precipitation_Amount;                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Sunshine_Hours;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Rain_Days;                                         // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Chance_Of_Rain;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Humidity;                                          // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_SingularClimateData            StructOut;                                         // 0x0030(0x0030)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_SingularClimateData            Singular_Biome_Climate;                            // 0x0060(0x0030)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_SingularClimateData            NewLocalVar;                                       // 0x0090(0x0030)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_4;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_2; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_3; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_4; // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast; // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_SetFieldsInStruct_Humidity_18_236CE0E74D8A0EBFA1315C9DCDC32556_ImplicitCast; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_1; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1; // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_SetFieldsInStruct_ChanceOfRain_15_AE3F9A3A4C46C605CC6F63B592EE2600_ImplicitCast; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_2; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_3; // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_2; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_4; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_SetFieldsInStruct_DegreesLow_5_B7EEB5D14AC145EA04E4EBA518410B98_ImplicitCast; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_3; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_4; // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_SetFieldsInStruct_DegreesHigh_4_7F6758CA46FA570E1B9659B2F4991825_ImplicitCast; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_SetFieldsInStruct_Precipitation_7_F8324633470113F78AD6A89BEED4BA28_ImplicitCast; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate) == 0x000008, "Wrong alignment on BP_BiomeManager_C_Adds_Random_to_Todays_Climate");
static_assert(sizeof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate) == 0x0001D0, "Wrong size on BP_BiomeManager_C_Adds_Random_to_Todays_Climate");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, Degrees_High) == 0x000000, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::Degrees_High' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, Degrees_Low) == 0x000008, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::Degrees_Low' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, Precipitation_Amount) == 0x000010, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::Precipitation_Amount' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, Sunshine_Hours) == 0x000018, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::Sunshine_Hours' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, Rain_Days) == 0x00001C, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::Rain_Days' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, Chance_Of_Rain) == 0x000020, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::Chance_Of_Rain' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, Humidity) == 0x000028, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::Humidity' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, StructOut) == 0x000030, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::StructOut' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, Singular_Biome_Climate) == 0x000060, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::Singular_Biome_Climate' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, NewLocalVar) == 0x000090, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000C0, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x0000D8, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_BreakVector_X) == 0x0000E0, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_BreakVector_Y) == 0x0000E8, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_BreakVector_Z) == 0x0000F0, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_FTrunc_ReturnValue) == 0x0000F8, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000100, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_MakeRandomStream_ReturnValue) == 0x000108, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_MakeRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000110, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000118, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000120, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_Subtract_IntInt_ReturnValue) == 0x000128, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_Add_IntInt_ReturnValue) == 0x00012C, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000130, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1) == 0x000138, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x00013C, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000140, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x000148, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000150, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_Subtract_DoubleDouble_ReturnValue_4) == 0x000158, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_Subtract_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_ReturnValue_2) == 0x000160, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000168, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x000170, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_ReturnValue_3) == 0x000178, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_ReturnValue_4) == 0x00017C, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast) == 0x000180, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast) == 0x000184, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, K2Node_SetFieldsInStruct_Humidity_18_236CE0E74D8A0EBFA1315C9DCDC32556_ImplicitCast) == 0x000188, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::K2Node_SetFieldsInStruct_Humidity_18_236CE0E74D8A0EBFA1315C9DCDC32556_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_1) == 0x000190, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1) == 0x000194, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, K2Node_SetFieldsInStruct_ChanceOfRain_15_AE3F9A3A4C46C605CC6F63B592EE2600_ImplicitCast) == 0x000198, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::K2Node_SetFieldsInStruct_ChanceOfRain_15_AE3F9A3A4C46C605CC6F63B592EE2600_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_2) == 0x0001A0, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_3) == 0x0001A4, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_2) == 0x0001A8, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_4) == 0x0001AC, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, K2Node_SetFieldsInStruct_DegreesLow_5_B7EEB5D14AC145EA04E4EBA518410B98_ImplicitCast) == 0x0001B0, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::K2Node_SetFieldsInStruct_DegreesLow_5_B7EEB5D14AC145EA04E4EBA518410B98_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_3) == 0x0001B8, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_4) == 0x0001BC, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, K2Node_SetFieldsInStruct_DegreesHigh_4_7F6758CA46FA570E1B9659B2F4991825_ImplicitCast) == 0x0001C0, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::K2Node_SetFieldsInStruct_DegreesHigh_4_7F6758CA46FA570E1B9659B2F4991825_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Adds_Random_to_Todays_Climate, K2Node_SetFieldsInStruct_Precipitation_7_F8324633470113F78AD6A89BEED4BA28_ImplicitCast) == 0x0001C8, "Member 'BP_BiomeManager_C_Adds_Random_to_Todays_Climate::K2Node_SetFieldsInStruct_Precipitation_7_F8324633470113F78AD6A89BEED4BA28_ImplicitCast' has a wrong offset!");

// Function BP_BiomeManager.BP_BiomeManager_C.Biome to Row Name
// 0x0020 (0x0020 - 0x0000)
struct BP_BiomeManager_C_Biome_to_Row_Name final
{
public:
	EBiomes                                       Biome_In;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Row_Name_0;                                        // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBiomes                                       Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BiomeManager_C_Biome_to_Row_Name) == 0x000004, "Wrong alignment on BP_BiomeManager_C_Biome_to_Row_Name");
static_assert(sizeof(BP_BiomeManager_C_Biome_to_Row_Name) == 0x000020, "Wrong size on BP_BiomeManager_C_Biome_to_Row_Name");
static_assert(offsetof(BP_BiomeManager_C_Biome_to_Row_Name, Biome_In) == 0x000000, "Member 'BP_BiomeManager_C_Biome_to_Row_Name::Biome_In' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Biome_to_Row_Name, Row_Name_0) == 0x000004, "Member 'BP_BiomeManager_C_Biome_to_Row_Name::Row_Name_0' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Biome_to_Row_Name, Temp_byte_Variable) == 0x00000C, "Member 'BP_BiomeManager_C_Biome_to_Row_Name::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Biome_to_Row_Name, Temp_name_Variable) == 0x000010, "Member 'BP_BiomeManager_C_Biome_to_Row_Name::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Biome_to_Row_Name, K2Node_Select_Default) == 0x000018, "Member 'BP_BiomeManager_C_Biome_to_Row_Name::K2Node_Select_Default' has a wrong offset!");

// Function BP_BiomeManager.BP_BiomeManager_C.Blend Biome Data
// 0x21A0 (0x21A0 - 0x0000)
struct BP_BiomeManager_C_Blend_Biome_Data final
{
public:
	struct FVector2D                              Location;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time_Input;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalAtmosphereOutput         CURRENT_Global_Struct_0;                           // 0x0018(0x02E0)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Normalized_Year_In;                                // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FSTRUCT_SingularClimateData> Biome_Climate_Map;                         // 0x0300(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSTRUCT_SingularClimateData            Current_Biome_Climate;                             // 0x0350(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalAtmosphereOutput         Global;                                            // 0x0380(0x02E0)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBiomes                                       Current_Biome_0;                                   // 0x0660(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_SingularClimateData            Current_Biome_Climate_Out;                         // 0x0668(0x0030)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_SingularClimateData            LV_Climate;                                        // 0x0698(0x0030)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FSTRUCT_SingularClimateData> NewLocalVar_0;                             // 0x06C8(0x0050)(Edit, BlueprintVisible)
	TMap<double, bool>                            LV_Blend_Biome_Bool;                               // 0x0718(0x0050)(Edit, BlueprintVisible)
	int32                                         LV_Month;                                          // 0x0768(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Determine_Month_ReturnValue;              // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBiomeType                                    CallFunc_Get_Biomes_From_Location_Red_Category_Name; // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Get_Biomes_From_Location_Red_Category_Amount; // 0x0771(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBiomeType                                    CallFunc_Get_Biomes_From_Location_Green_Category_Name; // 0x0772(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Get_Biomes_From_Location_Green_Category_Amount; // 0x0773(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBiomeType                                    CallFunc_Get_Biomes_From_Location_Blue_Category_Name; // 0x0774(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Get_Biomes_From_Location_Blue_Category_Amount; // 0x0775(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBiomeType                                    CallFunc_Get_Biomes_From_Location_Alpha_Category_Name; // 0x0776(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Get_Biomes_From_Location_Alpha_Category_Amount; // 0x0777(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_ByteToDouble_ReturnValue;            // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_ByteToDouble_ReturnValue_1;          // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_ByteToDouble_ReturnValue_2;          // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_ByteToDouble_ReturnValue_3;          // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x07B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x07BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_3;    // 0x07BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x07BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x07BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BE[0x2];                                      // 0x07BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_SingularClimateData            CallFunc_Get_Climate_For_Biome_OVERRIDE_Singular_Day_Climate; // 0x07C0(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_SingularClimateData            CallFunc_Get_Climate_For_Biome_OVERRIDE_Singular_Day_Climate_1; // 0x07F0(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_2;              // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_3;              // 0x0821(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_822[0x6];                                      // 0x0822(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_SingularClimateData            CallFunc_Get_Climate_For_Biome_OVERRIDE_Singular_Day_Climate_2; // 0x0828(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_SingularClimateData            CallFunc_Get_Climate_For_Biome_OVERRIDE_Singular_Day_Climate_3; // 0x0858(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_4;              // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_5;              // 0x0889(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_6;              // 0x088A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_7;              // 0x088B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_8;              // 0x088C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBiomes                                       CallFunc_Get_Current_Biome_Current_Biome;          // 0x088D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88E[0x2];                                      // 0x088E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Get_Current_Biome_Amount;                 // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalAtmosphereOutput         CallFunc_Get_Override_For_Biome_Override_Global_Struct; // 0x0898(0x02E0)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalOverrideAndBool          CallFunc_Get_Override_For_Biome_OVERRIDE_Global_Struct_BOOL; // 0x0B78(0x0047)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_9;              // 0x0BBF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_10;             // 0x0BC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC1[0x7];                                      // 0x0BC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_GlobalAtmosphereOutput         CallFunc_Get_Override_For_Biome_Override_Global_Struct_1; // 0x0BC8(0x02E0)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalOverrideAndBool          CallFunc_Get_Override_For_Biome_OVERRIDE_Global_Struct_BOOL_1; // 0x0EA8(0x0047)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EEF[0x1];                                      // 0x0EEF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_GlobalAtmosphereOutput         CallFunc_Get_Override_For_Biome_Override_Global_Struct_2; // 0x0EF0(0x02E0)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalOverrideAndBool          CallFunc_Get_Override_For_Biome_OVERRIDE_Global_Struct_BOOL_2; // 0x11D0(0x0047)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_11;             // 0x1217(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_12;             // 0x1218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1219[0x7];                                     // 0x1219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_GlobalAtmosphereOutput         CallFunc_Get_Override_For_Biome_Override_Global_Struct_3; // 0x1220(0x02E0)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalOverrideAndBool          CallFunc_Get_Override_For_Biome_OVERRIDE_Global_Struct_BOOL_3; // 0x1500(0x0047)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_13;             // 0x1547(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_14;             // 0x1548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_15;             // 0x1549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154A[0x6];                                     // 0x154A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_GlobalAtmosphereOutput         CallFunc_LERP_Structs__F__Current_Global_Struct;   // 0x1550(0x02E0)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_SingularClimateData            CallFunc_LERP_Climate_Data_Current_Biome_Climate_Out; // 0x1830(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalAtmosphereOutput         CallFunc_LERP_Structs__F__Current_Global_Struct_1; // 0x1860(0x02E0)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalAtmosphereOutput         CallFunc_LERP_Structs__F__Current_Global_Struct_2; // 0x1B40(0x02E0)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_SingularClimateData            CallFunc_LERP_Climate_Data_Current_Biome_Climate_Out_1; // 0x1E20(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalAtmosphereOutput         CallFunc_LERP_Structs__F__Current_Global_Struct_3; // 0x1E50(0x02E0)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_SingularClimateData            CallFunc_LERP_Climate_Data_Current_Biome_Climate_Out_2; // 0x2130(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_SingularClimateData            CallFunc_LERP_Climate_Data_Current_Biome_Climate_Out_3; // 0x2160(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LERP_Structs__F__Alpha_ImplicitCast;      // 0x2190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LERP_Structs__F__Alpha_ImplicitCast_1;    // 0x2194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LERP_Structs__F__Alpha_ImplicitCast_2;    // 0x2198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LERP_Structs__F__Alpha_ImplicitCast_3;    // 0x219C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BiomeManager_C_Blend_Biome_Data) == 0x000008, "Wrong alignment on BP_BiomeManager_C_Blend_Biome_Data");
static_assert(sizeof(BP_BiomeManager_C_Blend_Biome_Data) == 0x0021A0, "Wrong size on BP_BiomeManager_C_Blend_Biome_Data");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, Location) == 0x000000, "Member 'BP_BiomeManager_C_Blend_Biome_Data::Location' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, Time_Input) == 0x000010, "Member 'BP_BiomeManager_C_Blend_Biome_Data::Time_Input' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CURRENT_Global_Struct_0) == 0x000018, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CURRENT_Global_Struct_0' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, Normalized_Year_In) == 0x0002F8, "Member 'BP_BiomeManager_C_Blend_Biome_Data::Normalized_Year_In' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, Biome_Climate_Map) == 0x000300, "Member 'BP_BiomeManager_C_Blend_Biome_Data::Biome_Climate_Map' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, Current_Biome_Climate) == 0x000350, "Member 'BP_BiomeManager_C_Blend_Biome_Data::Current_Biome_Climate' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, Global) == 0x000380, "Member 'BP_BiomeManager_C_Blend_Biome_Data::Global' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, Current_Biome_0) == 0x000660, "Member 'BP_BiomeManager_C_Blend_Biome_Data::Current_Biome_0' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, Current_Biome_Climate_Out) == 0x000668, "Member 'BP_BiomeManager_C_Blend_Biome_Data::Current_Biome_Climate_Out' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, LV_Climate) == 0x000698, "Member 'BP_BiomeManager_C_Blend_Biome_Data::LV_Climate' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, NewLocalVar_0) == 0x0006C8, "Member 'BP_BiomeManager_C_Blend_Biome_Data::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, LV_Blend_Biome_Bool) == 0x000718, "Member 'BP_BiomeManager_C_Blend_Biome_Data::LV_Blend_Biome_Bool' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, LV_Month) == 0x000768, "Member 'BP_BiomeManager_C_Blend_Biome_Data::LV_Month' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Determine_Month_ReturnValue) == 0x00076C, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Determine_Month_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Biomes_From_Location_Red_Category_Name) == 0x000770, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Biomes_From_Location_Red_Category_Name' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Biomes_From_Location_Red_Category_Amount) == 0x000771, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Biomes_From_Location_Red_Category_Amount' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Biomes_From_Location_Green_Category_Name) == 0x000772, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Biomes_From_Location_Green_Category_Name' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Biomes_From_Location_Green_Category_Amount) == 0x000773, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Biomes_From_Location_Green_Category_Amount' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Biomes_From_Location_Blue_Category_Name) == 0x000774, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Biomes_From_Location_Blue_Category_Name' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Biomes_From_Location_Blue_Category_Amount) == 0x000775, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Biomes_From_Location_Blue_Category_Amount' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Biomes_From_Location_Alpha_Category_Name) == 0x000776, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Biomes_From_Location_Alpha_Category_Name' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Biomes_From_Location_Alpha_Category_Amount) == 0x000777, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Biomes_From_Location_Alpha_Category_Amount' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Conv_ByteToDouble_ReturnValue) == 0x000778, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Conv_ByteToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Conv_ByteToDouble_ReturnValue_1) == 0x000780, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Conv_ByteToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000788, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000790, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Conv_ByteToDouble_ReturnValue_2) == 0x000798, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Conv_ByteToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Conv_ByteToDouble_ReturnValue_3) == 0x0007A0, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Conv_ByteToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0007A8, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0007B0, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x0007B8, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x0007B9, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x0007BA, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_EqualEqual_DoubleDouble_ReturnValue_3) == 0x0007BB, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_EqualEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue) == 0x0007BC, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_1) == 0x0007BD, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Climate_For_Biome_OVERRIDE_Singular_Day_Climate) == 0x0007C0, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Climate_For_Biome_OVERRIDE_Singular_Day_Climate' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Climate_For_Biome_OVERRIDE_Singular_Day_Climate_1) == 0x0007F0, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Climate_For_Biome_OVERRIDE_Singular_Day_Climate_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_2) == 0x000820, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_3) == 0x000821, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Climate_For_Biome_OVERRIDE_Singular_Day_Climate_2) == 0x000828, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Climate_For_Biome_OVERRIDE_Singular_Day_Climate_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Climate_For_Biome_OVERRIDE_Singular_Day_Climate_3) == 0x000858, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Climate_For_Biome_OVERRIDE_Singular_Day_Climate_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_4) == 0x000888, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_5) == 0x000889, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_6) == 0x00088A, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_7) == 0x00088B, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_8) == 0x00088C, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Current_Biome_Current_Biome) == 0x00088D, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Current_Biome_Current_Biome' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Current_Biome_Amount) == 0x000890, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Current_Biome_Amount' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Override_For_Biome_Override_Global_Struct) == 0x000898, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Override_For_Biome_Override_Global_Struct' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Override_For_Biome_OVERRIDE_Global_Struct_BOOL) == 0x000B78, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Override_For_Biome_OVERRIDE_Global_Struct_BOOL' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_9) == 0x000BBF, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_10) == 0x000BC0, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Override_For_Biome_Override_Global_Struct_1) == 0x000BC8, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Override_For_Biome_Override_Global_Struct_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Override_For_Biome_OVERRIDE_Global_Struct_BOOL_1) == 0x000EA8, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Override_For_Biome_OVERRIDE_Global_Struct_BOOL_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Override_For_Biome_Override_Global_Struct_2) == 0x000EF0, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Override_For_Biome_Override_Global_Struct_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Override_For_Biome_OVERRIDE_Global_Struct_BOOL_2) == 0x0011D0, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Override_For_Biome_OVERRIDE_Global_Struct_BOOL_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_11) == 0x001217, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_12) == 0x001218, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Override_For_Biome_Override_Global_Struct_3) == 0x001220, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Override_For_Biome_Override_Global_Struct_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_Get_Override_For_Biome_OVERRIDE_Global_Struct_BOOL_3) == 0x001500, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_Get_Override_For_Biome_OVERRIDE_Global_Struct_BOOL_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_13) == 0x001547, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_14) == 0x001548, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_GetValidValue_ReturnValue_15) == 0x001549, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_GetValidValue_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_LERP_Structs__F__Current_Global_Struct) == 0x001550, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_LERP_Structs__F__Current_Global_Struct' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_LERP_Climate_Data_Current_Biome_Climate_Out) == 0x001830, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_LERP_Climate_Data_Current_Biome_Climate_Out' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_LERP_Structs__F__Current_Global_Struct_1) == 0x001860, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_LERP_Structs__F__Current_Global_Struct_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_LERP_Structs__F__Current_Global_Struct_2) == 0x001B40, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_LERP_Structs__F__Current_Global_Struct_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_LERP_Climate_Data_Current_Biome_Climate_Out_1) == 0x001E20, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_LERP_Climate_Data_Current_Biome_Climate_Out_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_LERP_Structs__F__Current_Global_Struct_3) == 0x001E50, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_LERP_Structs__F__Current_Global_Struct_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_LERP_Climate_Data_Current_Biome_Climate_Out_2) == 0x002130, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_LERP_Climate_Data_Current_Biome_Climate_Out_2' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_LERP_Climate_Data_Current_Biome_Climate_Out_3) == 0x002160, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_LERP_Climate_Data_Current_Biome_Climate_Out_3' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_LERP_Structs__F__Alpha_ImplicitCast) == 0x002190, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_LERP_Structs__F__Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_LERP_Structs__F__Alpha_ImplicitCast_1) == 0x002194, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_LERP_Structs__F__Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_BiomeManager_C_Blend_Biome_Data, CallFunc_LERP_Structs__F__Alpha_ImplicitCast_2) == 0x002198, "Member 'BP_BiomeManager_C_Blend_Biome_Data::CallFunc_LERP_Structs__F__Alpha_ImplicitCast_2' has a wrong offset!");
