#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bld_Sign_Tool

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Bld_Sign_Tool.BP_Bld_Sign_Tool_C
// 0x0088 (0x03D0 - 0x0348)
class ABP_Bld_Sign_Tool_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Hu_Kae_Sign010;                                 // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal1;                                            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    Static_Mesh;                                       // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Sign_Selector;                                     // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Material_Selector;                                 // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Paint_Color_Tint;                                  // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Atlas_V;                                           // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Atlas_U;                                           // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Decal_Color_Tint;                                  // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Atlas_Grid_Amount;                                 // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Atlas_Texture;                                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Roughness_Adjust;                                  // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Metallic;                                          // 0x03B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Icon_Select;                                       // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Grid_Mult_Num;                                     // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Parameter_Name;                                    // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Bld_Sign_Tool_C">();
	}
	static class ABP_Bld_Sign_Tool_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Bld_Sign_Tool_C>();
	}
};
static_assert(alignof(ABP_Bld_Sign_Tool_C) == 0x000008, "Wrong alignment on ABP_Bld_Sign_Tool_C");
static_assert(sizeof(ABP_Bld_Sign_Tool_C) == 0x0003D0, "Wrong size on ABP_Bld_Sign_Tool_C");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, SM_Hu_Kae_Sign010) == 0x000348, "Member 'ABP_Bld_Sign_Tool_C::SM_Hu_Kae_Sign010' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Decal1) == 0x000350, "Member 'ABP_Bld_Sign_Tool_C::Decal1' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Decal) == 0x000358, "Member 'ABP_Bld_Sign_Tool_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Static_Mesh) == 0x000360, "Member 'ABP_Bld_Sign_Tool_C::Static_Mesh' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Sign_Selector) == 0x000370, "Member 'ABP_Bld_Sign_Tool_C::Sign_Selector' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Material_Selector) == 0x000374, "Member 'ABP_Bld_Sign_Tool_C::Material_Selector' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Paint_Color_Tint) == 0x000378, "Member 'ABP_Bld_Sign_Tool_C::Paint_Color_Tint' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Atlas_V) == 0x000388, "Member 'ABP_Bld_Sign_Tool_C::Atlas_V' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Atlas_U) == 0x00038C, "Member 'ABP_Bld_Sign_Tool_C::Atlas_U' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Decal_Color_Tint) == 0x000390, "Member 'ABP_Bld_Sign_Tool_C::Decal_Color_Tint' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Atlas_Grid_Amount) == 0x0003A0, "Member 'ABP_Bld_Sign_Tool_C::Atlas_Grid_Amount' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Atlas_Texture) == 0x0003A8, "Member 'ABP_Bld_Sign_Tool_C::Atlas_Texture' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Roughness_Adjust) == 0x0003B0, "Member 'ABP_Bld_Sign_Tool_C::Roughness_Adjust' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Metallic) == 0x0003B4, "Member 'ABP_Bld_Sign_Tool_C::Metallic' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Icon_Select) == 0x0003B8, "Member 'ABP_Bld_Sign_Tool_C::Icon_Select' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Grid_Mult_Num) == 0x0003C0, "Member 'ABP_Bld_Sign_Tool_C::Grid_Mult_Num' has a wrong offset!");
static_assert(offsetof(ABP_Bld_Sign_Tool_C, Parameter_Name) == 0x0003C8, "Member 'ABP_Bld_Sign_Tool_C::Parameter_Name' has a wrong offset!");

}

