#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CyclopsShamanTotemTree_RootFissures

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CyclopsShamanTotemTree_RootFissures.BP_CyclopsShamanTotemTree_RootFissures_C.ExecuteUbergraph_BP_CyclopsShamanTotemTree_RootFissures
// 0x0004 (0x0004 - 0x0000)
struct BP_CyclopsShamanTotemTree_RootFissures_C_ExecuteUbergraph_BP_CyclopsShamanTotemTree_RootFissures final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CyclopsShamanTotemTree_RootFissures_C_ExecuteUbergraph_BP_CyclopsShamanTotemTree_RootFissures) == 0x000004, "Wrong alignment on BP_CyclopsShamanTotemTree_RootFissures_C_ExecuteUbergraph_BP_CyclopsShamanTotemTree_RootFissures");
static_assert(sizeof(BP_CyclopsShamanTotemTree_RootFissures_C_ExecuteUbergraph_BP_CyclopsShamanTotemTree_RootFissures) == 0x000004, "Wrong size on BP_CyclopsShamanTotemTree_RootFissures_C_ExecuteUbergraph_BP_CyclopsShamanTotemTree_RootFissures");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_ExecuteUbergraph_BP_CyclopsShamanTotemTree_RootFissures, EntryPoint) == 0x000000, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_ExecuteUbergraph_BP_CyclopsShamanTotemTree_RootFissures::EntryPoint' has a wrong offset!");

// Function BP_CyclopsShamanTotemTree_RootFissures.BP_CyclopsShamanTotemTree_RootFissures_C.SpawnFadeOutRoots
// 0x0130 (0x0130 - 0x0000)
struct BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnClient_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots) == 0x000010, "Wrong alignment on BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots");
static_assert(sizeof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots) == 0x000130, "Wrong size on BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, Temp_int_Variable) == 0x000000, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_Multiply_IntInt_ReturnValue) == 0x000004, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_BreakTransform_Rotation) == 0x0000B8, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_BreakTransform_Scale) == 0x0000D0, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_IsRunningOnClient_ReturnValue) == 0x0000E8, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_IsRunningOnClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_ComposeRotators_ReturnValue) == 0x0000F0, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000120, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000128, "Member 'BP_CyclopsShamanTotemTree_RootFissures_C_SpawnFadeOutRoots::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

}

