#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CC_Hud

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CC_Hud.BP_CC_Hud_C.ExecuteUbergraph_BP_CC_Hud
// 0x0008 (0x0008 - 0x0000)
struct BP_CC_Hud_C_ExecuteUbergraph_BP_CC_Hud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CC_Hud_C_ExecuteUbergraph_BP_CC_Hud) == 0x000004, "Wrong alignment on BP_CC_Hud_C_ExecuteUbergraph_BP_CC_Hud");
static_assert(sizeof(BP_CC_Hud_C_ExecuteUbergraph_BP_CC_Hud) == 0x000008, "Wrong size on BP_CC_Hud_C_ExecuteUbergraph_BP_CC_Hud");
static_assert(offsetof(BP_CC_Hud_C_ExecuteUbergraph_BP_CC_Hud, EntryPoint) == 0x000000, "Member 'BP_CC_Hud_C_ExecuteUbergraph_BP_CC_Hud::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CC_Hud_C_ExecuteUbergraph_BP_CC_Hud, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_CC_Hud_C_ExecuteUbergraph_BP_CC_Hud::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_CC_Hud.BP_CC_Hud_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CC_Hud_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CC_Hud_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CC_Hud_C_ReceiveTick");
static_assert(sizeof(BP_CC_Hud_C_ReceiveTick) == 0x000004, "Wrong size on BP_CC_Hud_C_ReceiveTick");
static_assert(offsetof(BP_CC_Hud_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CC_Hud_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

