#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Constellation_Timeline

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Constellation_Timeline.BP_Constellation_Timeline_C
// 0x0028 (0x0370 - 0x0348)
class ABP_Constellation_Timeline_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Constellation_Time_Constellation_1_lines_Value_1046F0F3436F00863A79B5BAD7D36C9A; // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Constellation_Time_Constellation_1_Value_1046F0F3436F00863A79B5BAD7D36C9A; // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Constellation_Time__Direction_1046F0F3436F00863A79B5BAD7D36C9A; // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Constellation_Time;                                // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Toggle_On();
	void ExecuteUbergraph_BP_Constellation_Timeline(int32 EntryPoint);
	void Constellation_Time__UpdateFunc();
	void Constellation_Time__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Constellation_Timeline_C">();
	}
	static class ABP_Constellation_Timeline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Constellation_Timeline_C>();
	}
};
static_assert(alignof(ABP_Constellation_Timeline_C) == 0x000008, "Wrong alignment on ABP_Constellation_Timeline_C");
static_assert(sizeof(ABP_Constellation_Timeline_C) == 0x000370, "Wrong size on ABP_Constellation_Timeline_C");
static_assert(offsetof(ABP_Constellation_Timeline_C, UberGraphFrame) == 0x000348, "Member 'ABP_Constellation_Timeline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Constellation_Timeline_C, DefaultSceneRoot) == 0x000350, "Member 'ABP_Constellation_Timeline_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Constellation_Timeline_C, Constellation_Time_Constellation_1_lines_Value_1046F0F3436F00863A79B5BAD7D36C9A) == 0x000358, "Member 'ABP_Constellation_Timeline_C::Constellation_Time_Constellation_1_lines_Value_1046F0F3436F00863A79B5BAD7D36C9A' has a wrong offset!");
static_assert(offsetof(ABP_Constellation_Timeline_C, Constellation_Time_Constellation_1_Value_1046F0F3436F00863A79B5BAD7D36C9A) == 0x00035C, "Member 'ABP_Constellation_Timeline_C::Constellation_Time_Constellation_1_Value_1046F0F3436F00863A79B5BAD7D36C9A' has a wrong offset!");
static_assert(offsetof(ABP_Constellation_Timeline_C, Constellation_Time__Direction_1046F0F3436F00863A79B5BAD7D36C9A) == 0x000360, "Member 'ABP_Constellation_Timeline_C::Constellation_Time__Direction_1046F0F3436F00863A79B5BAD7D36C9A' has a wrong offset!");
static_assert(offsetof(ABP_Constellation_Timeline_C, Constellation_Time) == 0x000368, "Member 'ABP_Constellation_Timeline_C::Constellation_Time' has a wrong offset!");

}

