#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FakeLight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FakeLight.BP_FakeLight_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct BP_FakeLight_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColor_SetTemperature_InTemperature_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FakeLight_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_FakeLight_C_UserConstructionScript");
static_assert(sizeof(BP_FakeLight_C_UserConstructionScript) == 0x000038, "Wrong size on BP_FakeLight_C_UserConstructionScript");
static_assert(offsetof(BP_FakeLight_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000000, "Member 'BP_FakeLight_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FakeLight_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x000018, "Member 'BP_FakeLight_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FakeLight_C_UserConstructionScript, CallFunc_LinearColor_SetTemperature_InTemperature_ImplicitCast) == 0x000030, "Member 'BP_FakeLight_C_UserConstructionScript::CallFunc_LinearColor_SetTemperature_InTemperature_ImplicitCast' has a wrong offset!");

}

