#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrassForceCapture

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GrassForceCapture.BP_GrassForceCapture_C.ExecuteUbergraph_BP_GrassForceCapture
// 0x0570 (0x0570 - 0x0000)
struct BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0048(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraParameterCollectionInstance*    CallFunc_GetNiagaraParameterCollection_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_3;        // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       CallFunc_Array_Get_Item;                           // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0290(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue_1;                   // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorTrackingSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerCharacter*>               CallFunc_GetPlayersInRadiusUsingOctree_Players;    // 0x0318(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetPlayersInRadiusUsingOctree_PlayersFound; // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CaravelBase_C*                      K2Node_DynamicCast_AsBP_Caravel_Base;              // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0400(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0428(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_2;   // 0x0440(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character;               // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMounted_ReturnValue;                    // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A[0x6];                                      // 0x045A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_4;        // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0488(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_3;   // 0x0500(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPlayersInRadiusUsingOctree_Radius_ImplicitCast; // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Search_Radius_ImplicitCast;     // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_B_ImplicitCast;                      // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Search_Radius_ImplicitCast_1;   // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_2;     // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture) == 0x000010, "Wrong alignment on BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture");
static_assert(sizeof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture) == 0x000570, "Wrong size on BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, EntryPoint) == 0x000000, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_GetPlayerPawn_ReturnValue) == 0x000028, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000048, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000130, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_IsValid_ReturnValue) == 0x000131, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000138, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_GetNiagaraParameterCollection_ReturnValue) == 0x000150, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_GetNiagaraParameterCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_IsActive_ReturnValue) == 0x000158, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, Temp_int_Loop_Counter_Variable) == 0x00015C, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Subtract_IntInt_ReturnValue) == 0x000160, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000164, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000168, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000180, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000188, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_MakeVector_ReturnValue) == 0x0001A0, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Add_VectorVector_ReturnValue) == 0x0001B8, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Conv_DoubleToVector_ReturnValue_3) == 0x0001D0, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Conv_DoubleToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0001E8, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Array_Get_Item) == 0x0001F8, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Array_Length_ReturnValue) == 0x000200, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000208, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000220, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_X) == 0x000228, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_Y) == 0x000230, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_Z) == 0x000238, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Max_ReturnValue) == 0x000240, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Array_Length_ReturnValue_1) == 0x000244, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000248, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_X_1) == 0x000250, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_Y_1) == 0x000258, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_Z_1) == 0x000260, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000268, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000270, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000278, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000280, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000288, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_MakeVector4_ReturnValue) == 0x000290, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0002B0, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0002B8, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_HasAuthority_ReturnValue) == 0x0002C0, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_IsActive_ReturnValue_1) == 0x0002C1, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_IsActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002C8, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_X_2) == 0x0002E0, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_Y_2) == 0x0002E8, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_Z_2) == 0x0002F0, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_MakeVector2D_ReturnValue) == 0x0002F8, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000308, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Array_Length_ReturnValue_2) == 0x000310, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_GetPlayersInRadiusUsingOctree_Players) == 0x000318, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_GetPlayersInRadiusUsingOctree_Players' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_GetPlayersInRadiusUsingOctree_PlayersFound) == 0x000328, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_GetPlayersInRadiusUsingOctree_PlayersFound' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Greater_IntInt_ReturnValue) == 0x000329, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_FMin_ReturnValue) == 0x000330, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_X_3) == 0x000338, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_Y_3) == 0x000340, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_Z_3) == 0x000348, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000350, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_MakeVector_ReturnValue_1) == 0x000368, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000380, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000388, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, K2Node_DynamicCast_AsBP_Caravel_Base) == 0x000390, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::K2Node_DynamicCast_AsBP_Caravel_Base' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, K2Node_DynamicCast_bSuccess) == 0x000398, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_MakeVector_ReturnValue_2) == 0x0003A0, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_GetActorForwardVector_ReturnValue) == 0x0003B8, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0003D0, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0003E8, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000400, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000410, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000428, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Conv_VectorToLinearColor_ReturnValue_2) == 0x000440, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Conv_VectorToLinearColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, K2Node_DynamicCast_AsBase_Character) == 0x000450, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, K2Node_DynamicCast_bSuccess_1) == 0x000458, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_IsMounted_ReturnValue) == 0x000459, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_IsMounted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Multiply_VectorVector_ReturnValue_4) == 0x000460, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Multiply_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_IsServer_ReturnValue) == 0x000478, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Divide_DoubleDouble_ReturnValue_4) == 0x000480, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Divide_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_MakeVector_ReturnValue_3) == 0x000488, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0004A0, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_X_4) == 0x0004B8, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_Y_4) == 0x0004C0, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_BreakVector_Z_4) == 0x0004C8, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_MakeVector_ReturnValue_4) == 0x0004D0, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0004E8, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Conv_VectorToLinearColor_ReturnValue_3) == 0x000500, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Conv_VectorToLinearColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000510, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000518, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x000520, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_GetPlayersInRadiusUsingOctree_Radius_ImplicitCast) == 0x000528, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_GetPlayersInRadiusUsingOctree_Radius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000530, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, K2Node_VariableSet_Search_Radius_ImplicitCast) == 0x000538, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::K2Node_VariableSet_Search_Radius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000540, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_FMin_B_ImplicitCast) == 0x000548, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_FMin_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, K2Node_VariableSet_Search_Radius_ImplicitCast_1) == 0x000550, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::K2Node_VariableSet_Search_Radius_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000558, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture, CallFunc_Divide_DoubleDouble_A_ImplicitCast_2) == 0x000560, "Member 'BP_GrassForceCapture_C_ExecuteUbergraph_BP_GrassForceCapture::CallFunc_Divide_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function BP_GrassForceCapture.BP_GrassForceCapture_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_GrassForceCapture_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrassForceCapture_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_GrassForceCapture_C_ReceiveTick");
static_assert(sizeof(BP_GrassForceCapture_C_ReceiveTick) == 0x000004, "Wrong size on BP_GrassForceCapture_C_ReceiveTick");
static_assert(offsetof(BP_GrassForceCapture_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_GrassForceCapture_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_GrassForceCapture.BP_GrassForceCapture_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct BP_GrassForceCapture_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrassForceCapture_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_GrassForceCapture_C_UserConstructionScript");
static_assert(sizeof(BP_GrassForceCapture_C_UserConstructionScript) == 0x000004, "Wrong size on BP_GrassForceCapture_C_UserConstructionScript");
static_assert(offsetof(BP_GrassForceCapture_C_UserConstructionScript, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000000, "Member 'BP_GrassForceCapture_C_UserConstructionScript::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");

}

