#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrassForceCapture

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GrassForceCapture.BP_GrassForceCapture_C
// 0x0080 (0x03C8 - 0x0348)
class ABP_GrassForceCapture_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_PawnWaterEffector;                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_PawnGrassEffector;                              // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Current_Position;                                  // 0x0368(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Previous_Position;                                 // 0x0380(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Grass_Force_Capture_Area;                          // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Search_Radius;                                     // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerCharacter*>               Nearby_Actors;                                     // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         Max_Num_Tracked_Actors;                            // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector4>                       OutVec4Array;                                      // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_GrassForceCapture(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GrassForceCapture_C">();
	}
	static class ABP_GrassForceCapture_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GrassForceCapture_C>();
	}
};
static_assert(alignof(ABP_GrassForceCapture_C) == 0x000008, "Wrong alignment on ABP_GrassForceCapture_C");
static_assert(sizeof(ABP_GrassForceCapture_C) == 0x0003C8, "Wrong size on ABP_GrassForceCapture_C");
static_assert(offsetof(ABP_GrassForceCapture_C, UberGraphFrame) == 0x000348, "Member 'ABP_GrassForceCapture_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GrassForceCapture_C, NS_PawnWaterEffector) == 0x000350, "Member 'ABP_GrassForceCapture_C::NS_PawnWaterEffector' has a wrong offset!");
static_assert(offsetof(ABP_GrassForceCapture_C, NS_PawnGrassEffector) == 0x000358, "Member 'ABP_GrassForceCapture_C::NS_PawnGrassEffector' has a wrong offset!");
static_assert(offsetof(ABP_GrassForceCapture_C, DefaultSceneRoot) == 0x000360, "Member 'ABP_GrassForceCapture_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GrassForceCapture_C, Current_Position) == 0x000368, "Member 'ABP_GrassForceCapture_C::Current_Position' has a wrong offset!");
static_assert(offsetof(ABP_GrassForceCapture_C, Previous_Position) == 0x000380, "Member 'ABP_GrassForceCapture_C::Previous_Position' has a wrong offset!");
static_assert(offsetof(ABP_GrassForceCapture_C, Grass_Force_Capture_Area) == 0x000398, "Member 'ABP_GrassForceCapture_C::Grass_Force_Capture_Area' has a wrong offset!");
static_assert(offsetof(ABP_GrassForceCapture_C, Search_Radius) == 0x00039C, "Member 'ABP_GrassForceCapture_C::Search_Radius' has a wrong offset!");
static_assert(offsetof(ABP_GrassForceCapture_C, Nearby_Actors) == 0x0003A0, "Member 'ABP_GrassForceCapture_C::Nearby_Actors' has a wrong offset!");
static_assert(offsetof(ABP_GrassForceCapture_C, Max_Num_Tracked_Actors) == 0x0003B0, "Member 'ABP_GrassForceCapture_C::Max_Num_Tracked_Actors' has a wrong offset!");
static_assert(offsetof(ABP_GrassForceCapture_C, OutVec4Array) == 0x0003B8, "Member 'ABP_GrassForceCapture_C::OutVec4Array' has a wrong offset!");

}

