#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GroundPound_Smash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GroundPound_Smash.BP_GroundPound_Smash_C.GetActor
// 0x0010 (0x0010 - 0x0000)
struct BP_GroundPound_Smash_C_GetActor final
{
public:
	class UObject*                                MeleeBandit;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GroundPound_Smash_C_GetActor) == 0x000008, "Wrong alignment on BP_GroundPound_Smash_C_GetActor");
static_assert(sizeof(BP_GroundPound_Smash_C_GetActor) == 0x000010, "Wrong size on BP_GroundPound_Smash_C_GetActor");
static_assert(offsetof(BP_GroundPound_Smash_C_GetActor, MeleeBandit) == 0x000000, "Member 'BP_GroundPound_Smash_C_GetActor::MeleeBandit' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_GetActor, Player) == 0x000008, "Member 'BP_GroundPound_Smash_C_GetActor::Player' has a wrong offset!");

// Function BP_GroundPound_Smash.BP_GroundPound_Smash_C.Received_Notify
// 0x0170 (0x0170 - 0x0000)
struct BP_GroundPound_Smash_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GroundPound_Smash_C_Received_Notify) == 0x000008, "Wrong alignment on BP_GroundPound_Smash_C_Received_Notify");
static_assert(sizeof(BP_GroundPound_Smash_C_Received_Notify) == 0x000170, "Wrong size on BP_GroundPound_Smash_C_Received_Notify");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, MeshComp) == 0x000000, "Member 'BP_GroundPound_Smash_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, Animation) == 0x000008, "Member 'BP_GroundPound_Smash_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, EventReference) == 0x000010, "Member 'BP_GroundPound_Smash_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, ReturnValue) == 0x000040, "Member 'BP_GroundPound_Smash_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000050, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_GetActorForwardVector_ReturnValue) == 0x000068, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_BreakRotator_Roll) == 0x000080, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_BreakRotator_Pitch) == 0x000084, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_BreakRotator_Yaw) == 0x000088, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000090, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_BreakVector_X) == 0x0000B0, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_BreakVector_Y) == 0x0000B8, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_BreakVector_Z) == 0x0000C0, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_GetSocketLocation_ReturnValue) == 0x0000D0, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_MakeRotator_ReturnValue) == 0x0000E8, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_BreakVector_X_1) == 0x000100, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_BreakVector_Y_1) == 0x000108, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_BreakVector_Z_1) == 0x000110, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000118, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000120, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000128, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_MakeVector_ReturnValue) == 0x000130, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000148, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000150, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000158, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000160, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000168, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GroundPound_Smash_C_Received_Notify, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x00016C, "Member 'BP_GroundPound_Smash_C_Received_Notify::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

}

