#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HuKae_SoS_Roof_Pieces

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_HuKae_SoS_Roof_Pieces.BP_HuKae_SoS_Roof_Pieces_C.ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces
// 0x0B08 (0x0B08 - 0x0000)
struct BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_DeltaTime_1;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_DeltaTime;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0070(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_1;     // 0x0178(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_2;     // 0x0280(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_3;     // 0x0388(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_8;      // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_5;                // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_4;     // 0x04A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_5;     // 0x0590(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_9;      // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_6;                // 0x0680(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_6;     // 0x0698(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78C[0x4];                                      // 0x078C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue_1;                     // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_10;     // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_11;     // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_7;                // 0x07C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x07D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x07F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x08D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_8;                // 0x09C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x09D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_RotateGears_DeltaTime_ImplicitCast;       // 0x0AC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateSaw_DeltaTime_ImplicitCast;         // 0x0AC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0AD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0AD4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_1;          // 0x0AD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_2;          // 0x0ADC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_3;          // 0x0AE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_4;          // 0x0AE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_5;          // 0x0AE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AEC[0x4];                                      // 0x0AEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_DegSin_A_ImplicitCast;                    // 0x0AF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0AF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_6;          // 0x0B00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_7;          // 0x0B04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces) == 0x000008, "Wrong alignment on BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces");
static_assert(sizeof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces) == 0x000B08, "Wrong size on BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, EntryPoint) == 0x000000, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, K2Node_CustomEvent_DeltaTime_1) == 0x000008, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::K2Node_CustomEvent_DeltaTime_1' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, K2Node_CustomEvent_DeltaTime) == 0x000010, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::K2Node_CustomEvent_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000028, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_BreakVector_X) == 0x000030, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_BreakVector_Y) == 0x000038, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_BreakVector_Z) == 0x000040, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000048, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_ReturnValue) == 0x000050, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000068, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000070, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_ReturnValue_1) == 0x000158, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000170, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_K2_AddLocalRotation_SweepHitResult_1) == 0x000178, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_K2_AddLocalRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_ReturnValue_2) == 0x000260, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000278, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_K2_AddLocalRotation_SweepHitResult_2) == 0x000280, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_K2_AddLocalRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_ReturnValue_3) == 0x000368, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x000380, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_K2_AddLocalRotation_SweepHitResult_3) == 0x000388, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_K2_AddLocalRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Multiply_DoubleDouble_ReturnValue_8) == 0x000470, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Multiply_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_ReturnValue_4) == 0x000478, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_ReturnValue_5) == 0x000490, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_K2_AddLocalRotation_SweepHitResult_4) == 0x0004A8, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_K2_AddLocalRotation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_K2_AddLocalRotation_SweepHitResult_5) == 0x000590, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_K2_AddLocalRotation_SweepHitResult_5' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Multiply_DoubleDouble_ReturnValue_9) == 0x000678, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Multiply_DoubleDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_ReturnValue_6) == 0x000680, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_K2_AddLocalRotation_SweepHitResult_6) == 0x000698, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_K2_AddLocalRotation_SweepHitResult_6' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_BreakRotator_Roll) == 0x000780, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_BreakRotator_Pitch) == 0x000784, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_BreakRotator_Yaw) == 0x000788, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000790, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_DegSin_ReturnValue) == 0x000798, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_DegSin_ReturnValue_1) == 0x0007A0, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_DegSin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Multiply_DoubleDouble_ReturnValue_10) == 0x0007A8, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Multiply_DoubleDouble_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Multiply_DoubleDouble_ReturnValue_11) == 0x0007B0, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Multiply_DoubleDouble_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0007B8, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_ReturnValue_7) == 0x0007C0, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeVector_ReturnValue) == 0x0007D8, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0007F0, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0008D8, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_ReturnValue_8) == 0x0009C0, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0009D8, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_RotateGears_DeltaTime_ImplicitCast) == 0x000AC0, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_RotateGears_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_UpdateSaw_DeltaTime_ImplicitCast) == 0x000AC8, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_UpdateSaw_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000AD0, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000AD4, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_Roll_ImplicitCast_1) == 0x000AD8, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_Roll_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_Roll_ImplicitCast_2) == 0x000ADC, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_Roll_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_Roll_ImplicitCast_3) == 0x000AE0, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_Roll_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_Roll_ImplicitCast_4) == 0x000AE4, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_Roll_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_Roll_ImplicitCast_5) == 0x000AE8, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_Roll_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_DegSin_A_ImplicitCast) == 0x000AF0, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_DegSin_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000AF8, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_Roll_ImplicitCast_6) == 0x000B00, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_Roll_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces, CallFunc_MakeRotator_Roll_ImplicitCast_7) == 0x000B04, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ExecuteUbergraph_BP_HuKae_SoS_Roof_Pieces::CallFunc_MakeRotator_Roll_ImplicitCast_7' has a wrong offset!");

// Function BP_HuKae_SoS_Roof_Pieces.BP_HuKae_SoS_Roof_Pieces_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_HuKae_SoS_Roof_Pieces_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HuKae_SoS_Roof_Pieces_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_HuKae_SoS_Roof_Pieces_C_ReceiveTick");
static_assert(sizeof(BP_HuKae_SoS_Roof_Pieces_C_ReceiveTick) == 0x000004, "Wrong size on BP_HuKae_SoS_Roof_Pieces_C_ReceiveTick");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_HuKae_SoS_Roof_Pieces_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_HuKae_SoS_Roof_Pieces.BP_HuKae_SoS_Roof_Pieces_C.RotateGears
// 0x0008 (0x0008 - 0x0000)
struct BP_HuKae_SoS_Roof_Pieces_C_RotateGears final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HuKae_SoS_Roof_Pieces_C_RotateGears) == 0x000008, "Wrong alignment on BP_HuKae_SoS_Roof_Pieces_C_RotateGears");
static_assert(sizeof(BP_HuKae_SoS_Roof_Pieces_C_RotateGears) == 0x000008, "Wrong size on BP_HuKae_SoS_Roof_Pieces_C_RotateGears");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_RotateGears, DeltaTime) == 0x000000, "Member 'BP_HuKae_SoS_Roof_Pieces_C_RotateGears::DeltaTime' has a wrong offset!");

// Function BP_HuKae_SoS_Roof_Pieces.BP_HuKae_SoS_Roof_Pieces_C.UpdateSaw
// 0x0008 (0x0008 - 0x0000)
struct BP_HuKae_SoS_Roof_Pieces_C_UpdateSaw final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HuKae_SoS_Roof_Pieces_C_UpdateSaw) == 0x000008, "Wrong alignment on BP_HuKae_SoS_Roof_Pieces_C_UpdateSaw");
static_assert(sizeof(BP_HuKae_SoS_Roof_Pieces_C_UpdateSaw) == 0x000008, "Wrong size on BP_HuKae_SoS_Roof_Pieces_C_UpdateSaw");
static_assert(offsetof(BP_HuKae_SoS_Roof_Pieces_C_UpdateSaw, DeltaTime) == 0x000000, "Member 'BP_HuKae_SoS_Roof_Pieces_C_UpdateSaw::DeltaTime' has a wrong offset!");

}

