#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteriorVolume

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function BP_InteriorVolume.BP_InteriorVolume_C.Brush Begin Overlap
// 0x0108 (0x0108 - 0x0000)
struct BP_InteriorVolume_C_Brush_Begin_Overlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_InteriorVolume_C_Brush_Begin_Overlap) == 0x000008, "Wrong alignment on BP_InteriorVolume_C_Brush_Begin_Overlap");
static_assert(sizeof(BP_InteriorVolume_C_Brush_Begin_Overlap) == 0x000108, "Wrong size on BP_InteriorVolume_C_Brush_Begin_Overlap");
static_assert(offsetof(BP_InteriorVolume_C_Brush_Begin_Overlap, OverlappedComponent) == 0x000000, "Member 'BP_InteriorVolume_C_Brush_Begin_Overlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_Brush_Begin_Overlap, OtherActor) == 0x000008, "Member 'BP_InteriorVolume_C_Brush_Begin_Overlap::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_Brush_Begin_Overlap, OtherComp) == 0x000010, "Member 'BP_InteriorVolume_C_Brush_Begin_Overlap::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_Brush_Begin_Overlap, OtherBodyIndex) == 0x000018, "Member 'BP_InteriorVolume_C_Brush_Begin_Overlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_Brush_Begin_Overlap, bFromSweep) == 0x00001C, "Member 'BP_InteriorVolume_C_Brush_Begin_Overlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_Brush_Begin_Overlap, SweepResult) == 0x000020, "Member 'BP_InteriorVolume_C_Brush_Begin_Overlap::SweepResult' has a wrong offset!");

// Function BP_InteriorVolume.BP_InteriorVolume_C.Brush End Overlap
// 0x0020 (0x0020 - 0x0000)
struct BP_InteriorVolume_C_Brush_End_Overlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorVolume_C_Brush_End_Overlap) == 0x000008, "Wrong alignment on BP_InteriorVolume_C_Brush_End_Overlap");
static_assert(sizeof(BP_InteriorVolume_C_Brush_End_Overlap) == 0x000020, "Wrong size on BP_InteriorVolume_C_Brush_End_Overlap");
static_assert(offsetof(BP_InteriorVolume_C_Brush_End_Overlap, OverlappedComponent) == 0x000000, "Member 'BP_InteriorVolume_C_Brush_End_Overlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_Brush_End_Overlap, OtherActor) == 0x000008, "Member 'BP_InteriorVolume_C_Brush_End_Overlap::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_Brush_End_Overlap, OtherComp) == 0x000010, "Member 'BP_InteriorVolume_C_Brush_End_Overlap::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_Brush_End_Overlap, OtherBodyIndex) == 0x000018, "Member 'BP_InteriorVolume_C_Brush_End_Overlap::OtherBodyIndex' has a wrong offset!");

// Function BP_InteriorVolume.BP_InteriorVolume_C.Catch Initial Overlaps
// 0x0008 (0x0008 - 0x0000)
struct BP_InteriorVolume_C_Catch_Initial_Overlaps final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorVolume_C_Catch_Initial_Overlaps) == 0x000008, "Wrong alignment on BP_InteriorVolume_C_Catch_Initial_Overlaps");
static_assert(sizeof(BP_InteriorVolume_C_Catch_Initial_Overlaps) == 0x000008, "Wrong size on BP_InteriorVolume_C_Catch_Initial_Overlaps");
static_assert(offsetof(BP_InteriorVolume_C_Catch_Initial_Overlaps, Component) == 0x000000, "Member 'BP_InteriorVolume_C_Catch_Initial_Overlaps::Component' has a wrong offset!");

// Function BP_InteriorVolume.BP_InteriorVolume_C.ExecuteUbergraph_BP_InteriorVolume
// 0x05B0 (0x05B0 - 0x0000)
struct BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AIntrepidSkyBase*                       CallFunc_GetIntrepidSkyInstance_IntrepidSky;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIntrepidSkyBase*                       CallFunc_GetIntrepidSkyInstance_IntrepidSky_1;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_VerraWorld_GlobalSky_C*             K2Node_DynamicCast_AsBP_Verra_World_Global_Sky;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VerraWorld_GlobalSky_C*             K2Node_DynamicCast_AsBP_Verra_World_Global_Sky_1;  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AudioManager_C*                     K2Node_DynamicCast_AsBP_Audio_Manager;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AudioManager_C*                     K2Node_DynamicCast_AsBP_Audio_Manager_1;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AIntrepidSkyBase*                       CallFunc_GetIntrepidSkyInstance_IntrepidSky_2;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_VerraWorld_GlobalSky_C*             K2Node_DynamicCast_AsBP_Verra_World_Global_Sky_2;  // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AudioManager_C*                     K2Node_DynamicCast_AsBP_Audio_Manager_2;           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIntrepidMusicPlayer*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIntrepidMusicPlayer*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent_1;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp_1;                    // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_1;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0120(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayer_Local_Player;               // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayer_Local_Player_1;             // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_3;                   // 0x0227(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0230(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          CallFunc_Array_Get_Item;                           // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26B[0x1];                                      // 0x026B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x026C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          CallFunc_Array_Get_Item_1;                         // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          CallFunc_Array_Get_Item_2;                         // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x02B0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_CustomEvent_Component;                      // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x03A0(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x03BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnClient_ReturnValue;            // 0x03BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCalloutQueueInfo                      K2Node_MakeStruct_CalloutQueueInfo;                // 0x03E0(0x0138)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAoCPlayerController*                   K2Node_DynamicCast_AsAo_CPlayer_Controller;        // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0538(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D[0x3];                                      // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_C*                          K2Node_DynamicCast_AsPlayer_Pawn;                  // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0559(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A[0x6];                                      // 0x055A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59A[0x2];                                      // 0x059A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PPV_Blend_Blend_Weight_ImplicitCast;      // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume) == 0x000008, "Wrong alignment on BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume");
static_assert(sizeof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume) == 0x0005B0, "Wrong size on BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, EntryPoint) == 0x000000, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_GetIntrepidSkyInstance_IntrepidSky) == 0x000040, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_GetIntrepidSkyInstance_IntrepidSky' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_GetIntrepidSkyInstance_IntrepidSky_1) == 0x000048, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_GetIntrepidSkyInstance_IntrepidSky_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_DynamicCast_AsBP_Verra_World_Global_Sky) == 0x000050, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_DynamicCast_AsBP_Verra_World_Global_Sky' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_DynamicCast_AsBP_Verra_World_Global_Sky_1) == 0x000060, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_DynamicCast_AsBP_Verra_World_Global_Sky_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_DynamicCast_AsBP_Audio_Manager) == 0x000070, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_DynamicCast_AsBP_Audio_Manager' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_DynamicCast_AsBP_Audio_Manager_1) == 0x000080, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_DynamicCast_AsBP_Audio_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_1) == 0x000089, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_2) == 0x00008A, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, Temp_int_Array_Index_Variable_1) == 0x00008C, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_BooleanAND_ReturnValue) == 0x000090, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_GetIntrepidSkyInstance_IntrepidSky_2) == 0x000098, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_GetIntrepidSkyInstance_IntrepidSky_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_DynamicCast_AsBP_Verra_World_Global_Sky_2) == 0x0000A0, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_DynamicCast_AsBP_Verra_World_Global_Sky_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_DynamicCast_bSuccess_4) == 0x0000A8, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_3) == 0x0000A9, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_4) == 0x0000AA, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_DynamicCast_AsBP_Audio_Manager_2) == 0x0000B0, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_DynamicCast_AsBP_Audio_Manager_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_DynamicCast_bSuccess_5) == 0x0000B8, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_BooleanAND_ReturnValue_1) == 0x0000B9, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000C0, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, Temp_int_Array_Index_Variable_2) == 0x0000C8, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_5) == 0x0000CC, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, Temp_int_Loop_Counter_Variable_1) == 0x0000D0, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_6) == 0x0000D4, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D8, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, Temp_int_Loop_Counter_Variable_2) == 0x0000DC, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000E0, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000E8, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_7) == 0x0000F0, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsServer_ReturnValue) == 0x0000F1, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_8) == 0x0000F2, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_HasAuthority_ReturnValue) == 0x0000F3, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsServer_ReturnValue_1) == 0x0000F4, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_HasAuthority_ReturnValue_1) == 0x0000F5, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_Event_DeltaSeconds) == 0x0000F8, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CustomEvent_OverlappedComponent_1) == 0x000100, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CustomEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CustomEvent_OtherActor_1) == 0x000108, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CustomEvent_OtherComp_1) == 0x000110, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CustomEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CustomEvent_OtherBodyIndex_1) == 0x000118, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CustomEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CustomEvent_bFromSweep) == 0x00011C, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CustomEvent_SweepResult) == 0x000120, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CustomEvent_OverlappedComponent) == 0x000208, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CustomEvent_OtherActor) == 0x000210, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CustomEvent_OtherComp) == 0x000218, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CustomEvent_OtherBodyIndex) == 0x000220, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsLocalPlayer_Local_Player) == 0x000224, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsLocalPlayer_Local_Player' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsLocalPlayer_Local_Player_1) == 0x000225, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsLocalPlayer_Local_Player_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsServer_ReturnValue_2) == 0x000226, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsServer_ReturnValue_3) == 0x000227, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Not_PreBool_ReturnValue) == 0x000228, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Not_PreBool_ReturnValue_1) == 0x000229, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_BooleanAND_ReturnValue_2) == 0x00022A, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_BooleanAND_ReturnValue_3) == 0x00022B, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Not_PreBool_ReturnValue_2) == 0x00022C, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CreateDelegate_OutputDelegate_1) == 0x000230, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_9) == 0x000240, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_Event_EndPlayReason) == 0x000241, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_10) == 0x000242, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_11) == 0x000243, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Array_Get_Item) == 0x000248, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_FClamp_ReturnValue) == 0x000250, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Array_Length_ReturnValue) == 0x000258, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, Temp_int_Array_Index_Variable_3) == 0x00025C, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000260, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_12) == 0x000268, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000269, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_13) == 0x00026A, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CreateDelegate_OutputDelegate_2) == 0x00026C, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Array_Get_Item_1) == 0x000280, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Array_Length_ReturnValue_1) == 0x000288, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Less_IntInt_ReturnValue) == 0x00028C, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Array_Get_Item_2) == 0x000290, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Subtract_IntInt_ReturnValue) == 0x000298, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00029C, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Less_IntInt_ReturnValue_1) == 0x00029D, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Array_Length_ReturnValue_2) == 0x0002A0, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002A4, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Add_IntInt_ReturnValue_3) == 0x0002A8, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, Temp_struct_Variable) == 0x0002B0, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_CustomEvent_Component) == 0x000398, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_CustomEvent_Component' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_GetOverlappingActors_OverlappingActors) == 0x0003A0, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Array_Get_Item_3) == 0x0003B0, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Array_Length_ReturnValue_3) == 0x0003B8, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Less_IntInt_ReturnValue_3) == 0x0003BC, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsValid_ReturnValue_14) == 0x0003BD, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Not_PreBool_ReturnValue_3) == 0x0003BE, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_IsRunningOnClient_ReturnValue) == 0x0003BF, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_IsRunningOnClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_BooleanAND_ReturnValue_4) == 0x0003C0, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_Conv_TextToString_ReturnValue) == 0x0003C8, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_BooleanAND_ReturnValue_5) == 0x0003D8, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, K2Node_MakeStruct_CalloutQueueInfo) == 0x0003E0, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::K2Node_MakeStruct_CalloutQueueInfo' has a wrong offset!");
static_assert(offsetof(BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume, CallFunc_GetPlayerController_ReturnValue) == 0x000518, "Member 'BP_InteriorVolume_C_ExecuteUbergraph_BP_InteriorVolume::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
