#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IntrepidSky_EnvModify_Outdoors

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function BP_IntrepidSky_EnvModify_Outdoors.BP_IntrepidSky_EnvModify_Outdoors_C.UserConstructionScript
// 0x0580 (0x0580 - 0x0000)
struct BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     UniqueObjectNameForCooking_WeightedBlendable;      // 0x0050(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     UniqueObjectNameForCooking_WeightedBlendable_1;    // 0x0068(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNameHashIndex_ReturnValue;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_11;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array_1;                          // 0x00E8(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x0120(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue_1;               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProceduralMeshComponent*               CallFunc_AddComponent_ReturnValue;                 // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_3;             // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array_2;                          // 0x01B8(0x0010)(ConstParm, ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_3;                          // 0x01C8(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_1;                            // 0x01D8(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      Temp_struct_Variable_2;                            // 0x0200(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        K2Node_MakeArray_Array_4;                          // 0x0280(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRightVectorAtDistanceAlongSpline_ReturnValue; // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue_1;            // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      Temp_struct_Variable_3;                            // 0x02F0(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_GetSplineLength_ReturnValue_2;            // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      Temp_struct_Variable_4;                            // 0x0308(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      Temp_struct_Variable_5;                            // 0x0320(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_1;            // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      Temp_struct_Variable_6;                            // 0x0348(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector>                        CallFunc_CalculateTangentsForMesh_Normals;         // 0x0358(0x0010)(ReferenceParm)
	TArray<struct FProcMeshTangent>               CallFunc_CalculateTangentsForMesh_Tangents;        // 0x0368(0x0010)(ReferenceParm)
	TArray<struct FVector>                        CallFunc_CalculateTangentsForMesh_Normals_1;       // 0x0378(0x0010)(ReferenceParm)
	TArray<struct FProcMeshTangent>               CallFunc_CalculateTangentsForMesh_Tangents_1;      // 0x0388(0x0010)(ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_7;                            // 0x0398(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_8;                            // 0x03A8(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_9;                            // 0x03B8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      Temp_struct_Variable_10;                           // 0x03F8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_4;             // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_5;             // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_6;             // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_7;             // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array_5;                          // 0x0418(0x0010)(ConstParm, ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_6;                          // 0x0428(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_3;                         // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0488(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x04A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x04C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array_7;                          // 0x04D8(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVectorAtDistanceAlongSpline_ReturnValue_1; // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue_1;        // 0x0508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue_3;            // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRightVectorAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRightVectorAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast_1;       // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript");
static_assert(sizeof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript) == 0x000580, "Wrong size on BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x000014, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_3) == 0x000018, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_4) == 0x000020, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_5) == 0x000028, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_6) == 0x00002C, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_7) == 0x000030, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_8) == 0x000034, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_9) == 0x00003C, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_int_Array_Index_Variable_2) == 0x000040, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetGameState_ReturnValue) == 0x000048, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, UniqueObjectNameForCooking_WeightedBlendable) == 0x000050, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::UniqueObjectNameForCooking_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, UniqueObjectNameForCooking_WeightedBlendable_1) == 0x000068, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::UniqueObjectNameForCooking_WeightedBlendable_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue) == 0x00007C, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_2) == 0x000080, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000084, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_10) == 0x000088, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000090, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_bool_Variable_1) == 0x000098, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_1) == 0x000099, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetNameHashIndex_ReturnValue) == 0x00009C, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetNameHashIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_IsWithEditor_ReturnValue) == 0x0000A0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_3) == 0x0000A4, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x0000A8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_11) == 0x0000B8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x0000C8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, K2Node_MakeArray_Array_1) == 0x0000E8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_int_Array_Index_Variable_3) == 0x0000F8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetSplineLength_ReturnValue) == 0x0000FC, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000100, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetActorScale3D_ReturnValue) == 0x000108, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_struct_Variable) == 0x000120, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_IsWithEditor_ReturnValue_1) == 0x000180, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_IsWithEditor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000188, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000190, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000198, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x0001A0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_1) == 0x0001A4, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Percent_IntInt_ReturnValue) == 0x0001A8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Percent_IntInt_ReturnValue_1) == 0x0001AC, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Percent_IntInt_ReturnValue_2) == 0x0001B0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Percent_IntInt_ReturnValue_3) == 0x0001B4, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Percent_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, K2Node_MakeArray_Array_2) == 0x0001B8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, K2Node_MakeArray_Array_3) == 0x0001C8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_struct_Variable_1) == 0x0001D8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x0001E8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_struct_Variable_2) == 0x000200, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000210, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000228, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000240, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000248, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000260, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_2) == 0x000278, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, K2Node_MakeArray_Array_4) == 0x000280, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_1) == 0x000290, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetRightVectorAtDistanceAlongSpline_ReturnValue) == 0x000298, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetRightVectorAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Divide_VectorVector_ReturnValue) == 0x0002B0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x0002C8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x0002E0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetSplineLength_ReturnValue_1) == 0x0002E4, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetSplineLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_1) == 0x0002E8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0002EC, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_struct_Variable_3) == 0x0002F0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetSplineLength_ReturnValue_2) == 0x000300, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetSplineLength_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_struct_Variable_4) == 0x000308, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000318, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_struct_Variable_5) == 0x000320, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetActorScale3D_ReturnValue_1) == 0x000330, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetActorScale3D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_struct_Variable_6) == 0x000348, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_CalculateTangentsForMesh_Normals) == 0x000358, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_CalculateTangentsForMesh_Normals' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_CalculateTangentsForMesh_Tangents) == 0x000368, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_CalculateTangentsForMesh_Tangents' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_CalculateTangentsForMesh_Normals_1) == 0x000378, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_CalculateTangentsForMesh_Normals_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_CalculateTangentsForMesh_Tangents_1) == 0x000388, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_CalculateTangentsForMesh_Tangents_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_struct_Variable_7) == 0x000398, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_struct_Variable_8) == 0x0003A8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_struct_Variable_9) == 0x0003B8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_3) == 0x0003C8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0003D0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_2) == 0x0003D8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0003E0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0003E8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_4) == 0x0003F0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, Temp_struct_Variable_10) == 0x0003F8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Percent_IntInt_ReturnValue_4) == 0x000408, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Percent_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Percent_IntInt_ReturnValue_5) == 0x00040C, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Percent_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Percent_IntInt_ReturnValue_6) == 0x000410, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Percent_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Percent_IntInt_ReturnValue_7) == 0x000414, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Percent_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, K2Node_MakeArray_Array_5) == 0x000418, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, K2Node_MakeArray_Array_6) == 0x000428, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Get_Item_2) == 0x000438, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000450, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Get_Item_3) == 0x000468, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_5) == 0x000480, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000488, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_3) == 0x0004A0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0004A8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0004C0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, K2Node_MakeArray_Array_7) == 0x0004D8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0004E8, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetRightVectorAtDistanceAlongSpline_ReturnValue_1) == 0x0004F0, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetRightVectorAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Divide_VectorVector_ReturnValue_1) == 0x000508, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Divide_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x000520, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_2) == 0x000538, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetSplineLength_ReturnValue_3) == 0x00053C, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetSplineLength_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_3) == 0x000540, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000544, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000548, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetRightVectorAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000550, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetRightVectorAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000554, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000558, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000560, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetRightVectorAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x000568, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetRightVectorAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x00056C, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript, CallFunc_Less_DoubleDouble_B_ImplicitCast_1) == 0x000570, "Member 'BP_IntrepidSky_EnvModify_Outdoors_C_UserConstructionScript::CallFunc_Less_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");

// Function BP_IntrepidSky_EnvModify_Outdoors.BP_IntrepidSky_EnvModify_Outdoors_C.Update Blending Editor Time
// 0x0030 (0x0030 - 0x0000)
struct BP_IntrepidSky_EnvModify_Outdoors_C_Update_Blending_Editor_Time final
{
public:
	struct FVector                                CallFunc_GetEditorCameraPosition_CameraLocation;   // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
