#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LingeringEffect_UnstableFlamePatch

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LingeringEffect_UnstableFlamePatch.BP_LingeringEffect_UnstableFlamePatch_C.BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_LingeringEffect_UnstableFlamePatch.BP_LingeringEffect_UnstableFlamePatch_C.BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_LingeringEffect_UnstableFlamePatch.BP_LingeringEffect_UnstableFlamePatch_C.ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch
// 0x0190 (0x0190 - 0x0000)
struct BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFlameElemental_TheUntendedFlame_C*     K2Node_DynamicCast_AsFlame_Elemental_the_Untended_Flame; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             UniqueObjectNameForCooking_OutputDelegate;         // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnClient_ReturnValue;            // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0078(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnClient_ReturnValue_1;          // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnClient_ReturnValue_2;          // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnClient_ReturnValue_3;          // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_167[0x1];                                      // 0x0167(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch) == 0x000008, "Wrong alignment on BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch");
static_assert(sizeof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch) == 0x000190, "Wrong size on BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, EntryPoint) == 0x000000, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_DynamicCast_AsFlame_Elemental_the_Untended_Flame) == 0x000010, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_DynamicCast_AsFlame_Elemental_the_Untended_Flame' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_Event_EndPlayReason) == 0x000019, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_Array_RemoveItem_ReturnValue) == 0x00001A, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, UniqueObjectNameForCooking_OutputDelegate) == 0x00001C, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::UniqueObjectNameForCooking_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000048, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_IsValid_ReturnValue_3) == 0x000050, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_IsValid_ReturnValue_4) == 0x000051, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_IsRunningOnClient_ReturnValue) == 0x000052, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_IsRunningOnClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000058, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000060, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000068, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000070, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_ComponentBoundEvent_bFromSweep) == 0x000074, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_ComponentBoundEvent_SweepResult) == 0x000078, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000160, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_IsRunningOnClient_ReturnValue_1) == 0x000161, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_IsRunningOnClient_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_IsRunningOnClient_ReturnValue_2) == 0x000162, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_IsRunningOnClient_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000163, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_IsValid_ReturnValue_5) == 0x000164, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_IsValid_ReturnValue_6) == 0x000165, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_IsRunningOnClient_ReturnValue_3) == 0x000166, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_IsRunningOnClient_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000168, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_ComponentBoundEvent_OtherActor) == 0x000170, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_ComponentBoundEvent_OtherComp) == 0x000178, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000180, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000184, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_Array_Add_ReturnValue) == 0x000188, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x00018C, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");

// Function BP_LingeringEffect_UnstableFlamePatch.BP_LingeringEffect_UnstableFlamePatch_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_LingeringEffect_UnstableFlamePatch_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LingeringEffect_UnstableFlamePatch_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_LingeringEffect_UnstableFlamePatch_C_ReceiveEndPlay");
static_assert(sizeof(BP_LingeringEffect_UnstableFlamePatch_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_LingeringEffect_UnstableFlamePatch_C_ReceiveEndPlay");
static_assert(offsetof(BP_LingeringEffect_UnstableFlamePatch_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_LingeringEffect_UnstableFlamePatch_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

