#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LingeringEffect_UnstableFlamePatch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LingeringEffect_UnstableFlamePatch.BP_LingeringEffect_UnstableFlamePatch_C
// 0x0038 (0x0548 - 0x0510)
class ABP_LingeringEffect_UnstableFlamePatch_C final : public AAoCAbilityLingeringEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       CustomCollision;                                   // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFlameElemental_TheUntendedFlame_C*     Agent;                                             // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFlameElemental_TheUntendedFlame_C*     Target;                                            // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int64                                         PatchCountEffectID;                                // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AbsorbTimerHandle;                                 // 0x0538(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         AbsorbTimerDuration;                               // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AbsorbTimerComplete();
	void BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_LingeringEffect_UnstableFlamePatch_CustomCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_BP_LingeringEffect_UnstableFlamePatch(int32 EntryPoint);
	void FadeOut_BP();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LingeringEffect_UnstableFlamePatch_C">();
	}
	static class ABP_LingeringEffect_UnstableFlamePatch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LingeringEffect_UnstableFlamePatch_C>();
	}
};
static_assert(alignof(ABP_LingeringEffect_UnstableFlamePatch_C) == 0x000008, "Wrong alignment on ABP_LingeringEffect_UnstableFlamePatch_C");
static_assert(sizeof(ABP_LingeringEffect_UnstableFlamePatch_C) == 0x000548, "Wrong size on ABP_LingeringEffect_UnstableFlamePatch_C");
static_assert(offsetof(ABP_LingeringEffect_UnstableFlamePatch_C, UberGraphFrame) == 0x000510, "Member 'ABP_LingeringEffect_UnstableFlamePatch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LingeringEffect_UnstableFlamePatch_C, CustomCollision) == 0x000518, "Member 'ABP_LingeringEffect_UnstableFlamePatch_C::CustomCollision' has a wrong offset!");
static_assert(offsetof(ABP_LingeringEffect_UnstableFlamePatch_C, Agent) == 0x000520, "Member 'ABP_LingeringEffect_UnstableFlamePatch_C::Agent' has a wrong offset!");
static_assert(offsetof(ABP_LingeringEffect_UnstableFlamePatch_C, Target) == 0x000528, "Member 'ABP_LingeringEffect_UnstableFlamePatch_C::Target' has a wrong offset!");
static_assert(offsetof(ABP_LingeringEffect_UnstableFlamePatch_C, PatchCountEffectID) == 0x000530, "Member 'ABP_LingeringEffect_UnstableFlamePatch_C::PatchCountEffectID' has a wrong offset!");
static_assert(offsetof(ABP_LingeringEffect_UnstableFlamePatch_C, AbsorbTimerHandle) == 0x000538, "Member 'ABP_LingeringEffect_UnstableFlamePatch_C::AbsorbTimerHandle' has a wrong offset!");
static_assert(offsetof(ABP_LingeringEffect_UnstableFlamePatch_C, AbsorbTimerDuration) == 0x000540, "Member 'ABP_LingeringEffect_UnstableFlamePatch_C::AbsorbTimerDuration' has a wrong offset!");

}

