#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lantern01_Carry

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Lantern01_Carry.BP_Lantern01_Carry_C
// 0x0028 (0x0370 - 0x0348)
class ABP_Lantern01_Carry_C final : public AActor
{
public:
	class UArrowComponent*                        Arrow;                                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 LanternMesh;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Variant;                                           // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lantern01_Carry_C">();
	}
	static class ABP_Lantern01_Carry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Lantern01_Carry_C>();
	}
};
static_assert(alignof(ABP_Lantern01_Carry_C) == 0x000008, "Wrong alignment on ABP_Lantern01_Carry_C");
static_assert(sizeof(ABP_Lantern01_Carry_C) == 0x000370, "Wrong size on ABP_Lantern01_Carry_C");
static_assert(offsetof(ABP_Lantern01_Carry_C, Arrow) == 0x000348, "Member 'ABP_Lantern01_Carry_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Lantern01_Carry_C, SpotLight) == 0x000350, "Member 'ABP_Lantern01_Carry_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Lantern01_Carry_C, LanternMesh) == 0x000358, "Member 'ABP_Lantern01_Carry_C::LanternMesh' has a wrong offset!");
static_assert(offsetof(ABP_Lantern01_Carry_C, DefaultSceneRoot) == 0x000360, "Member 'ABP_Lantern01_Carry_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Lantern01_Carry_C, Variant) == 0x000368, "Member 'ABP_Lantern01_Carry_C::Variant' has a wrong offset!");

}

