#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LandscapeBrushRoad

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"
#include "S_RoadSetDressingData_structs.hpp"
#include "StructUtils_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "SRoadSplineMeshActorSettings_structs.hpp"
#include "Chooser_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LandscapeBrushRoad.BP_LandscapeBrushRoad_C.Build Road
// 0x0010 (0x0010 - 0x0000)
struct BP_LandscapeBrushRoad_C_Build_Road final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushRoad_C_Build_Road) == 0x000008, "Wrong alignment on BP_LandscapeBrushRoad_C_Build_Road");
static_assert(sizeof(BP_LandscapeBrushRoad_C_Build_Road) == 0x000010, "Wrong size on BP_LandscapeBrushRoad_C_Build_Road");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Build_Road, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'BP_LandscapeBrushRoad_C_Build_Road::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Build_Road, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_LandscapeBrushRoad_C_Build_Road::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Build_Road, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_LandscapeBrushRoad_C_Build_Road::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Build_Road, CallFunc_IsWithEditor_ReturnValue) == 0x00000A, "Member 'BP_LandscapeBrushRoad_C_Build_Road::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Build_Road, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'BP_LandscapeBrushRoad_C_Build_Road::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_LandscapeBrushRoad.BP_LandscapeBrushRoad_C.Capture Minimap
// 0x0018 (0x0018 - 0x0000)
struct BP_LandscapeBrushRoad_C_Capture_Minimap final
{
public:
	bool                                          Is_Capturing;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Height_Offset;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Width_Scale;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushRoad_C_Capture_Minimap) == 0x000008, "Wrong alignment on BP_LandscapeBrushRoad_C_Capture_Minimap");
static_assert(sizeof(BP_LandscapeBrushRoad_C_Capture_Minimap) == 0x000018, "Wrong size on BP_LandscapeBrushRoad_C_Capture_Minimap");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Capture_Minimap, Is_Capturing) == 0x000000, "Member 'BP_LandscapeBrushRoad_C_Capture_Minimap::Is_Capturing' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Capture_Minimap, Height_Offset) == 0x000008, "Member 'BP_LandscapeBrushRoad_C_Capture_Minimap::Height_Offset' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Capture_Minimap, Width_Scale) == 0x000010, "Member 'BP_LandscapeBrushRoad_C_Capture_Minimap::Width_Scale' has a wrong offset!");

// Function BP_LandscapeBrushRoad.BP_LandscapeBrushRoad_C.OnRoadActiveStateUpdatedBP
// 0x0001 (0x0001 - 0x0000)
struct BP_LandscapeBrushRoad_C_OnRoadActiveStateUpdatedBP final
{
public:
	bool                                          bIsRoadActive;                                     // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushRoad_C_OnRoadActiveStateUpdatedBP) == 0x000001, "Wrong alignment on BP_LandscapeBrushRoad_C_OnRoadActiveStateUpdatedBP");
static_assert(sizeof(BP_LandscapeBrushRoad_C_OnRoadActiveStateUpdatedBP) == 0x000001, "Wrong size on BP_LandscapeBrushRoad_C_OnRoadActiveStateUpdatedBP");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnRoadActiveStateUpdatedBP, bIsRoadActive) == 0x000000, "Member 'BP_LandscapeBrushRoad_C_OnRoadActiveStateUpdatedBP::bIsRoadActive' has a wrong offset!");

// Function BP_LandscapeBrushRoad.BP_LandscapeBrushRoad_C.OnRoadAppearanceUpdatedBP
// 0x0068 (0x0068 - 0x0000)
struct BP_LandscapeBrushRoad_C_OnRoadAppearanceUpdatedBP final
{
public:
	struct FLoadedRoadAppearance                  LoadedRoadAppearance;                              // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_LandscapeBrushRoad_C_OnRoadAppearanceUpdatedBP) == 0x000008, "Wrong alignment on BP_LandscapeBrushRoad_C_OnRoadAppearanceUpdatedBP");
static_assert(sizeof(BP_LandscapeBrushRoad_C_OnRoadAppearanceUpdatedBP) == 0x000068, "Wrong size on BP_LandscapeBrushRoad_C_OnRoadAppearanceUpdatedBP");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnRoadAppearanceUpdatedBP, LoadedRoadAppearance) == 0x000000, "Member 'BP_LandscapeBrushRoad_C_OnRoadAppearanceUpdatedBP::LoadedRoadAppearance' has a wrong offset!");

// Function BP_LandscapeBrushRoad.BP_LandscapeBrushRoad_C.OnRoadBaseAppearanceUpdatedBP
// 0x0078 (0x0078 - 0x0000)
struct BP_LandscapeBrushRoad_C_OnRoadBaseAppearanceUpdatedBP final
{
public:
	struct FLoadedRoadBaseAppearance              LoadedRoadBaseAppearance;                          // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_LandscapeBrushRoad_C_OnRoadBaseAppearanceUpdatedBP) == 0x000008, "Wrong alignment on BP_LandscapeBrushRoad_C_OnRoadBaseAppearanceUpdatedBP");
static_assert(sizeof(BP_LandscapeBrushRoad_C_OnRoadBaseAppearanceUpdatedBP) == 0x000078, "Wrong size on BP_LandscapeBrushRoad_C_OnRoadBaseAppearanceUpdatedBP");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnRoadBaseAppearanceUpdatedBP, LoadedRoadBaseAppearance) == 0x000000, "Member 'BP_LandscapeBrushRoad_C_OnRoadBaseAppearanceUpdatedBP::LoadedRoadBaseAppearance' has a wrong offset!");

// Function BP_LandscapeBrushRoad.BP_LandscapeBrushRoad_C.OnUpdateActiveRoadStatus
// 0x00A0 (0x00A0 - 0x0000)
struct BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus) == 0x000008, "Wrong alignment on BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus");
static_assert(sizeof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus) == 0x0000A0, "Wrong size on BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, Temp_int_Loop_Counter_Variable_1) == 0x000004, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, Temp_int_Loop_Counter_Variable_2) == 0x000018, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, Temp_int_Loop_Counter_Variable_3) == 0x000020, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, Temp_bool_Variable) == 0x00002C, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, Temp_int_Array_Index_Variable_2) == 0x000030, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000050, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, Temp_int_Array_Index_Variable_3) == 0x000054, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Max_ReturnValue) == 0x000058, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, Temp_real_Variable) == 0x000068, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Array_Get_Item_2) == 0x000070, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Array_Length_ReturnValue_2) == 0x000078, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, Temp_real_Variable_1) == 0x00007C, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Less_IntInt_ReturnValue_1) == 0x000080, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, K2Node_Select_Default) == 0x000084, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Array_Length_ReturnValue_3) == 0x000088, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Array_Get_Item_3) == 0x000090, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_Less_IntInt_ReturnValue_2) == 0x000098, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus, CallFunc_IsValid_ReturnValue_1) == 0x000099, "Member 'BP_LandscapeBrushRoad_C_OnUpdateActiveRoadStatus::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_LandscapeBrushRoad.BP_LandscapeBrushRoad_C.OnUpdateLoadedRoadAppearance
// 0x0140 (0x0140 - 0x0000)
struct BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance final
{
public:
	struct FChooserEvaluationContext              CallFunc_MakeChooserEvaluationContext_ReturnValue; // 0x0000(0x0050)()
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       CallFunc_MakeEvaluateChooser_ReturnValue;          // 0x0060(0x0010)()
	class UMaterialInterface*                     CallFunc_EvaluateObjectChooserBase_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0078(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBiomeType                                    CallFunc_Get_Biome_From_Location_Biome;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_Select_Default;                             // 0x00F8(0x0028)(HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance) == 0x000008, "Wrong alignment on BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance");
static_assert(sizeof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance) == 0x000140, "Wrong size on BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_MakeChooserEvaluationContext_ReturnValue) == 0x000000, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_MakeChooserEvaluationContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000050, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000058, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000059, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_MakeEvaluateChooser_ReturnValue) == 0x000060, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_MakeEvaluateChooser_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_EvaluateObjectChooserBase_ReturnValue) == 0x000070, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_EvaluateObjectChooserBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000078, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000A0, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_BooleanAND_ReturnValue) == 0x0000A1, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, Temp_bool_Variable) == 0x0000C0, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_BreakVector_X) == 0x0000C8, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_BreakVector_Y) == 0x0000D0, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_BreakVector_Z) == 0x0000D8, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_MakeVector2D_ReturnValue) == 0x0000E0, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_Get_Biome_From_Location_Biome) == 0x0000F0, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_Get_Biome_From_Location_Biome' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000F1, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, K2Node_Select_Default) == 0x0000F8, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_FMax_ReturnValue) == 0x000120, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_SelectFloat_ReturnValue) == 0x000128, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_SelectFloat_B_ImplicitCast) == 0x000130, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_SelectFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance, CallFunc_FMax_A_ImplicitCast) == 0x000138, "Member 'BP_LandscapeBrushRoad_C_OnUpdateLoadedRoadAppearance::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");

// Function BP_LandscapeBrushRoad.BP_LandscapeBrushRoad_C.Set Road Levels
// 0x0010 (0x0010 - 0x0000)
struct BP_LandscapeBrushRoad_C_Set_Road_Levels final
{
public:
	int32                                         Road_Level;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushRoad_C_Set_Road_Levels) == 0x000008, "Wrong alignment on BP_LandscapeBrushRoad_C_Set_Road_Levels");
static_assert(sizeof(BP_LandscapeBrushRoad_C_Set_Road_Levels) == 0x000010, "Wrong size on BP_LandscapeBrushRoad_C_Set_Road_Levels");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Set_Road_Levels, Road_Level) == 0x000000, "Member 'BP_LandscapeBrushRoad_C_Set_Road_Levels::Road_Level' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Set_Road_Levels, CallFunc_IsWithEditor_ReturnValue) == 0x000004, "Member 'BP_LandscapeBrushRoad_C_Set_Road_Levels::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Set_Road_Levels, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'BP_LandscapeBrushRoad_C_Set_Road_Levels::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");

// Function BP_LandscapeBrushRoad.BP_LandscapeBrushRoad_C.ExecuteUbergraph_BP_LandscapeBrushRoad
// 0x0148 (0x0148 - 0x0000)
struct BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NodeLevel;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Is_Capturing;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Height_Offset;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Width_Scale;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsCapturing;                         // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_LayerName;                            // 0x0024(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsRoadActive;                        // 0x002C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLoadedRoadAppearance                  K2Node_Event_LoadedRoadAppearance;                 // 0x0030(0x0068)(ConstParm)
	struct FLoadedRoadBaseAppearance              K2Node_Event_LoadedRoadBaseAppearance;             // 0x0098(0x0078)(ConstParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x1];                                      // 0x0113(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPCGComponent*>                  CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0120(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad) == 0x000008, "Wrong alignment on BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad");
static_assert(sizeof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad) == 0x000148, "Wrong size on BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, EntryPoint) == 0x000000, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, K2Node_Event_NodeLevel) == 0x000004, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::K2Node_Event_NodeLevel' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, K2Node_Event_Is_Capturing) == 0x00000C, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::K2Node_Event_Is_Capturing' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, K2Node_Event_Height_Offset) == 0x000010, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::K2Node_Event_Height_Offset' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, K2Node_Event_Width_Scale) == 0x000018, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::K2Node_Event_Width_Scale' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, K2Node_Event_bIsCapturing) == 0x000020, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::K2Node_Event_bIsCapturing' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, K2Node_Event_LayerName) == 0x000024, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::K2Node_Event_LayerName' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, K2Node_Event_bIsRoadActive) == 0x00002C, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::K2Node_Event_bIsRoadActive' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, K2Node_Event_LoadedRoadAppearance) == 0x000030, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::K2Node_Event_LoadedRoadAppearance' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, K2Node_Event_LoadedRoadBaseAppearance) == 0x000098, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::K2Node_Event_LoadedRoadBaseAppearance' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, CallFunc_BooleanAND_ReturnValue) == 0x000110, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, CallFunc_BooleanAND_ReturnValue_1) == 0x000111, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, CallFunc_IsValid_ReturnValue) == 0x000112, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, Temp_int_Loop_Counter_Variable) == 0x000114, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, CallFunc_Add_IntInt_ReturnValue) == 0x000118, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000120, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, CallFunc_Array_Length_ReturnValue) == 0x000130, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, CallFunc_Array_Get_Item) == 0x000138, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad, CallFunc_Less_IntInt_ReturnValue) == 0x000140, "Member 'BP_LandscapeBrushRoad_C_ExecuteUbergraph_BP_LandscapeBrushRoad::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LandscapeBrushRoad.BP_LandscapeBrushRoad_C.Clear All PCG Data
// 0x00A0 (0x00A0 - 0x0000)
struct BP_LandscapeBrushRoad_C_Clear_All_PCG_Data final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInstancedStaticMeshComponent*>  CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UInstancedStaticMeshComponent*          CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0058(0x0010)(ReferenceParm)
	TArray<class UPCGComponent*>                  CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_2;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data) == 0x000008, "Wrong alignment on BP_LandscapeBrushRoad_C_Clear_All_PCG_Data");
static_assert(sizeof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data) == 0x0000A0, "Wrong size on BP_LandscapeBrushRoad_C_Clear_All_PCG_Data");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, Temp_int_Array_Index_Variable_2) == 0x000020, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, Temp_int_Loop_Counter_Variable_2) == 0x000024, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000028, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x00002C, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x00004C, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Max_ReturnValue) == 0x000054, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_GetAttachedActors_OutActors) == 0x000058, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000068, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Array_Length_ReturnValue_2) == 0x00008C, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Subtract_IntInt_ReturnValue_4) == 0x000090, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Subtract_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Subtract_IntInt_ReturnValue_5) == 0x000094, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Subtract_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Max_ReturnValue_1) == 0x000098, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoad_C_Clear_All_PCG_Data, CallFunc_Max_ReturnValue_2) == 0x00009C, "Member 'BP_LandscapeBrushRoad_C_Clear_All_PCG_Data::CallFunc_Max_ReturnValue_2' has a wrong offset!");

// Function BP_LandscapeBrushRoad.BP_LandscapeBrushRoad_C.Get Road Width Based on Level
// 0x0080 (0x0080 - 0x0000)
struct BP_LandscapeBrushRoad_C_Get_Road_Width_Based_on_Level final
{
public:
	double                                        Start_Alpha;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        End_Alpha;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Width_Start;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Width_End;                                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
