#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LocalFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LocalFX.BP_LocalFX_C
// 0x0048 (0x0390 - 0x0348)
class ABP_LocalFX_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara_FlyingInsects;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_Indoor;                                    // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_Outdoor;                                   // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_Precipitation;                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_Plankton;                                  // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Ocean_Height;                                      // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Precip_Amount;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LocalFX(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Set_Indoor_Effect(class UNiagaraSystem* Effect);
	void Set_Indoor_Effect_Transition(double Transition);
	void Set_Outdoor_Effect(class UNiagaraSystem* Effect);
	void Set_Outdoor_Effect_Transition(double Transition);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LocalFX_C">();
	}
	static class ABP_LocalFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LocalFX_C>();
	}
};
static_assert(alignof(ABP_LocalFX_C) == 0x000008, "Wrong alignment on ABP_LocalFX_C");
static_assert(sizeof(ABP_LocalFX_C) == 0x000390, "Wrong size on ABP_LocalFX_C");
static_assert(offsetof(ABP_LocalFX_C, UberGraphFrame) == 0x000348, "Member 'ABP_LocalFX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LocalFX_C, Niagara_FlyingInsects) == 0x000350, "Member 'ABP_LocalFX_C::Niagara_FlyingInsects' has a wrong offset!");
static_assert(offsetof(ABP_LocalFX_C, Niagara_Indoor) == 0x000358, "Member 'ABP_LocalFX_C::Niagara_Indoor' has a wrong offset!");
static_assert(offsetof(ABP_LocalFX_C, Niagara_Outdoor) == 0x000360, "Member 'ABP_LocalFX_C::Niagara_Outdoor' has a wrong offset!");
static_assert(offsetof(ABP_LocalFX_C, Niagara_Precipitation) == 0x000368, "Member 'ABP_LocalFX_C::Niagara_Precipitation' has a wrong offset!");
static_assert(offsetof(ABP_LocalFX_C, Niagara_Plankton) == 0x000370, "Member 'ABP_LocalFX_C::Niagara_Plankton' has a wrong offset!");
static_assert(offsetof(ABP_LocalFX_C, DefaultSceneRoot) == 0x000378, "Member 'ABP_LocalFX_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LocalFX_C, Ocean_Height) == 0x000380, "Member 'ABP_LocalFX_C::Ocean_Height' has a wrong offset!");
static_assert(offsetof(ABP_LocalFX_C, Precip_Amount) == 0x000388, "Member 'ABP_LocalFX_C::Precip_Amount' has a wrong offset!");

}

