#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LumenLight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LumenLight.BP_LumenLight_C.GetLightColor
// 0x0038 (0x0038 - 0x0000)
struct BP_LumenLight_C_GetLightColor final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColor_SetTemperature_InTemperature_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LumenLight_C_GetLightColor) == 0x000008, "Wrong alignment on BP_LumenLight_C_GetLightColor");
static_assert(sizeof(BP_LumenLight_C_GetLightColor) == 0x000038, "Wrong size on BP_LumenLight_C_GetLightColor");
static_assert(offsetof(BP_LumenLight_C_GetLightColor, ReturnValue) == 0x000000, "Member 'BP_LumenLight_C_GetLightColor::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LumenLight_C_GetLightColor, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000018, "Member 'BP_LumenLight_C_GetLightColor::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LumenLight_C_GetLightColor, CallFunc_LinearColor_SetTemperature_InTemperature_ImplicitCast) == 0x000030, "Member 'BP_LumenLight_C_GetLightColor::CallFunc_LinearColor_SetTemperature_InTemperature_ImplicitCast' has a wrong offset!");

}

