#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LandscapeBrushRoadIntersection

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function BP_LandscapeBrushRoadIntersection.BP_LandscapeBrushRoadIntersection_C.Add Base Visible Spline Meshes
// 0x02E0 (0x02E0 - 0x0000)
struct BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue;    // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x00B0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       CallFunc_Array_Get_Item_1;                         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRollAtSplinePoint_ReturnValue;         // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtSplinePoint_ReturnValue;        // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtSplinePoint_ReturnValue_1;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRollAtSplinePoint_ReturnValue_1;       // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetEndRoll_EndRoll_ImplicitCast;          // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetStartRoll_StartRoll_ImplicitCast;      // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes) == 0x000010, "Wrong alignment on BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes");
static_assert(sizeof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes) == 0x0002E0, "Wrong size on BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Array_Get_Item) == 0x000014, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Percent_IntInt_ReturnValue) == 0x000018, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_InverseTransformDirection_ReturnValue) == 0x000090, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_InverseTransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_MakeLiteralInt_ReturnValue) == 0x0000A8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, Temp_struct_Variable) == 0x0000B0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, Temp_int_Loop_Counter_Variable_1) == 0x000110, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_AddComponent_ReturnValue) == 0x000118, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Add_IntInt_ReturnValue_2) == 0x000120, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000128, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Array_Add_ReturnValue) == 0x000130, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_IsValid_ReturnValue) == 0x000134, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000138, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Array_Add_ReturnValue_1) == 0x000140, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Array_Get_Item_1) == 0x000148, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Array_Length_ReturnValue_1) == 0x000150, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_GetRollAtSplinePoint_ReturnValue) == 0x000154, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_GetRollAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Less_IntInt_ReturnValue) == 0x000158, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000160, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_GetScaleAtSplinePoint_ReturnValue) == 0x000168, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_GetScaleAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_GetScaleAtSplinePoint_ReturnValue_1) == 0x000180, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_GetScaleAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_BreakVector_X) == 0x000198, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_BreakVector_Y) == 0x0001A0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_BreakVector_Z) == 0x0001A8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_BreakVector_X_1) == 0x0001B0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_BreakVector_Y_1) == 0x0001B8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_BreakVector_Z_1) == 0x0001C0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001C8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001D0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0001D8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0001E0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_MakeVector2D_ReturnValue) == 0x0001E8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_MakeVector2D_ReturnValue_1) == 0x0001F8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_GetRollAtSplinePoint_ReturnValue_1) == 0x000208, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_GetRollAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000210, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x000228, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000240, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Add_VectorVector_ReturnValue) == 0x000248, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x000260, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x000278, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000290, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Array_Get_Item_2) == 0x0002A8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Array_Length_ReturnValue_2) == 0x0002B0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002B4, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0002B8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_SetEndRoll_EndRoll_ImplicitCast) == 0x0002C0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_SetEndRoll_EndRoll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x0002C8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes, CallFunc_SetStartRoll_StartRoll_ImplicitCast) == 0x0002D0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Base_Visible_Spline_Meshes::CallFunc_SetStartRoll_StartRoll_ImplicitCast' has a wrong offset!");

// Function BP_LandscapeBrushRoadIntersection.BP_LandscapeBrushRoadIntersection_C.Add Grass Hiding Spline Meshes
// 0x0250 (0x0250 - 0x0000)
struct BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetScaleAtSplinePoint_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtSplinePoint_ReturnValue_1;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRollAtSplinePoint_ReturnValue;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRollAtSplinePoint_ReturnValue_1;       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_2;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_3;                         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x0190(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item_4;                         // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetEndRoll_EndRoll_ImplicitCast;          // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetStartRoll_StartRoll_ImplicitCast;      // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes) == 0x000010, "Wrong alignment on BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes");
static_assert(sizeof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes) == 0x000250, "Wrong size on BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, Temp_int_Variable) == 0x000010, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Add_IntInt_ReturnValue_2) == 0x000018, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Add_IntInt_ReturnValue_3) == 0x000020, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_GetScaleAtSplinePoint_ReturnValue) == 0x000040, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_GetScaleAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_BreakVector_X) == 0x000060, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_BreakVector_Y) == 0x000068, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_BreakVector_Z) == 0x000070, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_GetScaleAtSplinePoint_ReturnValue_1) == 0x000078, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_GetScaleAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_GetRollAtSplinePoint_ReturnValue) == 0x000090, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_GetRollAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_BreakVector_X_1) == 0x000098, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_BreakVector_Y_1) == 0x0000A0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_BreakVector_Z_1) == 0x0000A8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_GetRollAtSplinePoint_ReturnValue_1) == 0x0000B0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_GetRollAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x0000B8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x0000D0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x0000E8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x000100, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000118, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Percent_IntInt_ReturnValue) == 0x00011C, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Subtract_IntInt_ReturnValue) == 0x000120, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Array_Get_Item_2) == 0x000128, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000130, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000138, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000140, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Add_IntInt_ReturnValue_4) == 0x000148, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_MakeVector2D_ReturnValue) == 0x000150, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000160, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Array_Get_Item_3) == 0x000168, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000170, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000178, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_MakeVector2D_ReturnValue_1) == 0x000180, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, Temp_struct_Variable) == 0x000190, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_AddComponent_ReturnValue) == 0x0001F0, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Array_Get_Item_4) == 0x0001F8, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Array_Add_ReturnValue) == 0x000200, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000208, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Array_Add_ReturnValue_1) == 0x000210, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_IsValid_ReturnValue) == 0x000214, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Array_Length_ReturnValue_2) == 0x000218, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Less_IntInt_ReturnValue_1) == 0x00021C, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000220, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000228, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000230, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000238, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000240, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_SetEndRoll_EndRoll_ImplicitCast) == 0x000248, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_SetEndRoll_EndRoll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes, CallFunc_SetStartRoll_StartRoll_ImplicitCast) == 0x00024C, "Member 'BP_LandscapeBrushRoadIntersection_C_Add_Grass_Hiding_Spline_Meshes::CallFunc_SetStartRoll_StartRoll_ImplicitCast' has a wrong offset!");

// Function BP_LandscapeBrushRoadIntersection.BP_LandscapeBrushRoadIntersection_C.Adjust Connected Road Endpoints
// 0x0B40 (0x0B40 - 0x0000)
struct BP_LandscapeBrushRoadIntersection_C_Adjust_Connected_Road_Endpoints final
{
public:
	TArray<class AActor*>                         Actors_To_Ignore;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FVector                                Sample_Location;                                   // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Normal_List;                                       // 0x0028(0x0010)(Edit, BlueprintVisible)
	struct FVector                                Intersection_Center;                               // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
