#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LandscapeBrushNodeShape

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SNodeRoadConnection_structs.hpp"
#include "SNodeRiverConnection_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "SNodeShape_structs.hpp"


namespace SDK::Params
{

// Function BP_LandscapeBrushNodeShape.BP_LandscapeBrushNodeShape_C.Add Child Road Helpers
// 0x01E0 (0x01E0 - 0x0000)
struct BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_LandscapeBrushRoad_C> CallFunc_Array_Get_Item;                          // 0x0008(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_LandscapeBrushRoad_C*               UniqueObjectNameForCooking_AsBP_Landscape_Brush_Road; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueObjectNameForCooking_bSuccess;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ConstParm, ReferenceParm)
	TSoftObjectPtr<class ABP_LandscapeBrushNodeShape_C> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x00F8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSNodeRoadConnection                   CallFunc_Array_Get_Item_1;                         // 0x0128(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0160(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LandscapeBrushRoadNodeHelper_C*     K2Node_DynamicCast_AsBP_Landscape_Brush_Road_Node_Helper; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers) == 0x000010, "Wrong alignment on BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers");
static_assert(sizeof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers) == 0x0001E0, "Wrong size on BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Array_Get_Item) == 0x000008, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000038, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, UniqueObjectNameForCooking_AsBP_Landscape_Brush_Road) == 0x000040, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::UniqueObjectNameForCooking_AsBP_Landscape_Brush_Road' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, UniqueObjectNameForCooking_bSuccess) == 0x000048, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::UniqueObjectNameForCooking_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_SelectFloat_ReturnValue) == 0x000050, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000058, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000070, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000088, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000A0, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000D0, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, K2Node_MakeArray_Array) == 0x0000E8, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0000F8, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Array_Get_Item_1) == 0x000128, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_Less_IntInt_ReturnValue) == 0x000158, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_MakeTransform_ReturnValue) == 0x000160, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_AddComponent_ReturnValue) == 0x0001C0, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, CallFunc_IsValid_ReturnValue_1) == 0x0001C8, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, K2Node_DynamicCast_AsBP_Landscape_Brush_Road_Node_Helper) == 0x0001D0, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::K2Node_DynamicCast_AsBP_Landscape_Brush_Road_Node_Helper' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'BP_LandscapeBrushNodeShape_C_Add_Child_Road_Helpers::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_LandscapeBrushNodeShape.BP_LandscapeBrushNodeShape_C.Add This Brush To Only Update List
// 0x0068 (0x0068 - 0x0000)
struct BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALandscapeBrushManagerActor*            CallFunc_EditorFindBrushManagerInCurrentLevel_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LandscapeBrushManager_C*            K2Node_DynamicCast_AsBP_Landscape_Brush_Manager;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllChildActors_ChildActors;            // 0x0030(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALandscapeBrushBaseActor*               K2Node_DynamicCast_AsLandscape_Brush_Base_Actor;   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List) == 0x000008, "Wrong alignment on BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List");
static_assert(sizeof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List) == 0x000068, "Wrong size on BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, CallFunc_EditorFindBrushManagerInCurrentLevel_ReturnValue) == 0x000008, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::CallFunc_EditorFindBrushManagerInCurrentLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, K2Node_DynamicCast_AsBP_Landscape_Brush_Manager) == 0x000020, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::K2Node_DynamicCast_AsBP_Landscape_Brush_Manager' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, CallFunc_GetAllChildActors_ChildActors) == 0x000030, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::CallFunc_GetAllChildActors_ChildActors' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, K2Node_DynamicCast_AsLandscape_Brush_Base_Actor) == 0x000050, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::K2Node_DynamicCast_AsLandscape_Brush_Base_Actor' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, CallFunc_Array_Add_ReturnValue_1) == 0x000060, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_LandscapeBrushNodeShape_C_Add_This_Brush_To_Only_Update_List::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LandscapeBrushNodeShape.BP_LandscapeBrushNodeShape_C.Adjust Connected Actor Endpoints
// 0x03C0 (0x03C0 - 0x0000)
struct BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSNodeRiverConnection                  CallFunc_Array_Get_Item_1;                         // 0x0088(0x0048)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_TransformRotation_ReturnValue;            // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WaterSpline_C*                      CallFunc_Array_Get_Item_2;                         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_166[0x2];                                      // 0x0166(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0xB];                                      // 0x0175(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0180(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_TransformRotation_ReturnValue_1;          // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue_1;          // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue_1;                // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_3;                         // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x2];                                      // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_4;                // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_5;                // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_LandscapeBrushRoad_C> CallFunc_Array_Get_Item_4;                        // 0x02E0(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LandscapeBrushRoad_C*               UniqueObjectNameForCooking_AsBP_Landscape_Brush_Road; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueObjectNameForCooking_bSuccess;               // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x2];                                      // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_1;    // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_2;   // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_3;   // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue_1;            // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints) == 0x000010, "Wrong alignment on BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints");
static_assert(sizeof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints) == 0x0003C0, "Wrong size on BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, Temp_int_Array_Index_Variable_1) == 0x000004, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Array_Get_Item) == 0x000008, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_SelectFloat_ReturnValue) == 0x000070, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_SelectFloat_ReturnValue_1) == 0x000078, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Add_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_TransformRotation_ReturnValue) == 0x0000D8, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_TransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_TransformLocation_ReturnValue) == 0x0000F0, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_GetUpVector_ReturnValue) == 0x000108, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_GetForwardVector_ReturnValue) == 0x000120, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, Temp_int_Loop_Counter_Variable_1) == 0x000138, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_SelectFloat_ReturnValue_2) == 0x000140, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Add_IntInt_ReturnValue_1) == 0x000148, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, Temp_int_Variable) == 0x00014C, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, Temp_bool_Variable) == 0x000150, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, Temp_bool_Variable_1) == 0x000151, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Array_Get_Item_2) == 0x000158, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Less_IntInt_ReturnValue) == 0x000164, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_IsValid_ReturnValue) == 0x000165, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, Temp_int_Variable_1) == 0x000168, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x00016C, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Subtract_IntInt_ReturnValue) == 0x000170, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, Temp_bool_Variable_2) == 0x000174, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_GetTransform_ReturnValue_1) == 0x000180, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, K2Node_Select_Default) == 0x0001E0, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001E4, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001E8, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_TransformRotation_ReturnValue_1) == 0x0001F0, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_TransformRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_TransformLocation_ReturnValue_1) == 0x000208, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_TransformLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_GetUpVector_ReturnValue_1) == 0x000220, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_GetUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_GetForwardVector_ReturnValue_1) == 0x000238, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000250, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, Temp_bool_Variable_3) == 0x000268, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Array_Get_Item_3) == 0x000269, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, K2Node_Select_Default_1) == 0x00026C, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x000270, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Vector_Distance_ReturnValue) == 0x000288, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_SelectFloat_ReturnValue_3) == 0x000290, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000298, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_SelectFloat_ReturnValue_4) == 0x0002A0, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_SelectFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0002A8, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_SelectFloat_ReturnValue_5) == 0x0002C0, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_SelectFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0002C8, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Array_Get_Item_4) == 0x0002E0, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Array_Length_ReturnValue_1) == 0x000308, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000310, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Less_IntInt_ReturnValue_1) == 0x000318, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, UniqueObjectNameForCooking_AsBP_Landscape_Brush_Road) == 0x000320, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::UniqueObjectNameForCooking_AsBP_Landscape_Brush_Road' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, UniqueObjectNameForCooking_bSuccess) == 0x000328, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::UniqueObjectNameForCooking_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_IsValid_ReturnValue_1) == 0x000329, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_GetNumberOfSplinePoints_ReturnValue_1) == 0x00032C, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_GetNumberOfSplinePoints_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000330, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, K2Node_Select_Default_2) == 0x000334, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000338, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Add_IntInt_ReturnValue_3) == 0x00033C, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, K2Node_Select_Default_3) == 0x000340, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_GetLocationAtSplinePoint_ReturnValue_2) == 0x000348, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_GetLocationAtSplinePoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_GetLocationAtSplinePoint_ReturnValue_3) == 0x000360, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_GetLocationAtSplinePoint_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Vector_Distance_ReturnValue_1) == 0x000378, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000380, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000388, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0003A0, "Member 'BP_LandscapeBrushNodeShape_C_Adjust_Connected_Actor_Endpoints::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");

// Function BP_LandscapeBrushNodeShape.BP_LandscapeBrushNodeShape_C.EditorPrepForSceneCapture
// 0x000C (0x000C - 0x0000)
struct BP_LandscapeBrushNodeShape_C_EditorPrepForSceneCapture final
{
public:
	bool                                          bIsCapturing;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LayerName;                                         // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushNodeShape_C_EditorPrepForSceneCapture) == 0x000004, "Wrong alignment on BP_LandscapeBrushNodeShape_C_EditorPrepForSceneCapture");
static_assert(sizeof(BP_LandscapeBrushNodeShape_C_EditorPrepForSceneCapture) == 0x00000C, "Wrong size on BP_LandscapeBrushNodeShape_C_EditorPrepForSceneCapture");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_EditorPrepForSceneCapture, bIsCapturing) == 0x000000, "Member 'BP_LandscapeBrushNodeShape_C_EditorPrepForSceneCapture::bIsCapturing' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_EditorPrepForSceneCapture, LayerName) == 0x000004, "Member 'BP_LandscapeBrushNodeShape_C_EditorPrepForSceneCapture::LayerName' has a wrong offset!");

// Function BP_LandscapeBrushNodeShape.BP_LandscapeBrushNodeShape_C.ExecuteUbergraph_BP_LandscapeBrushNodeShape
// 0x0010 (0x0010 - 0x0000)
struct BP_LandscapeBrushNodeShape_C_ExecuteUbergraph_BP_LandscapeBrushNodeShape final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsCapturing;                         // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_LayerName;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LandscapeBrushNodeShape_C_ExecuteUbergraph_BP_LandscapeBrushNodeShape) == 0x000004, "Wrong alignment on BP_LandscapeBrushNodeShape_C_ExecuteUbergraph_BP_LandscapeBrushNodeShape");
static_assert(sizeof(BP_LandscapeBrushNodeShape_C_ExecuteUbergraph_BP_LandscapeBrushNodeShape) == 0x000010, "Wrong size on BP_LandscapeBrushNodeShape_C_ExecuteUbergraph_BP_LandscapeBrushNodeShape");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_ExecuteUbergraph_BP_LandscapeBrushNodeShape, EntryPoint) == 0x000000, "Member 'BP_LandscapeBrushNodeShape_C_ExecuteUbergraph_BP_LandscapeBrushNodeShape::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_ExecuteUbergraph_BP_LandscapeBrushNodeShape, K2Node_Event_bIsCapturing) == 0x000004, "Member 'BP_LandscapeBrushNodeShape_C_ExecuteUbergraph_BP_LandscapeBrushNodeShape::K2Node_Event_bIsCapturing' has a wrong offset!");
static_assert(offsetof(BP_LandscapeBrushNodeShape_C_ExecuteUbergraph_BP_LandscapeBrushNodeShape, K2Node_Event_LayerName) == 0x000008, "Member 'BP_LandscapeBrushNodeShape_C_ExecuteUbergraph_BP_LandscapeBrushNodeShape::K2Node_Event_LayerName' has a wrong offset!");

// Function BP_LandscapeBrushNodeShape.BP_LandscapeBrushNodeShape_C.Populate Is Road End Array
// 0x01B0 (0x01B0 - 0x0000)
struct BP_LandscapeBrushNodeShape_C_Populate_Is_Road_End_Array final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_LandscapeBrushNodeShape_C> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0034(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABP_LandscapeBrushRoad_C> CallFunc_Array_Get_Item;                          // 0x00A8(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00E0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
