#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelInstanceCell

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LevelInstanceCell.BP_LevelInstanceCell_C.Find Brush Manager In Current Level
// 0x0080 (0x0080 - 0x0000)
struct BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level final
{
public:
	class ABP_LandscapeBrushManager_C*            BrushManager;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LandscapeBrushManager_C*            Current_Level_Brush_Manager;                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevel*                                 CallFunc_GetLevel_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_LandscapeBrushManager_C*>    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	class ABP_LandscapeBrushManager_C*            CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevel*                                 CallFunc_GetLevel_ReturnValue_1;                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue_1;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level) == 0x000008, "Wrong alignment on BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level");
static_assert(sizeof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level) == 0x000080, "Wrong size on BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, BrushManager) == 0x000000, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::BrushManager' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, Found) == 0x000008, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::Found' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, Current_Level_Brush_Manager) == 0x000010, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::Current_Level_Brush_Manager' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_GetLevel_ReturnValue) == 0x000020, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_GetOuterObject_ReturnValue) == 0x000030, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_GetLevel_ReturnValue_1) == 0x000060, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_GetLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_GetOuterObject_ReturnValue_1) == 0x000068, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_GetOuterObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000074, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000075, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'BP_LevelInstanceCell_C_Find_Brush_Manager_In_Current_Level::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LevelInstanceCell.BP_LevelInstanceCell_C.Request Update From Landscape
// 0x0010 (0x0010 - 0x0000)
struct BP_LevelInstanceCell_C_Request_Update_From_Landscape final
{
public:
	class ABP_LandscapeBrushManager_C*            CallFunc_Find_Brush_Manager_In_Current_Level_BrushManager; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Find_Brush_Manager_In_Current_Level_Found; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelInstanceCell_C_Request_Update_From_Landscape) == 0x000008, "Wrong alignment on BP_LevelInstanceCell_C_Request_Update_From_Landscape");
static_assert(sizeof(BP_LevelInstanceCell_C_Request_Update_From_Landscape) == 0x000010, "Wrong size on BP_LevelInstanceCell_C_Request_Update_From_Landscape");
static_assert(offsetof(BP_LevelInstanceCell_C_Request_Update_From_Landscape, CallFunc_Find_Brush_Manager_In_Current_Level_BrushManager) == 0x000000, "Member 'BP_LevelInstanceCell_C_Request_Update_From_Landscape::CallFunc_Find_Brush_Manager_In_Current_Level_BrushManager' has a wrong offset!");
static_assert(offsetof(BP_LevelInstanceCell_C_Request_Update_From_Landscape, CallFunc_Find_Brush_Manager_In_Current_Level_Found) == 0x000008, "Member 'BP_LevelInstanceCell_C_Request_Update_From_Landscape::CallFunc_Find_Brush_Manager_In_Current_Level_Found' has a wrong offset!");

}

