#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LocalWeatherCustomOverride

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LocalWeatherCustomOverride.BP_LocalWeatherCustomOverride_C.UserConstructionScript
// 0x01F0 (0x01F0 - 0x0000)
struct BP_LocalWeatherCustomOverride_C_UserConstructionScript final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalWeatherCustomOverride_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_LocalWeatherCustomOverride_C_UserConstructionScript");
static_assert(sizeof(BP_LocalWeatherCustomOverride_C_UserConstructionScript) == 0x0001F0, "Wrong size on BP_LocalWeatherCustomOverride_C_UserConstructionScript");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_IsWithEditor_ReturnValue) == 0x000008, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, Temp_struct_Variable) == 0x000010, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000080, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000098, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_GetComponentBounds_Origin) == 0x0000A0, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_GetComponentBounds_BoxExtent) == 0x0000B8, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_GetComponentBounds_SphereRadius) == 0x0000D0, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D8, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000F0, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0001D8, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x0001E0, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_UserConstructionScript, CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast) == 0x0001E8, "Member 'BP_LocalWeatherCustomOverride_C_UserConstructionScript::CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast' has a wrong offset!");

// Function BP_LocalWeatherCustomOverride.BP_LocalWeatherCustomOverride_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LocalWeatherCustomOverride_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalWeatherCustomOverride_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LocalWeatherCustomOverride_C_ReceiveTick");
static_assert(sizeof(BP_LocalWeatherCustomOverride_C_ReceiveTick) == 0x000004, "Wrong size on BP_LocalWeatherCustomOverride_C_ReceiveTick");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LocalWeatherCustomOverride_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_LocalWeatherCustomOverride.BP_LocalWeatherCustomOverride_C.Initial Overlap
// 0x0008 (0x0008 - 0x0000)
struct BP_LocalWeatherCustomOverride_C_Initial_Overlap final
{
public:
	class AActor*                                 Player_Pawn_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalWeatherCustomOverride_C_Initial_Overlap) == 0x000008, "Wrong alignment on BP_LocalWeatherCustomOverride_C_Initial_Overlap");
static_assert(sizeof(BP_LocalWeatherCustomOverride_C_Initial_Overlap) == 0x000008, "Wrong size on BP_LocalWeatherCustomOverride_C_Initial_Overlap");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_Initial_Overlap, Player_Pawn_0) == 0x000000, "Member 'BP_LocalWeatherCustomOverride_C_Initial_Overlap::Player_Pawn_0' has a wrong offset!");

// Function BP_LocalWeatherCustomOverride.BP_LocalWeatherCustomOverride_C.ExecuteUbergraph_BP_LocalWeatherCustomOverride
// 0x0240 (0x0240 - 0x0000)
struct BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_WeatherEventInterface_C> K2Node_DynamicCast_AsBPI_Weather_Event_Interface; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0050(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AIntrepidSkyBase*                       CallFunc_GetIntrepidSkyInstance_IntrepidSky;       // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayer_Local_Player;               // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_166[0x2];                                      // 0x0166(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AIntrepidSkyBase*                       CallFunc_GetIntrepidSkyInstance_IntrepidSky_1;     // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_WeatherEventInterface_C> K2Node_DynamicCast_AsBPI_Weather_Event_Interface_1; // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_WeatherEventInterface_C> K2Node_DynamicCast_AsBPI_Weather_Event_Interface_2; // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_Component;                      // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0200(0x0010)(ReferenceParm)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Player_Pawn;                    // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayer_Local_Player_1;             // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_233[0x5];                                      // 0x0233(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride) == 0x000008, "Wrong alignment on BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride");
static_assert(sizeof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride) == 0x000240, "Wrong size on BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, EntryPoint) == 0x000000, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_DynamicCast_AsBPI_Weather_Event_Interface) == 0x000008, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_DynamicCast_AsBPI_Weather_Event_Interface' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000030, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000038, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000040, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000048, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_ComponentBoundEvent_bFromSweep) == 0x00004C, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_ComponentBoundEvent_SweepResult) == 0x000050, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_IsServer_ReturnValue) == 0x000138, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_Not_PreBool_ReturnValue) == 0x000139, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_GetIntrepidSkyInstance_IntrepidSky) == 0x000140, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_GetIntrepidSkyInstance_IntrepidSky' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000148, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_ComponentBoundEvent_OtherActor) == 0x000150, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_ComponentBoundEvent_OtherComp) == 0x000158, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000160, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_IsLocalPlayer_Local_Player) == 0x000164, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_IsLocalPlayer_Local_Player' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_IsServer_ReturnValue_1) == 0x000165, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_GetIntrepidSkyInstance_IntrepidSky_1) == 0x000168, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_GetIntrepidSkyInstance_IntrepidSky_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_Not_PreBool_ReturnValue_1) == 0x000170, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_DynamicCast_AsBPI_Weather_Event_Interface_1) == 0x000178, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_DynamicCast_AsBPI_Weather_Event_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_DynamicCast_bSuccess_1) == 0x000188, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_BooleanAND_ReturnValue) == 0x000189, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000190, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_GetClosestPointOnCollision_OutPointOnBody) == 0x0001A8, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_GetClosestPointOnCollision_OutPointOnBody' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_GetClosestPointOnCollision_ReturnValue) == 0x0001C0, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_GetClosestPointOnCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_DynamicCast_AsBPI_Weather_Event_Interface_2) == 0x0001C8, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_DynamicCast_AsBPI_Weather_Event_Interface_2' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_DynamicCast_bSuccess_2) == 0x0001D8, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001E0, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0001E8, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_CustomEvent_Component) == 0x0001F0, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_CustomEvent_Component' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_FClamp_ReturnValue) == 0x0001F8, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000200, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_FMin_ReturnValue) == 0x000210, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_Array_Get_Item) == 0x000218, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_Array_Length_ReturnValue) == 0x000220, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, K2Node_CustomEvent_Player_Pawn) == 0x000228, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::K2Node_CustomEvent_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_Less_IntInt_ReturnValue) == 0x000230, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_IsLocalPlayer_Local_Player_1) == 0x000231, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_IsLocalPlayer_Local_Player_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_BooleanAND_ReturnValue_1) == 0x000232, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000238, "Member 'BP_LocalWeatherCustomOverride_C_ExecuteUbergraph_BP_LocalWeatherCustomOverride::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_LocalWeatherCustomOverride.BP_LocalWeatherCustomOverride_C.Catch Initial Overlaps
// 0x0008 (0x0008 - 0x0000)
struct BP_LocalWeatherCustomOverride_C_Catch_Initial_Overlaps final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalWeatherCustomOverride_C_Catch_Initial_Overlaps) == 0x000008, "Wrong alignment on BP_LocalWeatherCustomOverride_C_Catch_Initial_Overlaps");
static_assert(sizeof(BP_LocalWeatherCustomOverride_C_Catch_Initial_Overlaps) == 0x000008, "Wrong size on BP_LocalWeatherCustomOverride_C_Catch_Initial_Overlaps");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_Catch_Initial_Overlaps, Component) == 0x000000, "Member 'BP_LocalWeatherCustomOverride_C_Catch_Initial_Overlaps::Component' has a wrong offset!");

// Function BP_LocalWeatherCustomOverride.BP_LocalWeatherCustomOverride_C.BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_LocalWeatherCustomOverride.BP_LocalWeatherCustomOverride_C.BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_LocalWeatherCustomOverride_C_BndEvt__BP_LocalWeatherCustomOverride_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
