#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MasterLightSource

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MasterLightSource.BP_MasterLightSource_C.DestroyAllLights
// 0x0002 (0x0002 - 0x0000)
struct BP_MasterLightSource_C_DestroyAllLights final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightSource_C_DestroyAllLights) == 0x000001, "Wrong alignment on BP_MasterLightSource_C_DestroyAllLights");
static_assert(sizeof(BP_MasterLightSource_C_DestroyAllLights) == 0x000002, "Wrong size on BP_MasterLightSource_C_DestroyAllLights");
static_assert(offsetof(BP_MasterLightSource_C_DestroyAllLights, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_MasterLightSource_C_DestroyAllLights::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_DestroyAllLights, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_MasterLightSource_C_DestroyAllLights::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_MasterLightSource.BP_MasterLightSource_C.ExecuteUbergraph_BP_MasterLightSource
// 0x0010 (0x0010 - 0x0000)
struct BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddComponentToMultiPosEvent_ReturnValue;  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource) == 0x000004, "Wrong alignment on BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource");
static_assert(sizeof(BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource) == 0x000010, "Wrong size on BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource");
static_assert(offsetof(BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource, EntryPoint) == 0x000000, "Member 'BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource, CallFunc_AddComponentToMultiPosEvent_ReturnValue) == 0x00000C, "Member 'BP_MasterLightSource_C_ExecuteUbergraph_BP_MasterLightSource::CallFunc_AddComponentToMultiPosEvent_ReturnValue' has a wrong offset!");

// Function BP_MasterLightSource.BP_MasterLightSource_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_MasterLightSource_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightSource_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_MasterLightSource_C_ReceiveTick");
static_assert(sizeof(BP_MasterLightSource_C_ReceiveTick) == 0x000004, "Wrong size on BP_MasterLightSource_C_ReceiveTick");
static_assert(offsetof(BP_MasterLightSource_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_MasterLightSource_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_MasterLightSource.BP_MasterLightSource_C.SetCurrentIntensity
// 0x0008 (0x0008 - 0x0000)
struct BP_MasterLightSource_C_SetCurrentIntensity final
{
public:
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightSource_C_SetCurrentIntensity) == 0x000004, "Wrong alignment on BP_MasterLightSource_C_SetCurrentIntensity");
static_assert(sizeof(BP_MasterLightSource_C_SetCurrentIntensity) == 0x000008, "Wrong size on BP_MasterLightSource_C_SetCurrentIntensity");
static_assert(offsetof(BP_MasterLightSource_C_SetCurrentIntensity, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000000, "Member 'BP_MasterLightSource_C_SetCurrentIntensity::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetCurrentIntensity, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000004, "Member 'BP_MasterLightSource_C_SetCurrentIntensity::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_MasterLightSource.BP_MasterLightSource_C.SetLightProperties
// 0x00C0 (0x00C0 - 0x0000)
struct BP_MasterLightSource_C_SetLightProperties final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    K2Node_DynamicCast_AsSpot_Light_Component;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0068(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOuterConeAngle_NewOuterConeAngle_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_ContactShadowLength_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetInnerConeAngle_NewInnerConeAngle_ImplicitCast; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetTemperature_NewTemperature_ImplicitCast; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColor_SetTemperature_InTemperature_ImplicitCast; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightSource_C_SetLightProperties) == 0x000008, "Wrong alignment on BP_MasterLightSource_C_SetLightProperties");
static_assert(sizeof(BP_MasterLightSource_C_SetLightProperties) == 0x0000C0, "Wrong size on BP_MasterLightSource_C_SetLightProperties");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_MasterLightSource_C_SetLightProperties::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000008, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, K2Node_DynamicCast_AsSpot_Light_Component) == 0x000020, "Member 'BP_MasterLightSource_C_SetLightProperties::K2Node_DynamicCast_AsSpot_Light_Component' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_MasterLightSource_C_SetLightProperties::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_FClamp_ReturnValue) == 0x000038, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000058, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_FClamp_ReturnValue_1) == 0x000060, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000068, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000078, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000080, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_SetOuterConeAngle_NewOuterConeAngle_ImplicitCast) == 0x000088, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_SetOuterConeAngle_NewOuterConeAngle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000090, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, K2Node_VariableSet_ContactShadowLength_ImplicitCast) == 0x000098, "Member 'BP_MasterLightSource_C_SetLightProperties::K2Node_VariableSet_ContactShadowLength_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x0000A0, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1) == 0x0000A8, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast) == 0x0000B0, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_SetInnerConeAngle_NewInnerConeAngle_ImplicitCast) == 0x0000B4, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_SetInnerConeAngle_NewInnerConeAngle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_SetTemperature_NewTemperature_ImplicitCast) == 0x0000B8, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_SetTemperature_NewTemperature_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetLightProperties, CallFunc_LinearColor_SetTemperature_InTemperature_ImplicitCast) == 0x0000BC, "Member 'BP_MasterLightSource_C_SetLightProperties::CallFunc_LinearColor_SetTemperature_InTemperature_ImplicitCast' has a wrong offset!");

// Function BP_MasterLightSource.BP_MasterLightSource_C.SetLightType
// 0x0001 (0x0001 - 0x0000)
struct BP_MasterLightSource_C_SetLightType final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightSource_C_SetLightType) == 0x000001, "Wrong alignment on BP_MasterLightSource_C_SetLightType");
static_assert(sizeof(BP_MasterLightSource_C_SetLightType) == 0x000001, "Wrong size on BP_MasterLightSource_C_SetLightType");
static_assert(offsetof(BP_MasterLightSource_C_SetLightType, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_MasterLightSource_C_SetLightType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_MasterLightSource.BP_MasterLightSource_C.SetMeshProperties
// 0x0020 (0x0020 - 0x0000)
struct BP_MasterLightSource_C_SetMeshProperties final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightSource_C_SetMeshProperties) == 0x000008, "Wrong alignment on BP_MasterLightSource_C_SetMeshProperties");
static_assert(sizeof(BP_MasterLightSource_C_SetMeshProperties) == 0x000020, "Wrong size on BP_MasterLightSource_C_SetMeshProperties");
static_assert(offsetof(BP_MasterLightSource_C_SetMeshProperties, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_MasterLightSource_C_SetMeshProperties::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetMeshProperties, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_MasterLightSource_C_SetMeshProperties::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightSource_C_SetMeshProperties, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_MasterLightSource_C_SetMeshProperties::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");

// Function BP_MasterLightSource.BP_MasterLightSource_C.SetTimeOfDayProperties
// 0x0001 (0x0001 - 0x0000)
struct BP_MasterLightSource_C_SetTimeOfDayProperties final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightSource_C_SetTimeOfDayProperties) == 0x000001, "Wrong alignment on BP_MasterLightSource_C_SetTimeOfDayProperties");
static_assert(sizeof(BP_MasterLightSource_C_SetTimeOfDayProperties) == 0x000001, "Wrong size on BP_MasterLightSource_C_SetTimeOfDayProperties");
static_assert(offsetof(BP_MasterLightSource_C_SetTimeOfDayProperties, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_MasterLightSource_C_SetTimeOfDayProperties::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_MasterLightSource.BP_MasterLightSource_C.UpdateLightOnValue
// 0x0008 (0x0008 - 0x0000)
struct BP_MasterLightSource_C_UpdateLightOnValue final
{
public:
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightSource_C_UpdateLightOnValue) == 0x000008, "Wrong alignment on BP_MasterLightSource_C_UpdateLightOnValue");
static_assert(sizeof(BP_MasterLightSource_C_UpdateLightOnValue) == 0x000008, "Wrong size on BP_MasterLightSource_C_UpdateLightOnValue");
static_assert(offsetof(BP_MasterLightSource_C_UpdateLightOnValue, CallFunc_Lerp_ReturnValue) == 0x000000, "Member 'BP_MasterLightSource_C_UpdateLightOnValue::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function BP_MasterLightSource.BP_MasterLightSource_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_MasterLightSource_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightSource_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_MasterLightSource_C_UserConstructionScript");
static_assert(sizeof(BP_MasterLightSource_C_UserConstructionScript) == 0x000008, "Wrong size on BP_MasterLightSource_C_UserConstructionScript");
static_assert(offsetof(BP_MasterLightSource_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_MasterLightSource_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

