#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MasterLightActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ENUM_SunPosition_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_LightTypeDefaults_structs.hpp"


namespace SDK::Params
{

// Function BP_MasterLightActor.BP_MasterLightActor_C.Add Mesh
// 0x0590 (0x0590 - 0x0000)
struct BP_MasterLightActor_C_Add_Mesh final
{
public:
	struct FTransform                             MainAttachTRANS;                                   // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             SupportAttachTRANS;                                // 0x0060(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasSupportMesh;                                    // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar_1;                                     // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   NewLocalVar_0;                                     // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0230(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue;            // 0x0290(0x0010)(ReferenceParm)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x02A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0308(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x03F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue_1;          // 0x0470(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0490(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x04F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x050A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x050B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x050C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D[0x3];                                      // 0x050D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0510(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0578(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0584(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0585(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_586[0x2];                                      // 0x0586(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x0588(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightActor_C_Add_Mesh) == 0x000010, "Wrong alignment on BP_MasterLightActor_C_Add_Mesh");
static_assert(sizeof(BP_MasterLightActor_C_Add_Mesh) == 0x000590, "Wrong size on BP_MasterLightActor_C_Add_Mesh");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, MainAttachTRANS) == 0x000000, "Member 'BP_MasterLightActor_C_Add_Mesh::MainAttachTRANS' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, SupportAttachTRANS) == 0x000060, "Member 'BP_MasterLightActor_C_Add_Mesh::SupportAttachTRANS' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, HasSupportMesh) == 0x0000C0, "Member 'BP_MasterLightActor_C_Add_Mesh::HasSupportMesh' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, NewLocalVar_1) == 0x0000C1, "Member 'BP_MasterLightActor_C_Add_Mesh::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, NewLocalVar_0) == 0x0000C8, "Member 'BP_MasterLightActor_C_Add_Mesh::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, Temp_int_Array_Index_Variable) == 0x0000D0, "Member 'BP_MasterLightActor_C_Add_Mesh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, Temp_int_Loop_Counter_Variable) == 0x0000D4, "Member 'BP_MasterLightActor_C_Add_Mesh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, Temp_int_Array_Index_Variable_1) == 0x000140, "Member 'BP_MasterLightActor_C_Add_Mesh::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, Temp_int_Loop_Counter_Variable_1) == 0x000144, "Member 'BP_MasterLightActor_C_Add_Mesh::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Add_IntInt_ReturnValue_1) == 0x000148, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, Temp_int_Array_Index_Variable_2) == 0x00014C, "Member 'BP_MasterLightActor_C_Add_Mesh::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, Temp_int_Loop_Counter_Variable_2) == 0x000150, "Member 'BP_MasterLightActor_C_Add_Mesh::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Add_IntInt_ReturnValue_2) == 0x000154, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000159, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_AddComponent_ReturnValue) == 0x000160, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000168, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_BreakTransform_Location) == 0x000170, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_BreakTransform_Rotation) == 0x000188, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_BreakTransform_Scale) == 0x0001A0, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_BreakTransform_Location_1) == 0x0001B8, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_BreakTransform_Rotation_1) == 0x0001D0, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_BreakTransform_Scale_1) == 0x0001E8, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_ComposeRotators_ReturnValue) == 0x000200, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000218, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_MakeTransform_ReturnValue_1) == 0x000230, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_GetAllSocketNames_ReturnValue) == 0x000290, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_GetAllSocketNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_ComposeTransforms_ReturnValue) == 0x0002A0, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Array_Get_Item) == 0x000300, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000308, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_GetSocketTransform_ReturnValue) == 0x0003F0, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Conv_NameToString_ReturnValue) == 0x000450, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Contains_ReturnValue) == 0x000460, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Array_Length_ReturnValue) == 0x000464, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Less_IntInt_ReturnValue) == 0x000468, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_GetAllSocketNames_ReturnValue_1) == 0x000470, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_GetAllSocketNames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Array_Get_Item_1) == 0x000480, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Array_Length_ReturnValue_1) == 0x000488, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000490, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Less_IntInt_ReturnValue_1) == 0x0004F0, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0004F8, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Contains_ReturnValue_1) == 0x000508, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_IsValid_ReturnValue_1) == 0x000509, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_IsValid_ReturnValue_2) == 0x00050A, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_SetStaticMesh_ReturnValue_1) == 0x00050B, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x00050C, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_MakeTransform_ReturnValue_2) == 0x000510, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_IsValid_ReturnValue_3) == 0x000570, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Array_Get_Item_2) == 0x000578, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Array_Length_ReturnValue_2) == 0x000580, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Less_IntInt_ReturnValue_2) == 0x000584, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_IsValid_ReturnValue_4) == 0x000585, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_AddComponent_ReturnValue_1) == 0x000588, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");

// Function BP_MasterLightActor.BP_MasterLightActor_C.Add Plane Emissive
// 0x0210 (0x0210 - 0x0000)
struct BP_MasterLightActor_C_Add_Plane_Emissive final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CallFunc_AddComponent_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        CallFunc_AddComponent_ReturnValue_1;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_ColorTempToRGB_Return_Color;              // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x1];                                      // 0x0153(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0xB];                                      // 0x0175(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0180(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_2;               // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ColorTempToRGB_Temp_ImplicitCast;         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_2; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightActor_C_Add_Plane_Emissive) == 0x000010, "Wrong alignment on BP_MasterLightActor_C_Add_Plane_Emissive");
static_assert(sizeof(BP_MasterLightActor_C_Add_Plane_Emissive) == 0x000210, "Wrong size on BP_MasterLightActor_C_Add_Plane_Emissive");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_MakeTransform_ReturnValue_1) == 0x000060, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_AddComponent_ReturnValue) == 0x0000C0, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_AddComponent_ReturnValue_1) == 0x0000C8, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_ColorTempToRGB_Return_Color) == 0x0000D0, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_ColorTempToRGB_Return_Color' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue) == 0x0000E0, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_IsWithEditor_ReturnValue) == 0x000150, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000151, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000152, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_BreakColor_R) == 0x000154, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_BreakColor_G) == 0x000158, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_BreakColor_B) == 0x00015C, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_BreakColor_A) == 0x000160, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000168, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000170, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000171, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x000172, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_BooleanOR_ReturnValue) == 0x000173, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_BooleanOR_ReturnValue_1) == 0x000174, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_ComposeTransforms_ReturnValue) == 0x000180, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_AddComponent_ReturnValue_2) == 0x0001E0, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_ColorTempToRGB_Temp_ImplicitCast) == 0x0001E8, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_ColorTempToRGB_Temp_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0001F0, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x0001F8, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1) == 0x000200, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_2) == 0x000208, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function BP_MasterLightActor.BP_MasterLightActor_C.Add Point
// 0x03B0 (0x03B0 - 0x0000)
struct BP_MasterLightActor_C_Add_Point final
{
public:
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_AdjustLightTransForWidgetOffset_ReturnValue; // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0xC];                                       // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x00A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0110(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x01C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalTransform_SweepHitResult;      // 0x0288(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightActor_C_Add_Point) == 0x000010, "Wrong alignment on BP_MasterLightActor_C_Add_Point");
static_assert(sizeof(BP_MasterLightActor_C_Add_Point) == 0x0003B0, "Wrong size on BP_MasterLightActor_C_Add_Point");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_Array_Add_ReturnValue) == 0x000000, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_AdjustLightTransForWidgetOffset_ReturnValue) == 0x000010, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_AdjustLightTransForWidgetOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000078, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000080, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, Temp_int_Loop_Counter_Variable) == 0x000084, "Member 'BP_MasterLightActor_C_Add_Point::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, Temp_int_Array_Index_Variable) == 0x000090, "Member 'BP_MasterLightActor_C_Add_Point::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_AddComponent_ReturnValue) == 0x000100, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_GetTransform_ReturnValue) == 0x000110, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_BreakTransform_Location) == 0x000170, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_BreakTransform_Rotation) == 0x000188, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_BreakTransform_Scale) == 0x0001A0, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_ComposeTransforms_ReturnValue) == 0x0001C0, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_BreakTransform_Location_1) == 0x000220, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_BreakTransform_Rotation_1) == 0x000238, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_BreakTransform_Scale_1) == 0x000250, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_Vector_Distance_ReturnValue) == 0x000268, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000270, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_IsValid_ReturnValue) == 0x000280, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000281, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_K2_AddLocalTransform_SweepHitResult) == 0x000288, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_K2_AddLocalTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, Temp_object_Variable) == 0x000370, "Member 'BP_MasterLightActor_C_Add_Point::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, Temp_object_Variable_1) == 0x000378, "Member 'BP_MasterLightActor_C_Add_Point::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, Temp_bool_Variable) == 0x000380, "Member 'BP_MasterLightActor_C_Add_Point::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, K2Node_Select_Default) == 0x000388, "Member 'BP_MasterLightActor_C_Add_Point::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000390, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000398, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00039C, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0003A0, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x0003A4, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");

// Function BP_MasterLightActor.BP_MasterLightActor_C.Add Sperical Emissive
// 0x0200 (0x0200 - 0x0000)
struct BP_MasterLightActor_C_Add_Sperical_Emissive final
{
public:
	struct FLinearColor                           Local_Color_From_Temp;                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_ColorTempToRGB_Return_Color;              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_ColorTempToRGB_Return_Color_1;            // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Check_if_Color_Overridden_Color;          // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Check_if_Color_Overridden_Color_1;        // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0xF];                                      // 0x0141(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0150(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ColorTempToRGB_Temp_ImplicitCast;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ColorTempToRGB_Temp_ImplicitCast_1;       // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_2; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightActor_C_Add_Sperical_Emissive) == 0x000010, "Wrong alignment on BP_MasterLightActor_C_Add_Sperical_Emissive");
static_assert(sizeof(BP_MasterLightActor_C_Add_Sperical_Emissive) == 0x000200, "Wrong size on BP_MasterLightActor_C_Add_Sperical_Emissive");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, Local_Color_From_Temp) == 0x000000, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::Local_Color_From_Temp' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, Temp_struct_Variable) == 0x000010, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, CallFunc_ColorTempToRGB_Return_Color) == 0x000078, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::CallFunc_ColorTempToRGB_Return_Color' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, CallFunc_ColorTempToRGB_Return_Color_1) == 0x00008C, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::CallFunc_ColorTempToRGB_Return_Color_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, CallFunc_IsValid_ReturnValue_1) == 0x00009C, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00009D, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
