#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MasterLightActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_SunPosition_structs.hpp"


namespace SDK::Params
{

// Function BP_MasterLightActor.BP_MasterLightActor_C.Add Mesh
// 0x0048 (0x0048 - 0x0000)
struct BP_MasterLightActor_C_Add_Mesh final
{
public:
	bool                                          NewLocalVar_1;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   NewLocalVar_0;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightActor_C_Add_Mesh) == 0x000008, "Wrong alignment on BP_MasterLightActor_C_Add_Mesh");
static_assert(sizeof(BP_MasterLightActor_C_Add_Mesh) == 0x000048, "Wrong size on BP_MasterLightActor_C_Add_Mesh");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, NewLocalVar_1) == 0x000000, "Member 'BP_MasterLightActor_C_Add_Mesh::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, NewLocalVar_0) == 0x000008, "Member 'BP_MasterLightActor_C_Add_Mesh::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_MasterLightActor_C_Add_Mesh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_MasterLightActor_C_Add_Mesh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000019, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_IsValid_ReturnValue_2) == 0x000021, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000022, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_IsValid_ReturnValue_3) == 0x000035, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Mesh, CallFunc_AddComponent_ReturnValue_1) == 0x000040, "Member 'BP_MasterLightActor_C_Add_Mesh::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");

// Function BP_MasterLightActor.BP_MasterLightActor_C.Add Plane Emissive
// 0x00F0 (0x00F0 - 0x0000)
struct BP_MasterLightActor_C_Add_Plane_Emissive final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CallFunc_AddComponent_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        CallFunc_AddComponent_ReturnValue_1;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_2;               // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightActor_C_Add_Plane_Emissive) == 0x000010, "Wrong alignment on BP_MasterLightActor_C_Add_Plane_Emissive");
static_assert(sizeof(BP_MasterLightActor_C_Add_Plane_Emissive) == 0x0000F0, "Wrong size on BP_MasterLightActor_C_Add_Plane_Emissive");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_MakeTransform_ReturnValue_1) == 0x000060, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_AddComponent_ReturnValue) == 0x0000C0, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_AddComponent_ReturnValue_1) == 0x0000C8, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_IsWithEditor_ReturnValue) == 0x0000D0, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000D1, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x0000D2, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D8, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Plane_Emissive, CallFunc_AddComponent_ReturnValue_2) == 0x0000E0, "Member 'BP_MasterLightActor_C_Add_Plane_Emissive::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");

// Function BP_MasterLightActor.BP_MasterLightActor_C.Add Point
// 0x01D0 (0x01D0 - 0x0000)
struct BP_MasterLightActor_C_Add_Point final
{
public:
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightActor_C_Add_Point) == 0x000010, "Wrong alignment on BP_MasterLightActor_C_Add_Point");
static_assert(sizeof(BP_MasterLightActor_C_Add_Point) == 0x0001D0, "Wrong size on BP_MasterLightActor_C_Add_Point");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_BreakTransform_Location) == 0x000070, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_ComposeTransforms_ReturnValue) == 0x0000C0, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_BreakTransform_Location_1) == 0x000120, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_BreakTransform_Rotation_1) == 0x000138, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_BreakTransform_Scale_1) == 0x000150, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_Vector_Distance_ReturnValue) == 0x000168, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000170, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_AddComponent_ReturnValue) == 0x000180, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_IsValid_ReturnValue) == 0x000188, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, Temp_object_Variable) == 0x000190, "Member 'BP_MasterLightActor_C_Add_Point::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, Temp_object_Variable_1) == 0x000198, "Member 'BP_MasterLightActor_C_Add_Point::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, Temp_bool_Variable) == 0x0001A0, "Member 'BP_MasterLightActor_C_Add_Point::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, K2Node_Select_Default) == 0x0001A8, "Member 'BP_MasterLightActor_C_Add_Point::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0001B0, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0001B8, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0001BC, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0001C0, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Point, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x0001C4, "Member 'BP_MasterLightActor_C_Add_Point::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");

// Function BP_MasterLightActor.BP_MasterLightActor_C.Add Sperical Emissive
// 0x0080 (0x0080 - 0x0000)
struct BP_MasterLightActor_C_Add_Sperical_Emissive final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightActor_C_Add_Sperical_Emissive) == 0x000010, "Wrong alignment on BP_MasterLightActor_C_Add_Sperical_Emissive");
static_assert(sizeof(BP_MasterLightActor_C_Add_Sperical_Emissive) == 0x000080, "Wrong size on BP_MasterLightActor_C_Add_Sperical_Emissive");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, CallFunc_IsWithEditor_ReturnValue) == 0x000068, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000069, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, CallFunc_AddComponent_ReturnValue_1) == 0x000070, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Sperical_Emissive, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000078, "Member 'BP_MasterLightActor_C_Add_Sperical_Emissive::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_MasterLightActor.BP_MasterLightActor_C.Add Spot
// 0x0020 (0x0020 - 0x0000)
struct BP_MasterLightActor_C_Add_Spot final
{
public:
	class USpotLightComponent*                    CallFunc_AddComponent_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightActor_C_Add_Spot) == 0x000008, "Wrong alignment on BP_MasterLightActor_C_Add_Spot");
static_assert(sizeof(BP_MasterLightActor_C_Add_Spot) == 0x000020, "Wrong size on BP_MasterLightActor_C_Add_Spot");
static_assert(offsetof(BP_MasterLightActor_C_Add_Spot, CallFunc_AddComponent_ReturnValue) == 0x000000, "Member 'BP_MasterLightActor_C_Add_Spot::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Spot, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_MasterLightActor_C_Add_Spot::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Spot, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_MasterLightActor_C_Add_Spot::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_Spot, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'BP_MasterLightActor_C_Add_Spot::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_MasterLightActor.BP_MasterLightActor_C.Add VFX Components
// 0x0030 (0x0030 - 0x0000)
struct BP_MasterLightActor_C_Add_VFX_Components final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_AddComponent_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightActor_C_Add_VFX_Components) == 0x000008, "Wrong alignment on BP_MasterLightActor_C_Add_VFX_Components");
static_assert(sizeof(BP_MasterLightActor_C_Add_VFX_Components) == 0x000030, "Wrong size on BP_MasterLightActor_C_Add_VFX_Components");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_MasterLightActor_C_Add_VFX_Components::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_MasterLightActor_C_Add_VFX_Components::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_MasterLightActor_C_Add_VFX_Components::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_MasterLightActor_C_Add_VFX_Components::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_MasterLightActor_C_Add_VFX_Components::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_MasterLightActor_C_Add_VFX_Components::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components, CallFunc_AddComponent_ReturnValue) == 0x000020, "Member 'BP_MasterLightActor_C_Add_VFX_Components::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'BP_MasterLightActor_C_Add_VFX_Components::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'BP_MasterLightActor_C_Add_VFX_Components::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MasterLightActor.BP_MasterLightActor_C.Add VFX Components at Sockets
// 0x0130 (0x0130 - 0x0000)
struct BP_MasterLightActor_C_Add_VFX_Components_at_Sockets final
{
public:
	int32                                         VFX_Socket_Count;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue;            // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0xB];                                       // 0x0045(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x00B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_AddComponent_ReturnValue;                 // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets) == 0x000010, "Wrong alignment on BP_MasterLightActor_C_Add_VFX_Components_at_Sockets");
static_assert(sizeof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets) == 0x000130, "Wrong size on BP_MasterLightActor_C_Add_VFX_Components_at_Sockets");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, VFX_Socket_Count) == 0x000000, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::VFX_Socket_Count' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, Temp_int_Variable) == 0x000014, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_GetAllSocketNames_ReturnValue) == 0x000028, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_GetAllSocketNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_Array_Get_Item_1) == 0x00003C, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_GetSocketTransform_ReturnValue) == 0x000050, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_ComposeTransforms_ReturnValue) == 0x0000B0, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_Conv_NameToString_ReturnValue) == 0x000110, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_AddComponent_ReturnValue) == 0x000120, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_Contains_ReturnValue) == 0x000128, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_Add_VFX_Components_at_Sockets, CallFunc_Array_Add_ReturnValue) == 0x00012C, "Member 'BP_MasterLightActor_C_Add_VFX_Components_at_Sockets::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_MasterLightActor.BP_MasterLightActor_C.ExecuteUbergraph_BP_MasterLightActor
// 0x01D0 (0x01D0 - 0x0000)
struct BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_SunPosition                              Temp_byte_Variable;                                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIntrepidSkyBase*                       CallFunc_GetIntrepidSkyInstance_IntrepidSky;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_VerraWorld_GlobalSky_C*             K2Node_DynamicCast_AsBP_Verra_World_Global_Sky;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_3;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_SunPosition                              Temp_byte_Variable_1;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             UniqueObjectNameForCooking_OutputDelegate;         // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIntrepidSkyBase*                       CallFunc_GetIntrepidSkyInstance_IntrepidSky_1;     // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VerraWorld_GlobalSky_C*             K2Node_DynamicCast_AsBP_Verra_World_Global_Sky_1;  // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_5;                              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_1;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddActorToMultiPosEvent_ReturnValue;      // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast;                      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_B_ImplicitCast_1;                    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast;       // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_1; // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast_1;     // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Transition_Alpha_ImplicitCast;  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor) == 0x000008, "Wrong alignment on BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor");
static_assert(sizeof(BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor) == 0x0001D0, "Wrong size on BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor");
static_assert(offsetof(BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor, EntryPoint) == 0x000000, "Member 'BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor, CallFunc_FCeil_ReturnValue) == 0x000004, "Member 'BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor, CallFunc_Conv_IntToBool_ReturnValue) == 0x000008, "Member 'BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor, Temp_real_Variable) == 0x00000C, "Member 'BP_MasterLightActor_C_ExecuteUbergraph_BP_MasterLightActor::Temp_real_Variable' has a wrong offset!");
