#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MvP_Freehold_01

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MvP_Freehold_01.BP_MvP_Freehold_01_C
// 0x00D0 (0x0440 - 0x0370)
class ABP_MvP_Freehold_01_C final : public AFreeholdActor
{
public:
	class UStaticMeshComponent*                   HuKaelar_Props_N3_Post_Tall2;                      // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HuKaelar_Props_N3_Post_Tall;                       // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HuKaelar_Props_N3_Post_Tall1;                      // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HuKaelar_Props_N3_Post_Tall5;                      // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HuKaelar_Props_N3_Post_Tall4;                      // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HuKaelar_Props_N3_Post_Tall3;                      // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          NavModVolume;                                      // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor___StorageChest;                         // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor___Well;                                 // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor___House;                                // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        BP_RVTDecal30_Arrow;                               // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    BP_RVTDecal30_Billboard;                           // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_RVTDecal30_Decal;                               // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_RVTDecal30_HideGrassDecal;                      // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_RVTDecal30_DefaultSceneRoot;                    // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        BP_RVTDecal31_Arrow;                               // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    BP_RVTDecal31_Billboard;                           // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_RVTDecal31_Decal;                               // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_RVTDecal31_HideGrassDecal;                      // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_RVTDecal31_DefaultSceneRoot;                    // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        BP_RVTDecal29_Arrow;                               // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    BP_RVTDecal29_Billboard;                           // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_RVTDecal29_Decal;                               // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_RVTDecal29_HideGrassDecal;                      // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_RVTDecal29_DefaultSceneRoot;                    // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MvP_Freehold_01_C">();
	}
	static class ABP_MvP_Freehold_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MvP_Freehold_01_C>();
	}
};
static_assert(alignof(ABP_MvP_Freehold_01_C) == 0x000008, "Wrong alignment on ABP_MvP_Freehold_01_C");
static_assert(sizeof(ABP_MvP_Freehold_01_C) == 0x000440, "Wrong size on ABP_MvP_Freehold_01_C");
static_assert(offsetof(ABP_MvP_Freehold_01_C, HuKaelar_Props_N3_Post_Tall2) == 0x000370, "Member 'ABP_MvP_Freehold_01_C::HuKaelar_Props_N3_Post_Tall2' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, HuKaelar_Props_N3_Post_Tall) == 0x000378, "Member 'ABP_MvP_Freehold_01_C::HuKaelar_Props_N3_Post_Tall' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, HuKaelar_Props_N3_Post_Tall1) == 0x000380, "Member 'ABP_MvP_Freehold_01_C::HuKaelar_Props_N3_Post_Tall1' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, HuKaelar_Props_N3_Post_Tall5) == 0x000388, "Member 'ABP_MvP_Freehold_01_C::HuKaelar_Props_N3_Post_Tall5' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, HuKaelar_Props_N3_Post_Tall4) == 0x000390, "Member 'ABP_MvP_Freehold_01_C::HuKaelar_Props_N3_Post_Tall4' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, HuKaelar_Props_N3_Post_Tall3) == 0x000398, "Member 'ABP_MvP_Freehold_01_C::HuKaelar_Props_N3_Post_Tall3' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, NavModVolume) == 0x0003A0, "Member 'ABP_MvP_Freehold_01_C::NavModVolume' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, ChildActor___StorageChest) == 0x0003A8, "Member 'ABP_MvP_Freehold_01_C::ChildActor___StorageChest' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, ChildActor___Well) == 0x0003B0, "Member 'ABP_MvP_Freehold_01_C::ChildActor___Well' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, ChildActor___House) == 0x0003B8, "Member 'ABP_MvP_Freehold_01_C::ChildActor___House' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal30_Arrow) == 0x0003C0, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal30_Arrow' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal30_Billboard) == 0x0003C8, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal30_Billboard' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal30_Decal) == 0x0003D0, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal30_Decal' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal30_HideGrassDecal) == 0x0003D8, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal30_HideGrassDecal' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal30_DefaultSceneRoot) == 0x0003E0, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal30_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal31_Arrow) == 0x0003E8, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal31_Arrow' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal31_Billboard) == 0x0003F0, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal31_Billboard' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal31_Decal) == 0x0003F8, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal31_Decal' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal31_HideGrassDecal) == 0x000400, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal31_HideGrassDecal' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal31_DefaultSceneRoot) == 0x000408, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal31_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal29_Arrow) == 0x000410, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal29_Arrow' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal29_Billboard) == 0x000418, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal29_Billboard' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal29_Decal) == 0x000420, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal29_Decal' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal29_HideGrassDecal) == 0x000428, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal29_HideGrassDecal' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, BP_RVTDecal29_DefaultSceneRoot) == 0x000430, "Member 'ABP_MvP_Freehold_01_C::BP_RVTDecal29_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MvP_Freehold_01_C, SharedRoot) == 0x000438, "Member 'ABP_MvP_Freehold_01_C::SharedRoot' has a wrong offset!");

}

