#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NodeTree_Blueprint

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_NodeTree_Blueprint.BP_NodeTree_Blueprint_C.ExecuteUbergraph_BP_NodeTree_Blueprint
// 0x002C (0x002C - 0x0000)
struct BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint) == 0x000004, "Wrong alignment on BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint");
static_assert(sizeof(BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint) == 0x00002C, "Wrong size on BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint");
static_assert(offsetof(BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint, EntryPoint) == 0x000000, "Member 'BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint, Temp_delegate_Variable) == 0x000004, "Member 'BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint, CallFunc_PostAkEvent_ReturnValue) == 0x000024, "Member 'BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint, CallFunc_PostAkEvent_ReturnValue_1) == 0x000028, "Member 'BP_NodeTree_Blueprint_C_ExecuteUbergraph_BP_NodeTree_Blueprint::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

}

