#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NodeTree_DEAD_Blueprint

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NodeTree_DEAD_Blueprint.BP_NodeTree_DEAD_Blueprint_C
// 0x0068 (0x03B0 - 0x0348)
class ABP_NodeTree_DEAD_Blueprint_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_CorruptionPlane_small_6_StaticMeshComponent0;   // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorruptionPlane_small_7_StaticMeshComponent0;   // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   NodeTree_DEAD_roots_StaticMeshComponent0;          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorruptionPlane_small_5_StaticMeshComponent0;   // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorruptionPlane_small_4_StaticMeshComponent0;   // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   NodeTree_DEAD_roots2_StaticMeshComponent0;         // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorruptionPlane_small_01_StaticMeshComponent0;  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorruptionPlane_small_2_StaticMeshComponent0;   // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorruptionPlane_small_3_StaticMeshComponent0;   // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FX_Water_Plane_27_StaticMeshComponent0;         // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   NodeTree_DEAD_StaticMeshComponent0;                // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   NodeTree_corruption_Merged_StaticMeshComponent0;   // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NodeTree_DEAD_Blueprint_C">();
	}
	static class ABP_NodeTree_DEAD_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NodeTree_DEAD_Blueprint_C>();
	}
};
static_assert(alignof(ABP_NodeTree_DEAD_Blueprint_C) == 0x000008, "Wrong alignment on ABP_NodeTree_DEAD_Blueprint_C");
static_assert(sizeof(ABP_NodeTree_DEAD_Blueprint_C) == 0x0003B0, "Wrong size on ABP_NodeTree_DEAD_Blueprint_C");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, SM_CorruptionPlane_small_6_StaticMeshComponent0) == 0x000348, "Member 'ABP_NodeTree_DEAD_Blueprint_C::SM_CorruptionPlane_small_6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, SM_CorruptionPlane_small_7_StaticMeshComponent0) == 0x000350, "Member 'ABP_NodeTree_DEAD_Blueprint_C::SM_CorruptionPlane_small_7_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, NodeTree_DEAD_roots_StaticMeshComponent0) == 0x000358, "Member 'ABP_NodeTree_DEAD_Blueprint_C::NodeTree_DEAD_roots_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, SM_CorruptionPlane_small_5_StaticMeshComponent0) == 0x000360, "Member 'ABP_NodeTree_DEAD_Blueprint_C::SM_CorruptionPlane_small_5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, SM_CorruptionPlane_small_4_StaticMeshComponent0) == 0x000368, "Member 'ABP_NodeTree_DEAD_Blueprint_C::SM_CorruptionPlane_small_4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, NodeTree_DEAD_roots2_StaticMeshComponent0) == 0x000370, "Member 'ABP_NodeTree_DEAD_Blueprint_C::NodeTree_DEAD_roots2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, SM_CorruptionPlane_small_01_StaticMeshComponent0) == 0x000378, "Member 'ABP_NodeTree_DEAD_Blueprint_C::SM_CorruptionPlane_small_01_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, SM_CorruptionPlane_small_2_StaticMeshComponent0) == 0x000380, "Member 'ABP_NodeTree_DEAD_Blueprint_C::SM_CorruptionPlane_small_2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, SM_CorruptionPlane_small_3_StaticMeshComponent0) == 0x000388, "Member 'ABP_NodeTree_DEAD_Blueprint_C::SM_CorruptionPlane_small_3_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, SM_FX_Water_Plane_27_StaticMeshComponent0) == 0x000390, "Member 'ABP_NodeTree_DEAD_Blueprint_C::SM_FX_Water_Plane_27_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, NodeTree_DEAD_StaticMeshComponent0) == 0x000398, "Member 'ABP_NodeTree_DEAD_Blueprint_C::NodeTree_DEAD_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, NodeTree_corruption_Merged_StaticMeshComponent0) == 0x0003A0, "Member 'ABP_NodeTree_DEAD_Blueprint_C::NodeTree_corruption_Merged_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_NodeTree_DEAD_Blueprint_C, SharedRoot) == 0x0003A8, "Member 'ABP_NodeTree_DEAD_Blueprint_C::SharedRoot' has a wrong offset!");

}

