#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NodeRoadProxy

#include "Basic.hpp"

#include "S_RoadSetDressingData_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NodeRoadProxy.BP_NodeRoadProxy_C
// 0x0110 (0x0458 - 0x0348)
class ABP_NodeRoadProxy_C final : public AActor
{
public:
	class UBillboardComponent*                    Billboard;                                         // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UObject*                                NodeLayoutToolManagerInterface;                    // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPCGComponent*                          Active_PCG_Comp;                                   // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPCGGraphInstance*                      Graph;                                             // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FS_RoadSetDressingData                 Road_Set_Dressing_Data;                            // 0x0378(0x00D8)(Edit, BlueprintVisible, HasGetValueTypeHash)
	ESplineCoordinateSpace                        Coordinate_Space;                                  // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Apply_PCG_Data();
	void Clear_All_PCG_Data();
	void Create_Spline(class USplineComponent* In_Spline);
	void Update_PCG_Data(const struct FS_RoadSetDressingData& S_RoadSetDressingData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NodeRoadProxy_C">();
	}
	static class ABP_NodeRoadProxy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NodeRoadProxy_C>();
	}
};
static_assert(alignof(ABP_NodeRoadProxy_C) == 0x000008, "Wrong alignment on ABP_NodeRoadProxy_C");
static_assert(sizeof(ABP_NodeRoadProxy_C) == 0x000458, "Wrong size on ABP_NodeRoadProxy_C");
static_assert(offsetof(ABP_NodeRoadProxy_C, Billboard) == 0x000348, "Member 'ABP_NodeRoadProxy_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_NodeRoadProxy_C, NodeLayoutToolManagerInterface) == 0x000350, "Member 'ABP_NodeRoadProxy_C::NodeLayoutToolManagerInterface' has a wrong offset!");
static_assert(offsetof(ABP_NodeRoadProxy_C, Spline) == 0x000358, "Member 'ABP_NodeRoadProxy_C::Spline' has a wrong offset!");
static_assert(offsetof(ABP_NodeRoadProxy_C, DefaultSceneRoot) == 0x000360, "Member 'ABP_NodeRoadProxy_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_NodeRoadProxy_C, Active_PCG_Comp) == 0x000368, "Member 'ABP_NodeRoadProxy_C::Active_PCG_Comp' has a wrong offset!");
static_assert(offsetof(ABP_NodeRoadProxy_C, Graph) == 0x000370, "Member 'ABP_NodeRoadProxy_C::Graph' has a wrong offset!");
static_assert(offsetof(ABP_NodeRoadProxy_C, Road_Set_Dressing_Data) == 0x000378, "Member 'ABP_NodeRoadProxy_C::Road_Set_Dressing_Data' has a wrong offset!");
static_assert(offsetof(ABP_NodeRoadProxy_C, Coordinate_Space) == 0x000450, "Member 'ABP_NodeRoadProxy_C::Coordinate_Space' has a wrong offset!");

}

