#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PCG_FoliagePlacementTool

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_PCGFoliageAsset_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PCG_FoliagePlacementTool.BP_PCG_FoliagePlacementTool_C.Choose Foliage
// 0x0080 (0x0080 - 0x0000)
struct BP_PCG_FoliagePlacementTool_C_Choose_Foliage final
{
public:
	class UDataTable*                             ActiveDataTable;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0010(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_PCGFoliageAsset                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFoliageType_InstancedStaticMesh*       K2Node_DynamicCast_AsFoliage_Type_Instanced_Static_Mesh; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage) == 0x000008, "Wrong alignment on BP_PCG_FoliagePlacementTool_C_Choose_Foliage");
static_assert(sizeof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage) == 0x000080, "Wrong size on BP_PCG_FoliagePlacementTool_C_Choose_Foliage");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, ActiveDataTable) == 0x000000, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::ActiveDataTable' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000010, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000050, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000058, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, K2Node_DynamicCast_AsFoliage_Type_Instanced_Static_Mesh) == 0x000060, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::K2Node_DynamicCast_AsFoliage_Type_Instanced_Static_Mesh' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Choose_Foliage, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'BP_PCG_FoliagePlacementTool_C_Choose_Foliage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PCG_FoliagePlacementTool.BP_PCG_FoliagePlacementTool_C.Find Box Extent from Spline
// 0x0300 (0x0300 - 0x0000)
struct BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline final
{
public:
	struct FVector                                SplinePointMinVector;                              // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SplinePointMaxVector;                              // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Index;                                     // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue_1;        // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_2;                       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_2;   // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x01E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_2;                       // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline) == 0x000008, "Wrong alignment on BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline");
static_assert(sizeof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline) == 0x000300, "Wrong size on BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, SplinePointMinVector) == 0x000000, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::SplinePointMinVector' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, SplinePointMaxVector) == 0x000018, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::SplinePointMaxVector' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, Current_Index) == 0x000030, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::Current_Index' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, Temp_int_Variable) == 0x000034, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000040, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000058, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000070, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_X) == 0x000088, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Y) == 0x000090, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Z) == 0x000098, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_Divide_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000D0, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_Divide_VectorVector_ReturnValue_1) == 0x0000E8, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_Divide_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000100, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000118, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_X_1) == 0x000130, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Y_1) == 0x000138, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Z_1) == 0x000140, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_X_2) == 0x000148, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Y_2) == 0x000150, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Z_2) == 0x000158, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_FMax_ReturnValue) == 0x000160, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x000168, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_FMax_ReturnValue_1) == 0x000180, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_FMax_ReturnValue_2) == 0x000188, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_MakeVector_ReturnValue) == 0x000190, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue_2) == 0x0001A8, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_X_3) == 0x0001C0, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Y_3) == 0x0001C8, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Z_3) == 0x0001D0, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_FMin_ReturnValue) == 0x0001D8, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0001E0, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_FMin_ReturnValue_1) == 0x0002C8, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_FMin_ReturnValue_2) == 0x0002D0, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_FMin_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_MakeVector_ReturnValue_1) == 0x0002D8, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0002F0, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_Subtract_IntInt_ReturnValue) == 0x0002F4, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002F8, "Member 'BP_PCG_FoliagePlacementTool_C_Find_Box_Extent_from_Spline::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PCG_FoliagePlacementTool.BP_PCG_FoliagePlacementTool_C.Override Spline
// 0x0188 (0x0188 - 0x0000)
struct BP_PCG_FoliagePlacementTool_C_Override_Spline final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0020(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_1;    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PCG_FoliagePlacementTool_C_Override_Spline) == 0x000008, "Wrong alignment on BP_PCG_FoliagePlacementTool_C_Override_Spline");
static_assert(sizeof(BP_PCG_FoliagePlacementTool_C_Override_Spline) == 0x000188, "Wrong size on BP_PCG_FoliagePlacementTool_C_Override_Spline");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, Temp_int_Variable) == 0x00000C, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000010, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000020, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000108, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_GetNumberOfSplinePoints_ReturnValue_1) == 0x00010C, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_GetNumberOfSplinePoints_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000110, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000118, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x000130, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_Array_Get_Item) == 0x000138, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_Array_Length_ReturnValue) == 0x000150, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_Less_IntInt_ReturnValue) == 0x000154, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_Array_Get_Item_1) == 0x000158, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Override_Spline, CallFunc_Array_Get_Item_2) == 0x000170, "Member 'BP_PCG_FoliagePlacementTool_C_Override_Spline::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function BP_PCG_FoliagePlacementTool.BP_PCG_FoliagePlacementTool_C.Randomize Seed
// 0x0004 (0x0004 - 0x0000)
struct BP_PCG_FoliagePlacementTool_C_Randomize_Seed final
{
public:
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PCG_FoliagePlacementTool_C_Randomize_Seed) == 0x000004, "Wrong alignment on BP_PCG_FoliagePlacementTool_C_Randomize_Seed");
static_assert(sizeof(BP_PCG_FoliagePlacementTool_C_Randomize_Seed) == 0x000004, "Wrong size on BP_PCG_FoliagePlacementTool_C_Randomize_Seed");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Randomize_Seed, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000000, "Member 'BP_PCG_FoliagePlacementTool_C_Randomize_Seed::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");

// Function BP_PCG_FoliagePlacementTool.BP_PCG_FoliagePlacementTool_C.Set Graph Foliage
// 0x0080 (0x0080 - 0x0000)
struct BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFoliageType_InstancedStaticMesh*       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0050(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage) == 0x000008, "Wrong alignment on BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage");
static_assert(sizeof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage) == 0x000080, "Wrong size on BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage, CallFunc_MakeLiteralString_ReturnValue) == 0x000010, "Member 'BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage, CallFunc_GetSubstring_ReturnValue) == 0x000020, "Member 'BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage, CallFunc_Conv_StringToName_ReturnValue) == 0x000048, "Member 'BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000050, "Member 'BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'BP_PCG_FoliagePlacementTool_C_Set_Graph_Foliage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PCG_FoliagePlacementTool.BP_PCG_FoliagePlacementTool_C.Set Graph Parameters
// 0x0004 (0x0004 - 0x0000)
struct BP_PCG_FoliagePlacementTool_C_Set_Graph_Parameters final
{
public:
	float                                         CallFunc_SetFloatParameter_Value_ImplicitCast;     // 0x0000(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Parameters) == 0x000004, "Wrong alignment on BP_PCG_FoliagePlacementTool_C_Set_Graph_Parameters");
static_assert(sizeof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Parameters) == 0x000004, "Wrong size on BP_PCG_FoliagePlacementTool_C_Set_Graph_Parameters");
static_assert(offsetof(BP_PCG_FoliagePlacementTool_C_Set_Graph_Parameters, CallFunc_SetFloatParameter_Value_ImplicitCast) == 0x000000, "Member 'BP_PCG_FoliagePlacementTool_C_Set_Graph_Parameters::CallFunc_SetFloatParameter_Value_ImplicitCast' has a wrong offset!");

}

