#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PinkeningSwitcher

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PinkeningSwitcher.BP_PinkeningSwitcher_C.ExecuteUbergraph_BP_PinkeningSwitcher
// 0x0004 (0x0004 - 0x0000)
struct BP_PinkeningSwitcher_C_ExecuteUbergraph_BP_PinkeningSwitcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PinkeningSwitcher_C_ExecuteUbergraph_BP_PinkeningSwitcher) == 0x000004, "Wrong alignment on BP_PinkeningSwitcher_C_ExecuteUbergraph_BP_PinkeningSwitcher");
static_assert(sizeof(BP_PinkeningSwitcher_C_ExecuteUbergraph_BP_PinkeningSwitcher) == 0x000004, "Wrong size on BP_PinkeningSwitcher_C_ExecuteUbergraph_BP_PinkeningSwitcher");
static_assert(offsetof(BP_PinkeningSwitcher_C_ExecuteUbergraph_BP_PinkeningSwitcher, EntryPoint) == 0x000000, "Member 'BP_PinkeningSwitcher_C_ExecuteUbergraph_BP_PinkeningSwitcher::EntryPoint' has a wrong offset!");

// Function BP_PinkeningSwitcher.BP_PinkeningSwitcher_C.CheckPinken
// 0x0028 (0x0028 - 0x0000)
struct BP_PinkeningSwitcher_C_CheckPinken final
{
public:
	double                                        Enable;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PinkeningSwitcher_C_CheckPinken) == 0x000008, "Wrong alignment on BP_PinkeningSwitcher_C_CheckPinken");
static_assert(sizeof(BP_PinkeningSwitcher_C_CheckPinken) == 0x000028, "Wrong size on BP_PinkeningSwitcher_C_CheckPinken");
static_assert(offsetof(BP_PinkeningSwitcher_C_CheckPinken, Enable) == 0x000000, "Member 'BP_PinkeningSwitcher_C_CheckPinken::Enable' has a wrong offset!");
static_assert(offsetof(BP_PinkeningSwitcher_C_CheckPinken, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_PinkeningSwitcher_C_CheckPinken::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PinkeningSwitcher_C_CheckPinken, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_PinkeningSwitcher_C_CheckPinken::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PinkeningSwitcher_C_CheckPinken, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'BP_PinkeningSwitcher_C_CheckPinken::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PinkeningSwitcher_C_CheckPinken, CallFunc_IsWithEditor_ReturnValue) == 0x000020, "Member 'BP_PinkeningSwitcher_C_CheckPinken::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PinkeningSwitcher_C_CheckPinken, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000024, "Member 'BP_PinkeningSwitcher_C_CheckPinken::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

}

