#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Fireball

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Projectile_Fireball.BP_Projectile_Fireball_C.ExecuteUbergraph_BP_Projectile_Fireball
// 0x0010 (0x0010 - 0x0000)
struct BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball) == 0x000004, "Wrong alignment on BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball");
static_assert(sizeof(BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball) == 0x000010, "Wrong size on BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball");
static_assert(offsetof(BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball, EntryPoint) == 0x000000, "Member 'BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball, CallFunc_IsServer_ReturnValue) == 0x00000C, "Member 'BP_Projectile_Fireball_C_ExecuteUbergraph_BP_Projectile_Fireball::CallFunc_IsServer_ReturnValue' has a wrong offset!");

// Function BP_Projectile_Fireball.BP_Projectile_Fireball_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Projectile_Fireball_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_Fireball_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Projectile_Fireball_C_ReceiveTick");
static_assert(sizeof(BP_Projectile_Fireball_C_ReceiveTick) == 0x000004, "Wrong size on BP_Projectile_Fireball_C_ReceiveTick");
static_assert(offsetof(BP_Projectile_Fireball_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Projectile_Fireball_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

