#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Nova

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projectile_Nova.BP_Projectile_Nova_C
// 0x0018 (0x05B0 - 0x0598)
class ABP_Projectile_Nova_C final : public AAoCAbilityProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Projectile_Nova(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projectile_Nova_C">();
	}
	static class ABP_Projectile_Nova_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projectile_Nova_C>();
	}
};
static_assert(alignof(ABP_Projectile_Nova_C) == 0x000008, "Wrong alignment on ABP_Projectile_Nova_C");
static_assert(sizeof(ABP_Projectile_Nova_C) == 0x0005B0, "Wrong size on ABP_Projectile_Nova_C");
static_assert(offsetof(ABP_Projectile_Nova_C, UberGraphFrame) == 0x000598, "Member 'ABP_Projectile_Nova_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Nova_C, ParticleSystem) == 0x0005A0, "Member 'ABP_Projectile_Nova_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Nova_C, Scale) == 0x0005A8, "Member 'ABP_Projectile_Nova_C::Scale' has a wrong offset!");

}

