#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RoadTrackDecal

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_RoadTrackDecal.BP_RoadTrackDecal_C.ExecuteUbergraph_BP_RoadTrackDecal
// 0x00B0 (0x00B0 - 0x0000)
struct BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_RoadSetDressingTrackDecal_C> UniqueObjectNameForCooking_AsBPI_Road_Set_Dressing_Track_Decal; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueObjectNameForCooking_bSuccess;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UMaterialInterface>> CallFunc_Get_Decal_Data_Decals;                 // 0x0028(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_GetDecalMaterial_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0040(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      CallFunc_Array_Get_Item;                           // 0x0068(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_SoftObjectReference_ReturnValue; // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     UniqueObjectNameForCooking_AsMaterial_Interface;   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueObjectNameForCooking_bSuccess_1;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal) == 0x000008, "Wrong alignment on BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal");
static_assert(sizeof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal) == 0x0000B0, "Wrong size on BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, EntryPoint) == 0x000000, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, CallFunc_GetAttachParentActor_ReturnValue) == 0x000008, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, UniqueObjectNameForCooking_AsBPI_Road_Set_Dressing_Track_Decal) == 0x000010, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::UniqueObjectNameForCooking_AsBPI_Road_Set_Dressing_Track_Decal' has a wrong offset!");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, UniqueObjectNameForCooking_bSuccess) == 0x000020, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::UniqueObjectNameForCooking_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, CallFunc_Get_Decal_Data_Decals) == 0x000028, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::CallFunc_Get_Decal_Data_Decals' has a wrong offset!");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, CallFunc_GetDecalMaterial_ReturnValue) == 0x000038, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::CallFunc_GetDecalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000040, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000090, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, CallFunc_NotEqual_SoftObjectReference_ReturnValue) == 0x000091, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::CallFunc_NotEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000098, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, UniqueObjectNameForCooking_AsMaterial_Interface) == 0x0000A0, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::UniqueObjectNameForCooking_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal, UniqueObjectNameForCooking_bSuccess_1) == 0x0000A8, "Member 'BP_RoadTrackDecal_C_ExecuteUbergraph_BP_RoadTrackDecal::UniqueObjectNameForCooking_bSuccess_1' has a wrong offset!");

// Function BP_RoadTrackDecal.BP_RoadTrackDecal_C.Get Decal Data
// 0x0010 (0x0010 - 0x0000)
struct BP_RoadTrackDecal_C_Get_Decal_Data final
{
public:
	TArray<TSoftObjectPtr<class UMaterialInterface>> Decals;                                         // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_RoadTrackDecal_C_Get_Decal_Data) == 0x000008, "Wrong alignment on BP_RoadTrackDecal_C_Get_Decal_Data");
static_assert(sizeof(BP_RoadTrackDecal_C_Get_Decal_Data) == 0x000010, "Wrong size on BP_RoadTrackDecal_C_Get_Decal_Data");
static_assert(offsetof(BP_RoadTrackDecal_C_Get_Decal_Data, Decals) == 0x000000, "Member 'BP_RoadTrackDecal_C_Get_Decal_Data::Decals' has a wrong offset!");

}

