#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rogue_ShadowArena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Rogue_ShadowArena.BP_Rogue_ShadowArena_C
// 0x0038 (0x0548 - 0x0510)
class ABP_Rogue_ShadowArena_C final : public AAoCAbilityLingeringEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   WALL6;                                             // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        InitialZ;                                          // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetZ;                                           // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TravelTime;                                        // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Speed2;                                            // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TotalTime;                                         // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Rogue_ShadowArena(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Rogue_ShadowArena_C">();
	}
	static class ABP_Rogue_ShadowArena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Rogue_ShadowArena_C>();
	}
};
static_assert(alignof(ABP_Rogue_ShadowArena_C) == 0x000008, "Wrong alignment on ABP_Rogue_ShadowArena_C");
static_assert(sizeof(ABP_Rogue_ShadowArena_C) == 0x000548, "Wrong size on ABP_Rogue_ShadowArena_C");
static_assert(offsetof(ABP_Rogue_ShadowArena_C, UberGraphFrame) == 0x000510, "Member 'ABP_Rogue_ShadowArena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Rogue_ShadowArena_C, WALL6) == 0x000518, "Member 'ABP_Rogue_ShadowArena_C::WALL6' has a wrong offset!");
static_assert(offsetof(ABP_Rogue_ShadowArena_C, InitialZ) == 0x000520, "Member 'ABP_Rogue_ShadowArena_C::InitialZ' has a wrong offset!");
static_assert(offsetof(ABP_Rogue_ShadowArena_C, TargetZ) == 0x000528, "Member 'ABP_Rogue_ShadowArena_C::TargetZ' has a wrong offset!");
static_assert(offsetof(ABP_Rogue_ShadowArena_C, TravelTime) == 0x000530, "Member 'ABP_Rogue_ShadowArena_C::TravelTime' has a wrong offset!");
static_assert(offsetof(ABP_Rogue_ShadowArena_C, Speed2) == 0x000538, "Member 'ABP_Rogue_ShadowArena_C::Speed2' has a wrong offset!");
static_assert(offsetof(ABP_Rogue_ShadowArena_C, TotalTime) == 0x000540, "Member 'ABP_Rogue_ShadowArena_C::TotalTime' has a wrong offset!");

}

