#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rogue_ShadowArena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Rogue_ShadowArena.BP_Rogue_ShadowArena_C.ExecuteUbergraph_BP_Rogue_ShadowArena
// 0x0260 (0x0260 - 0x0000)
struct BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_2;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0xF];                                      // 0x0101(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0110(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_5;                          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_5;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_5;                          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue_1;          // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena) == 0x000010, "Wrong alignment on BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena");
static_assert(sizeof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena) == 0x000260, "Wrong size on BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, EntryPoint) == 0x000000, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000006, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x000007, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, Temp_bool_Has_Been_Initd_Variable_1) == 0x000008, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, Temp_bool_IsClosed_Variable_1) == 0x000028, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, K2Node_Event_EndPlayReason) == 0x0000A0, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, K2Node_SwitchEnum_CmpSuccess) == 0x0000A1, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_X) == 0x0000A8, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_Y) == 0x0000B0, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_Z) == 0x0000B8, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_X_1) == 0x0000C0, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_Y_1) == 0x0000C8, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_Z_1) == 0x0000D0, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0000D8, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_X_2) == 0x0000E0, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_Y_2) == 0x0000E8, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_Z_2) == 0x0000F0, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000100, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_GetTransform_ReturnValue_1) == 0x000110, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_X_3) == 0x000170, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_Y_3) == 0x000178, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_Z_3) == 0x000180, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_X_4) == 0x000188, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_Y_4) == 0x000190, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_Z_4) == 0x000198, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0001A0, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_FClamp_ReturnValue) == 0x0001A8, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_X_5) == 0x0001B0, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_X_5' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_Y_5) == 0x0001B8, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_Y_5' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_BreakVector_Z_5) == 0x0001C0, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_BreakVector_Z_5' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_MakeVector_ReturnValue) == 0x0001C8, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_TransformLocation_ReturnValue) == 0x0001E0, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_NearlyEqual_FloatFloat_ReturnValue_1) == 0x0001F8, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_NearlyEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000200, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000208, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_FClamp_ReturnValue_1) == 0x000210, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_MakeVector_ReturnValue_1) == 0x000218, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_TransformLocation_ReturnValue_1) == 0x000230, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_TransformLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000248, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000250, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000258, "Member 'BP_Rogue_ShadowArena_C_ExecuteUbergraph_BP_Rogue_ShadowArena::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function BP_Rogue_ShadowArena.BP_Rogue_ShadowArena_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Rogue_ShadowArena_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Rogue_ShadowArena_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Rogue_ShadowArena_C_ReceiveEndPlay");
static_assert(sizeof(BP_Rogue_ShadowArena_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Rogue_ShadowArena_C_ReceiveEndPlay");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Rogue_ShadowArena_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Rogue_ShadowArena.BP_Rogue_ShadowArena_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Rogue_ShadowArena_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Rogue_ShadowArena_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Rogue_ShadowArena_C_ReceiveTick");
static_assert(sizeof(BP_Rogue_ShadowArena_C_ReceiveTick) == 0x000004, "Wrong size on BP_Rogue_ShadowArena_C_ReceiveTick");
static_assert(offsetof(BP_Rogue_ShadowArena_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Rogue_ShadowArena_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

