#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StableCharacterSocket

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_StableCharacterSocket.BP_StableCharacterSocket_C.BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    TouchedComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   ButtonPressed;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature");
static_assert(sizeof(BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature) == 0x000020, "Wrong size on BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature");
static_assert(offsetof(BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature, TouchedComponent) == 0x000000, "Member 'BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature::TouchedComponent' has a wrong offset!");
static_assert(offsetof(BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature, ButtonPressed) == 0x000008, "Member 'BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature::ButtonPressed' has a wrong offset!");

// Function BP_StableCharacterSocket.BP_StableCharacterSocket_C.BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginCursorOverSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginCursorOverSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    TouchedComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginCursorOverSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginCursorOverSignature__DelegateSignature");
static_assert(sizeof(BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginCursorOverSignature__DelegateSignature) == 0x000008, "Wrong size on BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginCursorOverSignature__DelegateSignature");
static_assert(offsetof(BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginCursorOverSignature__DelegateSignature, TouchedComponent) == 0x000000, "Member 'BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginCursorOverSignature__DelegateSignature::TouchedComponent' has a wrong offset!");

// Function BP_StableCharacterSocket.BP_StableCharacterSocket_C.BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndCursorOverSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndCursorOverSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    TouchedComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndCursorOverSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndCursorOverSignature__DelegateSignature");
static_assert(sizeof(BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndCursorOverSignature__DelegateSignature) == 0x000008, "Wrong size on BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndCursorOverSignature__DelegateSignature");
static_assert(offsetof(BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndCursorOverSignature__DelegateSignature, TouchedComponent) == 0x000000, "Member 'BP_StableCharacterSocket_C_BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndCursorOverSignature__DelegateSignature::TouchedComponent' has a wrong offset!");

// Function BP_StableCharacterSocket.BP_StableCharacterSocket_C.ExecuteUbergraph_BP_StableCharacterSocket
// 0x0038 (0x0038 - 0x0000)
struct BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_TouchedComponent_2;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_ComponentBoundEvent_ButtonPressed;          // 0x0010(0x0018)(HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_TouchedComponent_1;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_TouchedComponent;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket) == 0x000008, "Wrong alignment on BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket");
static_assert(sizeof(BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket) == 0x000038, "Wrong size on BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket");
static_assert(offsetof(BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket, EntryPoint) == 0x000000, "Member 'BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket, K2Node_ComponentBoundEvent_TouchedComponent_2) == 0x000008, "Member 'BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket::K2Node_ComponentBoundEvent_TouchedComponent_2' has a wrong offset!");
static_assert(offsetof(BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket, K2Node_ComponentBoundEvent_ButtonPressed) == 0x000010, "Member 'BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket::K2Node_ComponentBoundEvent_ButtonPressed' has a wrong offset!");
static_assert(offsetof(BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket, K2Node_ComponentBoundEvent_TouchedComponent_1) == 0x000028, "Member 'BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket::K2Node_ComponentBoundEvent_TouchedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket, K2Node_ComponentBoundEvent_TouchedComponent) == 0x000030, "Member 'BP_StableCharacterSocket_C_ExecuteUbergraph_BP_StableCharacterSocket::K2Node_ComponentBoundEvent_TouchedComponent' has a wrong offset!");

// Function BP_StableCharacterSocket.BP_StableCharacterSocket_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_StableCharacterSocket_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StableCharacterSocket_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_StableCharacterSocket_C_UserConstructionScript");
static_assert(sizeof(BP_StableCharacterSocket_C_UserConstructionScript) == 0x000001, "Wrong size on BP_StableCharacterSocket_C_UserConstructionScript");
static_assert(offsetof(BP_StableCharacterSocket_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000000, "Member 'BP_StableCharacterSocket_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

}

