#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineMesh_Palisades

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SSplineMeshEntry_structs.hpp"


namespace SDK::Params
{

// Function BP_SplineMesh_Palisades.BP_SplineMesh_Palisades_C.Add Meshes To Spline
// 0x0550 (0x0550 - 0x0000)
struct BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline final
{
public:
	class USplineComponent*                       Spline_Component;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSSplineMeshEntry>              In_Entries;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSSplineMeshEntry                      In_Override_Entry_Start;                           // 0x0020(0x00A0)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FSSplineMeshEntry                      In_Override_Entry_End;                             // 0x00C0(0x00A0)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0160(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Add_Meshes_To_Spline_Success;             // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0xD];                                      // 0x0183(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0190(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0200(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_Array_Get_Item;                           // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_1;                         // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetInstanceTransform_OutInstanceTransform; // 0x0270(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInstanceTransform_ReturnValue;         // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInstanceCount_ReturnValue;             // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindDirectionClosestToWorldLocation_ReturnValue; // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0408(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0428(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_2;            // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x04C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52D[0x3];                                      // 0x052D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline) == 0x000010, "Wrong alignment on BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline");
static_assert(sizeof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline) == 0x000550, "Wrong size on BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, Spline_Component) == 0x000000, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::Spline_Component' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, In_Entries) == 0x000008, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::In_Entries' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, In_Override_Entry_Start) == 0x000020, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::In_Override_Entry_Start' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, In_Override_Entry_End) == 0x0000C0, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::In_Override_Entry_End' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, Success) == 0x000160, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::Success' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, Temp_int_Variable) == 0x000164, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Add_Meshes_To_Spline_Success) == 0x000168, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Add_Meshes_To_Spline_Success' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Add_IntInt_ReturnValue) == 0x00016C, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, Temp_int_Array_Index_Variable) == 0x000170, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, Temp_int_Loop_Counter_Variable) == 0x000174, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Add_IntInt_ReturnValue_1) == 0x000178, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, Temp_int_Array_Index_Variable_1) == 0x00017C, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000181, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_BooleanAND_ReturnValue) == 0x000182, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, Temp_struct_Variable) == 0x000190, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_IsValid_ReturnValue_1) == 0x0001F0, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_AddComponent_ReturnValue) == 0x0001F8, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_GetTransform_ReturnValue) == 0x000200, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Array_Get_Item) == 0x000260, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Array_Get_Item_1) == 0x000268, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_GetInstanceTransform_OutInstanceTransform) == 0x000270, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_GetInstanceTransform_OutInstanceTransform' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_GetInstanceTransform_ReturnValue) == 0x0002D0, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_GetInstanceTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0002D8, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_BreakTransform_Location) == 0x0002F0, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_BreakTransform_Rotation) == 0x000308, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_BreakTransform_Scale) == 0x000320, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_GetInstanceCount_ReturnValue) == 0x000338, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_GetInstanceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_BreakRotator_Roll) == 0x00033C, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_BreakRotator_Pitch) == 0x000340, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_BreakRotator_Yaw) == 0x000344, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Subtract_IntInt_ReturnValue) == 0x000348, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000350, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000358, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_MakeRotator_ReturnValue) == 0x000360, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_ComposeRotators_ReturnValue) == 0x000378, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_GetUpVector_ReturnValue) == 0x000390, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_TransformLocation_ReturnValue) == 0x0003A8, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0003C0, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_FindDirectionClosestToWorldLocation_ReturnValue) == 0x0003D8, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_FindDirectionClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Add_VectorVector_ReturnValue) == 0x0003F0, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000408, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Array_Length_ReturnValue) == 0x000420, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_MakeRotFromX_ReturnValue) == 0x000428, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Less_IntInt_ReturnValue) == 0x000440, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_ComposeRotators_ReturnValue_1) == 0x000448, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Array_Length_ReturnValue_1) == 0x000460, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_ComposeRotators_ReturnValue_2) == 0x000468, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_ComposeRotators_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000480, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, Temp_int_Loop_Counter_Variable_1) == 0x000498, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0004A0, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_MakeTransform_ReturnValue) == 0x0004C0, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Less_IntInt_ReturnValue_1) == 0x000520, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_AddInstance_ReturnValue) == 0x000524, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Add_IntInt_ReturnValue_2) == 0x000528, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_SetStaticMesh_ReturnValue) == 0x00052C, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000530, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000538, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x000540, "Member 'BP_SplineMesh_Palisades_C_Add_Meshes_To_Spline::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");

}

