#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StableCharacterSocket

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StableCharacterSocket.BP_StableCharacterSocket_C
// 0x0038 (0x0380 - 0x0348)
class ABP_StableCharacterSocket_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       LightRigCollisionSphere;                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMergeableSkeletalMeshComponent*        MergeableSkeletalMesh;                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCustomizationCharacterSocket*          CharacterSocketComponent;                          // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature(class UPrimitiveComponent* TouchedComponent, const struct FKey& ButtonPressed);
	void BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginCursorOverSignature__DelegateSignature(class UPrimitiveComponent* TouchedComponent);
	void BndEvt__BP_StableCharacterSocket_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndCursorOverSignature__DelegateSignature(class UPrimitiveComponent* TouchedComponent);
	void ExecuteUbergraph_BP_StableCharacterSocket(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StableCharacterSocket_C">();
	}
	static class ABP_StableCharacterSocket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StableCharacterSocket_C>();
	}
};
static_assert(alignof(ABP_StableCharacterSocket_C) == 0x000008, "Wrong alignment on ABP_StableCharacterSocket_C");
static_assert(sizeof(ABP_StableCharacterSocket_C) == 0x000380, "Wrong size on ABP_StableCharacterSocket_C");
static_assert(offsetof(ABP_StableCharacterSocket_C, UberGraphFrame) == 0x000348, "Member 'ABP_StableCharacterSocket_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StableCharacterSocket_C, Capsule) == 0x000350, "Member 'ABP_StableCharacterSocket_C::Capsule' has a wrong offset!");
static_assert(offsetof(ABP_StableCharacterSocket_C, LightRigCollisionSphere) == 0x000358, "Member 'ABP_StableCharacterSocket_C::LightRigCollisionSphere' has a wrong offset!");
static_assert(offsetof(ABP_StableCharacterSocket_C, SkeletalMesh) == 0x000360, "Member 'ABP_StableCharacterSocket_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_StableCharacterSocket_C, MergeableSkeletalMesh) == 0x000368, "Member 'ABP_StableCharacterSocket_C::MergeableSkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_StableCharacterSocket_C, CharacterSocketComponent) == 0x000370, "Member 'ABP_StableCharacterSocket_C::CharacterSocketComponent' has a wrong offset!");
static_assert(offsetof(ABP_StableCharacterSocket_C, DefaultSceneRoot) == 0x000378, "Member 'ABP_StableCharacterSocket_C::DefaultSceneRoot' has a wrong offset!");

}

