#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tank_Barrier

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Tank_Barrier.BP_Tank_Barrier_C.ExecuteUbergraph_BP_Tank_Barrier
// 0x000C (0x000C - 0x0000)
struct BP_Tank_Barrier_C_ExecuteUbergraph_BP_Tank_Barrier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tank_Barrier_C_ExecuteUbergraph_BP_Tank_Barrier) == 0x000004, "Wrong alignment on BP_Tank_Barrier_C_ExecuteUbergraph_BP_Tank_Barrier");
static_assert(sizeof(BP_Tank_Barrier_C_ExecuteUbergraph_BP_Tank_Barrier) == 0x00000C, "Wrong size on BP_Tank_Barrier_C_ExecuteUbergraph_BP_Tank_Barrier");
static_assert(offsetof(BP_Tank_Barrier_C_ExecuteUbergraph_BP_Tank_Barrier, EntryPoint) == 0x000000, "Member 'BP_Tank_Barrier_C_ExecuteUbergraph_BP_Tank_Barrier::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Tank_Barrier_C_ExecuteUbergraph_BP_Tank_Barrier, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Tank_Barrier_C_ExecuteUbergraph_BP_Tank_Barrier::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Tank_Barrier_C_ExecuteUbergraph_BP_Tank_Barrier, K2Node_Event_EndPlayReason) == 0x000008, "Member 'BP_Tank_Barrier_C_ExecuteUbergraph_BP_Tank_Barrier::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_Tank_Barrier.BP_Tank_Barrier_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Tank_Barrier_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tank_Barrier_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Tank_Barrier_C_ReceiveEndPlay");
static_assert(sizeof(BP_Tank_Barrier_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Tank_Barrier_C_ReceiveEndPlay");
static_assert(offsetof(BP_Tank_Barrier_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Tank_Barrier_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Tank_Barrier.BP_Tank_Barrier_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Tank_Barrier_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tank_Barrier_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Tank_Barrier_C_ReceiveTick");
static_assert(sizeof(BP_Tank_Barrier_C_ReceiveTick) == 0x000004, "Wrong size on BP_Tank_Barrier_C_ReceiveTick");
static_assert(offsetof(BP_Tank_Barrier_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Tank_Barrier_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

