#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VerraWorld_GlobalSky

#include "Basic.hpp"

#include "STRUCT_PostProcessDefaultSettings_structs.hpp"
#include "Engine_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Niagara_structs.hpp"


namespace SDK::Params
{

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Adjust Weather
// 0x0050 (0x0050 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Adjust_Weather final
{
public:
	double                                        Custom_Humidity_Max;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Humidity_Min;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Precipitation_Amount_Max;                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Precipitation_Amount_Min;                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Temp_Max;                                   // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Temp_Min;                                   // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_WindSpeed_Max;                              // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Wind_Speed_Min;                             // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Chance_Of_Precip_Max;                       // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Chance_Of_Precip_Min;                       // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Adjust_Weather) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Adjust_Weather");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Adjust_Weather) == 0x000050, "Wrong size on BP_VerraWorld_GlobalSky_C_Adjust_Weather");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Humidity_Max) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Humidity_Max' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Humidity_Min) == 0x000008, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Humidity_Min' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Precipitation_Amount_Max) == 0x000010, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Precipitation_Amount_Max' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Precipitation_Amount_Min) == 0x000018, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Precipitation_Amount_Min' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Temp_Max) == 0x000020, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Temp_Max' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Temp_Min) == 0x000028, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Temp_Min' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_WindSpeed_Max) == 0x000030, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_WindSpeed_Max' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Wind_Speed_Min) == 0x000038, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Wind_Speed_Min' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Chance_Of_Precip_Max) == 0x000040, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Chance_Of_Precip_Max' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Chance_Of_Precip_Min) == 0x000048, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Chance_Of_Precip_Min' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Apply Weather Override
// 0x00A0 (0x00A0 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Apply_Weather_Override final
{
public:
	struct FSingleDayClimate                      StructRef;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSingleDayClimate                      Output_Get;                                        // 0x0028(0x0028)(Parm, OutParm)
	struct FSingleDayClimate                      LV_Climate_Data;                                   // 0x0050(0x0028)(Edit, BlueprintVisible)
	struct FSingleDayClimate                      CallFunc_ApplyWeatherOverrideNative_OutClimate;    // 0x0078(0x0028)()
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Apply_Weather_Override) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Apply_Weather_Override");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Apply_Weather_Override) == 0x0000A0, "Wrong size on BP_VerraWorld_GlobalSky_C_Apply_Weather_Override");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Apply_Weather_Override, StructRef) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Apply_Weather_Override::StructRef' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Apply_Weather_Override, Output_Get) == 0x000028, "Member 'BP_VerraWorld_GlobalSky_C_Apply_Weather_Override::Output_Get' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Apply_Weather_Override, LV_Climate_Data) == 0x000050, "Member 'BP_VerraWorld_GlobalSky_C_Apply_Weather_Override::LV_Climate_Data' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Apply_Weather_Override, CallFunc_ApplyWeatherOverrideNative_OutClimate) == 0x000078, "Member 'BP_VerraWorld_GlobalSky_C_Apply_Weather_Override::CallFunc_ApplyWeatherOverrideNative_OutClimate' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.BiomePostProcessBlend
// 0x0BE0 (0x0BE0 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend final
{
public:
	struct FSTRUCT_PostProcessDefaultSettings     CallFunc_Map_Find_Value;                           // 0x0000(0x02E0)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0xF];                                      // 0x02E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_PostProcessDefaultSettings     CallFunc_Map_Find_Value_1;                         // 0x02F0(0x02E0)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0xF];                                      // 0x05D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_PostProcessDefaultSettings     CallFunc_Map_Find_Value_2;                         // 0x05E0(0x02E0)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C1[0xF];                                      // 0x08C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_PostProcessDefaultSettings     CallFunc_Map_Find_Value_3;                         // 0x08D0(0x02E0)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0BB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0BB1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0BB2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0BB3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0BB4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB5[0x3];                                      // 0x0BB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0BB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0BC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_2;    // 0x0BC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_3;    // 0x0BD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend) == 0x000010, "Wrong alignment on BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend) == 0x000BE0, "Wrong size on BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_Value) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_ReturnValue) == 0x0002E0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_Value_1) == 0x0002F0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_ReturnValue_1) == 0x0005D0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_Value_2) == 0x0005E0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_ReturnValue_2) == 0x0008C0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_Value_3) == 0x0008D0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_ReturnValue_3) == 0x000BB0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000BB1, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000BB2, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000BB3, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x000BB4, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000BB8, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000BC0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_A_ImplicitCast_2) == 0x000BC8, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_A_ImplicitCast_3) == 0x000BD0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.BiomePPVValidChecks
// 0x1800 (0x1800 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks final
{
public:
	struct FSTRUCT_PostProcessDefaultSettings     STRUCT_PostProcessDefaultSettings;                 // 0x0000(0x02E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class FString                                 Biome_Color;                                       // 0x02E0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         BiomeAmount;                                       // 0x02F0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0330(0x06E0)()
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings_1;           // 0x0A10(0x06E0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x10F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x10F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x10F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10F3[0x5];                                     // 0x10F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x10F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings_2;           // 0x1100(0x06E0)()
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x17E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x17E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_AutoExposureBias_ImplicitCast;   // 0x17F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks) == 0x000010, "Wrong alignment on BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks) == 0x001800, "Wrong size on BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, STRUCT_PostProcessDefaultSettings) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::STRUCT_PostProcessDefaultSettings' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, Biome_Color) == 0x0002E0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::Biome_Color' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, BiomeAmount) == 0x0002F0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::BiomeAmount' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Concat_StrStr_ReturnValue) == 0x0002F8, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000308, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Conv_StringToName_ReturnValue) == 0x000318, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000320, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, K2Node_MakeStruct_PostProcessSettings) == 0x000330, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, K2Node_MakeStruct_PostProcessSettings_1) == 0x000A10, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::K2Node_MakeStruct_PostProcessSettings_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_IsValid_ReturnValue) == 0x0010F0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0010F1, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_IsValid_ReturnValue_1) == 0x0010F2, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Lerp_ReturnValue) == 0x0010F8, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, K2Node_MakeStruct_PostProcessSettings_2) == 0x001100, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::K2Node_MakeStruct_PostProcessSettings_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Lerp_Alpha_ImplicitCast) == 0x0017E0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Lerp_A_ImplicitCast) == 0x0017E8, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Lerp_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, K2Node_MakeStruct_AutoExposureBias_ImplicitCast) == 0x0017F0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::K2Node_MakeStruct_AutoExposureBias_ImplicitCast' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Cast
// 0x0048 (0x0048 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Cast final
{
public:
	bool                                          Cast_Is_Valid;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABiomeManager*                          K2Node_DynamicCast_AsBiome_Manager;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGlobalAtmosphere*                      K2Node_DynamicCast_AsGlobal_Atmosphere;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AudioManager_C*                     K2Node_DynamicCast_AsBP_Audio_Manager;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ConstellationManager_C*             K2Node_DynamicCast_AsBP_Constellation_Manager;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Cast) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Cast");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Cast) == 0x000048, "Wrong size on BP_VerraWorld_GlobalSky_C_Cast");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, Cast_Is_Valid) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Cast::Cast_Is_Valid' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_AsBiome_Manager) == 0x000008, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_AsBiome_Manager' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_AsGlobal_Atmosphere) == 0x000018, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_AsGlobal_Atmosphere' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_AsBP_Audio_Manager) == 0x000028, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_AsBP_Audio_Manager' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_AsBP_Constellation_Manager) == 0x000038, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_AsBP_Constellation_Manager' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_bSuccess_3) == 0x000040, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Event - Add Blend Settings
// 0x0018 (0x0018 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings final
{
public:
	struct FAtmoBlendSettings                     Blend_Settings;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         Override_Volmume_Hash;                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings) == 0x000018, "Wrong size on BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings, Blend_Settings) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings::Blend_Settings' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings, Override_Volmume_Hash) == 0x000010, "Member 'BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings::Override_Volmume_Hash' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Event - Current Tranistion
// 0x0010 (0x0010 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion final
{
public:
	int32                                         Hash_Name;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Current_Transition;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion) == 0x000010, "Wrong size on BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion, Hash_Name) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion::Hash_Name' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion, Current_Transition) == 0x000008, "Member 'BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion::Current_Transition' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Event - Remove Blend
// 0x0004 (0x0004 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Event___Remove_Blend final
{
public:
	int32                                         Hash_Name;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Event___Remove_Blend) == 0x000004, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Event___Remove_Blend");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Event___Remove_Blend) == 0x000004, "Wrong size on BP_VerraWorld_GlobalSky_C_Event___Remove_Blend");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event___Remove_Blend, Hash_Name) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Event___Remove_Blend::Hash_Name' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Event Set Biome
// 0x0002 (0x0002 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Event_Set_Biome final
{
public:
	bool                                          Set_Biome;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBiomeType                                    Biome;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Event_Set_Biome) == 0x000001, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Event_Set_Biome");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Event_Set_Biome) == 0x000002, "Wrong size on BP_VerraWorld_GlobalSky_C_Event_Set_Biome");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event_Set_Biome, Set_Biome) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Event_Set_Biome::Set_Biome' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event_Set_Biome, Biome) == 0x000001, "Member 'BP_VerraWorld_GlobalSky_C_Event_Set_Biome::Biome' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.ExecuteUbergraph_BP_VerraWorld_GlobalSky
// 0x0E40 (0x0E40 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_ExecuteUbergraph_BP_VerraWorld_GlobalSky final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(int32 Hash_Name, double Current_Transition)> UniqueObjectNameForCooking_OutputDelegate;         // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0058(0x0008)(NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UniqueObjectNameForCooking_LinearColor;            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Hash_Name)>              UniqueObjectNameForCooking_OutputDelegate_1;       // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Set_Biome;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBiomeType                                    K2Node_CustomEvent_Biome;                          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAtmoBlendSettings& Blend_Settings, int32 Override_Volmume_Hash)> UniqueObjectNameForCooking_OutputDelegate_2;       // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBasicParticleData>             K2Node_Event_Data;                                 // 0x00B8(0x0010)(ConstParm, ReferenceParm)
	class UNiagaraSystem*                         K2Node_Event_NiagaraSystem;                        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_SimulationPositionOffset;             // 0x00D0(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Value;                          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           UniqueObjectNameForCooking_LinearColor_1;          // 0x012C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13F[0x1];                                      // 0x013F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Current_Temp;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Precipitation_Amount;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Normalized_Temperature;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Final_Humidity;                 // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraParameterCollectionInstance*    CallFunc_GetNiagaraParameterCollection_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAtmoBlendSettings                     K2Node_CustomEvent_Blend_Settings;                 // 0x0190(0x0010)(NoDestructor)
	int32                                         K2Node_CustomEvent_Override_Volmume_Hash;          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FAtmoBlendSettings>        CallFunc_SortAtmoOverrides_ReturnValue;            // 0x01A8(0x0050)()
	int32                                         K2Node_CustomEvent_Hash_Name_1;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Hash_Name;                      // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Current_Transition;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSingleDayClimate                      CallFunc_Apply_Weather_Override_Output_Get;        // 0x0210(0x0028)()
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x023B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_ChanceOfPrecipitation;                // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Custom_Humidity_Max;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Custom_Humidity_Min;                  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Custom_Precipitation_Amount_Max;      // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Custom_Precipitation_Amount_Min;      // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Custom_Temp_Max;                      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Custom_Temp_Min;                      // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Custom_WindSpeed_Max;                 // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Custom_Wind_Speed_Min;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Custom_Chance_Of_Precip_Max;          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Custom_Chance_Of_Precip_Min;          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Transition;                           // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Humidity;                             // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsEnabled_1;                         // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsEnabled;                           // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x2];                                      // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_WindDirection;                        // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_WindSpeed;                            // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Precipitation;                        // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Temperature;                          // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas_1;   // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size_1;     // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context_1;  // 0x02E0(0x0008)(NoDestructor)
	bool                                          K2Node_Event_bIsEnbabled;                          // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_GameTimeNormalized;                   // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_TimeOfDay24h;                         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WeatherEvent_C*                     CallFunc_Array_Get_Item;                           // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIntrepidGameUserSettings*              CallFunc_GetIntrepidGameUserSettings_ReturnValue;  // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOverallScalabilityLevel_ReturnValue;   // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMonth                                        CallFunc_Get_Month_ReturnValue;                    // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333[0x5];                                      // 0x0333(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UniqueObjectNameForCooking_LinearColor_2;          // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UniqueObjectNameForCooking_LinearColor_3;          // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0388(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0488(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49A[0x6];                                      // 0x049A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_4;                          // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_5;                          // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_5;                          // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_5;                          // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x04D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x04E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x04F0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostProcessComponent*                  CallFunc_AddComponent_ReturnValue;                 // 0x0558(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Post_Process_Blend_Day_Night_Output_Get;  // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0568(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x056C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0570(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
