#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VFFoliage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Chooser_structs.hpp"
#include "StructUtils_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_VFFoliage.BP_VFFoliage_C.Choose Foliage
// 0x0070 (0x0070 - 0x0000)
struct BP_VFFoliage_C_Choose_Foliage final
{
public:
	struct FChooserEvaluationContext              CallFunc_MakeChooserEvaluationContext_ReturnValue; // 0x0000(0x0050)()
	struct FInstancedStruct                       CallFunc_MakeEvaluateChooser_ReturnValue;          // 0x0050(0x0010)()
	TArray<class UFoliageType_InstancedStaticMesh*> CallFunc_EvaluateObjectChooserBaseMulti_ReturnValue; // 0x0060(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_VFFoliage_C_Choose_Foliage) == 0x000008, "Wrong alignment on BP_VFFoliage_C_Choose_Foliage");
static_assert(sizeof(BP_VFFoliage_C_Choose_Foliage) == 0x000070, "Wrong size on BP_VFFoliage_C_Choose_Foliage");
static_assert(offsetof(BP_VFFoliage_C_Choose_Foliage, CallFunc_MakeChooserEvaluationContext_ReturnValue) == 0x000000, "Member 'BP_VFFoliage_C_Choose_Foliage::CallFunc_MakeChooserEvaluationContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Choose_Foliage, CallFunc_MakeEvaluateChooser_ReturnValue) == 0x000050, "Member 'BP_VFFoliage_C_Choose_Foliage::CallFunc_MakeEvaluateChooser_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Choose_Foliage, CallFunc_EvaluateObjectChooserBaseMulti_ReturnValue) == 0x000060, "Member 'BP_VFFoliage_C_Choose_Foliage::CallFunc_EvaluateObjectChooserBaseMulti_ReturnValue' has a wrong offset!");

// Function BP_VFFoliage.BP_VFFoliage_C.Find Box Extent from Spline
// 0x0300 (0x0300 - 0x0000)
struct BP_VFFoliage_C_Find_Box_Extent_from_Spline final
{
public:
	int32                                         Current_Index;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SplinePointMaxVector;                              // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SplinePointMinVector;                              // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue_1;        // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_2;                       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_2;   // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x01E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_2;                       // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFFoliage_C_Find_Box_Extent_from_Spline) == 0x000008, "Wrong alignment on BP_VFFoliage_C_Find_Box_Extent_from_Spline");
static_assert(sizeof(BP_VFFoliage_C_Find_Box_Extent_from_Spline) == 0x000300, "Wrong size on BP_VFFoliage_C_Find_Box_Extent_from_Spline");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, Current_Index) == 0x000000, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::Current_Index' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, SplinePointMaxVector) == 0x000008, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::SplinePointMaxVector' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, SplinePointMinVector) == 0x000020, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::SplinePointMinVector' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, Temp_int_Variable) == 0x000038, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000040, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000058, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000070, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_X) == 0x000088, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Y) == 0x000090, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Z) == 0x000098, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_Divide_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000D0, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_Divide_VectorVector_ReturnValue_1) == 0x0000E8, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_Divide_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000100, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000118, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_X_1) == 0x000130, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Y_1) == 0x000138, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Z_1) == 0x000140, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_X_2) == 0x000148, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Y_2) == 0x000150, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Z_2) == 0x000158, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_FMax_ReturnValue) == 0x000160, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x000168, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_FMax_ReturnValue_1) == 0x000180, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_FMax_ReturnValue_2) == 0x000188, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_MakeVector_ReturnValue) == 0x000190, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue_2) == 0x0001A8, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_X_3) == 0x0001C0, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Y_3) == 0x0001C8, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_BreakVector_Z_3) == 0x0001D0, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_FMin_ReturnValue) == 0x0001D8, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0001E0, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_FMin_ReturnValue_1) == 0x0002C8, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_FMin_ReturnValue_2) == 0x0002D0, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_FMin_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_MakeVector_ReturnValue_1) == 0x0002D8, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0002F0, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_Subtract_IntInt_ReturnValue) == 0x0002F4, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Find_Box_Extent_from_Spline, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002F8, "Member 'BP_VFFoliage_C_Find_Box_Extent_from_Spline::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_VFFoliage.BP_VFFoliage_C.Get PCG Param Data Asset
// 0x0008 (0x0008 - 0x0000)
struct BP_VFFoliage_C_Get_PCG_Param_Data_Asset final
{
public:
	class UPCGParameterData*                      PCG_Data;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFFoliage_C_Get_PCG_Param_Data_Asset) == 0x000008, "Wrong alignment on BP_VFFoliage_C_Get_PCG_Param_Data_Asset");
static_assert(sizeof(BP_VFFoliage_C_Get_PCG_Param_Data_Asset) == 0x000008, "Wrong size on BP_VFFoliage_C_Get_PCG_Param_Data_Asset");
static_assert(offsetof(BP_VFFoliage_C_Get_PCG_Param_Data_Asset, PCG_Data) == 0x000000, "Member 'BP_VFFoliage_C_Get_PCG_Param_Data_Asset::PCG_Data' has a wrong offset!");

// Function BP_VFFoliage.BP_VFFoliage_C.Override Spline
// 0x0188 (0x0188 - 0x0000)
struct BP_VFFoliage_C_Override_Spline final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0020(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_1;    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFFoliage_C_Override_Spline) == 0x000008, "Wrong alignment on BP_VFFoliage_C_Override_Spline");
static_assert(sizeof(BP_VFFoliage_C_Override_Spline) == 0x000188, "Wrong size on BP_VFFoliage_C_Override_Spline");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_VFFoliage_C_Override_Spline::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_VFFoliage_C_Override_Spline::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, Temp_int_Variable) == 0x00000C, "Member 'BP_VFFoliage_C_Override_Spline::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000010, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000020, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000108, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_GetNumberOfSplinePoints_ReturnValue_1) == 0x00010C, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_GetNumberOfSplinePoints_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000110, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000118, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x000130, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_Array_Get_Item) == 0x000138, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_Array_Length_ReturnValue) == 0x000150, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_Less_IntInt_ReturnValue) == 0x000154, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_Array_Get_Item_1) == 0x000158, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Override_Spline, CallFunc_Array_Get_Item_2) == 0x000170, "Member 'BP_VFFoliage_C_Override_Spline::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function BP_VFFoliage.BP_VFFoliage_C.PCG Param Data Logic
// 0x0128 (0x0128 - 0x0000)
struct BP_VFFoliage_C_PCG_Param_Data_Logic final
{
public:
	struct FChooserEvaluationContext              CallFunc_MakeChooserEvaluationContext_ReturnValue; // 0x0000(0x0050)()
	struct FInstancedStruct                       CallFunc_MakeEvaluateChooser_ReturnValue;          // 0x0050(0x0010)()
	class UPCGParameterData*                      CallFunc_EvaluateObjectChooserBase_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPCGParameterData*                      CallFunc_GetInstancedObject_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FChooserEvaluationContext              CallFunc_MakeChooserEvaluationContext_ReturnValue_1; // 0x0080(0x0050)()
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       CallFunc_MakeEvaluateChooser_ReturnValue_1;        // 0x00D8(0x0010)()
	class UPCGGraph*                              CallFunc_EvaluateObjectChooserBase_ReturnValue_1;  // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x00F8(0x0020)()
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x011C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFFoliage_C_PCG_Param_Data_Logic) == 0x000008, "Wrong alignment on BP_VFFoliage_C_PCG_Param_Data_Logic");
static_assert(sizeof(BP_VFFoliage_C_PCG_Param_Data_Logic) == 0x000128, "Wrong size on BP_VFFoliage_C_PCG_Param_Data_Logic");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_MakeChooserEvaluationContext_ReturnValue) == 0x000000, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_MakeChooserEvaluationContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_MakeEvaluateChooser_ReturnValue) == 0x000050, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_MakeEvaluateChooser_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_EvaluateObjectChooserBase_ReturnValue) == 0x000060, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_EvaluateObjectChooserBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_GetObjectClass_ReturnValue) == 0x000068, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_GetInstancedObject_ReturnValue) == 0x000070, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_GetInstancedObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_GetObjectClass_ReturnValue_1) == 0x000078, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_MakeChooserEvaluationContext_ReturnValue_1) == 0x000080, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_MakeChooserEvaluationContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000D0, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_MakeEvaluateChooser_ReturnValue_1) == 0x0000D8, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_MakeEvaluateChooser_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_EvaluateObjectChooserBase_ReturnValue_1) == 0x0000E8, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_EvaluateObjectChooserBase_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x0000F8, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000118, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_BooleanAND_ReturnValue) == 0x000119, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_GetTagName_ReturnValue) == 0x00011C, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_PCG_Param_Data_Logic, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000124, "Member 'BP_VFFoliage_C_PCG_Param_Data_Logic::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_VFFoliage.BP_VFFoliage_C.Set Graph Foliage
// 0x0088 (0x0088 - 0x0000)
struct BP_VFFoliage_C_Set_Graph_Foliage final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFoliageType_InstancedStaticMesh*       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0050(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetFloatParameter_Value_ImplicitCast;     // 0x0080(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFFoliage_C_Set_Graph_Foliage) == 0x000008, "Wrong alignment on BP_VFFoliage_C_Set_Graph_Foliage");
static_assert(sizeof(BP_VFFoliage_C_Set_Graph_Foliage) == 0x000088, "Wrong size on BP_VFFoliage_C_Set_Graph_Foliage");
static_assert(offsetof(BP_VFFoliage_C_Set_Graph_Foliage, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_VFFoliage_C_Set_Graph_Foliage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Set_Graph_Foliage, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_VFFoliage_C_Set_Graph_Foliage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_VFFoliage_C_Set_Graph_Foliage, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_VFFoliage_C_Set_Graph_Foliage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
