#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VerraWorld_GlobalSky

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_PostProcessDefaultSettings_structs.hpp"
#include "Engine_structs.hpp"
#include "E_Weather_WindCondition_structs.hpp"
#include "Niagara_structs.hpp"
#include "E_Weather_SnowCondition_structs.hpp"
#include "E_Weather_RainCondition_structs.hpp"
#include "E_Weather_HumidityCondition_structs.hpp"
#include "E_Weather_FogCondition_structs.hpp"


namespace SDK::Params
{

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Adjust Weather
// 0x0050 (0x0050 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Adjust_Weather final
{
public:
	double                                        Custom_Humidity_Max;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Humidity_Min;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Precipitation_Amount_Max;                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Precipitation_Amount_Min;                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Temp_Max;                                   // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Temp_Min;                                   // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_WindSpeed_Max;                              // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Wind_Speed_Min;                             // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Chance_Of_Precip_Max;                       // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Chance_Of_Precip_Min;                       // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Adjust_Weather) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Adjust_Weather");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Adjust_Weather) == 0x000050, "Wrong size on BP_VerraWorld_GlobalSky_C_Adjust_Weather");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Humidity_Max) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Humidity_Max' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Humidity_Min) == 0x000008, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Humidity_Min' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Precipitation_Amount_Max) == 0x000010, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Precipitation_Amount_Max' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Precipitation_Amount_Min) == 0x000018, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Precipitation_Amount_Min' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Temp_Max) == 0x000020, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Temp_Max' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Temp_Min) == 0x000028, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Temp_Min' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_WindSpeed_Max) == 0x000030, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_WindSpeed_Max' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Wind_Speed_Min) == 0x000038, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Wind_Speed_Min' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Chance_Of_Precip_Max) == 0x000040, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Chance_Of_Precip_Max' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Adjust_Weather, Custom_Chance_Of_Precip_Min) == 0x000048, "Member 'BP_VerraWorld_GlobalSky_C_Adjust_Weather::Custom_Chance_Of_Precip_Min' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Apply Weather Override
// 0x00A0 (0x00A0 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Apply_Weather_Override final
{
public:
	struct FSingleDayClimate                      StructRef;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSingleDayClimate                      Output_Get;                                        // 0x0028(0x0028)(Parm, OutParm)
	struct FSingleDayClimate                      LV_Climate_Data;                                   // 0x0050(0x0028)(Edit, BlueprintVisible)
	struct FSingleDayClimate                      CallFunc_ApplyWeatherOverrideNative_OutClimate;    // 0x0078(0x0028)()
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Apply_Weather_Override) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Apply_Weather_Override");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Apply_Weather_Override) == 0x0000A0, "Wrong size on BP_VerraWorld_GlobalSky_C_Apply_Weather_Override");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Apply_Weather_Override, StructRef) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Apply_Weather_Override::StructRef' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Apply_Weather_Override, Output_Get) == 0x000028, "Member 'BP_VerraWorld_GlobalSky_C_Apply_Weather_Override::Output_Get' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Apply_Weather_Override, LV_Climate_Data) == 0x000050, "Member 'BP_VerraWorld_GlobalSky_C_Apply_Weather_Override::LV_Climate_Data' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Apply_Weather_Override, CallFunc_ApplyWeatherOverrideNative_OutClimate) == 0x000078, "Member 'BP_VerraWorld_GlobalSky_C_Apply_Weather_Override::CallFunc_ApplyWeatherOverrideNative_OutClimate' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.BiomePostProcessBlend
// 0x0BE0 (0x0BE0 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend final
{
public:
	struct FSTRUCT_PostProcessDefaultSettings     CallFunc_Map_Find_Value;                           // 0x0000(0x02E0)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0xF];                                      // 0x02E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_PostProcessDefaultSettings     CallFunc_Map_Find_Value_1;                         // 0x02F0(0x02E0)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0xF];                                      // 0x05D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_PostProcessDefaultSettings     CallFunc_Map_Find_Value_2;                         // 0x05E0(0x02E0)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C1[0xF];                                      // 0x08C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_PostProcessDefaultSettings     CallFunc_Map_Find_Value_3;                         // 0x08D0(0x02E0)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0BB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0BB1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0BB2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0BB3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0BB4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB5[0x3];                                      // 0x0BB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0BB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0BC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_2;    // 0x0BC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_3;    // 0x0BD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend) == 0x000010, "Wrong alignment on BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend) == 0x000BE0, "Wrong size on BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_Value) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_ReturnValue) == 0x0002E0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_Value_1) == 0x0002F0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_ReturnValue_1) == 0x0005D0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_Value_2) == 0x0005E0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_ReturnValue_2) == 0x0008C0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_Value_3) == 0x0008D0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Map_Find_ReturnValue_3) == 0x000BB0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000BB1, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000BB2, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000BB3, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x000BB4, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000BB8, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000BC0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_A_ImplicitCast_2) == 0x000BC8, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend, CallFunc_Greater_DoubleDouble_A_ImplicitCast_3) == 0x000BD0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePostProcessBlend::CallFunc_Greater_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.BiomePPVValidChecks
// 0x1800 (0x1800 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks final
{
public:
	struct FSTRUCT_PostProcessDefaultSettings     STRUCT_PostProcessDefaultSettings;                 // 0x0000(0x02E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class FString                                 Biome_Color;                                       // 0x02E0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         BiomeAmount;                                       // 0x02F0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0330(0x06E0)()
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings_1;           // 0x0A10(0x06E0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x10F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x10F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x10F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10F3[0x5];                                     // 0x10F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x10F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings_2;           // 0x1100(0x06E0)()
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x17E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x17E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_AutoExposureBias_ImplicitCast;   // 0x17F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks) == 0x000010, "Wrong alignment on BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks) == 0x001800, "Wrong size on BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, STRUCT_PostProcessDefaultSettings) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::STRUCT_PostProcessDefaultSettings' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, Biome_Color) == 0x0002E0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::Biome_Color' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, BiomeAmount) == 0x0002F0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::BiomeAmount' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Concat_StrStr_ReturnValue) == 0x0002F8, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000308, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Conv_StringToName_ReturnValue) == 0x000318, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000320, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, K2Node_MakeStruct_PostProcessSettings) == 0x000330, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, K2Node_MakeStruct_PostProcessSettings_1) == 0x000A10, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::K2Node_MakeStruct_PostProcessSettings_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_IsValid_ReturnValue) == 0x0010F0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0010F1, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_IsValid_ReturnValue_1) == 0x0010F2, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Lerp_ReturnValue) == 0x0010F8, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, K2Node_MakeStruct_PostProcessSettings_2) == 0x001100, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::K2Node_MakeStruct_PostProcessSettings_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Lerp_Alpha_ImplicitCast) == 0x0017E0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, CallFunc_Lerp_A_ImplicitCast) == 0x0017E8, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::CallFunc_Lerp_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks, K2Node_MakeStruct_AutoExposureBias_ImplicitCast) == 0x0017F0, "Member 'BP_VerraWorld_GlobalSky_C_BiomePPVValidChecks::K2Node_MakeStruct_AutoExposureBias_ImplicitCast' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.BlendCurrentAtmoAndWeather
// 0x06C8 (0x06C8 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_S_Curve_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerraGlobalSkySettings                CallFunc_BlendAtmo_OutAtmoSettings;                // 0x0018(0x01F0)(NoDestructor)
	struct FVerraGlobalSkySettingsBoolSwitches    CallFunc_BlendAtmo_OutAtmoBools;                   // 0x0208(0x0044)(NoDestructor)
	struct FVerraGlobalSkySettings                CallFunc_BlendAtmo_OutAtmoSettings_1;              // 0x024C(0x01F0)(NoDestructor)
	struct FVerraGlobalSkySettingsBoolSwitches    CallFunc_BlendAtmo_OutAtmoBools_1;                 // 0x043C(0x0044)(NoDestructor)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerraGlobalSkySettings                CallFunc_BlendAtmo_OutAtmoSettings_2;              // 0x0484(0x01F0)(NoDestructor)
	struct FVerraGlobalSkySettingsBoolSwitches    CallFunc_BlendAtmo_OutAtmoBools_2;                 // 0x0674(0x0044)(NoDestructor)
	float                                         CallFunc_BlendAtmo_Alpha_ImplicitCast;             // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BlendAtmo_Alpha_ImplicitCast_1;           // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BlendAtmo_Alpha_ImplicitCast_2;           // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather) == 0x0006C8, "Wrong size on BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, ReturnValue) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, CallFunc_S_Curve_ReturnValue) == 0x000010, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::CallFunc_S_Curve_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, CallFunc_BlendAtmo_OutAtmoSettings) == 0x000018, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::CallFunc_BlendAtmo_OutAtmoSettings' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, CallFunc_BlendAtmo_OutAtmoBools) == 0x000208, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::CallFunc_BlendAtmo_OutAtmoBools' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, CallFunc_BlendAtmo_OutAtmoSettings_1) == 0x00024C, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::CallFunc_BlendAtmo_OutAtmoSettings_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, CallFunc_BlendAtmo_OutAtmoBools_1) == 0x00043C, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::CallFunc_BlendAtmo_OutAtmoBools_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000480, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, CallFunc_BlendAtmo_OutAtmoSettings_2) == 0x000484, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::CallFunc_BlendAtmo_OutAtmoSettings_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, CallFunc_BlendAtmo_OutAtmoBools_2) == 0x000674, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::CallFunc_BlendAtmo_OutAtmoBools_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, CallFunc_BlendAtmo_Alpha_ImplicitCast) == 0x0006B8, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::CallFunc_BlendAtmo_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, CallFunc_BlendAtmo_Alpha_ImplicitCast_1) == 0x0006BC, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::CallFunc_BlendAtmo_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather, CallFunc_BlendAtmo_Alpha_ImplicitCast_2) == 0x0006C0, "Member 'BP_VerraWorld_GlobalSky_C_BlendCurrentAtmoAndWeather::CallFunc_BlendAtmo_Alpha_ImplicitCast_2' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Cast
// 0x0048 (0x0048 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Cast final
{
public:
	bool                                          Cast_Is_Valid;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABiomeManager*                          K2Node_DynamicCast_AsBiome_Manager;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGlobalAtmosphere*                      K2Node_DynamicCast_AsGlobal_Atmosphere;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AudioManager_C*                     K2Node_DynamicCast_AsBP_Audio_Manager;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ConstellationManager_C*             K2Node_DynamicCast_AsBP_Constellation_Manager;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Cast) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Cast");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Cast) == 0x000048, "Wrong size on BP_VerraWorld_GlobalSky_C_Cast");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, Cast_Is_Valid) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Cast::Cast_Is_Valid' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_AsBiome_Manager) == 0x000008, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_AsBiome_Manager' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_AsGlobal_Atmosphere) == 0x000018, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_AsGlobal_Atmosphere' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_AsBP_Audio_Manager) == 0x000028, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_AsBP_Audio_Manager' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_AsBP_Constellation_Manager) == 0x000038, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_AsBP_Constellation_Manager' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Cast, K2Node_DynamicCast_bSuccess_3) == 0x000040, "Member 'BP_VerraWorld_GlobalSky_C_Cast::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Event - Add Blend Settings
// 0x0018 (0x0018 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings final
{
public:
	struct FAtmoBlendSettings                     Blend_Settings;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         Override_Volmume_Hash;                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings) == 0x000018, "Wrong size on BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings, Blend_Settings) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings::Blend_Settings' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings, Override_Volmume_Hash) == 0x000010, "Member 'BP_VerraWorld_GlobalSky_C_Event___Add_Blend_Settings::Override_Volmume_Hash' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Event - Current Tranistion
// 0x0010 (0x0010 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion final
{
public:
	int32                                         Hash_Name;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Current_Transition;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion) == 0x000010, "Wrong size on BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion, Hash_Name) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion::Hash_Name' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion, Current_Transition) == 0x000008, "Member 'BP_VerraWorld_GlobalSky_C_Event___Current_Tranistion::Current_Transition' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Event - Remove Blend
// 0x0004 (0x0004 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Event___Remove_Blend final
{
public:
	int32                                         Hash_Name;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Event___Remove_Blend) == 0x000004, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Event___Remove_Blend");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Event___Remove_Blend) == 0x000004, "Wrong size on BP_VerraWorld_GlobalSky_C_Event___Remove_Blend");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event___Remove_Blend, Hash_Name) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Event___Remove_Blend::Hash_Name' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Event Set Biome
// 0x0002 (0x0002 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Event_Set_Biome final
{
public:
	bool                                          Set_Biome;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBiomeType                                    Biome;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Event_Set_Biome) == 0x000001, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Event_Set_Biome");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Event_Set_Biome) == 0x000002, "Wrong size on BP_VerraWorld_GlobalSky_C_Event_Set_Biome");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event_Set_Biome, Set_Biome) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Event_Set_Biome::Set_Biome' has a wrong offset!");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event_Set_Biome, Biome) == 0x000001, "Member 'BP_VerraWorld_GlobalSky_C_Event_Set_Biome::Biome' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.Event Set Fog
// 0x0008 (0x0008 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_Event_Set_Fog final
{
public:
	double                                        Fog_Amount_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_Event_Set_Fog) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_Event_Set_Fog");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_Event_Set_Fog) == 0x000008, "Wrong size on BP_VerraWorld_GlobalSky_C_Event_Set_Fog");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_Event_Set_Fog, Fog_Amount_0) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_Event_Set_Fog::Fog_Amount_0' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.EventSetWetness
// 0x0008 (0x0008 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_EventSetWetness final
{
public:
	double                                        Wetness_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VerraWorld_GlobalSky_C_EventSetWetness) == 0x000008, "Wrong alignment on BP_VerraWorld_GlobalSky_C_EventSetWetness");
static_assert(sizeof(BP_VerraWorld_GlobalSky_C_EventSetWetness) == 0x000008, "Wrong size on BP_VerraWorld_GlobalSky_C_EventSetWetness");
static_assert(offsetof(BP_VerraWorld_GlobalSky_C_EventSetWetness, Wetness_0) == 0x000000, "Member 'BP_VerraWorld_GlobalSky_C_EventSetWetness::Wetness_0' has a wrong offset!");

// Function BP_VerraWorld_GlobalSky.BP_VerraWorld_GlobalSky_C.ExecuteUbergraph_BP_VerraWorld_GlobalSky
// 0x0CC0 (0x0CC0 - 0x0000)
struct BP_VerraWorld_GlobalSky_C_ExecuteUbergraph_BP_VerraWorld_GlobalSky final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_GameTimeNormalized;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_TimeOfDay24h;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UIntrepidGameUserSettings*              CallFunc_GetIntrepidGameUserSettings_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOverallScalabilityLevel_ReturnValue;   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Initalize_BiomeManager_Returned_Correct_Biome; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Initialize_Global_Atmosphere_Sun_is_in_the_RIght_Spot; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0058(0x0008)(NoDestructor)
	bool                                          K2Node_Event_bIsEnbabled;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Temperature;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Precipitation;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_WindSpeed;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_WindDirection;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsEnabled;                           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsEnabled_1;                         // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSingleDayClimate                      CallFunc_Apply_Weather_Override_Output_Get;        // 0x0090(0x0028)()
	float                                         K2Node_Event_Humidity;                             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIntrepidGameUserSettings*              CallFunc_GetIntrepidGameUserSettings_ReturnValue_1; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOverallScalabilityLevel_ReturnValue_1; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue_1;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           UniqueObjectNameForCooking_LinearColor;            // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas_1;   // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size_1;     // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context_1;  // 0x0170(0x0008)(NoDestructor)
	struct FSingleDayClimate                      CallFunc_Apply_Weather_Override_Output_Get_1;      // 0x0178(0x0028)()
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas_2;   // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size_2;     // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context_2;  // 0x01B8(0x0008)(NoDestructor)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           UniqueObjectNameForCooking_LinearColor_1;          // 0x01CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraParameterCollectionInstance*    CallFunc_GetNiagaraParameterCollection_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ChanceOfPrecipitation;                // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Current_Temp;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Precipitation_Amount;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Normalized_Temperature;         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Final_Humidity;                 // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WeatherEvent_C*                     CallFunc_Array_Get_Item;                           // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAtmoBlendSettings                     K2Node_CustomEvent_Blend_Settings;                 // 0x0278(0x0010)(NoDestructor)
	int32                                         K2Node_CustomEvent_Override_Volmume_Hash;          // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FAtmoBlendSettings>        CallFunc_SortAtmoOverrides_ReturnValue;            // 0x0290(0x0050)()
	int32                                         K2Node_CustomEvent_Hash_Name_1;                    // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Hash_Name;                      // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Current_Transition;             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_InGameTimeSeconds;                    // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
