#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterSpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_WaterSpline.BP_WaterSpline_C.Add Swim Volumes
// 0x00E0 (0x00E0 - 0x0000)
struct BP_WaterSpline_C_Add_Swim_Volumes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UChildActorComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UChildActorComponent*                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0xB];                                       // 0x0045(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item_1;                         // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume*                           K2Node_DynamicCast_AsWater_Volume;                 // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterSpline_C_Add_Swim_Volumes) == 0x000010, "Wrong alignment on BP_WaterSpline_C_Add_Swim_Volumes");
static_assert(sizeof(BP_WaterSpline_C_Add_Swim_Volumes) == 0x0000E0, "Wrong size on BP_WaterSpline_C_Add_Swim_Volumes");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, Temp_int_Variable) == 0x000018, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000028, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, CallFunc_AddComponent_ReturnValue) == 0x0000B8, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C0, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, K2Node_DynamicCast_AsWater_Volume) == 0x0000C8, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::K2Node_DynamicCast_AsWater_Volume' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Add_Swim_Volumes, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BP_WaterSpline_C_Add_Swim_Volumes::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_WaterSpline.BP_WaterSpline_C.Align Edge Spline
// 0x01D0 (0x01D0 - 0x0000)
struct BP_WaterSpline_C_Align_Edge_Spline final
{
public:
	class USplineComponent*                       Spline_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       TempSpline;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindLocationClosestToWorldLocation_ReturnValue; // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Distance2D_ReturnValue;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_2;   // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FindInputKeyClosestToWorldLocation_ReturnValue; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_DoubleToVector2D_ReturnValue;        // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtSplineInputKey_ReturnValue; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue_1;            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterSpline_C_Align_Edge_Spline) == 0x000008, "Wrong alignment on BP_WaterSpline_C_Align_Edge_Spline");
static_assert(sizeof(BP_WaterSpline_C_Align_Edge_Spline) == 0x0001D0, "Wrong size on BP_WaterSpline_C_Align_Edge_Spline");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, Spline_0) == 0x000000, "Member 'BP_WaterSpline_C_Align_Edge_Spline::Spline_0' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, TempSpline) == 0x000008, "Member 'BP_WaterSpline_C_Align_Edge_Spline::TempSpline' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000010, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, Temp_int_Variable) == 0x000030, "Member 'BP_WaterSpline_C_Align_Edge_Spline::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000038, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_FindLocationClosestToWorldLocation_ReturnValue) == 0x000050, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_FindLocationClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000068, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000078, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x000080, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000098, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_GetSplineLength_ReturnValue) == 0x0000A8, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000B0, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Distance2D_ReturnValue) == 0x0000C0, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Normal2D_ReturnValue) == 0x0000C8, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue_2) == 0x0000E0, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_FClamp_ReturnValue) == 0x0000F8, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_FindInputKeyClosestToWorldLocation_ReturnValue) == 0x000100, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_FindInputKeyClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Conv_DoubleToVector2D_ReturnValue) == 0x000108, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Conv_DoubleToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_GetDistanceAlongSplineAtSplineInputKey_ReturnValue) == 0x000118, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_GetDistanceAlongSplineAtSplineInputKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000120, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000130, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000138, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_BreakVector2D_X) == 0x000148, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_BreakVector2D_Y) == 0x000150, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_GetSplineLength_ReturnValue_1) == 0x000158, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_GetSplineLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000160, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000168, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_BreakVector_X) == 0x000180, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_BreakVector_Y) == 0x000188, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_BreakVector_Z) == 0x000190, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_MakeVector_ReturnValue) == 0x000198, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0001B0, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0001B8, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0001C0, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Align_Edge_Spline, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0001C8, "Member 'BP_WaterSpline_C_Align_Edge_Spline::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");

// Function BP_WaterSpline.BP_WaterSpline_C.Bake Mesh
// 0x01A8 (0x01A8 - 0x0000)
struct BP_WaterSpline_C_Bake_Mesh final
{
public:
	class UDynamicMeshComponent*                  Dynamic_Mesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Asset_Tag;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UStaticMesh*                            Out_SM;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDynamicMeshComponent*                  DynMesh;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     mat;                                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            SMTemp;                                            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UDynamicMesh*                           CallFunc_GetDynamicMesh_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	struct FGeometryScriptCopyMeshToAssetOptions  K2Node_MakeStruct_GeometryScriptCopyMeshToAssetOptions; // 0x0098(0x0080)()
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeometryScriptOutcomePins                    CallFunc_CopyMeshToStaticMesh_Outcome;             // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMesh*                           CallFunc_CopyMeshToStaticMesh_ReturnValue;         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueObjectNameForCooking_CmpSuccess;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterface>            CallFunc_GetAssetTools_ReturnValue;                // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_CreateAsset_ReturnValue;                  // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_if_Mesh_Asset_Exists_Exists_;       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Check_if_Mesh_Asset_Exists_Return_Mesh;   // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterSpline_C_Bake_Mesh) == 0x000008, "Wrong alignment on BP_WaterSpline_C_Bake_Mesh");
static_assert(sizeof(BP_WaterSpline_C_Bake_Mesh) == 0x0001A8, "Wrong size on BP_WaterSpline_C_Bake_Mesh");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, Dynamic_Mesh) == 0x000000, "Member 'BP_WaterSpline_C_Bake_Mesh::Dynamic_Mesh' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, Material) == 0x000008, "Member 'BP_WaterSpline_C_Bake_Mesh::Material' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, Asset_Tag) == 0x000010, "Member 'BP_WaterSpline_C_Bake_Mesh::Asset_Tag' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, Out_SM) == 0x000020, "Member 'BP_WaterSpline_C_Bake_Mesh::Out_SM' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, DynMesh) == 0x000028, "Member 'BP_WaterSpline_C_Bake_Mesh::DynMesh' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, mat) == 0x000030, "Member 'BP_WaterSpline_C_Bake_Mesh::mat' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, SMTemp) == 0x000038, "Member 'BP_WaterSpline_C_Bake_Mesh::SMTemp' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_GetGameState_ReturnValue) == 0x000040, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000050, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_GetDynamicMesh_ReturnValue) == 0x000070, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_GetDynamicMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, K2Node_MakeArray_Array) == 0x000088, "Member 'BP_WaterSpline_C_Bake_Mesh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, K2Node_MakeStruct_GeometryScriptCopyMeshToAssetOptions) == 0x000098, "Member 'BP_WaterSpline_C_Bake_Mesh::K2Node_MakeStruct_GeometryScriptCopyMeshToAssetOptions' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_IsWithEditor_ReturnValue) == 0x000118, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_CopyMeshToStaticMesh_Outcome) == 0x000119, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_CopyMeshToStaticMesh_Outcome' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_CopyMeshToStaticMesh_ReturnValue) == 0x000120, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_CopyMeshToStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, UniqueObjectNameForCooking_CmpSuccess) == 0x000128, "Member 'BP_WaterSpline_C_Bake_Mesh::UniqueObjectNameForCooking_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_GetAssetTools_ReturnValue) == 0x000130, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_GetAssetTools_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_GetObjectName_ReturnValue) == 0x000140, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000150, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000160, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000170, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_CreateAsset_ReturnValue) == 0x000180, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_CreateAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_Check_if_Mesh_Asset_Exists_Exists_) == 0x000188, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_Check_if_Mesh_Asset_Exists_Exists_' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, CallFunc_Check_if_Mesh_Asset_Exists_Return_Mesh) == 0x000190, "Member 'BP_WaterSpline_C_Bake_Mesh::CallFunc_Check_if_Mesh_Asset_Exists_Return_Mesh' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, K2Node_DynamicCast_AsStatic_Mesh) == 0x000198, "Member 'BP_WaterSpline_C_Bake_Mesh::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Mesh, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'BP_WaterSpline_C_Bake_Mesh::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_WaterSpline.BP_WaterSpline_C.Bake UVs
// 0x0010 (0x0010 - 0x0000)
struct BP_WaterSpline_C_Bake_UVs final
{
public:
	class UDynamicMeshComponent*                  DynMesh;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CurIndex;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterSpline_C_Bake_UVs) == 0x000008, "Wrong alignment on BP_WaterSpline_C_Bake_UVs");
static_assert(sizeof(BP_WaterSpline_C_Bake_UVs) == 0x000010, "Wrong size on BP_WaterSpline_C_Bake_UVs");
static_assert(offsetof(BP_WaterSpline_C_Bake_UVs, DynMesh) == 0x000000, "Member 'BP_WaterSpline_C_Bake_UVs::DynMesh' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_UVs, CurIndex) == 0x000008, "Member 'BP_WaterSpline_C_Bake_UVs::CurIndex' has a wrong offset!");

// Function BP_WaterSpline.BP_WaterSpline_C.Bake Vertex Colors
// 0x0200 (0x0200 - 0x0000)
struct BP_WaterSpline_C_Bake_Vertex_Colors final
{
public:
	class UDynamicMeshComponent*                  DynMesh;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CurIndex;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMesh*                           CallFunc_GetDynamicMesh_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometryScriptColorList               CallFunc_GetMeshPerVertexColors_ColorList;         // 0x0020(0x0010)()
	bool                                          CallFunc_GetMeshPerVertexColors_bIsValidColorSet;  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMeshPerVertexColors_bHasVertexIDGaps;  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMesh*                           CallFunc_GetMeshPerVertexColors_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVertexCount_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetVertexPosition_bIsValidVertex;         // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVertexPosition_ReturnValue;            // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0080(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindLocationClosestToWorldLocation_ReturnValue; // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDynamicMesh*                           CallFunc_SetMeshPerVertexColors_ReturnValue;       // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FindInputKeyClosestToWorldLocation_ReturnValue; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UniqueObjectNameForCooking_LinearColor;            // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetColorListItem_bIsValidIndex;           // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UniqueObjectNameForCooking_G_ImplicitCast;         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UniqueObjectNameForCooking_B_ImplicitCast;         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UniqueObjectNameForCooking_R_ImplicitCast;         // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UniqueObjectNameForCooking_A_ImplicitCast;         // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterSpline_C_Bake_Vertex_Colors) == 0x000010, "Wrong alignment on BP_WaterSpline_C_Bake_Vertex_Colors");
static_assert(sizeof(BP_WaterSpline_C_Bake_Vertex_Colors) == 0x000200, "Wrong size on BP_WaterSpline_C_Bake_Vertex_Colors");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, DynMesh) == 0x000000, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::DynMesh' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CurIndex) == 0x000008, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CurIndex' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_GetDynamicMesh_ReturnValue) == 0x000010, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_GetDynamicMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_GetMeshPerVertexColors_ColorList) == 0x000020, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_GetMeshPerVertexColors_ColorList' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_GetMeshPerVertexColors_bIsValidColorSet) == 0x000030, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_GetMeshPerVertexColors_bIsValidColorSet' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_GetMeshPerVertexColors_bHasVertexIDGaps) == 0x000031, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_GetMeshPerVertexColors_bHasVertexIDGaps' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_GetMeshPerVertexColors_ReturnValue) == 0x000038, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_GetMeshPerVertexColors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_GetVertexCount_ReturnValue) == 0x000040, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_GetVertexCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000045, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_BooleanAND_ReturnValue) == 0x000046, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_GetVertexPosition_bIsValidVertex) == 0x000047, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_GetVertexPosition_bIsValidVertex' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_GetVertexPosition_ReturnValue) == 0x000048, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_GetVertexPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, Temp_int_Variable) == 0x000060, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000064, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000068, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000078, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_GetTransform_ReturnValue) == 0x000080, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_TransformLocation_ReturnValue) == 0x0000E0, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_FindLocationClosestToWorldLocation_ReturnValue) == 0x0000F8, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_FindLocationClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_SetMeshPerVertexColors_ReturnValue) == 0x000110, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_SetMeshPerVertexColors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Vector_Distance_ReturnValue) == 0x000118, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_FindInputKeyClosestToWorldLocation_ReturnValue) == 0x000120, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_FindInputKeyClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000128, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000130, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000138, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000140, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000148, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x000150, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000158, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_FClamp_ReturnValue) == 0x000160, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000168, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_SelectFloat_ReturnValue) == 0x000170, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_BooleanXOR_ReturnValue) == 0x000178, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_FClamp_ReturnValue_1) == 0x000180, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_SelectFloat_ReturnValue_1) == 0x000188, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_FMin_ReturnValue) == 0x000190, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterSpline_C_Bake_Vertex_Colors, CallFunc_SelectFloat_ReturnValue_2) == 0x000198, "Member 'BP_WaterSpline_C_Bake_Vertex_Colors::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
