#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WallRoadLocator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WallRoadLocator.BP_WallRoadLocator_C
// 0x0078 (0x03C0 - 0x0348)
class ABP_WallRoadLocator_C final : public AActor
{
public:
	class UBillboardComponent*                    Billboard;                                         // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_WallRoadLocator_C*>          Neighbor_WallRoadLocators;                         // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ABP_LevelInstanceCell_C*>        Neighbor_Cells;                                    // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	double                                        Assign_Proximity;                                  // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UArrowComponent*>                Arrow_Components;                                  // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FVector                                Child_Intersection_Plane_Normal;                   // 0x0390(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                Child_Intersection_Position;                       // 0x03A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void Add_Editor_Helper_Arrows();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WallRoadLocator_C">();
	}
	static class ABP_WallRoadLocator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WallRoadLocator_C>();
	}
};
static_assert(alignof(ABP_WallRoadLocator_C) == 0x000008, "Wrong alignment on ABP_WallRoadLocator_C");
static_assert(sizeof(ABP_WallRoadLocator_C) == 0x0003C0, "Wrong size on ABP_WallRoadLocator_C");
static_assert(offsetof(ABP_WallRoadLocator_C, Billboard) == 0x000348, "Member 'ABP_WallRoadLocator_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_WallRoadLocator_C, DefaultSceneRoot) == 0x000350, "Member 'ABP_WallRoadLocator_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_WallRoadLocator_C, Neighbor_WallRoadLocators) == 0x000358, "Member 'ABP_WallRoadLocator_C::Neighbor_WallRoadLocators' has a wrong offset!");
static_assert(offsetof(ABP_WallRoadLocator_C, Neighbor_Cells) == 0x000368, "Member 'ABP_WallRoadLocator_C::Neighbor_Cells' has a wrong offset!");
static_assert(offsetof(ABP_WallRoadLocator_C, Assign_Proximity) == 0x000378, "Member 'ABP_WallRoadLocator_C::Assign_Proximity' has a wrong offset!");
static_assert(offsetof(ABP_WallRoadLocator_C, Arrow_Components) == 0x000380, "Member 'ABP_WallRoadLocator_C::Arrow_Components' has a wrong offset!");
static_assert(offsetof(ABP_WallRoadLocator_C, Child_Intersection_Plane_Normal) == 0x000390, "Member 'ABP_WallRoadLocator_C::Child_Intersection_Plane_Normal' has a wrong offset!");
static_assert(offsetof(ABP_WallRoadLocator_C, Child_Intersection_Position) == 0x0003A8, "Member 'ABP_WallRoadLocator_C::Child_Intersection_Position' has a wrong offset!");

}

