#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterLake

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_WaterLake.BP_WaterLake_C.Add Swim Volumes
// 0x00D0 (0x00D0 - 0x0000)
struct BP_WaterLake_C_Add_Swim_Volumes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UChildActorComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume*                           K2Node_DynamicCast_AsWater_Volume;                 // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterLake_C_Add_Swim_Volumes) == 0x000010, "Wrong alignment on BP_WaterLake_C_Add_Swim_Volumes");
static_assert(sizeof(BP_WaterLake_C_Add_Swim_Volumes) == 0x0000D0, "Wrong size on BP_WaterLake_C_Add_Swim_Volumes");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_WaterLake_C_Add_Swim_Volumes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_WaterLake_C_Add_Swim_Volumes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_WaterLake_C_Add_Swim_Volumes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BP_WaterLake_C_Add_Swim_Volumes::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_WaterLake_C_Add_Swim_Volumes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_WaterLake_C_Add_Swim_Volumes::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_WaterLake_C_Add_Swim_Volumes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'BP_WaterLake_C_Add_Swim_Volumes::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, CallFunc_AddComponent_ReturnValue) == 0x000098, "Member 'BP_WaterLake_C_Add_Swim_Volumes::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, K2Node_DynamicCast_AsWater_Volume) == 0x0000A0, "Member 'BP_WaterLake_C_Add_Swim_Volumes::K2Node_DynamicCast_AsWater_Volume' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_WaterLake_C_Add_Swim_Volumes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, CallFunc_Array_Length_ReturnValue_1) == 0x0000AC, "Member 'BP_WaterLake_C_Add_Swim_Volumes::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_WaterLake_C_Add_Swim_Volumes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, Temp_int_Variable) == 0x0000B4, "Member 'BP_WaterLake_C_Add_Swim_Volumes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_WaterLake_C_Add_Swim_Volumes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000BC, "Member 'BP_WaterLake_C_Add_Swim_Volumes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, Temp_int_Loop_Counter_Variable_1) == 0x0000C0, "Member 'BP_WaterLake_C_Add_Swim_Volumes::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C4, "Member 'BP_WaterLake_C_Add_Swim_Volumes::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Add_Swim_Volumes, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000C8, "Member 'BP_WaterLake_C_Add_Swim_Volumes::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_WaterLake.BP_WaterLake_C.Bake Mesh
// 0x01A8 (0x01A8 - 0x0000)
struct BP_WaterLake_C_Bake_Mesh final
{
public:
	class UDynamicMeshComponent*                  Dynamic_Mesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Asset_Tag;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UStaticMesh*                            Out_SM;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDynamicMeshComponent*                  DynMesh;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     mat;                                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            SMTemp;                                            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UDynamicMesh*                           CallFunc_GetDynamicMesh_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	struct FGeometryScriptCopyMeshToAssetOptions  K2Node_MakeStruct_GeometryScriptCopyMeshToAssetOptions; // 0x0098(0x0080)()
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeometryScriptOutcomePins                    CallFunc_CopyMeshToStaticMesh_Outcome;             // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMesh*                           CallFunc_CopyMeshToStaticMesh_ReturnValue;         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueObjectNameForCooking_CmpSuccess;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterface>            CallFunc_GetAssetTools_ReturnValue;                // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_CreateAsset_ReturnValue;                  // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_if_Mesh_Asset_Exists_Exists_;       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Check_if_Mesh_Asset_Exists_Return_Mesh;   // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterLake_C_Bake_Mesh) == 0x000008, "Wrong alignment on BP_WaterLake_C_Bake_Mesh");
static_assert(sizeof(BP_WaterLake_C_Bake_Mesh) == 0x0001A8, "Wrong size on BP_WaterLake_C_Bake_Mesh");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, Dynamic_Mesh) == 0x000000, "Member 'BP_WaterLake_C_Bake_Mesh::Dynamic_Mesh' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, Material) == 0x000008, "Member 'BP_WaterLake_C_Bake_Mesh::Material' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, Asset_Tag) == 0x000010, "Member 'BP_WaterLake_C_Bake_Mesh::Asset_Tag' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, Out_SM) == 0x000020, "Member 'BP_WaterLake_C_Bake_Mesh::Out_SM' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, DynMesh) == 0x000028, "Member 'BP_WaterLake_C_Bake_Mesh::DynMesh' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, mat) == 0x000030, "Member 'BP_WaterLake_C_Bake_Mesh::mat' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, SMTemp) == 0x000038, "Member 'BP_WaterLake_C_Bake_Mesh::SMTemp' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_GetGameState_ReturnValue) == 0x000040, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000050, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_GetDynamicMesh_ReturnValue) == 0x000080, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_GetDynamicMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, K2Node_MakeArray_Array) == 0x000088, "Member 'BP_WaterLake_C_Bake_Mesh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, K2Node_MakeStruct_GeometryScriptCopyMeshToAssetOptions) == 0x000098, "Member 'BP_WaterLake_C_Bake_Mesh::K2Node_MakeStruct_GeometryScriptCopyMeshToAssetOptions' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_IsWithEditor_ReturnValue) == 0x000118, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_CopyMeshToStaticMesh_Outcome) == 0x000119, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_CopyMeshToStaticMesh_Outcome' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_CopyMeshToStaticMesh_ReturnValue) == 0x000120, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_CopyMeshToStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, UniqueObjectNameForCooking_CmpSuccess) == 0x000128, "Member 'BP_WaterLake_C_Bake_Mesh::UniqueObjectNameForCooking_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_GetAssetTools_ReturnValue) == 0x000130, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_GetAssetTools_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_GetObjectName_ReturnValue) == 0x000140, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000150, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000160, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000170, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_CreateAsset_ReturnValue) == 0x000180, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_CreateAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_Check_if_Mesh_Asset_Exists_Exists_) == 0x000188, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_Check_if_Mesh_Asset_Exists_Exists_' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, CallFunc_Check_if_Mesh_Asset_Exists_Return_Mesh) == 0x000190, "Member 'BP_WaterLake_C_Bake_Mesh::CallFunc_Check_if_Mesh_Asset_Exists_Return_Mesh' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, K2Node_DynamicCast_AsStatic_Mesh) == 0x000198, "Member 'BP_WaterLake_C_Bake_Mesh::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Mesh, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'BP_WaterLake_C_Bake_Mesh::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_WaterLake.BP_WaterLake_C.Bake Vertex Colors
// 0x00A8 (0x00A8 - 0x0000)
struct BP_WaterLake_C_Bake_Vertex_Colors final
{
public:
	class UDynamicMeshComponent*                  DynMesh;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDynamicMesh*                           CallFunc_GetDynamicMesh_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometryScriptIndexList               CallFunc_GetAllTriangleIDs_TriangleIDList;         // 0x0018(0x0018)()
	bool                                          CallFunc_GetAllTriangleIDs_bHasTriangleIDGaps;     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMesh*                           CallFunc_GetAllTriangleIDs_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_ConvertIndexListToArray_IndexArray;       // 0x0040(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometryScriptUVTriangle              UniqueObjectNameForCooking_GeometryScriptUVTriangle; // 0x0068(0x0030)(NoDestructor)
	bool                                          CallFunc_SetMeshTriangleUVs_bIsValidTriangle;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMesh*                           CallFunc_SetMeshTriangleUVs_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterLake_C_Bake_Vertex_Colors) == 0x000008, "Wrong alignment on BP_WaterLake_C_Bake_Vertex_Colors");
static_assert(sizeof(BP_WaterLake_C_Bake_Vertex_Colors) == 0x0000A8, "Wrong size on BP_WaterLake_C_Bake_Vertex_Colors");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, DynMesh) == 0x000000, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::DynMesh' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_GetDynamicMesh_ReturnValue) == 0x000008, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_GetDynamicMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_GetAllTriangleIDs_TriangleIDList) == 0x000018, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_GetAllTriangleIDs_TriangleIDList' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_GetAllTriangleIDs_bHasTriangleIDGaps) == 0x000030, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_GetAllTriangleIDs_bHasTriangleIDGaps' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_GetAllTriangleIDs_ReturnValue) == 0x000038, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_GetAllTriangleIDs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_ConvertIndexListToArray_IndexArray) == 0x000040, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_ConvertIndexListToArray_IndexArray' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_Array_Get_Item) == 0x000054, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_Greater_IntInt_ReturnValue) == 0x000065, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, UniqueObjectNameForCooking_GeometryScriptUVTriangle) == 0x000068, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::UniqueObjectNameForCooking_GeometryScriptUVTriangle' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_SetMeshTriangleUVs_bIsValidTriangle) == 0x000098, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_SetMeshTriangleUVs_bIsValidTriangle' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Vertex_Colors, CallFunc_SetMeshTriangleUVs_ReturnValue) == 0x0000A0, "Member 'BP_WaterLake_C_Bake_Vertex_Colors::CallFunc_SetMeshTriangleUVs_ReturnValue' has a wrong offset!");

// Function BP_WaterLake.BP_WaterLake_C.Bake Water Meshes
// 0x0028 (0x0028 - 0x0000)
struct BP_WaterLake_C_Bake_Water_Meshes final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     CallFunc_Decompose_to_Volume_Transforms_Transforms; // 0x0010(0x0010)(ReferenceParm)
	class UStaticMesh*                            CallFunc_Bake_Mesh_Out_SM;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterLake_C_Bake_Water_Meshes) == 0x000008, "Wrong alignment on BP_WaterLake_C_Bake_Water_Meshes");
static_assert(sizeof(BP_WaterLake_C_Bake_Water_Meshes) == 0x000028, "Wrong size on BP_WaterLake_C_Bake_Water_Meshes");
static_assert(offsetof(BP_WaterLake_C_Bake_Water_Meshes, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'BP_WaterLake_C_Bake_Water_Meshes::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Water_Meshes, CallFunc_IsWithEditor_ReturnValue) == 0x000008, "Member 'BP_WaterLake_C_Bake_Water_Meshes::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Water_Meshes, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_WaterLake_C_Bake_Water_Meshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Water_Meshes, CallFunc_Decompose_to_Volume_Transforms_Transforms) == 0x000010, "Member 'BP_WaterLake_C_Bake_Water_Meshes::CallFunc_Decompose_to_Volume_Transforms_Transforms' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Bake_Water_Meshes, CallFunc_Bake_Mesh_Out_SM) == 0x000020, "Member 'BP_WaterLake_C_Bake_Water_Meshes::CallFunc_Bake_Mesh_Out_SM' has a wrong offset!");

// Function BP_WaterLake.BP_WaterLake_C.Build Display Mesh
// 0x00A0 (0x00A0 - 0x0000)
struct BP_WaterLake_C_Build_Display_Mesh final
{
public:
	TArray<struct FVector2D>                      PolygonVertices;                                   // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UMaterialInterface*>             K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class UDynamicMesh*                           CallFunc_GetDynamicMesh_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometryScriptCalculateNormalsOptions UniqueObjectNameForCooking_GeometryScriptCalculateNormalsOptions; // 0x0028(0x0002)(NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMesh*                           CallFunc_Reset_ReturnValue;                        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometryScriptRemeshOptions           K2Node_MakeStruct_GeometryScriptRemeshOptions;     // 0x0038(0x001C)(NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometryScriptPrimitiveOptions        K2Node_MakeStruct_GeometryScriptPrimitiveOptions;  // 0x0060(0x0003)(NoDestructor)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometryScriptUniformRemeshOptions    K2Node_MakeStruct_GeometryScriptUniformRemeshOptions; // 0x0064(0x000C)(NoDestructor)
	class UDynamicMesh*                           CallFunc_AppendTriangulatedPolygon_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDynamicMesh*                           CallFunc_ApplyUniformRemesh_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDynamicMesh*                           CallFunc_RecomputeNormals_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDynamicMesh*                           CallFunc_ClearMaterialIDs_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_TargetEdgeLength_ImplicitCast;   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterLake_C_Build_Display_Mesh) == 0x000008, "Wrong alignment on BP_WaterLake_C_Build_Display_Mesh");
static_assert(sizeof(BP_WaterLake_C_Build_Display_Mesh) == 0x0000A0, "Wrong size on BP_WaterLake_C_Build_Display_Mesh");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, PolygonVertices) == 0x000000, "Member 'BP_WaterLake_C_Build_Display_Mesh::PolygonVertices' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_WaterLake_C_Build_Display_Mesh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, CallFunc_GetDynamicMesh_ReturnValue) == 0x000020, "Member 'BP_WaterLake_C_Build_Display_Mesh::CallFunc_GetDynamicMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, UniqueObjectNameForCooking_GeometryScriptCalculateNormalsOptions) == 0x000028, "Member 'BP_WaterLake_C_Build_Display_Mesh::UniqueObjectNameForCooking_GeometryScriptCalculateNormalsOptions' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, CallFunc_Reset_ReturnValue) == 0x000030, "Member 'BP_WaterLake_C_Build_Display_Mesh::CallFunc_Reset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, K2Node_MakeStruct_GeometryScriptRemeshOptions) == 0x000038, "Member 'BP_WaterLake_C_Build_Display_Mesh::K2Node_MakeStruct_GeometryScriptRemeshOptions' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, CallFunc_SelectFloat_ReturnValue) == 0x000058, "Member 'BP_WaterLake_C_Build_Display_Mesh::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, K2Node_MakeStruct_GeometryScriptPrimitiveOptions) == 0x000060, "Member 'BP_WaterLake_C_Build_Display_Mesh::K2Node_MakeStruct_GeometryScriptPrimitiveOptions' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, K2Node_MakeStruct_GeometryScriptUniformRemeshOptions) == 0x000064, "Member 'BP_WaterLake_C_Build_Display_Mesh::K2Node_MakeStruct_GeometryScriptUniformRemeshOptions' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, CallFunc_AppendTriangulatedPolygon_ReturnValue) == 0x000070, "Member 'BP_WaterLake_C_Build_Display_Mesh::CallFunc_AppendTriangulatedPolygon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, CallFunc_ApplyUniformRemesh_ReturnValue) == 0x000078, "Member 'BP_WaterLake_C_Build_Display_Mesh::CallFunc_ApplyUniformRemesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, CallFunc_RecomputeNormals_ReturnValue) == 0x000080, "Member 'BP_WaterLake_C_Build_Display_Mesh::CallFunc_RecomputeNormals_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, CallFunc_ClearMaterialIDs_ReturnValue) == 0x000088, "Member 'BP_WaterLake_C_Build_Display_Mesh::CallFunc_ClearMaterialIDs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, CallFunc_SelectFloat_A_ImplicitCast) == 0x000090, "Member 'BP_WaterLake_C_Build_Display_Mesh::CallFunc_SelectFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Display_Mesh, K2Node_MakeStruct_TargetEdgeLength_ImplicitCast) == 0x000098, "Member 'BP_WaterLake_C_Build_Display_Mesh::K2Node_MakeStruct_TargetEdgeLength_ImplicitCast' has a wrong offset!");

// Function BP_WaterLake.BP_WaterLake_C.Build Profile for Spline
// 0x00F8 (0x00F8 - 0x0000)
struct BP_WaterLake_C_Build_Profile_for_Spline final
{
public:
	double                                        Width;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Divisions;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      Positions;                                         // 0x0010(0x0010)(Parm, OutParm)
	TArray<double>                                UVs;                                               // 0x0020(0x0010)(Parm, OutParm)
	TArray<double>                                UV;                                                // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector2D>                      Pos;                                               // 0x0040(0x0010)(Edit, BlueprintVisible)
	int32                                         Div;                                               // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Wid;                                               // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterLake_C_Build_Profile_for_Spline) == 0x000008, "Wrong alignment on BP_WaterLake_C_Build_Profile_for_Spline");
static_assert(sizeof(BP_WaterLake_C_Build_Profile_for_Spline) == 0x0000F8, "Wrong size on BP_WaterLake_C_Build_Profile_for_Spline");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, Width) == 0x000000, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::Width' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, Divisions) == 0x000008, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::Divisions' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, Positions) == 0x000010, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::Positions' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, UVs) == 0x000020, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::UVs' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, UV) == 0x000030, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::UV' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, Pos) == 0x000040, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::Pos' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, Div) == 0x000050, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::Div' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, Wid) == 0x000058, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::Wid' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, Temp_int_Variable) == 0x000060, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000068, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000070, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000080, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000098, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0000A0, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0000B8, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000C0, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0000C8, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_MakeVector2D_ReturnValue) == 0x0000D0, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0000E0, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Array_Add_ReturnValue) == 0x0000E8, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_Array_Add_ReturnValue_1) == 0x0000EC, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Build_Profile_for_Spline, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_WaterLake_C_Build_Profile_for_Spline::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_WaterLake.BP_WaterLake_C.Check if Mesh Asset Exists
// 0x0110 (0x0110 - 0x0000)
struct BP_WaterLake_C_Check_if_Mesh_Asset_Exists final
{
public:
	class FString                                 Asset_Name;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Exists_;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Return_Mesh;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            SM;                                                // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          MeshExists;                                        // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAssetRegistry>        CallFunc_GetAssetRegistry_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FAssetData>                     CallFunc_GetAssetsByPath_OutAssetData;             // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetAssetsByPath_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetData                             CallFunc_Array_Get_Item;                           // 0x0070(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetAsset_ReturnValue;                     // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetFullName_ReturnValue;                  // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists) == 0x000008, "Wrong alignment on BP_WaterLake_C_Check_if_Mesh_Asset_Exists");
static_assert(sizeof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists) == 0x000110, "Wrong size on BP_WaterLake_C_Check_if_Mesh_Asset_Exists");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, Asset_Name) == 0x000000, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::Asset_Name' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, Exists_) == 0x000010, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::Exists_' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, Return_Mesh) == 0x000018, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::Return_Mesh' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, SM) == 0x000020, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::SM' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, MeshExists) == 0x000028, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::MeshExists' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, Temp_bool_True_if_break_was_hit_Variable) == 0x000029, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_Conv_StringToName_ReturnValue) == 0x000038, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_GetAssetRegistry_ReturnValue) == 0x000048, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_GetAssetRegistry_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_GetAssetsByPath_OutAssetData) == 0x000058, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_GetAssetsByPath_OutAssetData' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_GetAssetsByPath_ReturnValue) == 0x000068, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_GetAssetsByPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_IsValid_ReturnValue) == 0x0000D9, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_BooleanAND_ReturnValue) == 0x0000DA, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_GetAsset_ReturnValue) == 0x0000E0, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_GetAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, K2Node_DynamicCast_AsStatic_Mesh) == 0x0000E8, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_GetFullName_ReturnValue) == 0x0000F8, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_GetFullName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_Contains_ReturnValue) == 0x000108, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterLake_C_Check_if_Mesh_Asset_Exists, CallFunc_BooleanAND_ReturnValue_1) == 0x000109, "Member 'BP_WaterLake_C_Check_if_Mesh_Asset_Exists::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_WaterLake.BP_WaterLake_C.CheckInvalidateMeshes
