#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeatherManager

#include "Basic.hpp"

#include "STRUCT_CloudParameters_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "STRUCT_SingularClimateData_structs.hpp"
#include "Struct_BiomeClimate_structs.hpp"


namespace SDK::Params
{

// Function BP_WeatherManager.BP_WeatherManager_C.Add Global Noise To Climate
// 0x0168 (0x0168 - 0x0000)
struct BP_WeatherManager_C_Add_Global_Noise_To_Climate final
{
public:
	struct FSingleDayClimate                      Singular_Day_Climate;                              // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        TOD_for_Curves;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        In_TOY_in_hours;                                   // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Temp_0;                                    // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Amount_of_Precipitation;                           // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Humidity;                                  // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPI_ReturnValue;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Random_Chance_Of_Precip_Post_Noise;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Sin_ReturnValue;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_2;        // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast;                      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Random_Chance_Of_Precip_In_Float_ImplicitCast; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_A_ImplicitCast;                      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Add_Global_Noise_To_Climate) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Add_Global_Noise_To_Climate");
static_assert(sizeof(BP_WeatherManager_C_Add_Global_Noise_To_Climate) == 0x000168, "Wrong size on BP_WeatherManager_C_Add_Global_Noise_To_Climate");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, Singular_Day_Climate) == 0x000000, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::Singular_Day_Climate' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, TOD_for_Curves) == 0x000028, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::TOD_for_Curves' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, In_TOY_in_hours) == 0x000030, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::In_TOY_in_hours' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, Current_Temp_0) == 0x000038, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::Current_Temp_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, Amount_of_Precipitation) == 0x000040, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::Amount_of_Precipitation' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, Current_Humidity) == 0x000048, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::Current_Humidity' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_GetPI_ReturnValue) == 0x000050, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Random_Chance_Of_Precip_Post_Noise) == 0x000060, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Random_Chance_Of_Precip_Post_Noise' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_FClamp_ReturnValue) == 0x000080, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Sin_ReturnValue) == 0x000088, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_FMin_ReturnValue) == 0x000090, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000098, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0000A0, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B8, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Lerp_ReturnValue) == 0x0000C8, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_FClamp_ReturnValue_1) == 0x0000D0, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000E0, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000E8, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_FMin_ReturnValue_1) == 0x0000F0, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x0000F8, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Conv_DoubleToString_ReturnValue_2) == 0x000108, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Conv_DoubleToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000118, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000128, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Lerp_B_ImplicitCast) == 0x000138, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Lerp_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Lerp_A_ImplicitCast) == 0x000140, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Lerp_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000148, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Random_Chance_Of_Precip_In_Float_ImplicitCast) == 0x000150, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Random_Chance_Of_Precip_In_Float_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_FMin_A_ImplicitCast) == 0x000158, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_FMin_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Add_Global_Noise_To_Climate, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000160, "Member 'BP_WeatherManager_C_Add_Global_Noise_To_Climate::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.Calculate Dew Point
// 0x0038 (0x0038 - 0x0000)
struct BP_WeatherManager_C_Calculate_Dew_Point final
{
public:
	double                                        Current_Temp_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Humidity;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DewPoint;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Calculate_Dew_Point) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Calculate_Dew_Point");
static_assert(sizeof(BP_WeatherManager_C_Calculate_Dew_Point) == 0x000038, "Wrong size on BP_WeatherManager_C_Calculate_Dew_Point");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, Current_Temp_0) == 0x000000, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::Current_Temp_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, Current_Humidity) == 0x000008, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::Current_Humidity' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, DewPoint) == 0x000010, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::DewPoint' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.Calculate Weness
// 0x0020 (0x0020 - 0x0000)
struct BP_WeatherManager_C_Calculate_Weness final
{
public:
	double                                        Precipitation_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Calculate_Weness) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Calculate_Weness");
static_assert(sizeof(BP_WeatherManager_C_Calculate_Weness) == 0x000020, "Wrong size on BP_WeatherManager_C_Calculate_Weness");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Weness, Precipitation_0) == 0x000000, "Member 'BP_WeatherManager_C_Calculate_Weness::Precipitation_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Weness, ReturnValue) == 0x000008, "Member 'BP_WeatherManager_C_Calculate_Weness::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Weness, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'BP_WeatherManager_C_Calculate_Weness::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Weness, CallFunc_Lerp_ReturnValue_1) == 0x000018, "Member 'BP_WeatherManager_C_Calculate_Weness::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.Cloud DA to Struct
// 0x0330 (0x0330 - 0x0000)
struct BP_WeatherManager_C_Cloud_DA_to_Struct final
{
public:
	class UBPDA_CloudPreset_C*                    Cloud_DA_in;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CloudParameters                StructOut;                                         // 0x0008(0x0190)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CloudParameters                Cloud_Sturct;                                      // 0x0198(0x0190)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue_1;    // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Cloud_DA_to_Struct) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Cloud_DA_to_Struct");
static_assert(sizeof(BP_WeatherManager_C_Cloud_DA_to_Struct) == 0x000330, "Wrong size on BP_WeatherManager_C_Cloud_DA_to_Struct");
static_assert(offsetof(BP_WeatherManager_C_Cloud_DA_to_Struct, Cloud_DA_in) == 0x000000, "Member 'BP_WeatherManager_C_Cloud_DA_to_Struct::Cloud_DA_in' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_DA_to_Struct, StructOut) == 0x000008, "Member 'BP_WeatherManager_C_Cloud_DA_to_Struct::StructOut' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_DA_to_Struct, Cloud_Sturct) == 0x000198, "Member 'BP_WeatherManager_C_Cloud_DA_to_Struct::Cloud_Sturct' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_DA_to_Struct, CallFunc_Conv_LinearColorToColor_ReturnValue) == 0x000328, "Member 'BP_WeatherManager_C_Cloud_DA_to_Struct::CallFunc_Conv_LinearColorToColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_DA_to_Struct, CallFunc_Conv_LinearColorToColor_ReturnValue_1) == 0x00032C, "Member 'BP_WeatherManager_C_Cloud_DA_to_Struct::CallFunc_Conv_LinearColorToColor_ReturnValue_1' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.Cloud Logic
// 0x0788 (0x0788 - 0x0000)
struct BP_WeatherManager_C_Cloud_Logic final
{
public:
	double                                        Humidity;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Chance_Of_Precipitation;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DEBUG_Alpha_for_Blend;                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cloud_Vis_0;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_CloudParameters                StructOut;                                         // 0x0020(0x0190)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerraGlobalSkyVolumetricCloudSettings ReturnValue;                                       // 0x01B0(0x012C)(Parm, OutParm, ReturnParm, NoDestructor)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_CloudParameters                Cloud_Blend_B;                                     // 0x02E0(0x0190)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CloudParameters                Cloud_Blend_A;                                     // 0x0470(0x0190)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      CallFunc_BlendClouds_ReturnValue;                  // 0x0608(0x0050)()
	struct FVerraGlobalSkyVolumetricCloudSettings CallFunc_ConvertMapToStruct_ReturnValue;           // 0x0658(0x012C)(NoDestructor)
	float                                         CallFunc_BlendClouds_Alpha_ImplicitCast;           // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Cloud_Logic) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Cloud_Logic");
static_assert(sizeof(BP_WeatherManager_C_Cloud_Logic) == 0x000788, "Wrong size on BP_WeatherManager_C_Cloud_Logic");
static_assert(offsetof(BP_WeatherManager_C_Cloud_Logic, Humidity) == 0x000000, "Member 'BP_WeatherManager_C_Cloud_Logic::Humidity' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_Logic, Chance_Of_Precipitation) == 0x000008, "Member 'BP_WeatherManager_C_Cloud_Logic::Chance_Of_Precipitation' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_Logic, DEBUG_Alpha_for_Blend) == 0x000010, "Member 'BP_WeatherManager_C_Cloud_Logic::DEBUG_Alpha_for_Blend' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_Logic, Cloud_Vis_0) == 0x000018, "Member 'BP_WeatherManager_C_Cloud_Logic::Cloud_Vis_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_Logic, StructOut) == 0x000020, "Member 'BP_WeatherManager_C_Cloud_Logic::StructOut' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_Logic, ReturnValue) == 0x0001B0, "Member 'BP_WeatherManager_C_Cloud_Logic::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_Logic, Cloud_Blend_B) == 0x0002E0, "Member 'BP_WeatherManager_C_Cloud_Logic::Cloud_Blend_B' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_Logic, Cloud_Blend_A) == 0x000470, "Member 'BP_WeatherManager_C_Cloud_Logic::Cloud_Blend_A' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_Logic, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000600, "Member 'BP_WeatherManager_C_Cloud_Logic::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_Logic, CallFunc_BlendClouds_ReturnValue) == 0x000608, "Member 'BP_WeatherManager_C_Cloud_Logic::CallFunc_BlendClouds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_Logic, CallFunc_ConvertMapToStruct_ReturnValue) == 0x000658, "Member 'BP_WeatherManager_C_Cloud_Logic::CallFunc_ConvertMapToStruct_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Cloud_Logic, CallFunc_BlendClouds_Alpha_ImplicitCast) == 0x000784, "Member 'BP_WeatherManager_C_Cloud_Logic::CallFunc_BlendClouds_Alpha_ImplicitCast' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.Determine Month
// 0x0020 (0x0020 - 0x0000)
struct BP_WeatherManager_C_Determine_Month final
{
public:
	double                                        In_Year;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Determine_Month) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Determine_Month");
static_assert(sizeof(BP_WeatherManager_C_Determine_Month) == 0x000020, "Wrong size on BP_WeatherManager_C_Determine_Month");
static_assert(offsetof(BP_WeatherManager_C_Determine_Month, In_Year) == 0x000000, "Member 'BP_WeatherManager_C_Determine_Month::In_Year' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Determine_Month, ReturnValue) == 0x000008, "Member 'BP_WeatherManager_C_Determine_Month::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Determine_Month, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_WeatherManager_C_Determine_Month::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Determine_Month, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'BP_WeatherManager_C_Determine_Month::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.LERP Clouds
// 0x0760 (0x0760 - 0x0000)
struct BP_WeatherManager_C_LERP_Clouds final
{
public:
	class UBPDA_CloudPreset_C*                    Clouds_1;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBPDA_CloudPreset_C*                    Clouds_2;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ALPHA;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPDA_CloudPreset_C*                    Cloud_Blend;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CloudParameters                Cloud_Struct_IN;                                   // 0x0020(0x0190)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          because_im_lazy_and_i_said_so;                     // 0x01B0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_CloudPreset_C*                    OutputPin;                                         // 0x01B8(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CloudParameters                Cloud_Struct_0;                                    // 0x01C0(0x0190)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CloudParameters                LV_CloudStruct2;                                   // 0x0350(0x0190)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CloudParameters                LV_CloudStruct;                                    // 0x04E0(0x0190)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A[0x6];                                      // 0x067A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A2[0x6];                                      // 0x06A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_2;                           // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_3;                           // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_3;                       // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_4;                       // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x06C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CA[0x6];                                      // 0x06CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_4;                           // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_5;                           // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_5;                       // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_6;                       // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x06F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F2[0x6];                                      // 0x06F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_6;                           // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_7;                           // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_7;                       // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0711(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_712[0x6];                                      // 0x0712(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_8;                           // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_9;                           // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_8;                       // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_9;                       // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x0739(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73A[0x6];                                      // 0x073A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_10;                          // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_11;                          // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_10;                      // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_11;                      // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_LERP_Clouds) == 0x000008, "Wrong alignment on BP_WeatherManager_C_LERP_Clouds");
static_assert(sizeof(BP_WeatherManager_C_LERP_Clouds) == 0x000760, "Wrong size on BP_WeatherManager_C_LERP_Clouds");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Clouds_1) == 0x000000, "Member 'BP_WeatherManager_C_LERP_Clouds::Clouds_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Clouds_2) == 0x000008, "Member 'BP_WeatherManager_C_LERP_Clouds::Clouds_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, ALPHA) == 0x000010, "Member 'BP_WeatherManager_C_LERP_Clouds::ALPHA' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Cloud_Blend) == 0x000018, "Member 'BP_WeatherManager_C_LERP_Clouds::Cloud_Blend' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Cloud_Struct_IN) == 0x000020, "Member 'BP_WeatherManager_C_LERP_Clouds::Cloud_Struct_IN' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, because_im_lazy_and_i_said_so) == 0x0001B0, "Member 'BP_WeatherManager_C_LERP_Clouds::because_im_lazy_and_i_said_so' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, OutputPin) == 0x0001B8, "Member 'BP_WeatherManager_C_LERP_Clouds::OutputPin' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Cloud_Struct_0) == 0x0001C0, "Member 'BP_WeatherManager_C_LERP_Clouds::Cloud_Struct_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, LV_CloudStruct2) == 0x000350, "Member 'BP_WeatherManager_C_LERP_Clouds::LV_CloudStruct2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, LV_CloudStruct) == 0x0004E0, "Member 'BP_WeatherManager_C_LERP_Clouds::LV_CloudStruct' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, CallFunc_Lerp_ReturnValue) == 0x000670, "Member 'BP_WeatherManager_C_LERP_Clouds::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Temp_bool_Variable) == 0x000678, "Member 'BP_WeatherManager_C_LERP_Clouds::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Temp_bool_Variable_1) == 0x000679, "Member 'BP_WeatherManager_C_LERP_Clouds::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, K2Node_Select_Default) == 0x000680, "Member 'BP_WeatherManager_C_LERP_Clouds::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, K2Node_Select_Default_1) == 0x000688, "Member 'BP_WeatherManager_C_LERP_Clouds::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, CallFunc_Lerp_ReturnValue_1) == 0x000690, "Member 'BP_WeatherManager_C_LERP_Clouds::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, CallFunc_Lerp_ReturnValue_2) == 0x000698, "Member 'BP_WeatherManager_C_LERP_Clouds::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Temp_bool_Variable_2) == 0x0006A0, "Member 'BP_WeatherManager_C_LERP_Clouds::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Temp_bool_Variable_3) == 0x0006A1, "Member 'BP_WeatherManager_C_LERP_Clouds::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, K2Node_Select_Default_2) == 0x0006A8, "Member 'BP_WeatherManager_C_LERP_Clouds::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, K2Node_Select_Default_3) == 0x0006B0, "Member 'BP_WeatherManager_C_LERP_Clouds::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, CallFunc_Lerp_ReturnValue_3) == 0x0006B8, "Member 'BP_WeatherManager_C_LERP_Clouds::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, CallFunc_Lerp_ReturnValue_4) == 0x0006C0, "Member 'BP_WeatherManager_C_LERP_Clouds::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Temp_bool_Variable_4) == 0x0006C8, "Member 'BP_WeatherManager_C_LERP_Clouds::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Temp_bool_Variable_5) == 0x0006C9, "Member 'BP_WeatherManager_C_LERP_Clouds::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, K2Node_Select_Default_4) == 0x0006D0, "Member 'BP_WeatherManager_C_LERP_Clouds::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, K2Node_Select_Default_5) == 0x0006D8, "Member 'BP_WeatherManager_C_LERP_Clouds::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, CallFunc_Lerp_ReturnValue_5) == 0x0006E0, "Member 'BP_WeatherManager_C_LERP_Clouds::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, CallFunc_Lerp_ReturnValue_6) == 0x0006E8, "Member 'BP_WeatherManager_C_LERP_Clouds::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Temp_bool_Variable_6) == 0x0006F0, "Member 'BP_WeatherManager_C_LERP_Clouds::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Temp_bool_Variable_7) == 0x0006F1, "Member 'BP_WeatherManager_C_LERP_Clouds::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, K2Node_Select_Default_6) == 0x0006F8, "Member 'BP_WeatherManager_C_LERP_Clouds::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, K2Node_Select_Default_7) == 0x000700, "Member 'BP_WeatherManager_C_LERP_Clouds::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, CallFunc_Lerp_ReturnValue_7) == 0x000708, "Member 'BP_WeatherManager_C_LERP_Clouds::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Temp_bool_Variable_8) == 0x000710, "Member 'BP_WeatherManager_C_LERP_Clouds::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Temp_bool_Variable_9) == 0x000711, "Member 'BP_WeatherManager_C_LERP_Clouds::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, K2Node_Select_Default_8) == 0x000718, "Member 'BP_WeatherManager_C_LERP_Clouds::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, K2Node_Select_Default_9) == 0x000720, "Member 'BP_WeatherManager_C_LERP_Clouds::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, CallFunc_Lerp_ReturnValue_8) == 0x000728, "Member 'BP_WeatherManager_C_LERP_Clouds::CallFunc_Lerp_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, CallFunc_Lerp_ReturnValue_9) == 0x000730, "Member 'BP_WeatherManager_C_LERP_Clouds::CallFunc_Lerp_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Temp_bool_Variable_10) == 0x000738, "Member 'BP_WeatherManager_C_LERP_Clouds::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, Temp_bool_Variable_11) == 0x000739, "Member 'BP_WeatherManager_C_LERP_Clouds::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, K2Node_Select_Default_10) == 0x000740, "Member 'BP_WeatherManager_C_LERP_Clouds::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, K2Node_Select_Default_11) == 0x000748, "Member 'BP_WeatherManager_C_LERP_Clouds::K2Node_Select_Default_11' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, CallFunc_Lerp_ReturnValue_10) == 0x000750, "Member 'BP_WeatherManager_C_LERP_Clouds::CallFunc_Lerp_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_LERP_Clouds, CallFunc_Lerp_ReturnValue_11) == 0x000758, "Member 'BP_WeatherManager_C_LERP_Clouds::CallFunc_Lerp_ReturnValue_11' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.LERP Clouds2
// 0x0BE8 (0x0BE8 - 0x0000)
struct BP_WeatherManager_C_LERP_Clouds2 final
{
public:
	double                                        ALPHA;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FSTRUCT_CloudParameters> CloudPack_0;                                       // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Cloud_A_Index;                                     // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cloud_B_Index;                                     // 0x005C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Previous_Struct;                               // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_CloudParameters                Previous_Cloud_Blend;                              // 0x0068(0x0190)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CloudParameters                StructOut;                                         // 0x01F8(0x0190)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CloudParameters                LV_Cloud_Struct;                                   // 0x0388(0x0190)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTRUCT_CloudParameters>        CallFunc_Map_Values_Values;                        // 0x0520(0x0010)(ReferenceParm)
	struct FSTRUCT_CloudParameters                CallFunc_Array_Get_Item;                           // 0x0530(0x0190)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CloudParameters                CallFunc_Array_Get_Item_1;                         // 0x06C0(0x0190)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CloudParameters                K2Node_Select_Default;                             // 0x0850(0x0190)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x09E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x09F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x09F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0A00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_3;                       // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_4;                       // 0x0A10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_5;                       // 0x0A18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_6;                       // 0x0A20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_7;                       // 0x0A28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_8;                       // 0x0A30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_9;                       // 0x0A38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_10;                      // 0x0A40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_11;                      // 0x0A48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_12;                      // 0x0A50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_13;                      // 0x0A58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_14;                      // 0x0A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_15;                      // 0x0A68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_16;                      // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0A78(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_17;                      // 0x0A88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_18;                      // 0x0A90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_19;                      // 0x0A98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_20;                      // 0x0AA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_21;                      // 0x0AA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_22;                      // 0x0AB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_23;                      // 0x0AB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_24;                      // 0x0AC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_25;                      // 0x0AC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_26;                      // 0x0AD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_27;                      // 0x0AD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_28;                      // 0x0AE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x0AE8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_29;                      // 0x0AF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_30;                      // 0x0B00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_31;                      // 0x0B08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_32;                      // 0x0B10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0B18(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_2;    // 0x0B28(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_2;            // 0x0B38(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_33;                      // 0x0B48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x0B50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B54[0x4];                                      // 0x0B54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
