#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeatherManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_BiomeClimate_structs.hpp"
#include "E_Weather_HumidityCondition_structs.hpp"
#include "E_Weather_FogCondition_structs.hpp"
#include "E_Weather_WindCondition_structs.hpp"
#include "E_Weather_SnowCondition_structs.hpp"
#include "E_Weather_RainCondition_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "STRUCT_SingularClimateData_structs.hpp"


namespace SDK::Params
{

// Function BP_WeatherManager.BP_WeatherManager_C.Absolute Humidity
// 0x00A0 (0x00A0 - 0x0000)
struct BP_WeatherManager_C_Absolute_Humidity final
{
public:
	double                                        Normalized_Temp_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Humidity;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Dew_Pont;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Exp_ReturnValue;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Exp_ReturnValue_1;                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Absolute_Humidity) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Absolute_Humidity");
static_assert(sizeof(BP_WeatherManager_C_Absolute_Humidity) == 0x0000A0, "Wrong size on BP_WeatherManager_C_Absolute_Humidity");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, Normalized_Temp_0) == 0x000000, "Member 'BP_WeatherManager_C_Absolute_Humidity::Normalized_Temp_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, Humidity) == 0x000008, "Member 'BP_WeatherManager_C_Absolute_Humidity::Humidity' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, Dew_Pont) == 0x000010, "Member 'BP_WeatherManager_C_Absolute_Humidity::Dew_Pont' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000048, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000058, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000060, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000070, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Exp_ReturnValue) == 0x000078, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Exp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Exp_ReturnValue_1) == 0x000080, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Exp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000088, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000090, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Absolute_Humidity, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000098, "Member 'BP_WeatherManager_C_Absolute_Humidity::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.Assign Fog Condition
// 0x0028 (0x0028 - 0x0000)
struct BP_WeatherManager_C_Assign_Fog_Condition final
{
public:
	double                                        Fog_in;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_FogCondition                        FogCondition_0;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Fog;                                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3;  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4;  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Assign_Fog_Condition) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Assign_Fog_Condition");
static_assert(sizeof(BP_WeatherManager_C_Assign_Fog_Condition) == 0x000028, "Wrong size on BP_WeatherManager_C_Assign_Fog_Condition");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, Fog_in) == 0x000000, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::Fog_in' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, FogCondition_0) == 0x000008, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::FogCondition_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, Fog) == 0x000010, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::Fog' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000019, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x00001A, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x00001B, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3) == 0x00001D, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x00001E, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, CallFunc_BooleanAND_ReturnValue_1) == 0x00001F, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4) == 0x000020, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x000021, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Fog_Condition, CallFunc_BooleanAND_ReturnValue_2) == 0x000022, "Member 'BP_WeatherManager_C_Assign_Fog_Condition::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.Assign Humidity Condition
// 0x0028 (0x0028 - 0x0000)
struct BP_WeatherManager_C_Assign_Humidity_Condition final
{
public:
	double                                        Humidity;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_HumidityCondition                   HumidityCondition_0;                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Hum;                                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3;  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4;  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Assign_Humidity_Condition) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Assign_Humidity_Condition");
static_assert(sizeof(BP_WeatherManager_C_Assign_Humidity_Condition) == 0x000028, "Wrong size on BP_WeatherManager_C_Assign_Humidity_Condition");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, Humidity) == 0x000000, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::Humidity' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, HumidityCondition_0) == 0x000008, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::HumidityCondition_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, Hum) == 0x000010, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::Hum' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000019, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x00001A, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x00001B, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3) == 0x00001D, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x00001E, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, CallFunc_BooleanAND_ReturnValue_1) == 0x00001F, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4) == 0x000020, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x000021, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Humidity_Condition, CallFunc_BooleanAND_ReturnValue_2) == 0x000022, "Member 'BP_WeatherManager_C_Assign_Humidity_Condition::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.Assign Precipitation Condition
// 0x0048 (0x0048 - 0x0000)
struct BP_WeatherManager_C_Assign_Precipitation_Condition final
{
public:
	double                                        Precipitation;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temperature;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_RainCondition                       RainCondition_0;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_SnowCondition                       SnowCondition_0;                                   // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Precip;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3;  // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4;  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_5;  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_6;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_7;  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_8;  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_9;  // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_3;     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_10; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_11; // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Assign_Precipitation_Condition) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Assign_Precipitation_Condition");
static_assert(sizeof(BP_WeatherManager_C_Assign_Precipitation_Condition) == 0x000048, "Wrong size on BP_WeatherManager_C_Assign_Precipitation_Condition");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, Precipitation) == 0x000000, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::Precipitation' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, Temperature) == 0x000008, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::Temperature' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, RainCondition_0) == 0x000010, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::RainCondition_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, SnowCondition_0) == 0x000011, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::SnowCondition_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, Precip) == 0x000018, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::Precip' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000021, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_Not_PreBool_ReturnValue_1) == 0x000023, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanAND_ReturnValue_1) == 0x000025, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanAND_ReturnValue_2) == 0x000026, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanAND_ReturnValue_3) == 0x000027, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000029, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00002A, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00002B, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanOR_ReturnValue) == 0x00002C, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x00002D, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanAND_ReturnValue_4) == 0x00002E, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3) == 0x00002F, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4) == 0x000030, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000031, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanAND_ReturnValue_5) == 0x000032, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000033, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanOR_ReturnValue_1) == 0x000034, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanAND_ReturnValue_6) == 0x000035, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_5) == 0x000036, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000037, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_6) == 0x000038, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanAND_ReturnValue_7) == 0x000039, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_7) == 0x00003A, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x00003B, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanAND_ReturnValue_8) == 0x00003C, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_8) == 0x00003D, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x00003E, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_9) == 0x00003F, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue_3) == 0x000040, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_10) == 0x000041, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanAND_ReturnValue_9) == 0x000042, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_BooleanAND_ReturnValue_10) == 0x000043, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Precipitation_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_11) == 0x000044, "Member 'BP_WeatherManager_C_Assign_Precipitation_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_11' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.Assign Weather Conditions
// 0x0038 (0x0038 - 0x0000)
struct BP_WeatherManager_C_Assign_Weather_Conditions final
{
public:
	double                                        Temperature;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Precipitation;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Humidity;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fog;                                               // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wind_Speed;                                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_RainCondition                       RainCondition_0;                                   // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_SnowCondition                       SnowCondition_0;                                   // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_WindCondition                       WindCondition_0;                                   // 0x002A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_HumidityCondition                   HumidityCondition_0;                               // 0x002B(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_FogCondition                        FogCondition_0;                                    // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_RainCondition                       CallFunc_Assign_Precipitation_Condition_RainCondition; // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_SnowCondition                       CallFunc_Assign_Precipitation_Condition_SnowCondition; // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_WindCondition                       CallFunc_Assign_Wind_Condition_WindCondition;      // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_FogCondition                        CallFunc_Assign_Fog_Condition_FogCondition;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_HumidityCondition                   CallFunc_Assign_Humidity_Condition_HumidityCondition; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Assign_Weather_Conditions) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Assign_Weather_Conditions");
static_assert(sizeof(BP_WeatherManager_C_Assign_Weather_Conditions) == 0x000038, "Wrong size on BP_WeatherManager_C_Assign_Weather_Conditions");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, Temperature) == 0x000000, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::Temperature' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, Precipitation) == 0x000008, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::Precipitation' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, Humidity) == 0x000010, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::Humidity' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, Fog) == 0x000018, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::Fog' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, Wind_Speed) == 0x000020, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::Wind_Speed' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, RainCondition_0) == 0x000028, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::RainCondition_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, SnowCondition_0) == 0x000029, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::SnowCondition_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, WindCondition_0) == 0x00002A, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::WindCondition_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, HumidityCondition_0) == 0x00002B, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::HumidityCondition_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, FogCondition_0) == 0x00002C, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::FogCondition_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, CallFunc_Assign_Precipitation_Condition_RainCondition) == 0x00002D, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::CallFunc_Assign_Precipitation_Condition_RainCondition' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, CallFunc_Assign_Precipitation_Condition_SnowCondition) == 0x00002E, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::CallFunc_Assign_Precipitation_Condition_SnowCondition' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, CallFunc_Assign_Wind_Condition_WindCondition) == 0x00002F, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::CallFunc_Assign_Wind_Condition_WindCondition' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, CallFunc_Assign_Fog_Condition_FogCondition) == 0x000030, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::CallFunc_Assign_Fog_Condition_FogCondition' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Weather_Conditions, CallFunc_Assign_Humidity_Condition_HumidityCondition) == 0x000031, "Member 'BP_WeatherManager_C_Assign_Weather_Conditions::CallFunc_Assign_Humidity_Condition_HumidityCondition' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.Assign Wind Condition
// 0x0028 (0x0028 - 0x0000)
struct BP_WeatherManager_C_Assign_Wind_Condition final
{
public:
	double                                        WindSpeed;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Weather_WindCondition                       WindCondition_0;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Speed;                                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3;  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4;  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Assign_Wind_Condition) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Assign_Wind_Condition");
static_assert(sizeof(BP_WeatherManager_C_Assign_Wind_Condition) == 0x000028, "Wrong size on BP_WeatherManager_C_Assign_Wind_Condition");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, WindSpeed) == 0x000000, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::WindSpeed' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, WindCondition_0) == 0x000008, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::WindCondition_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, Speed) == 0x000010, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::Speed' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000019, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x00001A, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x00001B, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x00001D, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3) == 0x00001E, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, CallFunc_BooleanAND_ReturnValue_1) == 0x00001F, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x000020, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4) == 0x000021, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Assign_Wind_Condition, CallFunc_BooleanAND_ReturnValue_2) == 0x000022, "Member 'BP_WeatherManager_C_Assign_Wind_Condition::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.Calculate Dew Point
// 0x0050 (0x0050 - 0x0000)
struct BP_WeatherManager_C_Calculate_Dew_Point final
{
public:
	double                                        Normalized_Temp_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Humidity;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wetness_0;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NormalizedDewPoint;                                // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherManager_C_Calculate_Dew_Point) == 0x000008, "Wrong alignment on BP_WeatherManager_C_Calculate_Dew_Point");
static_assert(sizeof(BP_WeatherManager_C_Calculate_Dew_Point) == 0x000050, "Wrong size on BP_WeatherManager_C_Calculate_Dew_Point");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, Normalized_Temp_0) == 0x000000, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::Normalized_Temp_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, Current_Humidity) == 0x000008, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::Current_Humidity' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, Wetness_0) == 0x000010, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::Wetness_0' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, NormalizedDewPoint) == 0x000018, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::NormalizedDewPoint' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherManager_C_Calculate_Dew_Point, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'BP_WeatherManager_C_Calculate_Dew_Point::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_WeatherManager.BP_WeatherManager_C.Calculate Humidity
// 0x0068 (0x0068 - 0x0000)
struct BP_WeatherManager_C_Calculate_Humidity final
{
public:
	double                                        Humidity;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        In_Time_of_Year_in_hours;                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wetness_0;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
