#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_RoadsCommon

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_RoadsCommon.BPI_RoadsCommon_C.Capture Minimap
// 0x0018 (0x0018 - 0x0000)
struct BPI_RoadsCommon_C_Capture_Minimap final
{
public:
	bool                                          Is_Capturing;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Height_Offset;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Width_Scale;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_RoadsCommon_C_Capture_Minimap) == 0x000008, "Wrong alignment on BPI_RoadsCommon_C_Capture_Minimap");
static_assert(sizeof(BPI_RoadsCommon_C_Capture_Minimap) == 0x000018, "Wrong size on BPI_RoadsCommon_C_Capture_Minimap");
static_assert(offsetof(BPI_RoadsCommon_C_Capture_Minimap, Is_Capturing) == 0x000000, "Member 'BPI_RoadsCommon_C_Capture_Minimap::Is_Capturing' has a wrong offset!");
static_assert(offsetof(BPI_RoadsCommon_C_Capture_Minimap, Height_Offset) == 0x000008, "Member 'BPI_RoadsCommon_C_Capture_Minimap::Height_Offset' has a wrong offset!");
static_assert(offsetof(BPI_RoadsCommon_C_Capture_Minimap, Width_Scale) == 0x000010, "Member 'BPI_RoadsCommon_C_Capture_Minimap::Width_Scale' has a wrong offset!");

}

