#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bulletin_Board_Appearance_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bulletin_Board_Appearance_BP.Bulletin_Board_Appearance_BP_C
// 0x00B8 (0x0400 - 0x0348)
class ABulletin_Board_Appearance_BP_C final : public AActor
{
public:
	class UMapRegistrationComponentBP_C*          MapRegistrationComponentBP;                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_MonsterBountyBoard_Brazier2_StaticMeshComponent0; // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_MonsterBountyBoard_Brazier_StaticMeshComponent0; // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_MonsterBountyBoard_StaticMeshComponent0;         // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_HuKae_Nail_8_StaticMeshComponent0;               // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_HuKae_Nail_7_StaticMeshComponent0;               // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_HuKae_Nail_6_StaticMeshComponent0;               // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_HuKae_Nail_4_StaticMeshComponent0;               // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_HuKae_Nail_3_StaticMeshComponent0;               // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_HuKae_Nail_2_StaticMeshComponent0;               // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_HuKae_Nail_01_StaticMeshComponent0;              // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Huekae_HuntingLodge_Papers_9_StaticMeshComponent0; // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Huekae_HuntingLodge_Papers_8_StaticMeshComponent0; // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Huekae_HuntingLodge_Papers_7_StaticMeshComponent0; // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Huekae_HuntingLodge_Papers_6_StaticMeshComponent0; // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Huekae_HuntingLodge_Papers_5_StaticMeshComponent0; // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Huekae_HuntingLodge_Papers_04_StaticMeshComponent0; // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Huekae_HuntingLodge_Papers_4_StaticMeshComponent0; // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Huekae_HuntingLodge_Papers_03_StaticMeshComponent0; // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Huekae_HuntingLodge_Papers_02_StaticMeshComponent0; // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Huekae_HuntingLodge_Papers_01_StaticMeshComponent0; // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HuKaelar_Signs_MissingPoster_01_StaticMeshComponent0; // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bulletin_Board_Appearance_BP_C">();
	}
	static class ABulletin_Board_Appearance_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABulletin_Board_Appearance_BP_C>();
	}
};
static_assert(alignof(ABulletin_Board_Appearance_BP_C) == 0x000008, "Wrong alignment on ABulletin_Board_Appearance_BP_C");
static_assert(sizeof(ABulletin_Board_Appearance_BP_C) == 0x000400, "Wrong size on ABulletin_Board_Appearance_BP_C");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, MapRegistrationComponentBP) == 0x000348, "Member 'ABulletin_Board_Appearance_BP_C::MapRegistrationComponentBP' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_MonsterBountyBoard_Brazier2_StaticMeshComponent0) == 0x000350, "Member 'ABulletin_Board_Appearance_BP_C::S_MonsterBountyBoard_Brazier2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_MonsterBountyBoard_Brazier_StaticMeshComponent0) == 0x000358, "Member 'ABulletin_Board_Appearance_BP_C::S_MonsterBountyBoard_Brazier_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_MonsterBountyBoard_StaticMeshComponent0) == 0x000360, "Member 'ABulletin_Board_Appearance_BP_C::S_MonsterBountyBoard_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_HuKae_Nail_8_StaticMeshComponent0) == 0x000368, "Member 'ABulletin_Board_Appearance_BP_C::S_HuKae_Nail_8_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_HuKae_Nail_7_StaticMeshComponent0) == 0x000370, "Member 'ABulletin_Board_Appearance_BP_C::S_HuKae_Nail_7_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_HuKae_Nail_6_StaticMeshComponent0) == 0x000378, "Member 'ABulletin_Board_Appearance_BP_C::S_HuKae_Nail_6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_HuKae_Nail_4_StaticMeshComponent0) == 0x000380, "Member 'ABulletin_Board_Appearance_BP_C::S_HuKae_Nail_4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_HuKae_Nail_3_StaticMeshComponent0) == 0x000388, "Member 'ABulletin_Board_Appearance_BP_C::S_HuKae_Nail_3_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_HuKae_Nail_2_StaticMeshComponent0) == 0x000390, "Member 'ABulletin_Board_Appearance_BP_C::S_HuKae_Nail_2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_HuKae_Nail_01_StaticMeshComponent0) == 0x000398, "Member 'ABulletin_Board_Appearance_BP_C::S_HuKae_Nail_01_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_Huekae_HuntingLodge_Papers_9_StaticMeshComponent0) == 0x0003A0, "Member 'ABulletin_Board_Appearance_BP_C::S_Huekae_HuntingLodge_Papers_9_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_Huekae_HuntingLodge_Papers_8_StaticMeshComponent0) == 0x0003A8, "Member 'ABulletin_Board_Appearance_BP_C::S_Huekae_HuntingLodge_Papers_8_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_Huekae_HuntingLodge_Papers_7_StaticMeshComponent0) == 0x0003B0, "Member 'ABulletin_Board_Appearance_BP_C::S_Huekae_HuntingLodge_Papers_7_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_Huekae_HuntingLodge_Papers_6_StaticMeshComponent0) == 0x0003B8, "Member 'ABulletin_Board_Appearance_BP_C::S_Huekae_HuntingLodge_Papers_6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_Huekae_HuntingLodge_Papers_5_StaticMeshComponent0) == 0x0003C0, "Member 'ABulletin_Board_Appearance_BP_C::S_Huekae_HuntingLodge_Papers_5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_Huekae_HuntingLodge_Papers_04_StaticMeshComponent0) == 0x0003C8, "Member 'ABulletin_Board_Appearance_BP_C::S_Huekae_HuntingLodge_Papers_04_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_Huekae_HuntingLodge_Papers_4_StaticMeshComponent0) == 0x0003D0, "Member 'ABulletin_Board_Appearance_BP_C::S_Huekae_HuntingLodge_Papers_4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_Huekae_HuntingLodge_Papers_03_StaticMeshComponent0) == 0x0003D8, "Member 'ABulletin_Board_Appearance_BP_C::S_Huekae_HuntingLodge_Papers_03_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_Huekae_HuntingLodge_Papers_02_StaticMeshComponent0) == 0x0003E0, "Member 'ABulletin_Board_Appearance_BP_C::S_Huekae_HuntingLodge_Papers_02_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, S_Huekae_HuntingLodge_Papers_01_StaticMeshComponent0) == 0x0003E8, "Member 'ABulletin_Board_Appearance_BP_C::S_Huekae_HuntingLodge_Papers_01_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, HuKaelar_Signs_MissingPoster_01_StaticMeshComponent0) == 0x0003F0, "Member 'ABulletin_Board_Appearance_BP_C::HuKaelar_Signs_MissingPoster_01_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABulletin_Board_Appearance_BP_C, SharedRoot) == 0x0003F8, "Member 'ABulletin_Board_Appearance_BP_C::SharedRoot' has a wrong offset!");

}

