#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Caravel_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Caravel_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Caravel_AnimBP.Caravel_AnimBP_C
// 0x0760 (0x1850 - 0x10F0)
class UCaravel_AnimBP_C final : public UAoCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x10F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Caravel_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x10F8(0x0020)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1118(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1120(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1128(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1148(0x0070)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x11B8(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x12D0(0x0118)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x13E8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1430(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1478(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1498(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x1560(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1650(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1698(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x16E0(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1750(0x00F0)()
	bool                                          Turning;                                           // 0x1840(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurnRight;                                         // 0x1841(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurnLeft;                                          // 0x1842(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Caravel_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Caravel_AnimBP_C">();
	}
	static class UCaravel_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCaravel_AnimBP_C>();
	}
};
static_assert(alignof(UCaravel_AnimBP_C) == 0x000010, "Wrong alignment on UCaravel_AnimBP_C");
static_assert(sizeof(UCaravel_AnimBP_C) == 0x001850, "Wrong size on UCaravel_AnimBP_C");
static_assert(offsetof(UCaravel_AnimBP_C, UberGraphFrame) == 0x0010F0, "Member 'UCaravel_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, __AnimBlueprintMutables) == 0x0010F8, "Member 'UCaravel_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x001118, "Member 'UCaravel_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimBlueprintExtension_Base) == 0x001120, "Member 'UCaravel_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_Root) == 0x001128, "Member 'UCaravel_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x001148, "Member 'UCaravel_AnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace_1) == 0x0011B8, "Member 'UCaravel_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace_1' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x0012D0, "Member 'UCaravel_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_Slot) == 0x0013E8, "Member 'UCaravel_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001430, "Member 'UCaravel_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_StateResult) == 0x001478, "Member 'UCaravel_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_StateMachine) == 0x001498, "Member 'UCaravel_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_LayeredBoneBlend_1) == 0x001560, "Member 'UCaravel_AnimBP_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x001650, "Member 'UCaravel_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x001698, "Member 'UCaravel_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x0016E0, "Member 'UCaravel_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x001750, "Member 'UCaravel_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, Turning) == 0x001840, "Member 'UCaravel_AnimBP_C::Turning' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, TurnRight) == 0x001841, "Member 'UCaravel_AnimBP_C::TurnRight' has a wrong offset!");
static_assert(offsetof(UCaravel_AnimBP_C, TurnLeft) == 0x001842, "Member 'UCaravel_AnimBP_C::TurnLeft' has a wrong offset!");

}

