#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Caravel_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Caravel_AnimBP.Caravel_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct Caravel_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_87;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_88;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_89;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_90;                                 // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_91;                                  // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_92;                                 // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_93;                                   // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_94;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_95;                                 // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_96;                                // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          __StructProperty_97;                               // 0x0048(0x002C)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_98;                                 // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_99;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_100;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_101;                               // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_102;                                // 0x0084(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_103;                                // 0x0085(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_104;                                // 0x0086(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_105;                                // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_106;                              // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Caravel_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on Caravel_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_87) == 0x000004, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_87' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_88) == 0x00000C, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_88' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_89) == 0x000010, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_89' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_90) == 0x000014, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_90' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_91) == 0x00001C, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_91' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_92) == 0x000020, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_92' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_93) == 0x000028, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_93' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_94) == 0x000030, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_94' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_95) == 0x000031, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_95' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_96) == 0x000038, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_96' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_97) == 0x000048, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_97' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_98) == 0x000074, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_98' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_99) == 0x000078, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_99' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_100) == 0x00007C, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_100' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_101) == 0x000080, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_101' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_102) == 0x000084, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_102' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_103) == 0x000085, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_103' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_104) == 0x000086, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_104' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_105) == 0x000088, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_105' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_106) == 0x000090, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_106' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Caravel_AnimBP.Caravel_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x001F (0x0020 - 0x0001)
struct Caravel_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Caravel_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Caravel_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Caravel_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000020, "Wrong size on Caravel_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(Caravel_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x00001C, "Member 'Caravel_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");

}

