#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Caravan_Raft_AnimBP

#include "Basic.hpp"

#include "Caravan_Raft_AnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Caravan_Raft_AnimBP.Caravan_Raft_AnimBP_C
// 0x0340 (0x1430 - 0x10F0)
class UCaravan_Raft_AnimBP_C final : public UAoCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x10F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Caravan_Raft_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;          // 0x10F8(0x0018)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1110(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1118(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1120(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x1140(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x1258(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1370(0x0070)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x13E0(0x0048)()
	bool                                          MovingBackwards;                                   // 0x1428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Caravan_Raft_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Caravan_Raft_AnimBP_C">();
	}
	static class UCaravan_Raft_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCaravan_Raft_AnimBP_C>();
	}
};
static_assert(alignof(UCaravan_Raft_AnimBP_C) == 0x000010, "Wrong alignment on UCaravan_Raft_AnimBP_C");
static_assert(sizeof(UCaravan_Raft_AnimBP_C) == 0x001430, "Wrong size on UCaravan_Raft_AnimBP_C");
static_assert(offsetof(UCaravan_Raft_AnimBP_C, UberGraphFrame) == 0x0010F0, "Member 'UCaravan_Raft_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCaravan_Raft_AnimBP_C, __AnimBlueprintMutables) == 0x0010F8, "Member 'UCaravan_Raft_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UCaravan_Raft_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x001110, "Member 'UCaravan_Raft_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UCaravan_Raft_AnimBP_C, AnimBlueprintExtension_Base) == 0x001118, "Member 'UCaravan_Raft_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UCaravan_Raft_AnimBP_C, AnimGraphNode_Root) == 0x001120, "Member 'UCaravan_Raft_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCaravan_Raft_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace_1) == 0x001140, "Member 'UCaravan_Raft_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace_1' has a wrong offset!");
static_assert(offsetof(UCaravan_Raft_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x001258, "Member 'UCaravan_Raft_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UCaravan_Raft_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x001370, "Member 'UCaravan_Raft_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UCaravan_Raft_AnimBP_C, AnimGraphNode_Slot) == 0x0013E0, "Member 'UCaravan_Raft_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UCaravan_Raft_AnimBP_C, MovingBackwards) == 0x001428, "Member 'UCaravan_Raft_AnimBP_C::MovingBackwards' has a wrong offset!");

}

