#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CASTER_NPC_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct CASTER_NPC_AnimBP.CASTER_NPC_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x022F (0x0230 - 0x0001)
struct CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1068;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1069;                               // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1070;                               // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1071;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1072;                               // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1073;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1074;                               // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1075;                               // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1076;                               // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1077;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1078;                               // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1079;                               // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1080;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1081;                               // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1082;                               // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1083;                               // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1084;                              // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1085;                               // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1086;                               // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1087;                              // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1088;                               // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1089;                              // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1090;                              // 0x00B8(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_1091;                              // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1092;                              // 0x00D8(0x0010)(BlueprintVisible)
	struct FInputScaleBiasClampConstants          __StructProperty_1093;                             // 0x00E8(0x002C)(BlueprintVisible, NoDestructor)
	EAnimSyncMethod                               __EnumProperty_1094;                               // 0x0114(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1095;                               // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1096;                                 // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1097;                               // 0x0128(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1098;                               // 0x0129(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1099;                              // 0x0130(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1100;                               // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1101;                                // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1102;                               // 0x014C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1103;                               // 0x0154(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1104;                             // 0x0160(0x0020)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1105;                              // 0x0180(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1106;                               // 0x0184(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1107;                              // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1108;                               // 0x018C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1109;                               // 0x018D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1110;                               // 0x018E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18F[0x1];                                      // 0x018F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1111;                               // 0x0190(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0198(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0218(0x0018)()
};
static_assert(alignof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000230, "Wrong size on CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1068) == 0x000004, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1068' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1069) == 0x00000C, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1069' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1070) == 0x000010, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1070' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1071) == 0x000018, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1071' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1072) == 0x00001C, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1072' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1073) == 0x000024, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1073' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1074) == 0x000028, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1074' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1075) == 0x000030, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1075' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1076) == 0x000038, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1076' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1077) == 0x000040, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1077' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1078) == 0x000044, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1078' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1079) == 0x00004C, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1079' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1080) == 0x000054, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1080' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1081) == 0x000058, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1081' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1082) == 0x000060, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1082' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1083) == 0x000068, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1083' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1084) == 0x000070, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1084' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1085) == 0x000080, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1085' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1086) == 0x000088, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1086' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1087) == 0x000090, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1087' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1088) == 0x0000A0, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1088' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1089) == 0x0000A8, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1089' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1090) == 0x0000B8, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1090' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1091) == 0x0000C8, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1091' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1092) == 0x0000D8, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1092' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1093) == 0x0000E8, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1093' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1094) == 0x000114, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1094' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1095) == 0x000118, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1095' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1096) == 0x000120, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1096' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1097) == 0x000128, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1097' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1098) == 0x000129, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1098' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1099) == 0x000130, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1099' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1100) == 0x000140, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1100' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1101) == 0x000148, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1101' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1102) == 0x00014C, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1102' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1103) == 0x000154, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1103' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1104) == 0x000160, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1104' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1105) == 0x000180, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1105' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1106) == 0x000184, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1106' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1107) == 0x000188, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1107' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1108) == 0x00018C, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1108' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1109) == 0x00018D, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1109' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1110) == 0x00018E, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1110' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1111) == 0x000190, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1111' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000198, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000218, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct CASTER_NPC_AnimBP.CASTER_NPC_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x004B (0x004C - 0x0001)
struct CASTER_NPC_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_9;                                  // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x0025(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0026(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0027(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_14;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_17;                                 // 0x0035(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_18;                                 // 0x0036(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_19;                                 // 0x0037(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_21;                                 // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_22;                                 // 0x003A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_23;                                 // 0x003B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_24;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_25;                                 // 0x003D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_26;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_28;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on CASTER_NPC_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00004C, "Wrong size on CASTER_NPC_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(CASTER_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'CASTER_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
