#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct CCAnimBP.CCAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01DF (0x01E0 - 0x0001)
struct CCAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_512;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_513;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_514;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_515;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_516;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_517;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_518;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_519;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_520;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_521;                                // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_522;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_523;                                 // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_524;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_525;                              // 0x0050(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_526;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_527;                                // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_528;                                // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_529;                               // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_530;                               // 0x0098(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_531;                                // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_532;                                // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_533;                                 // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_534;                               // 0x00C0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_535;                               // 0x00D0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_536;                               // 0x00E0(0x0010)(BlueprintVisible)
	class UBlendProfile*                          __BlendProfile_537;                                // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_538;                                  // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_539;                                // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_540;                                // 0x0101(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_541;                                // 0x0102(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_542;                               // 0x0108(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_543;                               // 0x0118(0x0010)(BlueprintVisible)
	struct FAnimNodeFunctionRef                   __StructProperty_544;                              // 0x0128(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0148(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C8(0x0018)()
};
static_assert(alignof(CCAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on CCAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(CCAnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001E0, "Wrong size on CCAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_512) == 0x000004, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_512' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_513) == 0x00000C, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_513' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_514) == 0x000014, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_514' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_515) == 0x000018, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_515' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_516) == 0x000020, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_516' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_517) == 0x000024, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_517' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_518) == 0x00002C, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_518' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_519) == 0x000030, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_519' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_520) == 0x000038, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_520' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_521) == 0x00003C, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_521' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_522) == 0x000040, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_522' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_523) == 0x000048, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_523' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_524) == 0x00004C, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_524' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_525) == 0x000050, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_525' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_526) == 0x00007C, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_526' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_527) == 0x000080, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_527' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_528) == 0x000081, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_528' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_529) == 0x000088, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_529' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_530) == 0x000098, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_530' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_531) == 0x0000A8, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_531' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_532) == 0x0000B0, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_532' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_533) == 0x0000B8, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_533' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_534) == 0x0000C0, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_534' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_535) == 0x0000D0, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_535' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_536) == 0x0000E0, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_536' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_537) == 0x0000F0, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_537' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_538) == 0x0000F8, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_538' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_539) == 0x000100, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_539' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_540) == 0x000101, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_540' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_541) == 0x000102, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_541' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_542) == 0x000108, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_542' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_543) == 0x000118, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_543' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_544) == 0x000128, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_544' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000148, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001C8, "Member 'CCAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct CCAnimBP.CCAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x000F (0x0010 - 0x0001)
struct CCAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_1;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_3;                                  // 0x000A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_4;                                  // 0x000B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_5;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on CCAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(CCAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000010, "Wrong size on CCAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'CCAnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'CCAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_1) == 0x000008, "Member 'CCAnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_1' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000009, "Member 'CCAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_3) == 0x00000A, "Member 'CCAnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_3' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_4) == 0x00000B, "Member 'CCAnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_4' has a wrong offset!");
static_assert(offsetof(CCAnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_5) == 0x00000C, "Member 'CCAnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_5' has a wrong offset!");

}

