#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCAnimBP

#include "Basic.hpp"

#include "CCAnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass CCAnimBP.CCAnimBP_C
// 0x59A0 (0x6910 - 0x0F70)
class UCCAnimBP_C final : public UCharacterCreatorAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct CCAnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0F78(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0F88(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0F90(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0F98(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0FB8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1000(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1028(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1050(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1078(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x10A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x10C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x10F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x1118(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x1160(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x11A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x11F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x1238(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x1280(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x12C8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x1310(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x1358(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x13A0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x13E8(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1408(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x1428(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1470(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x1490(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x14D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x14F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1540(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x1560(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x15A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x15F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1638(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1680(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x16C8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1710(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1758(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x17A0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x17E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1830(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1850(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1918(0x0048)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x1960(0x0158)(ContainsInstancedReference)
	struct FAnimNode_ModifyBones                  AnimGraphNode_ModifyBones_1;                       // 0x1AB8(0x0120)()
	struct FAnimNode_ModifyBones                  AnimGraphNode_ModifyBones;                         // 0x1BD8(0x0120)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1CF8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1D18(0x0020)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x1D38(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1D80(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x1E00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x1E28(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x1E50(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_15;                       // 0x1E78(0x0460)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x22D8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x2320(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_14;                       // 0x2348(0x0460)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x27A8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x27F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x2818(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x2840(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_13;                       // 0x2868(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_12;                       // 0x2CC8(0x0460)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_11;                       // 0x3128(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x3588(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_10;                       // 0x35B0(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x3A10(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_9;                        // 0x3A38(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x3E98(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_8;                        // 0x3EC0(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x4320(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_7;                        // 0x4348(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x47A8(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_6;                        // 0x47D0(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x4C30(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_5;                        // 0x4C58(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x50B8(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_4;                        // 0x50E0(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x5540(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_3;                        // 0x5568(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x59C8(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_2;                        // 0x59F0(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x5E50(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x5E78(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x62D8(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x6300(0x0460)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x6760(0x0028)()
	double                                        __CustomProperty_Hands_Idle_Offset_00FF3ED54E8B9A689B79FEA410FDE198; // 0x6788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_00FF3ED54E8B9A689B79FEA410FDE198; // 0x6790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6791[0x7];                                     // 0x6791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_D1502EB74E8C4D14257490A968DE01CE; // 0x6798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_D1502EB74E8C4D14257490A968DE01CE; // 0x67A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_D1502EB74E8C4D14257490A968DE01CE; // 0x67A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A9[0x7];                                     // 0x67A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_FA3C4508472C64A3E091CDA9AE51B2D4; // 0x67B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_FA3C4508472C64A3E091CDA9AE51B2D4; // 0x67B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_FA3C4508472C64A3E091CDA9AE51B2D4; // 0x67C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67C1[0x7];                                     // 0x67C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_E2606461427365598D2F338FC404F0E8; // 0x67C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_E2606461427365598D2F338FC404F0E8; // 0x67D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_E2606461427365598D2F338FC404F0E8; // 0x67D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D9[0x7];                                     // 0x67D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_64ADDAE641485F07DBF3E1A6F793D85A; // 0x67E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_64ADDAE641485F07DBF3E1A6F793D85A; // 0x67E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_64ADDAE641485F07DBF3E1A6F793D85A; // 0x67F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67F1[0x7];                                     // 0x67F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_9B894F4341AAD36826793B86E8CE1FA3; // 0x67F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_9B894F4341AAD36826793B86E8CE1FA3; // 0x6800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_9B894F4341AAD36826793B86E8CE1FA3; // 0x6808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6809[0x7];                                     // 0x6809(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_C7D2CD7A4845BFDAB7AEC489F7093D8A; // 0x6810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_C7D2CD7A4845BFDAB7AEC489F7093D8A; // 0x6818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_C7D2CD7A4845BFDAB7AEC489F7093D8A; // 0x6820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6821[0x7];                                     // 0x6821(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_49CEAC464E17174E5B0E2BA26312B545; // 0x6828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_49CEAC464E17174E5B0E2BA26312B545; // 0x6830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_49CEAC464E17174E5B0E2BA26312B545; // 0x6838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6839[0x7];                                     // 0x6839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_49AF19C5495A757E0C19FB945581538C; // 0x6840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_49AF19C5495A757E0C19FB945581538C; // 0x6848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_49AF19C5495A757E0C19FB945581538C; // 0x6850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6851[0x7];                                     // 0x6851(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_4DBCEEF94BDE6C7D772CD4862926CBBE; // 0x6858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_4DBCEEF94BDE6C7D772CD4862926CBBE; // 0x6860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_4DBCEEF94BDE6C7D772CD4862926CBBE; // 0x6868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6869[0x7];                                     // 0x6869(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_065F336445AF049D76FD42A950CEC042; // 0x6870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_065F336445AF049D76FD42A950CEC042; // 0x6878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_065F336445AF049D76FD42A950CEC042; // 0x6880(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6881[0x7];                                     // 0x6881(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_452FDAE84B0AF1DB9911BEB3FE228F64; // 0x6888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_452FDAE84B0AF1DB9911BEB3FE228F64; // 0x6890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_452FDAE84B0AF1DB9911BEB3FE228F64; // 0x6898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6899[0x7];                                     // 0x6899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_8D20A0824E6463916F0850B47246739E; // 0x68A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_8D20A0824E6463916F0850B47246739E; // 0x68A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_8D20A0824E6463916F0850B47246739E; // 0x68B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68B1[0x7];                                     // 0x68B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_CC65A92B4DA23A641286B9A7E82E4A7C; // 0x68B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_CC65A92B4DA23A641286B9A7E82E4A7C; // 0x68C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_CC65A92B4DA23A641286B9A7E82E4A7C; // 0x68C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68C9[0x7];                                     // 0x68C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_16E3B0A341F5664F936FE9BB17AE43B9; // 0x68D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_16E3B0A341F5664F936FE9BB17AE43B9; // 0x68D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_16E3B0A341F5664F936FE9BB17AE43B9; // 0x68E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68E1[0x7];                                     // 0x68E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Hands_Additional_Offset_CFF2F411466936C5A4ACABBA60104A81; // 0x68E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_CFF2F411466936C5A4ACABBA60104A81; // 0x68F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Do__Hand_Traces_CFF2F411466936C5A4ACABBA60104A81; // 0x68F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68F9[0x7];                                     // 0x68F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IdlePlayRate;                                      // 0x6900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Height_Scale;                                      // 0x6908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CCAnimBP_AnimGraphNode_TransitionResult_627235B54BF45B6ED61625B999FB789C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CCAnimBP_AnimGraphNode_TransitionResult_6D08D84A455C0898CE25FAA244CD1A74();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CCAnimBP_AnimGraphNode_TransitionResult_76C4D0094654A2BFECF4C7827F90199C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CCAnimBP_AnimGraphNode_TransitionResult_86C6BC5F4951828403946D8594C2CF65();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CCAnimBP_AnimGraphNode_TransitionResult_8DAF96744F7728C68A612BAFFD98A773();
