#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CCAnimBP.CCAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct CCAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(CCAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on CCAnimBP_C_AnimGraph");
static_assert(sizeof(CCAnimBP_C_AnimGraph) == 0x000010, "Wrong size on CCAnimBP_C_AnimGraph");
static_assert(offsetof(CCAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'CCAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function CCAnimBP.CCAnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct CCAnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCAnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on CCAnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(CCAnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on CCAnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(CCAnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'CCAnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function CCAnimBP.CCAnimBP_C.ExecuteUbergraph_CCAnimBP
// 0x0100 (0x0100 - 0x0000)
struct CCAnimBP_C_ExecuteUbergraph_CCAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterCreatorActor*                 K2Node_DynamicCast_AsCharacter_Creator_Actor;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh_ReturnValue;                      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   UniqueObjectNameForCooking_NotifyName_4;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UniqueObjectNameForCooking_NotifyName_3;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       UniqueObjectNameForCooking_OutputDelegate;         // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   UniqueObjectNameForCooking_NotifyName_2;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       UniqueObjectNameForCooking_OutputDelegate_1;       // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   UniqueObjectNameForCooking_NotifyName_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       UniqueObjectNameForCooking_OutputDelegate_2;       // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       UniqueObjectNameForCooking_OutputDelegate_3;       // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   UniqueObjectNameForCooking_NotifyName;             // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       UniqueObjectNameForCooking_OutputDelegate_4;       // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTime_ReturnValue;   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x1];                                       // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacterCreatorController*            K2Node_DynamicCast_AsCharacter_Creator_Controller; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1;  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP) == 0x000008, "Wrong alignment on CCAnimBP_C_ExecuteUbergraph_CCAnimBP");
static_assert(sizeof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP) == 0x000100, "Wrong size on CCAnimBP_C_ExecuteUbergraph_CCAnimBP");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, EntryPoint) == 0x000000, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, Temp_name_Variable) == 0x000010, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, K2Node_DynamicCast_AsCharacter_Creator_Actor) == 0x000018, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::K2Node_DynamicCast_AsCharacter_Creator_Actor' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_GetMesh_ReturnValue) == 0x000028, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_GetMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, UniqueObjectNameForCooking_NotifyName_4) == 0x000030, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::UniqueObjectNameForCooking_NotifyName_4' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, UniqueObjectNameForCooking_NotifyName_3) == 0x000038, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::UniqueObjectNameForCooking_NotifyName_3' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, UniqueObjectNameForCooking_OutputDelegate) == 0x000040, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::UniqueObjectNameForCooking_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, UniqueObjectNameForCooking_NotifyName_2) == 0x000050, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::UniqueObjectNameForCooking_NotifyName_2' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, UniqueObjectNameForCooking_OutputDelegate_1) == 0x000058, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::UniqueObjectNameForCooking_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, UniqueObjectNameForCooking_NotifyName_1) == 0x000068, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::UniqueObjectNameForCooking_NotifyName_1' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, UniqueObjectNameForCooking_OutputDelegate_2) == 0x000070, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::UniqueObjectNameForCooking_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000080, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, UniqueObjectNameForCooking_OutputDelegate_3) == 0x000084, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::UniqueObjectNameForCooking_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, UniqueObjectNameForCooking_NotifyName) == 0x000094, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::UniqueObjectNameForCooking_NotifyName' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, UniqueObjectNameForCooking_OutputDelegate_4) == 0x00009C, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::UniqueObjectNameForCooking_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_GetInstanceAssetPlayerTime_ReturnValue) == 0x0000AC, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_GetInstanceAssetPlayerTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000B0, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000B1, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000B2, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, K2Node_Event_DeltaTimeX) == 0x0000B4, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_GetOwningComponent_ReturnValue) == 0x0000B8, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000C0, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000C8, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_IsValid_ReturnValue) == 0x0000C9, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_GetPlayerController_ReturnValue) == 0x0000D0, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, K2Node_DynamicCast_AsCharacter_Creator_Controller) == 0x0000D8, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::K2Node_DynamicCast_AsCharacter_Creator_Controller' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x0000E4, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x0000E8, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000E9, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0000F0, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CCAnimBP_C_ExecuteUbergraph_CCAnimBP, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1) == 0x0000F8, "Member 'CCAnimBP_C_ExecuteUbergraph_CCAnimBP::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function CCAnimBP.CCAnimBP_C.OnBlendOut_653AAC084559323BDDEB13938CF195BC
// 0x0008 (0x0008 - 0x0000)
struct CCAnimBP_C_OnBlendOut_653AAC084559323BDDEB13938CF195BC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCAnimBP_C_OnBlendOut_653AAC084559323BDDEB13938CF195BC) == 0x000004, "Wrong alignment on CCAnimBP_C_OnBlendOut_653AAC084559323BDDEB13938CF195BC");
static_assert(sizeof(CCAnimBP_C_OnBlendOut_653AAC084559323BDDEB13938CF195BC) == 0x000008, "Wrong size on CCAnimBP_C_OnBlendOut_653AAC084559323BDDEB13938CF195BC");
static_assert(offsetof(CCAnimBP_C_OnBlendOut_653AAC084559323BDDEB13938CF195BC, NotifyName) == 0x000000, "Member 'CCAnimBP_C_OnBlendOut_653AAC084559323BDDEB13938CF195BC::NotifyName' has a wrong offset!");

// Function CCAnimBP.CCAnimBP_C.OnCompleted_653AAC084559323BDDEB13938CF195BC
// 0x0008 (0x0008 - 0x0000)
struct CCAnimBP_C_OnCompleted_653AAC084559323BDDEB13938CF195BC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCAnimBP_C_OnCompleted_653AAC084559323BDDEB13938CF195BC) == 0x000004, "Wrong alignment on CCAnimBP_C_OnCompleted_653AAC084559323BDDEB13938CF195BC");
static_assert(sizeof(CCAnimBP_C_OnCompleted_653AAC084559323BDDEB13938CF195BC) == 0x000008, "Wrong size on CCAnimBP_C_OnCompleted_653AAC084559323BDDEB13938CF195BC");
static_assert(offsetof(CCAnimBP_C_OnCompleted_653AAC084559323BDDEB13938CF195BC, NotifyName) == 0x000000, "Member 'CCAnimBP_C_OnCompleted_653AAC084559323BDDEB13938CF195BC::NotifyName' has a wrong offset!");

// Function CCAnimBP.CCAnimBP_C.OnInterrupted_653AAC084559323BDDEB13938CF195BC
// 0x0008 (0x0008 - 0x0000)
struct CCAnimBP_C_OnInterrupted_653AAC084559323BDDEB13938CF195BC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCAnimBP_C_OnInterrupted_653AAC084559323BDDEB13938CF195BC) == 0x000004, "Wrong alignment on CCAnimBP_C_OnInterrupted_653AAC084559323BDDEB13938CF195BC");
static_assert(sizeof(CCAnimBP_C_OnInterrupted_653AAC084559323BDDEB13938CF195BC) == 0x000008, "Wrong size on CCAnimBP_C_OnInterrupted_653AAC084559323BDDEB13938CF195BC");
static_assert(offsetof(CCAnimBP_C_OnInterrupted_653AAC084559323BDDEB13938CF195BC, NotifyName) == 0x000000, "Member 'CCAnimBP_C_OnInterrupted_653AAC084559323BDDEB13938CF195BC::NotifyName' has a wrong offset!");

// Function CCAnimBP.CCAnimBP_C.OnNotifyBegin_653AAC084559323BDDEB13938CF195BC
// 0x0008 (0x0008 - 0x0000)
struct CCAnimBP_C_OnNotifyBegin_653AAC084559323BDDEB13938CF195BC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCAnimBP_C_OnNotifyBegin_653AAC084559323BDDEB13938CF195BC) == 0x000004, "Wrong alignment on CCAnimBP_C_OnNotifyBegin_653AAC084559323BDDEB13938CF195BC");
static_assert(sizeof(CCAnimBP_C_OnNotifyBegin_653AAC084559323BDDEB13938CF195BC) == 0x000008, "Wrong size on CCAnimBP_C_OnNotifyBegin_653AAC084559323BDDEB13938CF195BC");
static_assert(offsetof(CCAnimBP_C_OnNotifyBegin_653AAC084559323BDDEB13938CF195BC, NotifyName) == 0x000000, "Member 'CCAnimBP_C_OnNotifyBegin_653AAC084559323BDDEB13938CF195BC::NotifyName' has a wrong offset!");

// Function CCAnimBP.CCAnimBP_C.OnNotifyEnd_653AAC084559323BDDEB13938CF195BC
// 0x0008 (0x0008 - 0x0000)
struct CCAnimBP_C_OnNotifyEnd_653AAC084559323BDDEB13938CF195BC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCAnimBP_C_OnNotifyEnd_653AAC084559323BDDEB13938CF195BC) == 0x000004, "Wrong alignment on CCAnimBP_C_OnNotifyEnd_653AAC084559323BDDEB13938CF195BC");
static_assert(sizeof(CCAnimBP_C_OnNotifyEnd_653AAC084559323BDDEB13938CF195BC) == 0x000008, "Wrong size on CCAnimBP_C_OnNotifyEnd_653AAC084559323BDDEB13938CF195BC");
static_assert(offsetof(CCAnimBP_C_OnNotifyEnd_653AAC084559323BDDEB13938CF195BC, NotifyName) == 0x000000, "Member 'CCAnimBP_C_OnNotifyEnd_653AAC084559323BDDEB13938CF195BC::NotifyName' has a wrong offset!");

}

