#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosCaching

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ChaosCaching_structs.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class ChaosCaching.ChaosCacheCollection
// 0x0010 (0x0058 - 0x0048)
class UChaosCacheCollection final : public UObject
{
public:
	TArray<class UChaosCache*>                    Caches;                                            // 0x0048(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosCacheCollection">();
	}
	static class UChaosCacheCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosCacheCollection>();
	}
};
static_assert(alignof(UChaosCacheCollection) == 0x000008, "Wrong alignment on UChaosCacheCollection");
static_assert(sizeof(UChaosCacheCollection) == 0x000058, "Wrong size on UChaosCacheCollection");
static_assert(offsetof(UChaosCacheCollection, Caches) == 0x000048, "Member 'UChaosCacheCollection::Caches' has a wrong offset!");

// Class ChaosCaching.ChaosCacheManager
// 0x00B0 (0x03F8 - 0x0348)
class AChaosCacheManager : public AActor
{
public:
	class UChaosCacheCollection*                  CacheCollection;                                   // 0x0348(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECacheMode                                    CacheMode;                                         // 0x0350(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStartMode                                    StartMode;                                         // 0x0351(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FObservedComponent>             ObservedComponents;                                // 0x0360(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_370[0x88];                                     // 0x0370(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EnablePlayback(int32 Index_0, bool bEnable);
	void EnablePlaybackByCache(class FName InCacheName, bool bEnable);
	void ResetAllComponentTransforms();
	void ResetSingleTransform(int32 InIndex);
	void SetCacheCollection(class UChaosCacheCollection* InCacheCollection);
	void SetStartTime(float InStartTime);
	void TriggerAll();
	void TriggerComponent(class UPrimitiveComponent* InComponent);
	void TriggerComponentByCache(class FName InCacheName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosCacheManager">();
	}
	static class AChaosCacheManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChaosCacheManager>();
	}
};
static_assert(alignof(AChaosCacheManager) == 0x000008, "Wrong alignment on AChaosCacheManager");
static_assert(sizeof(AChaosCacheManager) == 0x0003F8, "Wrong size on AChaosCacheManager");
static_assert(offsetof(AChaosCacheManager, CacheCollection) == 0x000348, "Member 'AChaosCacheManager::CacheCollection' has a wrong offset!");
static_assert(offsetof(AChaosCacheManager, CacheMode) == 0x000350, "Member 'AChaosCacheManager::CacheMode' has a wrong offset!");
static_assert(offsetof(AChaosCacheManager, StartMode) == 0x000351, "Member 'AChaosCacheManager::StartMode' has a wrong offset!");
static_assert(offsetof(AChaosCacheManager, StartTime) == 0x000354, "Member 'AChaosCacheManager::StartTime' has a wrong offset!");
static_assert(offsetof(AChaosCacheManager, ObservedComponents) == 0x000360, "Member 'AChaosCacheManager::ObservedComponents' has a wrong offset!");

// Class ChaosCaching.ChaosCachePlayer
// 0x0000 (0x03F8 - 0x03F8)
class AChaosCachePlayer final : public AChaosCacheManager
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosCachePlayer">();
	}
	static class AChaosCachePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChaosCachePlayer>();
	}
};
static_assert(alignof(AChaosCachePlayer) == 0x000008, "Wrong alignment on AChaosCachePlayer");
static_assert(sizeof(AChaosCachePlayer) == 0x0003F8, "Wrong size on AChaosCachePlayer");

// Class ChaosCaching.ChaosCache
// 0x0338 (0x0380 - 0x0048)
class UChaosCache final : public UObject
{
public:
	float                                         RecordedDuration;                                  // 0x0048(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumRecordedFrames;                                 // 0x004C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 TrackToParticle;                                   // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerParticleCacheData>          ParticleTracks;                                    // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 ChannelCurveToParticle;                            // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FRichCurves>         ChannelsTracks;                                    // 0x0080(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FCompressedRichCurves> CompressedChannelsTracks;                        // 0x00D0(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FRichCurve>          CurveData;                                         // 0x0120(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FParticleTransformTrack> NamedTransformTracks;                          // 0x0170(0x0050)(NativeAccessSpecifierPublic)
	bool                                          bCompressChannels;                                 // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ChannelsCompressionErrorThreshold;                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChannelsCompressionSampleRate;                     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FCacheEventTrack>    EventTracks;                                       // 0x01D0(0x0050)(NativeAccessSpecifierPrivate)
	struct FCacheSpawnableTemplate                Spawnable;                                         // 0x0220(0x00D0)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGuid                                  AdapterGuid;                                       // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Version;                                           // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_304[0x7C];                                     // 0x0304(0x007C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosCache">();
	}
	static class UChaosCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosCache>();
	}
};
static_assert(alignof(UChaosCache) == 0x000010, "Wrong alignment on UChaosCache");
static_assert(sizeof(UChaosCache) == 0x000380, "Wrong size on UChaosCache");
static_assert(offsetof(UChaosCache, RecordedDuration) == 0x000048, "Member 'UChaosCache::RecordedDuration' has a wrong offset!");
static_assert(offsetof(UChaosCache, NumRecordedFrames) == 0x00004C, "Member 'UChaosCache::NumRecordedFrames' has a wrong offset!");
static_assert(offsetof(UChaosCache, TrackToParticle) == 0x000050, "Member 'UChaosCache::TrackToParticle' has a wrong offset!");
static_assert(offsetof(UChaosCache, ParticleTracks) == 0x000060, "Member 'UChaosCache::ParticleTracks' has a wrong offset!");
static_assert(offsetof(UChaosCache, ChannelCurveToParticle) == 0x000070, "Member 'UChaosCache::ChannelCurveToParticle' has a wrong offset!");
static_assert(offsetof(UChaosCache, ChannelsTracks) == 0x000080, "Member 'UChaosCache::ChannelsTracks' has a wrong offset!");
static_assert(offsetof(UChaosCache, CompressedChannelsTracks) == 0x0000D0, "Member 'UChaosCache::CompressedChannelsTracks' has a wrong offset!");
static_assert(offsetof(UChaosCache, CurveData) == 0x000120, "Member 'UChaosCache::CurveData' has a wrong offset!");
static_assert(offsetof(UChaosCache, NamedTransformTracks) == 0x000170, "Member 'UChaosCache::NamedTransformTracks' has a wrong offset!");
static_assert(offsetof(UChaosCache, bCompressChannels) == 0x0001C0, "Member 'UChaosCache::bCompressChannels' has a wrong offset!");
static_assert(offsetof(UChaosCache, ChannelsCompressionErrorThreshold) == 0x0001C4, "Member 'UChaosCache::ChannelsCompressionErrorThreshold' has a wrong offset!");
static_assert(offsetof(UChaosCache, ChannelsCompressionSampleRate) == 0x0001C8, "Member 'UChaosCache::ChannelsCompressionSampleRate' has a wrong offset!");
static_assert(offsetof(UChaosCache, EventTracks) == 0x0001D0, "Member 'UChaosCache::EventTracks' has a wrong offset!");
static_assert(offsetof(UChaosCache, Spawnable) == 0x000220, "Member 'UChaosCache::Spawnable' has a wrong offset!");
static_assert(offsetof(UChaosCache, AdapterGuid) == 0x0002F0, "Member 'UChaosCache::AdapterGuid' has a wrong offset!");
static_assert(offsetof(UChaosCache, Version) == 0x000300, "Member 'UChaosCache::Version' has a wrong offset!");

// Class ChaosCaching.MovieSceneChaosCacheSection
// 0x0028 (0x0140 - 0x0118)
class UMovieSceneChaosCacheSection final : public UMovieSceneBaseCacheSection
{
public:
	struct FMovieSceneChaosCacheParams            Params_0;                                          // 0x0118(0x0028)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneChaosCacheSection">();
	}
	static class UMovieSceneChaosCacheSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneChaosCacheSection>();
	}
};
static_assert(alignof(UMovieSceneChaosCacheSection) == 0x000008, "Wrong alignment on UMovieSceneChaosCacheSection");
static_assert(sizeof(UMovieSceneChaosCacheSection) == 0x000140, "Wrong size on UMovieSceneChaosCacheSection");
static_assert(offsetof(UMovieSceneChaosCacheSection, Params_0) == 0x000118, "Member 'UMovieSceneChaosCacheSection::Params_0' has a wrong offset!");

// Class ChaosCaching.MovieSceneChaosCacheTrack
// 0x0018 (0x00D0 - 0x00B8)
class UMovieSceneChaosCacheTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             AnimationSections;                                 // 0x00C0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneChaosCacheTrack">();
	}
	static class UMovieSceneChaosCacheTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneChaosCacheTrack>();
	}
};
static_assert(alignof(UMovieSceneChaosCacheTrack) == 0x000008, "Wrong alignment on UMovieSceneChaosCacheTrack");
static_assert(sizeof(UMovieSceneChaosCacheTrack) == 0x0000D0, "Wrong size on UMovieSceneChaosCacheTrack");
static_assert(offsetof(UMovieSceneChaosCacheTrack, AnimationSections) == 0x0000C0, "Member 'UMovieSceneChaosCacheTrack::AnimationSections' has a wrong offset!");

}

