#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cinematic_Character_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Cinematic_Character_AnimBP.Cinematic_Character_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00D7 (0x00D8 - 0x0001)
struct Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_21;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_22;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_23;                                 // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_24;                                  // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_25;                               // 0x0020(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0040(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C0(0x0018)()
};
static_assert(alignof(Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000D8, "Wrong size on Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_21) == 0x000004, "Member 'Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_21' has a wrong offset!");
static_assert(offsetof(Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_22) == 0x00000C, "Member 'Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_22' has a wrong offset!");
static_assert(offsetof(Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_23) == 0x000014, "Member 'Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_23' has a wrong offset!");
static_assert(offsetof(Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_24) == 0x00001C, "Member 'Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_24' has a wrong offset!");
static_assert(offsetof(Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_25) == 0x000020, "Member 'Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_25' has a wrong offset!");
static_assert(offsetof(Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000040, "Member 'Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000C0, "Member 'Cinematic_Character_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

