#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cinematic_Character_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Cinematic_Character_AnimBP.Cinematic_Character_AnimBP_C
// 0x02A0 (0x0610 - 0x0370)
class UCinematic_Character_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x03A8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03F0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0438(0x00F0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0528(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0548(0x00C8)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Cinematic_Character_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cinematic_Character_AnimBP_C">();
	}
	static class UCinematic_Character_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCinematic_Character_AnimBP_C>();
	}
};
static_assert(alignof(UCinematic_Character_AnimBP_C) == 0x000010, "Wrong alignment on UCinematic_Character_AnimBP_C");
static_assert(sizeof(UCinematic_Character_AnimBP_C) == 0x000610, "Wrong size on UCinematic_Character_AnimBP_C");
static_assert(offsetof(UCinematic_Character_AnimBP_C, UberGraphFrame) == 0x000370, "Member 'UCinematic_Character_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCinematic_Character_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UCinematic_Character_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UCinematic_Character_AnimBP_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UCinematic_Character_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UCinematic_Character_AnimBP_C, AnimGraphNode_Root) == 0x000388, "Member 'UCinematic_Character_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCinematic_Character_AnimBP_C, AnimGraphNode_Slot_1) == 0x0003A8, "Member 'UCinematic_Character_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UCinematic_Character_AnimBP_C, AnimGraphNode_Slot) == 0x0003F0, "Member 'UCinematic_Character_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UCinematic_Character_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x000438, "Member 'UCinematic_Character_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UCinematic_Character_AnimBP_C, AnimGraphNode_StateResult) == 0x000528, "Member 'UCinematic_Character_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UCinematic_Character_AnimBP_C, AnimGraphNode_StateMachine) == 0x000548, "Member 'UCinematic_Character_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

