#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cinematic_NPC_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Cinematic_NPC_Master.Cinematic_NPC_Master_C
// 0x0048 (0x0410 - 0x03C8)
class ACinematic_NPC_Master_C : public ASkeletalMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SK_KAE_M_Hands_B_0;                                // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_KAE_NPC_M_Drunk_Torso_A_0;                      // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_KAE_NPC_M_Drunk_Shoulders_A_0;                  // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_KAE_NPC_M_Drunk_Legs_A_0;                       // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_KAE_NPC_M_Drunk_Helmet_A_0;                     // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_KAE_NPC_M_Drunk_Forearms_A_0;                   // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_KAE_NPC_M_Drunk_Boots_A_0;                      // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_KAE_NPC_M_Drunk_Waist_A_0;                      // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Cinematic_NPC_Master(int32 EntryPoint);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cinematic_NPC_Master_C">();
	}
	static class ACinematic_NPC_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACinematic_NPC_Master_C>();
	}
};
static_assert(alignof(ACinematic_NPC_Master_C) == 0x000008, "Wrong alignment on ACinematic_NPC_Master_C");
static_assert(sizeof(ACinematic_NPC_Master_C) == 0x000410, "Wrong size on ACinematic_NPC_Master_C");
static_assert(offsetof(ACinematic_NPC_Master_C, UberGraphFrame) == 0x0003C8, "Member 'ACinematic_NPC_Master_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACinematic_NPC_Master_C, SK_KAE_M_Hands_B_0) == 0x0003D0, "Member 'ACinematic_NPC_Master_C::SK_KAE_M_Hands_B_0' has a wrong offset!");
static_assert(offsetof(ACinematic_NPC_Master_C, SK_KAE_NPC_M_Drunk_Torso_A_0) == 0x0003D8, "Member 'ACinematic_NPC_Master_C::SK_KAE_NPC_M_Drunk_Torso_A_0' has a wrong offset!");
static_assert(offsetof(ACinematic_NPC_Master_C, SK_KAE_NPC_M_Drunk_Shoulders_A_0) == 0x0003E0, "Member 'ACinematic_NPC_Master_C::SK_KAE_NPC_M_Drunk_Shoulders_A_0' has a wrong offset!");
static_assert(offsetof(ACinematic_NPC_Master_C, SK_KAE_NPC_M_Drunk_Legs_A_0) == 0x0003E8, "Member 'ACinematic_NPC_Master_C::SK_KAE_NPC_M_Drunk_Legs_A_0' has a wrong offset!");
static_assert(offsetof(ACinematic_NPC_Master_C, SK_KAE_NPC_M_Drunk_Helmet_A_0) == 0x0003F0, "Member 'ACinematic_NPC_Master_C::SK_KAE_NPC_M_Drunk_Helmet_A_0' has a wrong offset!");
static_assert(offsetof(ACinematic_NPC_Master_C, SK_KAE_NPC_M_Drunk_Forearms_A_0) == 0x0003F8, "Member 'ACinematic_NPC_Master_C::SK_KAE_NPC_M_Drunk_Forearms_A_0' has a wrong offset!");
static_assert(offsetof(ACinematic_NPC_Master_C, SK_KAE_NPC_M_Drunk_Boots_A_0) == 0x000400, "Member 'ACinematic_NPC_Master_C::SK_KAE_NPC_M_Drunk_Boots_A_0' has a wrong offset!");
static_assert(offsetof(ACinematic_NPC_Master_C, SK_KAE_NPC_M_Drunk_Waist_A_0) == 0x000408, "Member 'ACinematic_NPC_Master_C::SK_KAE_NPC_M_Drunk_Waist_A_0' has a wrong offset!");

}

