#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CombatPrototypingControlRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass CombatPrototypingControlRig.CombatPrototypingControlRig_C
// 0x0040 (0x0670 - 0x0630)
class UCombatPrototypingControlRig_C final : public UControlRig
{
public:
	TArray<struct FRigElementKey>                 FixedBones;                                        // 0x0630(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRigElementKey>                 FixedControls;                                     // 0x0640(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRigElementKey>                 EffectorBones;                                     // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRigElementKey>                 EffectorControls;                                  // 0x0660(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CombatPrototypingControlRig_C">();
	}
	static class UCombatPrototypingControlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombatPrototypingControlRig_C>();
	}
};
static_assert(alignof(UCombatPrototypingControlRig_C) == 0x000008, "Wrong alignment on UCombatPrototypingControlRig_C");
static_assert(sizeof(UCombatPrototypingControlRig_C) == 0x000670, "Wrong size on UCombatPrototypingControlRig_C");
static_assert(offsetof(UCombatPrototypingControlRig_C, FixedBones) == 0x000630, "Member 'UCombatPrototypingControlRig_C::FixedBones' has a wrong offset!");
static_assert(offsetof(UCombatPrototypingControlRig_C, FixedControls) == 0x000640, "Member 'UCombatPrototypingControlRig_C::FixedControls' has a wrong offset!");
static_assert(offsetof(UCombatPrototypingControlRig_C, EffectorBones) == 0x000650, "Member 'UCombatPrototypingControlRig_C::EffectorBones' has a wrong offset!");
static_assert(offsetof(UCombatPrototypingControlRig_C, EffectorControls) == 0x000660, "Member 'UCombatPrototypingControlRig_C::EffectorControls' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass CombatPrototypingControlRig.RigVMMemory_Literal
// 0x0578 (0x05C0 - 0x0048)
class CombatPrototypingControlRig::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	ERigVMTransformSpace                          CopyTransforms_1___CopyTransforms_SetTransform_Space__Const; // 0x0048(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CopyTransforms_1___CopyTransforms_SetTransform_bInitial__Const; // 0x0049(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CopyTransforms_1___CopyTransforms_SetTransform_Weight__Const; // 0x004C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CopyTransforms_1___CopyTransforms_SetTransform_bPropagateToChildren__Const; // 0x0050(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___IKTwoBone_Primary_Axis__Const;        // 0x0058(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___IKTwoBone_Secondary_Axis__Const;      // 0x0070(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_Pole_Vector_Node__Const;    // 0x0088(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_Bone_A__Const;              // 0x0094(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_Bone_B__Const;              // 0x00A0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_Bone_C__Const;              // 0x00AC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_End_Ctrl__Const;            // 0x00B8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___IKTwoBone_Enable_Stretch__Const;      // 0x00C4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___IKTwoBone_Stretch_Start_Ratio__Const; // 0x00C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___IKTwoBone_Stretch_Maximum_Ratio__Const; // 0x00CC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___IKTwoBone_Line_Thickness__Const;      // 0x00D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___IKTwoBone_debug__Const;               // 0x00D4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IKTwoBone___IKTwoBone_ProjectTransformToNewParent_bChildInitial__Const; // 0x00D5(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IKTwoBone___IKTwoBone_ProjectTransformToNewParent_bNewParentInitial__Const; // 0x00D6(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7[0x1];                                       // 0x00D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const; // 0x00D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          IKTwoBone___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Space__Const; // 0x00DC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigVectorKind                         IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorKind__Const; // 0x00DD(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorSpace__Const; // 0x00E0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_TwoBoneIKSimple_DebugSettings IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_DebugSettings__Const; // 0x00F0(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FLinearColor                           IKTwoBone___IKTwoBone_DebugLineItemSpace_Color__Const; // 0x0160(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             IKTwoBone___IKTwoBone_DebugLineItemSpace_WorldOffset__Const; // 0x0170(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___IKTwoBone_1_Primary_Axis__Const;      // 0x01D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_1_Pole_Vector_Node__Const;  // 0x01E8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_1_Bone_A__Const;            // 0x01F4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_1_Bone_B__Const;            // 0x0200(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_1_Bone_C__Const;            // 0x020C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_1_End_Ctrl__Const;          // 0x0218(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IKTwoBone_1___IKTwoBone_ProjectTransformToNewParent_bChildInitial__Const; // 0x0224(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IKTwoBone_1___IKTwoBone_ProjectTransformToNewParent_bNewParentInitial__Const; // 0x0225(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226[0x2];                                      // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const; // 0x0228(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          IKTwoBone_1___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Space__Const; // 0x022C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigVectorKind                         IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorKind__Const; // 0x022D(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorSpace__Const; // 0x0230(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_TwoBoneIKSimple_DebugSettings IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_DebugSettings__Const; // 0x0240(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FLinearColor                           IKTwoBone_1___IKTwoBone_DebugLineItemSpace_Color__Const; // 0x02B0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             IKTwoBone_1___IKTwoBone_DebugLineItemSpace_WorldOffset__Const; // 0x02C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_2_Pole_Vector_Node__Const;  // 0x0320(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_2_Bone_A__Const;            // 0x032C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_2_Bone_B__Const;            // 0x0338(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_2_Bone_C__Const;            // 0x0344(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_2_End_Ctrl__Const;          // 0x0350(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IKTwoBone_2___IKTwoBone_ProjectTransformToNewParent_bChildInitial__Const; // 0x035C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IKTwoBone_2___IKTwoBone_ProjectTransformToNewParent_bNewParentInitial__Const; // 0x035D(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IKTwoBone_2___IKTwoBone_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const; // 0x0360(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          IKTwoBone_2___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Space__Const; // 0x0364(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigVectorKind                         IKTwoBone_2___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorKind__Const; // 0x0365(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_366[0x2];                                      // 0x0366(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         IKTwoBone_2___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorSpace__Const; // 0x0368(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0xC];                                      // 0x0374(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_TwoBoneIKSimple_DebugSettings IKTwoBone_2___IKTwoBone_TwoBoneIKSimplePerItem_DebugSettings__Const; // 0x0380(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FLinearColor                           IKTwoBone_2___IKTwoBone_DebugLineItemSpace_Color__Const; // 0x03F0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             IKTwoBone_2___IKTwoBone_DebugLineItemSpace_WorldOffset__Const; // 0x0400(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_2_1_Pole_Vector_Node__Const; // 0x0460(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_2_1_Bone_A__Const;          // 0x046C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_2_1_Bone_B__Const;          // 0x0478(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_2_1_Bone_C__Const;          // 0x0484(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___IKTwoBone_2_1_End_Ctrl__Const;        // 0x0490(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IKTwoBone_2_1___IKTwoBone_ProjectTransformToNewParent_bChildInitial__Const; // 0x049C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IKTwoBone_2_1___IKTwoBone_ProjectTransformToNewParent_bNewParentInitial__Const; // 0x049D(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49E[0x2];                                      // 0x049E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IKTwoBone_2_1___IKTwoBone_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const; // 0x04A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          IKTwoBone_2_1___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Space__Const; // 0x04A4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigVectorKind                         IKTwoBone_2_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorKind__Const; // 0x04A5(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A6[0x2];                                      // 0x04A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         IKTwoBone_2_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorSpace__Const; // 0x04A8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0xC];                                      // 0x04B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_TwoBoneIKSimple_DebugSettings IKTwoBone_2_1___IKTwoBone_TwoBoneIKSimplePerItem_DebugSettings__Const; // 0x04C0(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FLinearColor                           IKTwoBone_2_1___IKTwoBone_DebugLineItemSpace_Color__Const; // 0x0530(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             IKTwoBone_2_1___IKTwoBone_DebugLineItemSpace_WorldOffset__Const; // 0x0540(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          CopyTransforms___CopyTransforms_SetTransform_Space__Const; // 0x05A0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CopyTransforms___CopyTransforms_SetTransform_bInitial__Const; // 0x05A1(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A2[0x2];                                      // 0x05A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CopyTransforms___CopyTransforms_SetTransform_Weight__Const; // 0x05A4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CopyTransforms___CopyTransforms_SetTransform_bPropagateToChildren__Const; // 0x05A8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          CopyTransforms_2_1___CopyTransforms_SetTransform_Space__Const; // 0x05A9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CopyTransforms_2_1___CopyTransforms_SetTransform_bInitial__Const; // 0x05AA(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB[0x1];                                      // 0x05AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CopyTransforms_2_1___CopyTransforms_SetTransform_Weight__Const; // 0x05AC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CopyTransforms_2_1___CopyTransforms_SetTransform_bPropagateToChildren__Const; // 0x05B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass CombatPrototypingControlRig.RigVMMemory_Literal", true>();
	}
	static class CombatPrototypingControlRig::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<CombatPrototypingControlRig::URigVMMemory_Literal>();
	}
};
static_assert(alignof(CombatPrototypingControlRig::URigVMMemory_Literal) == 0x000010, "Wrong alignment on CombatPrototypingControlRig::URigVMMemory_Literal");
static_assert(sizeof(CombatPrototypingControlRig::URigVMMemory_Literal) == 0x0005C0, "Wrong size on CombatPrototypingControlRig::URigVMMemory_Literal");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, CopyTransforms_1___CopyTransforms_SetTransform_Space__Const) == 0x000048, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::CopyTransforms_1___CopyTransforms_SetTransform_Space__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, CopyTransforms_1___CopyTransforms_SetTransform_bInitial__Const) == 0x000049, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::CopyTransforms_1___CopyTransforms_SetTransform_bInitial__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, CopyTransforms_1___CopyTransforms_SetTransform_Weight__Const) == 0x00004C, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::CopyTransforms_1___CopyTransforms_SetTransform_Weight__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, CopyTransforms_1___CopyTransforms_SetTransform_bPropagateToChildren__Const) == 0x000050, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::CopyTransforms_1___CopyTransforms_SetTransform_bPropagateToChildren__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_Primary_Axis__Const) == 0x000058, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_Primary_Axis__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_Secondary_Axis__Const) == 0x000070, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_Secondary_Axis__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_Pole_Vector_Node__Const) == 0x000088, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_Pole_Vector_Node__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_Bone_A__Const) == 0x000094, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_Bone_A__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_Bone_B__Const) == 0x0000A0, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_Bone_B__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_Bone_C__Const) == 0x0000AC, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_Bone_C__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_End_Ctrl__Const) == 0x0000B8, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_End_Ctrl__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_Enable_Stretch__Const) == 0x0000C4, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_Enable_Stretch__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_Stretch_Start_Ratio__Const) == 0x0000C8, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_Stretch_Start_Ratio__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_Stretch_Maximum_Ratio__Const) == 0x0000CC, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_Stretch_Maximum_Ratio__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_Line_Thickness__Const) == 0x0000D0, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_Line_Thickness__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_debug__Const) == 0x0000D4, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_debug__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone___IKTwoBone_ProjectTransformToNewParent_bChildInitial__Const) == 0x0000D5, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone___IKTwoBone_ProjectTransformToNewParent_bChildInitial__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone___IKTwoBone_ProjectTransformToNewParent_bNewParentInitial__Const) == 0x0000D6, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone___IKTwoBone_ProjectTransformToNewParent_bNewParentInitial__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const) == 0x0000D8, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Space__Const) == 0x0000DC, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Space__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorKind__Const) == 0x0000DD, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorKind__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorSpace__Const) == 0x0000E0, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorSpace__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_DebugSettings__Const) == 0x0000F0, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_DebugSettings__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone___IKTwoBone_DebugLineItemSpace_Color__Const) == 0x000160, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone___IKTwoBone_DebugLineItemSpace_Color__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone___IKTwoBone_DebugLineItemSpace_WorldOffset__Const) == 0x000170, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone___IKTwoBone_DebugLineItemSpace_WorldOffset__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_1_Primary_Axis__Const) == 0x0001D0, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_1_Primary_Axis__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_1_Pole_Vector_Node__Const) == 0x0001E8, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_1_Pole_Vector_Node__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_1_Bone_A__Const) == 0x0001F4, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_1_Bone_A__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_1_Bone_B__Const) == 0x000200, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_1_Bone_B__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_1_Bone_C__Const) == 0x00020C, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_1_Bone_C__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_1_End_Ctrl__Const) == 0x000218, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_1_End_Ctrl__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_1___IKTwoBone_ProjectTransformToNewParent_bChildInitial__Const) == 0x000224, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_1___IKTwoBone_ProjectTransformToNewParent_bChildInitial__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_1___IKTwoBone_ProjectTransformToNewParent_bNewParentInitial__Const) == 0x000225, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_1___IKTwoBone_ProjectTransformToNewParent_bNewParentInitial__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const) == 0x000228, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_1___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Space__Const) == 0x00022C, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_1___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Space__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorKind__Const) == 0x00022D, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorKind__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorSpace__Const) == 0x000230, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorSpace__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_DebugSettings__Const) == 0x000240, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_DebugSettings__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_1___IKTwoBone_DebugLineItemSpace_Color__Const) == 0x0002B0, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_1___IKTwoBone_DebugLineItemSpace_Color__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_1___IKTwoBone_DebugLineItemSpace_WorldOffset__Const) == 0x0002C0, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_1___IKTwoBone_DebugLineItemSpace_WorldOffset__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_2_Pole_Vector_Node__Const) == 0x000320, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_2_Pole_Vector_Node__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_2_Bone_A__Const) == 0x00032C, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_2_Bone_A__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_2_Bone_B__Const) == 0x000338, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_2_Bone_B__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_2_Bone_C__Const) == 0x000344, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_2_Bone_C__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_2_End_Ctrl__Const) == 0x000350, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_2_End_Ctrl__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2___IKTwoBone_ProjectTransformToNewParent_bChildInitial__Const) == 0x00035C, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2___IKTwoBone_ProjectTransformToNewParent_bChildInitial__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2___IKTwoBone_ProjectTransformToNewParent_bNewParentInitial__Const) == 0x00035D, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2___IKTwoBone_ProjectTransformToNewParent_bNewParentInitial__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2___IKTwoBone_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const) == 0x000360, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2___IKTwoBone_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Space__Const) == 0x000364, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Space__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorKind__Const) == 0x000365, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorKind__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorSpace__Const) == 0x000368, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorSpace__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2___IKTwoBone_TwoBoneIKSimplePerItem_DebugSettings__Const) == 0x000380, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2___IKTwoBone_TwoBoneIKSimplePerItem_DebugSettings__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2___IKTwoBone_DebugLineItemSpace_Color__Const) == 0x0003F0, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2___IKTwoBone_DebugLineItemSpace_Color__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2___IKTwoBone_DebugLineItemSpace_WorldOffset__Const) == 0x000400, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2___IKTwoBone_DebugLineItemSpace_WorldOffset__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_2_1_Pole_Vector_Node__Const) == 0x000460, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_2_1_Pole_Vector_Node__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_2_1_Bone_A__Const) == 0x00046C, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_2_1_Bone_A__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_2_1_Bone_B__Const) == 0x000478, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_2_1_Bone_B__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_2_1_Bone_C__Const) == 0x000484, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_2_1_Bone_C__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, RigVMModel___IKTwoBone_2_1_End_Ctrl__Const) == 0x000490, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::RigVMModel___IKTwoBone_2_1_End_Ctrl__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2_1___IKTwoBone_ProjectTransformToNewParent_bChildInitial__Const) == 0x00049C, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2_1___IKTwoBone_ProjectTransformToNewParent_bChildInitial__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2_1___IKTwoBone_ProjectTransformToNewParent_bNewParentInitial__Const) == 0x00049D, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2_1___IKTwoBone_ProjectTransformToNewParent_bNewParentInitial__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2_1___IKTwoBone_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const) == 0x0004A0, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2_1___IKTwoBone_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2_1___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Space__Const) == 0x0004A4, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2_1___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Space__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorKind__Const) == 0x0004A5, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorKind__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorSpace__Const) == 0x0004A8, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVectorSpace__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2_1___IKTwoBone_TwoBoneIKSimplePerItem_DebugSettings__Const) == 0x0004C0, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2_1___IKTwoBone_TwoBoneIKSimplePerItem_DebugSettings__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2_1___IKTwoBone_DebugLineItemSpace_Color__Const) == 0x000530, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2_1___IKTwoBone_DebugLineItemSpace_Color__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, IKTwoBone_2_1___IKTwoBone_DebugLineItemSpace_WorldOffset__Const) == 0x000540, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::IKTwoBone_2_1___IKTwoBone_DebugLineItemSpace_WorldOffset__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, CopyTransforms___CopyTransforms_SetTransform_Space__Const) == 0x0005A0, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::CopyTransforms___CopyTransforms_SetTransform_Space__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, CopyTransforms___CopyTransforms_SetTransform_bInitial__Const) == 0x0005A1, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::CopyTransforms___CopyTransforms_SetTransform_bInitial__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, CopyTransforms___CopyTransforms_SetTransform_Weight__Const) == 0x0005A4, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::CopyTransforms___CopyTransforms_SetTransform_Weight__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, CopyTransforms___CopyTransforms_SetTransform_bPropagateToChildren__Const) == 0x0005A8, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::CopyTransforms___CopyTransforms_SetTransform_bPropagateToChildren__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, CopyTransforms_2_1___CopyTransforms_SetTransform_Space__Const) == 0x0005A9, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::CopyTransforms_2_1___CopyTransforms_SetTransform_Space__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, CopyTransforms_2_1___CopyTransforms_SetTransform_bInitial__Const) == 0x0005AA, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::CopyTransforms_2_1___CopyTransforms_SetTransform_bInitial__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, CopyTransforms_2_1___CopyTransforms_SetTransform_Weight__Const) == 0x0005AC, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::CopyTransforms_2_1___CopyTransforms_SetTransform_Weight__Const' has a wrong offset!");
static_assert(offsetof(CombatPrototypingControlRig::URigVMMemory_Literal, CopyTransforms_2_1___CopyTransforms_SetTransform_bPropagateToChildren__Const) == 0x0005B0, "Member 'CombatPrototypingControlRig::URigVMMemory_Literal::CopyTransforms_2_1___CopyTransforms_SetTransform_bPropagateToChildren__Const' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass CombatPrototypingControlRig.RigVMMemory_Work
// 0x13D8 (0x1420 - 0x0048)
class CombatPrototypingControlRig::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         CopyTransforms_1___CopyTransforms_ArrayGetAtIndex_Element; // 0x0048(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         CopyTransforms_1___CopyTransforms_ArrayIterator_Index; // 0x0054(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CopyTransforms_1___CopyTransforms_GetTransform_Transform; // 0x0060(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         CopyTransforms_1___CopyTransforms_ArrayIterator_Element; // 0x00C0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              CopyTransforms_1___CopyTransforms_GetTransform_CachedIndex; // 0x00D0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              CopyTransforms_1___CopyTransforms_SetTransform_CachedIndex; // 0x00E0(0x0010)(Edit, EditConst, NonTransactional)
	int32                                         CopyTransforms_1___CopyTransforms_ArrayIterator_Count; // 0x00F0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CopyTransforms_1___CopyTransforms_ArrayIterator_Ratio; // 0x00F4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   CopyTransforms_1___CopyTransforms_ArrayIterator_BlockToRun; // 0x00F8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             IKTwoBone___IKTwoBone_ProjectTransformToNewParent_Transform; // 0x0100(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_ProjectTransformToNewParent_CachedChild; // 0x0160(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_ProjectTransformToNewParent_CachedOldParent; // 0x0170(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_ProjectTransformToNewParent_CachedNewParent; // 0x0180(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             IKTwoBone___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Transform; // 0x0190(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_RigUnit_GetTransform_14_1_1_1_CachedIndex; // 0x01F0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_PoleVector; // 0x0200(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IKTwoBone___IKTwoBone_MathVectorScale_Result;      // 0x0218(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         IKTwoBone___IKTwoBone_MathVectorDistance_Result;   // 0x0230(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0xC];                                      // 0x0234(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             IKTwoBone___IKTwoBone_GetTransform_1_Transform;    // 0x0240(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_GetTransform_1_CachedIndex;  // 0x02A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                IKTwoBone___IKTwoBone_MathVectorDistance_A;        // 0x02B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             IKTwoBone___IKTwoBone_GetTransform_2_Transform;    // 0x02D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_GetTransform_2_CachedIndex;  // 0x0330(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                IKTwoBone___IKTwoBone_MathVectorDistance_B;        // 0x0340(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_ItemALength; // 0x0358(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IKTwoBone___IKTwoBone_MathVectorScale_1_Result;    // 0x0360(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         IKTwoBone___IKTwoBone_MathVectorDistance_1_Result; // 0x0378(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             IKTwoBone___IKTwoBone_GetTransform_3_Transform;    // 0x0380(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_GetTransform_3_CachedIndex;  // 0x03E0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                IKTwoBone___IKTwoBone_MathVectorDistance_1_B;      // 0x03F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_ItemBLength; // 0x0408(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_CachedItemAIndex; // 0x0410(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_CachedItemBIndex; // 0x0420(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_CachedEffectorItemIndex; // 0x0430(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_TwoBoneIKSimplePerItem_CachedPoleVectorSpaceIndex; // 0x0440(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             IKTwoBone___IKTwoBone_RigUnit_GetTransform_14_1_Transform; // 0x0450(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_RigUnit_GetTransform_14_1_CachedIndex; // 0x04B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                IKTwoBone___IKTwoBone_DebugLineItemSpace_A;        // 0x04C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D8[0x8];                                      // 0x04D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             IKTwoBone___IKTwoBone_GetTransform_4_Transform;    // 0x04E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              IKTwoBone___IKTwoBone_GetTransform_4_CachedIndex;  // 0x0540(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                IKTwoBone___IKTwoBone_DebugLineItemSpace_B;        // 0x0550(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568[0x8];                                      // 0x0568(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             IKTwoBone_1___IKTwoBone_ProjectTransformToNewParent_Transform; // 0x0570(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              IKTwoBone_1___IKTwoBone_ProjectTransformToNewParent_CachedChild; // 0x05D0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              IKTwoBone_1___IKTwoBone_ProjectTransformToNewParent_CachedOldParent; // 0x05E0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              IKTwoBone_1___IKTwoBone_ProjectTransformToNewParent_CachedNewParent; // 0x05F0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             IKTwoBone_1___IKTwoBone_RigUnit_GetTransform_14_1_1_1_Transform; // 0x0600(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              IKTwoBone_1___IKTwoBone_RigUnit_GetTransform_14_1_1_1_CachedIndex; // 0x0660(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_PoleVector; // 0x0670(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IKTwoBone_1___IKTwoBone_MathVectorScale_Result;    // 0x0688(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         IKTwoBone_1___IKTwoBone_MathVectorDistance_Result; // 0x06A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0xC];                                      // 0x06A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             IKTwoBone_1___IKTwoBone_GetTransform_1_Transform;  // 0x06B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              IKTwoBone_1___IKTwoBone_GetTransform_1_CachedIndex; // 0x0710(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                IKTwoBone_1___IKTwoBone_MathVectorDistance_A;      // 0x0720(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_738[0x8];                                      // 0x0738(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             IKTwoBone_1___IKTwoBone_GetTransform_2_Transform;  // 0x0740(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              IKTwoBone_1___IKTwoBone_GetTransform_2_CachedIndex; // 0x07A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                IKTwoBone_1___IKTwoBone_MathVectorDistance_B;      // 0x07B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_ItemALength; // 0x07C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CC[0x4];                                      // 0x07CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IKTwoBone_1___IKTwoBone_MathVectorScale_1_Result;  // 0x07D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         IKTwoBone_1___IKTwoBone_MathVectorDistance_1_Result; // 0x07E8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EC[0x4];                                      // 0x07EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             IKTwoBone_1___IKTwoBone_GetTransform_3_Transform;  // 0x07F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              IKTwoBone_1___IKTwoBone_GetTransform_3_CachedIndex; // 0x0850(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                IKTwoBone_1___IKTwoBone_MathVectorDistance_1_B;    // 0x0860(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_ItemBLength; // 0x0878(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C[0x4];                                      // 0x087C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_CachedItemAIndex; // 0x0880(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_CachedItemBIndex; // 0x0890(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_CachedEffectorItemIndex; // 0x08A0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              IKTwoBone_1___IKTwoBone_TwoBoneIKSimplePerItem_CachedPoleVectorSpaceIndex; // 0x08B0(0x0010)(Edit, EditConst, NonTransactional)
