#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComboStateAnimNotify

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ComboStateAnimNotify.ComboStateAnimNotify_C
// 0x0028 (0x0078 - 0x0050)
class ComboStateAnimNotify::UComboStateAnimNotify_C final : public UAnimNotifyState
{
public:
	TMulticastInlineDelegate<void(bool NextSection, class UObject* AnimInstance)> ReceivedClickEvent; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   JumpToSectionName;                                 // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartNewMontage;                                   // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ComboStateAnimNotify::UComboStateAnimNotify_C* EmptyState;                                 // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ReceivedClickEventBool(bool GotTheClick, class UObject* AnimInstance);

	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, const struct FAnimNotifyEventReference& EventReference) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;
	bool Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass ComboStateAnimNotify.ComboStateAnimNotify_C", true, "ComboStateAnimNotify_C">();
	}
	static class ComboStateAnimNotify::UComboStateAnimNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ComboStateAnimNotify::UComboStateAnimNotify_C>();
	}
};
static_assert(alignof(ComboStateAnimNotify::UComboStateAnimNotify_C) == 0x000008, "Wrong alignment on ComboStateAnimNotify::UComboStateAnimNotify_C");
static_assert(sizeof(ComboStateAnimNotify::UComboStateAnimNotify_C) == 0x000078, "Wrong size on ComboStateAnimNotify::UComboStateAnimNotify_C");
static_assert(offsetof(ComboStateAnimNotify::UComboStateAnimNotify_C, ReceivedClickEvent) == 0x000050, "Member 'ComboStateAnimNotify::UComboStateAnimNotify_C::ReceivedClickEvent' has a wrong offset!");
static_assert(offsetof(ComboStateAnimNotify::UComboStateAnimNotify_C, JumpToSectionName) == 0x000060, "Member 'ComboStateAnimNotify::UComboStateAnimNotify_C::JumpToSectionName' has a wrong offset!");
static_assert(offsetof(ComboStateAnimNotify::UComboStateAnimNotify_C, StartNewMontage) == 0x000068, "Member 'ComboStateAnimNotify::UComboStateAnimNotify_C::StartNewMontage' has a wrong offset!");
static_assert(offsetof(ComboStateAnimNotify::UComboStateAnimNotify_C, EmptyState) == 0x000070, "Member 'ComboStateAnimNotify::UComboStateAnimNotify_C::EmptyState' has a wrong offset!");

}

