#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonIconButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonIconButton.CommonIconButton_C
// 0x0020 (0x16D0 - 0x16B0)
class UCommonIconButton_C final : public UCommonIconButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x16B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTexture2D*                             IconTexture;                                       // 0x16B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Expand_on_Hover;                                   // 0x16C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ExecuteUbergraph_CommonIconButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CommonIconButton_C">();
	}
	static class UCommonIconButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonIconButton_C>();
	}
};
static_assert(alignof(UCommonIconButton_C) == 0x000010, "Wrong alignment on UCommonIconButton_C");
static_assert(sizeof(UCommonIconButton_C) == 0x0016D0, "Wrong size on UCommonIconButton_C");
static_assert(offsetof(UCommonIconButton_C, UberGraphFrame) == 0x0016B0, "Member 'UCommonIconButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCommonIconButton_C, IconTexture) == 0x0016B8, "Member 'UCommonIconButton_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UCommonIconButton_C, Expand_on_Hover) == 0x0016C0, "Member 'UCommonIconButton_C::Expand_on_Hover' has a wrong offset!");

}

