#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cowering_NPC_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Cowering_NPC_AnimBP.Cowering_NPC_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0217 (0x0218 - 0x0001)
struct Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_931;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_932;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_933;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_934;                                // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_935;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_936;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_937;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_938;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_939;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_940;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_941;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_942;                                 // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_943;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_944;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_945;                                 // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_946;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_947;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 __ArrayProperty_948;                               // 0x0078(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_949;                               // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_950;                               // 0x0098(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_951;                               // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_952;                               // 0x00B8(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_953;                               // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_954;                                // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_955;                                 // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_956;                                // 0x00E4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_957;                                // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_958;                                // 0x00F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_959;                               // 0x00F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_960;                              // 0x00F8(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_961;                               // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_962;                                // 0x0128(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_963;                                // 0x0129(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_964;                                // 0x012C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_965;                                // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_966;                                  // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_967;                                // 0x0148(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_968;                                // 0x0149(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_969;                                // 0x014A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_970;                               // 0x0150(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_971;                              // 0x0160(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0180(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0200(0x0018)()
};
static_assert(alignof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000218, "Wrong size on Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_931) == 0x000004, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_931' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_932) == 0x00000C, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_932' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_933) == 0x000014, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_933' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_934) == 0x00001C, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_934' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_935) == 0x000020, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_935' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_936) == 0x000028, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_936' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_937) == 0x00002C, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_937' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_938) == 0x000034, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_938' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_939) == 0x000038, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_939' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_940) == 0x000040, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_940' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_941) == 0x000048, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_941' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_942) == 0x000050, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_942' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_943) == 0x000054, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_943' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_944) == 0x00005C, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_944' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_945) == 0x000064, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_945' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_946) == 0x000068, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_946' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_947) == 0x000070, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_947' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_948) == 0x000078, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_948' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_949) == 0x000088, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_949' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_950) == 0x000098, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_950' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_951) == 0x0000A8, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_951' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_952) == 0x0000B8, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_952' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_953) == 0x0000C8, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_953' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_954) == 0x0000D8, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_954' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_955) == 0x0000E0, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_955' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_956) == 0x0000E4, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_956' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_957) == 0x0000E8, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_957' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_958) == 0x0000F0, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_958' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_959) == 0x0000F4, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_959' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_960) == 0x0000F8, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_960' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_961) == 0x000124, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_961' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_962) == 0x000128, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_962' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_963) == 0x000129, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_963' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_964) == 0x00012C, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_964' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_965) == 0x000138, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_965' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_966) == 0x000140, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_966' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_967) == 0x000148, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_967' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_968) == 0x000149, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_968' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_969) == 0x00014A, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_969' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_970) == 0x000150, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_970' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_971) == 0x000160, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_971' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000180, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000200, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Cowering_NPC_AnimBP.Cowering_NPC_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0033 (0x0034 - 0x0001)
struct Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_6;                                  // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_7;                                  // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_8;                                  // 0x0022(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_9;                                  // 0x0023(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_10;                                 // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0025(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0026(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0027(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x002A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_17;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_18;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000034, "Wrong size on Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_0) == 0x000008, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_0' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000010, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x00001C, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_6) == 0x000020, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_6' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_7) == 0x000021, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_7' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_8) == 0x000022, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_8' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_9) == 0x000023, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_9' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_10) == 0x000024, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_10' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_11) == 0x000025, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_11' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_12) == 0x000026, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_12' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_13) == 0x000027, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_13' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_14) == 0x000028, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_14' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_15) == 0x000029, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_15' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_16) == 0x00002A, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_16' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_17) == 0x00002C, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_17' has a wrong offset!");
static_assert(offsetof(Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_18) == 0x000030, "Member 'Cowering_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_18' has a wrong offset!");

}

