#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_PC_MASTER_Universal_Hardcoded_Low

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "PBIK_structs.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass CR_PC_MASTER_Universal_Hardcoded_Low.CR_PC_MASTER_Universal_Hardcoded_Low_C
// 0x0088 (0x06B8 - 0x0630)
class UCR_PC_MASTER_Universal_Hardcoded_Low_C final : public UControlRig
{
public:
	bool                                          feet_perform_ik_trace;                             // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        movement_speed;                                    // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Ground_Offset_Pitch;                               // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_l_z_offset;                                   // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_r_z_offset;                                   // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_l_z_offset_target;                            // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_r_z_offset_target;                            // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pelvis_z_offset;                                   // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_moving;                                         // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         race_int;                                          // 0x0674(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         gender_int;                                        // 0x0678(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67C[0x4];                                      // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        foot_trace_depth_target_stand_min;                 // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_depth_target_stand_max;                 // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_depth_target_moving_min;                // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_depth_target_moving_max;                // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         race_from_game;                                    // 0x06A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         race_current;                                      // 0x06A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         gender_from_game;                                  // 0x06A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         gender_current;                                    // 0x06AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          trigger_update;                                    // 0x06B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CR_PC_MASTER_Universal_Hardcoded_Low_C">();
	}
	static class UCR_PC_MASTER_Universal_Hardcoded_Low_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_PC_MASTER_Universal_Hardcoded_Low_C>();
	}
};
static_assert(alignof(UCR_PC_MASTER_Universal_Hardcoded_Low_C) == 0x000008, "Wrong alignment on UCR_PC_MASTER_Universal_Hardcoded_Low_C");
static_assert(sizeof(UCR_PC_MASTER_Universal_Hardcoded_Low_C) == 0x0006B8, "Wrong size on UCR_PC_MASTER_Universal_Hardcoded_Low_C");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, feet_perform_ik_trace) == 0x000630, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::feet_perform_ik_trace' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, movement_speed) == 0x000638, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::movement_speed' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, Ground_Offset_Pitch) == 0x000640, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::Ground_Offset_Pitch' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, foot_l_z_offset) == 0x000648, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::foot_l_z_offset' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, foot_r_z_offset) == 0x000650, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::foot_r_z_offset' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, foot_l_z_offset_target) == 0x000658, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::foot_l_z_offset_target' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, foot_r_z_offset_target) == 0x000660, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::foot_r_z_offset_target' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, pelvis_z_offset) == 0x000668, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::pelvis_z_offset' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, is_moving) == 0x000670, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::is_moving' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, race_int) == 0x000674, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::race_int' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, gender_int) == 0x000678, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::gender_int' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, foot_trace_depth_target_stand_min) == 0x000680, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::foot_trace_depth_target_stand_min' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, foot_trace_depth_target_stand_max) == 0x000688, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::foot_trace_depth_target_stand_max' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, foot_trace_depth_target_moving_min) == 0x000690, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::foot_trace_depth_target_moving_min' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, foot_trace_depth_target_moving_max) == 0x000698, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::foot_trace_depth_target_moving_max' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, race_from_game) == 0x0006A0, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::race_from_game' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, race_current) == 0x0006A4, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::race_current' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, gender_from_game) == 0x0006A8, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::gender_from_game' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, gender_current) == 0x0006AC, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::gender_current' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_Low_C, trigger_update) == 0x0006B0, "Member 'UCR_PC_MASTER_Universal_Hardcoded_Low_C::trigger_update' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass CR_PC_MASTER_Universal_Hardcoded_Low.RigVMMemory_Literal
// 0x0EB8 (0x0F00 - 0x0048)
class CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	bool                                          RigVMModel___VariableNode_93_Value__Const;         // 0x0048(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___VariableNode_95_Value__Const;         // 0x0049(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_4_2_1_1_Item__Const;    // 0x004C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_4_2_1_1_Space__Const;   // 0x0058(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_Value__Const;   // 0x0060(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_4_2_1_1_Weight__Const;  // 0x0078(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_2_2_Item__Const;      // 0x007C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_Value__Const;     // 0x0088(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_2_1_Item__Const;    // 0x00A0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_Value__Const;   // 0x00B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_1_2_1_Item__Const;  // 0x00C8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_Value__Const; // 0x00D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_1_1_1_1_Item__Const; // 0x00F0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_Value__Const; // 0x0100(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_3_Item__Const;        // 0x0118(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_3_Value__Const;       // 0x0128(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_3_Item__Const;      // 0x0140(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_3_Value__Const;     // 0x0150(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_1_3_Item__Const;    // 0x0168(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_Value__Const;   // 0x0178(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_1_1_2_Item__Const;  // 0x0190(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_Value__Const; // 0x01A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_60_Value__Const;         // 0x01B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_61_Value__Const;         // 0x01C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_62_Value__Const;         // 0x01C8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_63_Value__Const;         // 0x01D0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_Value__Const; // 0x01D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_Value__Const;   // 0x01F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_Value__Const; // 0x0208(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_Value__Const; // 0x0220(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_Value__Const; // 0x0238(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_Value__Const;     // 0x0250(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_Value__Const;   // 0x0268(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_Value__Const; // 0x0280(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_Value__Const; // 0x0298(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_1_Value__Const; // 0x02B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_1_Value__Const; // 0x02C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_Value__Const; // 0x02E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_Value__Const; // 0x02F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_1_Value__Const; // 0x0310(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_Value__Const; // 0x0328(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_Value__Const; // 0x0340(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_60_3_Value__Const;       // 0x0358(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_1_Value__Const; // 0x0360(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_1_1_Value__Const; // 0x0378(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_1_1_Value__Const; // 0x0390(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_1_Value__Const; // 0x03A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_1_Value__Const; // 0x03C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_1_1_Value__Const; // 0x03D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_1_1_Value__Const; // 0x03F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_1_Value__Const; // 0x0408(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_1_Value__Const; // 0x0420(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_60_4_Value__Const;       // 0x0438(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_1_1_Value__Const; // 0x0440(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_1_1_1_Value__Const; // 0x0458(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_1_1_1_Value__Const; // 0x0470(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_1_1_Value__Const; // 0x0488(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_1_1_Value__Const; // 0x04A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_1_1_1_Value__Const; // 0x04B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_1_1_1_Value__Const; // 0x04D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_1_1_Value__Const; // 0x04E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_1_1_Value__Const; // 0x0500(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_1_1_1_Value__Const; // 0x0518(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_Value__Const;     // 0x0530(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_Value__Const;       // 0x0548(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_Value__Const;     // 0x0560(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_Value__Const;   // 0x0578(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_Value__Const; // 0x0590(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_Value__Const;         // 0x05A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_Value__Const;       // 0x05C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_Value__Const;     // 0x05D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_Value__Const;   // 0x05F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_60_7_Value__Const;       // 0x0608(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_61_7_Value__Const;       // 0x0610(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_2_Value__Const;   // 0x0618(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_3_Value__Const;     // 0x0630(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_2_Value__Const;   // 0x0648(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_2_Value__Const; // 0x0660(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_2_Value__Const; // 0x0678(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_4_Value__Const;       // 0x0690(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_4_Value__Const;     // 0x06A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_4_Value__Const;   // 0x06C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_3_Value__Const; // 0x06D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_2_Value__Const; // 0x06F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_2_Value__Const; // 0x0708(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_2_Value__Const; // 0x0720(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_2_Value__Const; // 0x0738(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_2_Value__Const;   // 0x0750(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_2_Value__Const; // 0x0768(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_2_Value__Const; // 0x0780(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_2_Value__Const; // 0x0798(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_2_Value__Const; // 0x07B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_2_Value__Const; // 0x07C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_2_Value__Const; // 0x07E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_2_Value__Const; // 0x07F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_2_Value__Const;   // 0x0810(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_2_Value__Const; // 0x0828(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_2_Value__Const; // 0x0840(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_2_Value__Const; // 0x0858(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_2_Value__Const; // 0x0870(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_2_Value__Const; // 0x0888(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_1_2_Value__Const; // 0x08A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_1_1_2_Value__Const; // 0x08B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_1_1_2_Value__Const; // 0x08D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_1_2_Value__Const; // 0x08E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_1_2_Value__Const; // 0x0900(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_1_1_2_Value__Const; // 0x0918(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_1_1_2_Value__Const; // 0x0930(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_1_2_Value__Const; // 0x0948(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_1_2_Value__Const; // 0x0960(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_60_11_Value__Const;      // 0x0978(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_1_1_1_1_Value__Const; // 0x0980(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_1_1_1_1_Value__Const; // 0x0998(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_1_1_1_1_Value__Const; // 0x09B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_1_1_1_1_Value__Const; // 0x09C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_3_Value__Const;   // 0x09E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_4_Value__Const;     // 0x09F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_3_Value__Const;   // 0x0A10(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_3_Value__Const; // 0x0A28(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_3_Value__Const; // 0x0A40(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_5_Value__Const;       // 0x0A58(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_5_Value__Const;     // 0x0A70(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_5_Value__Const;   // 0x0A88(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_4_Value__Const; // 0x0AA0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_2_1_Value__Const; // 0x0AB8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_3_1_Value__Const;   // 0x0AD0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_2_1_Value__Const; // 0x0AE8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_2_1_Value__Const; // 0x0B00(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_2_1_Value__Const; // 0x0B18(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_4_1_Value__Const;     // 0x0B30(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_4_1_Value__Const;   // 0x0B48(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_4_1_Value__Const; // 0x0B60(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_3_1_Value__Const; // 0x0B78(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_3_Item__Const;          // 0x0B90(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_3_Space__Const;         // 0x0B9C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9D[0x3];                                      // 0x0B9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___Set_Transform_3_Value__Const;         // 0x0BA0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_3_1_Item__Const;        // 0x0C00(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_3_2_Item__Const;        // 0x0C0C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_3_1_1_Item__Const;      // 0x0C18(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_Item__Const;            // 0x0C24(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_Item__Const;          // 0x0C30(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          FootTrace___FootTrace_GetTransform_Space__Const;   // 0x0C3C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace___FootTrace_GetTransform_bInitial__Const; // 0x0C3D(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3E[0x2];                                      // 0x0C3E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTrace___FootTrace_Add_B__Const;                // 0x0C40(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_Subtract_1_B__Const;         // 0x0C58(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        FootTrace___FootTrace_Remap_1_SourceMinimum__Const; // 0x0C70(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        FootTrace___FootTrace_Remap_1_SourceMaximum__Const; // 0x0C78(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               FootTrace___FootTrace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0C80(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C81[0x3];                                      // 0x0C81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootTrace___FootTrace_SphereTraceByTraceChannel_Radius__Const; // 0x0C84(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FootTrace___FootTrace_If_1_1_True__Const;          // 0x0C88(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FootTrace___FootTrace_If_1_1_False__Const;         // 0x0C98(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace___FootTrace_DebugLineItemSpace_Thickness__Const; // 0x0CA8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAC[0x4];                                      // 0x0CAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FootTrace___FootTrace_DebugLineItemSpace_WorldOffset__Const; // 0x0CB0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace___FootTrace_DebugLineItemSpace_bEnabled__Const; // 0x0D10(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    FootTrace___FootTrace_DebugTransformMutableItemSpace_Mode__Const; // 0x0D11(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D12[0x2];                                      // 0x0D12(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           FootTrace___FootTrace_DebugTransformMutableItemSpace_Color__Const; // 0x0D14(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace___FootTrace_DebugTransformMutableItemSpace_Thickness__Const; // 0x0D24(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace___FootTrace_DebugTransformMutableItemSpace_Scale__Const; // 0x0D28(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          FootTrace_1___FootTrace_GetTransform_Space__Const; // 0x0D2C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace_1___FootTrace_GetTransform_bInitial__Const; // 0x0D2D(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2E[0x2];                                      // 0x0D2E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTrace_1___FootTrace_Add_B__Const;              // 0x0D30(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace_1___FootTrace_Subtract_1_B__Const;       // 0x0D48(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        FootTrace_1___FootTrace_Remap_1_SourceMinimum__Const; // 0x0D60(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        FootTrace_1___FootTrace_Remap_1_SourceMaximum__Const; // 0x0D68(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               FootTrace_1___FootTrace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0D70(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D71[0x3];                                      // 0x0D71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootTrace_1___FootTrace_SphereTraceByTraceChannel_Radius__Const; // 0x0D74(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FootTrace_1___FootTrace_If_1_1_True__Const;        // 0x0D78(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FootTrace_1___FootTrace_If_1_1_False__Const;       // 0x0D88(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace_1___FootTrace_DebugLineItemSpace_Thickness__Const; // 0x0D98(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9C[0x4];                                      // 0x0D9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FootTrace_1___FootTrace_DebugLineItemSpace_WorldOffset__Const; // 0x0DA0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace_1___FootTrace_DebugLineItemSpace_bEnabled__Const; // 0x0E00(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    FootTrace_1___FootTrace_DebugTransformMutableItemSpace_Mode__Const; // 0x0E01(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E02[0x2];                                      // 0x0E02(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           FootTrace_1___FootTrace_DebugTransformMutableItemSpace_Color__Const; // 0x0E04(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace_1___FootTrace_DebugTransformMutableItemSpace_Thickness__Const; // 0x0E14(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace_1___FootTrace_DebugTransformMutableItemSpace_Scale__Const; // 0x0E18(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_Bias__Const;              // 0x0E1C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FInputRange                            RigVMModel___AlphaInterp_InRange__Const;           // 0x0E20(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         RigVMModel___AlphaInterp_InterpSpeedIncreasing__Const; // 0x0E28(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2C[0x4];                                      // 0x0E2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_ItemToModify__Const; // 0x0E30(0x0010)(Edit, EditConst, NonTransactional)
	EControlRigModifyBoneMode                     RigVMModel___ModifyTransforms_1_1_Mode__Const;     // 0x0E40(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E41[0x7];                                      // 0x0E41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_ItemToModify__Const; // 0x0E48(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_2_ItemToModify__Const; // 0x0E58(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___PBIK_1_Root__Const;                   // 0x0E68(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_Effectors__Const;              // 0x0E70(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_Curve__Const;     // 0x0E80(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_Curve__Const;       // 0x0E88(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_1_BoneSettings__Const;           // 0x0E90(0x0010)(Edit, EditConst, NonTransactional)
	TArray<class FName>                           RigVMModel___PBIK_1_ExcludedBones__Const;          // 0x0EA0(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_1_Settings__Const;               // 0x0EB0(0x003C)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_1_Debug__Const;                  // 0x0EEC(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_EF4[0x4];                                      // 0x0EF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___VariableNode_81_Value__Const;         // 0x0EF8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass CR_PC_MASTER_Universal_Hardcoded_Low.RigVMMemory_Literal", true>();
	}
	static class CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal>();
	}
};
static_assert(alignof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal) == 0x000010, "Wrong alignment on CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal");
static_assert(sizeof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal) == 0x000F00, "Wrong size on CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___VariableNode_93_Value__Const) == 0x000048, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___VariableNode_93_Value__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___VariableNode_95_Value__Const) == 0x000049, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___VariableNode_95_Value__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_2_1_1_Item__Const) == 0x00004C, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_2_1_1_Space__Const) == 0x000058, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_2_1_1_Space__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_2_1_1_Value__Const) == 0x000060, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_2_1_1_Value__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_2_1_1_Weight__Const) == 0x000078, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_2_1_1_Weight__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_2_2_Item__Const) == 0x00007C, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_2_2_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_2_2_Value__Const) == 0x000088, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_2_2_Value__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_1_2_1_Item__Const) == 0x0000A0, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_1_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_1_2_1_Value__Const) == 0x0000B0, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_1_2_1_Value__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_1_1_2_1_Item__Const) == 0x0000C8, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_1_1_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_1_1_2_1_Value__Const) == 0x0000D8, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_1_1_2_1_Value__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_1_1_1_1_1_Item__Const) == 0x0000F0, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_1_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_1_1_1_1_1_Value__Const) == 0x000100, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_1_1_1_1_1_Value__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal, RigVMModel___Set_Transform_4_3_Item__Const) == 0x000118, "Member 'CR_PC_MASTER_Universal_Hardcoded_Low::URigVMMemory_Literal::RigVMModel___Set_Transform_4_3_Item__Const' has a wrong offset!");
