#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_PC_MASTER_Universal_Headlook

#include "Basic.hpp"

#include "AnimationCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "PBIK_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass CR_PC_MASTER_Universal_Headlook.CR_PC_MASTER_Universal_Headlook_C
// 0x0048 (0x0678 - 0x0630)
class UCR_PC_MASTER_Universal_Headlook_C final : public UControlRig
{
public:
	bool                                          ShouldDoHeadLook;                                  // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAiming;                                          // 0x0631(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_632[0x6];                                      // 0x0632(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WorldLookAtLocation;                               // 0x0638(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CRLookAtLocation;                                  // 0x0650(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LOD_Level;                                         // 0x0668(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Weight_From_Anim;                                  // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CR_PC_MASTER_Universal_Headlook_C">();
	}
	static class UCR_PC_MASTER_Universal_Headlook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_PC_MASTER_Universal_Headlook_C>();
	}
};
static_assert(alignof(UCR_PC_MASTER_Universal_Headlook_C) == 0x000008, "Wrong alignment on UCR_PC_MASTER_Universal_Headlook_C");
static_assert(sizeof(UCR_PC_MASTER_Universal_Headlook_C) == 0x000678, "Wrong size on UCR_PC_MASTER_Universal_Headlook_C");
static_assert(offsetof(UCR_PC_MASTER_Universal_Headlook_C, ShouldDoHeadLook) == 0x000630, "Member 'UCR_PC_MASTER_Universal_Headlook_C::ShouldDoHeadLook' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Headlook_C, IsAiming) == 0x000631, "Member 'UCR_PC_MASTER_Universal_Headlook_C::IsAiming' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Headlook_C, WorldLookAtLocation) == 0x000638, "Member 'UCR_PC_MASTER_Universal_Headlook_C::WorldLookAtLocation' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Headlook_C, CRLookAtLocation) == 0x000650, "Member 'UCR_PC_MASTER_Universal_Headlook_C::CRLookAtLocation' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Headlook_C, LOD_Level) == 0x000668, "Member 'UCR_PC_MASTER_Universal_Headlook_C::LOD_Level' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Headlook_C, Weight_From_Anim) == 0x000670, "Member 'UCR_PC_MASTER_Universal_Headlook_C::Weight_From_Anim' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass CR_PC_MASTER_Universal_Headlook.RigVMMemory_Literal
// 0x0CA8 (0x0CF0 - 0x0048)
class CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___ParentConstraint_2_Child__Const;      // 0x0048(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___ParentConstraint_2_bMaintainOffset__Const; // 0x0054(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransformFilter                       RigVMModel___ParentConstraint_2_Filter__Const;     // 0x0055(0x0009)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___ParentConstraint_2_Parents__Const;    // 0x0060(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_ParentConstraint_AdvancedSettings RigVMModel___ParentConstraint_2_AdvancedSettings__Const; // 0x0070(0x0002)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___ParentConstraint_2_Weight__Const;     // 0x0074(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ParentConstraint_3_Child__Const;      // 0x0078(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___ParentConstraint_3_Parents__Const;    // 0x0088(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_ParentConstraint_AdvancedSettings RigVMModel___ParentConstraint_3_AdvancedSettings__Const; // 0x0098(0x0002)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_Item__Const;            // 0x009C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_Space__Const;           // 0x00A8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_bInitial__Const;        // 0x00A9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_6_Item__Const;           // 0x00AC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_Item__Const;          // 0x00B8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_6_1_Item__Const;         // 0x00C4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_Curve__Const;           // 0x00D0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DISPATCH_RigVMDispatch_If_1_False__Const; // 0x00D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathQuaternionToEuler_3_RotationOrder__Const; // 0x00DC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Remap_SourceMinimum__Const;           // 0x00E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_SourceMaximum__Const;           // 0x00E8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_TargetMinimum__Const;           // 0x00F0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_TargetMaximum__Const;           // 0x00F8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_Item__Const;     // 0x0100(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_Value__Const;    // 0x0110(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_Item__Const;             // 0x0170(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Greater_1_B__Const;                   // 0x0180(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Add_2_B__Const;                       // 0x0188(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Greater_B__Const;                     // 0x01A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_1_SourceMaximum__Const;         // 0x01A8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x01B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0210(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Color__Const; // 0x0214(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Thickness__Const; // 0x0224(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0228(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_Item__Const;   // 0x022C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_3_SourceMaximum__Const;         // 0x0238(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_2_1_Item__Const;        // 0x0240(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_1_Strength__Const;       // 0x024C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_2_2_Item__Const;        // 0x0250(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___LessEqual_1_1_B__Const;               // 0x0260(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ParentConstraint_1_1_Child__Const;    // 0x0268(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Concat_2_1_B__Const;                  // 0x0274(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___ParentConstraint_1_1_Parents__Const;  // 0x0280(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_ParentConstraint_AdvancedSettings RigVMModel___ParentConstraint_1_1_AdvancedSettings__Const; // 0x0290(0x0002)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RigVMModel___Concat_1_1_1_B__Const;                // 0x0294(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_Primary__Const;             // 0x02A0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_Secondary__Const;           // 0x02E8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___AimItem_1_DebugSettings__Const;       // 0x0330(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_1_2_Items__Const;   // 0x03A0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_1_Items__Const;     // 0x03B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FFilterOptionPerAxis                   RigVMModel___RotationConstraintLocalSpaceOffset_Filter__Const; // 0x03C0(0x0003)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_3C3[0x5];                                      // 0x03C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___RotationConstraintLocalSpaceOffset_Parents__Const; // 0x03C8(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_RotationConstraint_AdvancedSettings RigVMModel___RotationConstraintLocalSpaceOffset_AdvancedSettings__Const; // 0x03D8(0x0002)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_3DA[0x6];                                      // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Multiply_2_B__Const;                  // 0x03E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_1_1_Items__Const;   // 0x03E8(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___RotationConstraintLocalSpaceOffset_1_1_Child__Const; // 0x03F8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___RotationConstraintLocalSpaceOffset_1_1_Parents__Const; // 0x0408(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_RotationConstraint_AdvancedSettings RigVMModel___RotationConstraintLocalSpaceOffset_1_1_AdvancedSettings__Const; // 0x0418(0x0002)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_41A[0x6];                                      // 0x041A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Multiply_2_1_1_B__Const;              // 0x0420(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RotationConstraintLocalSpaceOffset_1_1_1_Child__Const; // 0x0428(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___RotationConstraintLocalSpaceOffset_1_1_1_Parents__Const; // 0x0438(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___PBIK_Root__Const;                     // 0x0448(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__Const;                // 0x0450(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_1_Item__Const; // 0x0460(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathQuaternionToEuler_RotationOrder__Const; // 0x046C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46D[0x3];                                      // 0x046D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Subtract_B__Const;                    // 0x0470(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_2_SourceMaximum__Const;         // 0x0478(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_Strength__Const;         // 0x0480(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_BoneSettings__Const;             // 0x0488(0x0010)(Edit, EditConst, NonTransactional)
	TArray<class FName>                           RigVMModel___PBIK_ExcludedBones__Const;            // 0x0498(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_Settings__Const;                 // 0x04A8(0x003C)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_Debug__Const;                    // 0x04E4(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	ERigUnitDebugTransformMode                    RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_Mode__Const; // 0x04EC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ED[0x3];                                      // 0x04ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_Color__Const; // 0x04F0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_Scale__Const; // 0x0500(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SpawnControl_3_Parent__Const;         // 0x0504(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_3_Name__Const;           // 0x0510(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_518[0x8];                                      // 0x0518(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___RigVMFunction_MathTransformMake_Rotation__Const; // 0x0520(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___RigVMFunction_MathTransformMake_Scale__Const; // 0x0540(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_3_Settings__Const; // 0x0560(0x00D0)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___SpawnControl_2_2_Parent__Const;       // 0x0630(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_2_2_Name__Const;         // 0x063C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644[0xC];                                      // 0x0644(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___SpawnControl_2_2_OffsetTransform__Const; // 0x0650(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Add_B__Const;                         // 0x06B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C8[0x8];                                      // 0x06C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_2_2_Settings__Const; // 0x06D0(0x00D0)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___SpawnControl_Name__Const;             // 0x07A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A8[0x8];                                      // 0x07A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_Settings__Const; // 0x07B0(0x00D0)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___SpawnControl_1_Name__Const;           // 0x0880(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SpawnControl_1_OffsetSpace__Const;    // 0x0888(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_889[0x7];                                      // 0x0889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_1_Settings__Const; // 0x0890(0x00D0)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___SpawnControl_1_1_Name__Const;         // 0x0960(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_968[0x8];                                      // 0x0968(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_1_1_Settings__Const; // 0x0970(0x00D0)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___SpawnControl_1_1_1_Name__Const;       // 0x0A40(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_9_Item__Const;           // 0x0A48(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A54[0xC];                                      // 0x0A54(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_1_1_1_Settings__Const; // 0x0A60(0x00D0)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___SpawnControl_1_1_2_Name__Const;       // 0x0B30(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_1_1_2_1_Name__Const;     // 0x0B38(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_2_Settings__Const; // 0x0B40(0x00D0)(Edit, EditConst, NonTransactional)
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_2_1_Settings__Const; // 0x0C10(0x00D0)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_Items__Const;       // 0x0CE0(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass CR_PC_MASTER_Universal_Headlook.RigVMMemory_Literal", true>();
	}
	static class CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal>();
	}
};
static_assert(alignof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal) == 0x000010, "Wrong alignment on CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal");
static_assert(sizeof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal) == 0x000CF0, "Wrong size on CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___ParentConstraint_2_Child__Const) == 0x000048, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___ParentConstraint_2_Child__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___ParentConstraint_2_bMaintainOffset__Const) == 0x000054, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___ParentConstraint_2_bMaintainOffset__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___ParentConstraint_2_Filter__Const) == 0x000055, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___ParentConstraint_2_Filter__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___ParentConstraint_2_Parents__Const) == 0x000060, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___ParentConstraint_2_Parents__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___ParentConstraint_2_AdvancedSettings__Const) == 0x000070, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___ParentConstraint_2_AdvancedSettings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___ParentConstraint_2_Weight__Const) == 0x000074, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___ParentConstraint_2_Weight__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___ParentConstraint_3_Child__Const) == 0x000078, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___ParentConstraint_3_Child__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___ParentConstraint_3_Parents__Const) == 0x000088, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___ParentConstraint_3_Parents__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___ParentConstraint_3_AdvancedSettings__Const) == 0x000098, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___ParentConstraint_3_AdvancedSettings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Set_Transform_Item__Const) == 0x00009C, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Set_Transform_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Set_Transform_Space__Const) == 0x0000A8, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Set_Transform_Space__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Set_Transform_bInitial__Const) == 0x0000A9, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Set_Transform_bInitial__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___GetTransform_6_Item__Const) == 0x0000AC, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___GetTransform_6_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Set_Transform_1_Item__Const) == 0x0000B8, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Set_Transform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___GetTransform_6_1_Item__Const) == 0x0000C4, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___GetTransform_6_1_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___GetCurveValue_Curve__Const) == 0x0000D0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___GetCurveValue_Curve__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___DISPATCH_RigVMDispatch_If_1_False__Const) == 0x0000D8, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___DISPATCH_RigVMDispatch_If_1_False__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathQuaternionToEuler_3_RotationOrder__Const) == 0x0000DC, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathQuaternionToEuler_3_RotationOrder__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Remap_SourceMinimum__Const) == 0x0000E0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Remap_SourceMinimum__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Remap_SourceMaximum__Const) == 0x0000E8, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Remap_SourceMaximum__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Remap_TargetMinimum__Const) == 0x0000F0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Remap_TargetMinimum__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Remap_TargetMaximum__Const) == 0x0000F8, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Remap_TargetMaximum__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_Item__Const) == 0x000100, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_Value__Const) == 0x000110, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_Value__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___GetTransform_Item__Const) == 0x000170, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___GetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Greater_1_B__Const) == 0x000180, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Greater_1_B__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Add_2_B__Const) == 0x000188, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Add_2_B__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Greater_B__Const) == 0x0001A0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Greater_B__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Remap_1_SourceMaximum__Const) == 0x0001A8, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Remap_1_SourceMaximum__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Transform__Const) == 0x0001B0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Transform__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Mode__Const) == 0x000210, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Mode__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Color__Const) == 0x000214, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Color__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Thickness__Const) == 0x000224, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Thickness__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Scale__Const) == 0x000228, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Scale__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_1_Item__Const) == 0x00022C, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Remap_3_SourceMaximum__Const) == 0x000238, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Remap_3_SourceMaximum__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Set_Transform_2_1_Item__Const) == 0x000240, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Set_Transform_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpringInterp_1_Strength__Const) == 0x00024C, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpringInterp_1_Strength__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Set_Transform_2_2_Item__Const) == 0x000250, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Set_Transform_2_2_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___LessEqual_1_1_B__Const) == 0x000260, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___LessEqual_1_1_B__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___ParentConstraint_1_1_Child__Const) == 0x000268, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___ParentConstraint_1_1_Child__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Concat_2_1_B__Const) == 0x000274, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Concat_2_1_B__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___ParentConstraint_1_1_Parents__Const) == 0x000280, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___ParentConstraint_1_1_Parents__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___ParentConstraint_1_1_AdvancedSettings__Const) == 0x000290, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___ParentConstraint_1_1_AdvancedSettings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Concat_1_1_1_B__Const) == 0x000294, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Concat_1_1_1_B__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___AimItem_1_Primary__Const) == 0x0002A0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___AimItem_1_Primary__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___AimItem_1_Secondary__Const) == 0x0002E8, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___AimItem_1_Secondary__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___AimItem_1_DebugSettings__Const) == 0x000330, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___AimItem_1_DebugSettings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigUnit_ItemArray_1_2_Items__Const) == 0x0003A0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigUnit_ItemArray_1_2_Items__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigUnit_ItemArray_1_Items__Const) == 0x0003B0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigUnit_ItemArray_1_Items__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RotationConstraintLocalSpaceOffset_Filter__Const) == 0x0003C0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RotationConstraintLocalSpaceOffset_Filter__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RotationConstraintLocalSpaceOffset_Parents__Const) == 0x0003C8, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RotationConstraintLocalSpaceOffset_Parents__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RotationConstraintLocalSpaceOffset_AdvancedSettings__Const) == 0x0003D8, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RotationConstraintLocalSpaceOffset_AdvancedSettings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Multiply_2_B__Const) == 0x0003E0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Multiply_2_B__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigUnit_ItemArray_1_1_Items__Const) == 0x0003E8, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigUnit_ItemArray_1_1_Items__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RotationConstraintLocalSpaceOffset_1_1_Child__Const) == 0x0003F8, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RotationConstraintLocalSpaceOffset_1_1_Child__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RotationConstraintLocalSpaceOffset_1_1_Parents__Const) == 0x000408, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RotationConstraintLocalSpaceOffset_1_1_Parents__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RotationConstraintLocalSpaceOffset_1_1_AdvancedSettings__Const) == 0x000418, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RotationConstraintLocalSpaceOffset_1_1_AdvancedSettings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Multiply_2_1_1_B__Const) == 0x000420, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Multiply_2_1_1_B__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RotationConstraintLocalSpaceOffset_1_1_1_Child__Const) == 0x000428, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RotationConstraintLocalSpaceOffset_1_1_1_Child__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RotationConstraintLocalSpaceOffset_1_1_1_Parents__Const) == 0x000438, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RotationConstraintLocalSpaceOffset_1_1_1_Parents__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___PBIK_Root__Const) == 0x000448, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___PBIK_Root__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___PBIK_Effectors__Const) == 0x000450, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___PBIK_Effectors__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_1_1_1_Item__Const) == 0x000460, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathQuaternionToEuler_RotationOrder__Const) == 0x00046C, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathQuaternionToEuler_RotationOrder__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Subtract_B__Const) == 0x000470, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Subtract_B__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Remap_2_SourceMaximum__Const) == 0x000478, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Remap_2_SourceMaximum__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpringInterp_Strength__Const) == 0x000480, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpringInterp_Strength__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___PBIK_BoneSettings__Const) == 0x000488, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___PBIK_BoneSettings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___PBIK_ExcludedBones__Const) == 0x000498, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___PBIK_ExcludedBones__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___PBIK_Settings__Const) == 0x0004A8, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___PBIK_Settings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___PBIK_Debug__Const) == 0x0004E4, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___PBIK_Debug__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_Mode__Const) == 0x0004EC, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_Mode__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_Color__Const) == 0x0004F0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_Color__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_Scale__Const) == 0x000500, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_Scale__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_3_Parent__Const) == 0x000504, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_3_Parent__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_3_Name__Const) == 0x000510, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_3_Name__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathTransformMake_Rotation__Const) == 0x000520, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathTransformMake_Rotation__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathTransformMake_Scale__Const) == 0x000540, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathTransformMake_Scale__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_3_Settings__Const) == 0x000560, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_3_Settings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_2_2_Parent__Const) == 0x000630, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_2_2_Parent__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_2_2_Name__Const) == 0x00063C, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_2_2_Name__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_2_2_OffsetTransform__Const) == 0x000650, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_2_2_OffsetTransform__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___Add_B__Const) == 0x0006B0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___Add_B__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_2_2_Settings__Const) == 0x0006D0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_2_2_Settings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_Name__Const) == 0x0007A0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_Name__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_Settings__Const) == 0x0007B0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_Settings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_1_Name__Const) == 0x000880, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_1_Name__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_1_OffsetSpace__Const) == 0x000888, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_1_OffsetSpace__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_1_Settings__Const) == 0x000890, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_1_Settings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_1_1_Name__Const) == 0x000960, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_1_1_Name__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_1_1_Settings__Const) == 0x000970, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_1_1_Settings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_1_1_1_Name__Const) == 0x000A40, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_1_1_1_Name__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___GetTransform_9_Item__Const) == 0x000A48, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___GetTransform_9_Item__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_1_1_1_Settings__Const) == 0x000A60, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_1_1_1_Settings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_1_1_2_Name__Const) == 0x000B30, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_1_1_2_Name__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_1_1_2_1_Name__Const) == 0x000B38, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_1_1_2_1_Name__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_2_Settings__Const) == 0x000B40, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_2_Settings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___SpawnControl_2_1_Settings__Const) == 0x000C10, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___SpawnControl_2_1_Settings__Const' has a wrong offset!");
static_assert(offsetof(CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal, RigVMModel___RigUnit_ItemArray_Items__Const) == 0x000CE0, "Member 'CR_PC_MASTER_Universal_Headlook::URigVMMemory_Literal::RigVMModel___RigUnit_ItemArray_Items__Const' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass CR_PC_MASTER_Universal_Headlook.RigVMMemory_Work
// 0x17F8 (0x1840 - 0x0048)
class CR_PC_MASTER_Universal_Headlook::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	TArray<struct FCachedRigElement>              RigVMModel___ParentConstraint_2_ChildCache;        // 0x0048(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>      RigVMModel___ParentConstraint_2_ParentCaches;      // 0x0058(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ParentConstraint_3_ChildCache;        // 0x0068(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>      RigVMModel___ParentConstraint_3_ParentCaches;      // 0x0078(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_6_Transform;             // 0x0090(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_6_CachedIndex;           // 0x00F0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_CachedIndex;            // 0x0100(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_6_1_Transform;           // 0x0110(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_6_1_CachedIndex;         // 0x0170(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_CachedIndex;          // 0x0180(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___From_World_1_2_1_Global;              // 0x0190(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Clamp_Result;                         // 0x01A8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Multiply_1_Result;                    // 0x01B0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DISPATCH_RigVMDispatch_If_1_Result;   // 0x01B8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetCurveValue_Valid;                  // 0x01BC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___GetCurveValue_Value;                  // 0x01C0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
