#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_PC_MASTER_Universal_Hardcoded

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "Engine_structs.hpp"
#include "PBIK_structs.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass CR_PC_MASTER_Universal_Hardcoded.CR_PC_MASTER_Universal_Hardcoded_C
// 0x0210 (0x0840 - 0x0630)
class UCR_PC_MASTER_Universal_Hardcoded_C final : public UControlRig
{
public:
	bool                                          feet_perform_ik_trace;                             // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          feet_perform_normal_adjust;                        // 0x0631(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          pause_pose;                                        // 0x0632(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          update_pose;                                       // 0x0633(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_634[0x4];                                      // 0x0634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        movement_speed;                                    // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Ground_Offset_Pitch;                               // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   foot_ctrl_l_limits_name;                           // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   foot_ctrl_r_limits_name;                           // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_l_lock_alpha;                                 // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_r_lock_alpha;                                 // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                foot_l_lock_location;                              // 0x0668(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               foot_l_lock_rotation;                              // 0x0680(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        foot_l_z_offset;                                   // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                foot_r_lock_location;                              // 0x06A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               foot_r_lock_rotation;                              // 0x06B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        foot_r_z_offset;                                   // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_l_z_offset_target;                            // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_r_z_offset_target;                            // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pelvis_z_offset;                                   // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  foot_l_normal_hit;                                 // 0x06F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  foot_r_normal_hit;                                 // 0x0710(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  foot_l_normal_hit_target;                          // 0x0730(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  foot_r_normal_hit_target;                          // 0x0750(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigPose                               hit_pose;                                          // 0x0770(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          is_moving;                                         // 0x07E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E1[0x3];                                      // 0x07E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         race_int;                                          // 0x07E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         gender_int;                                        // 0x07E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LOD;                                               // 0x07EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pelvis_clamp_min;                                  // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_height;                                 // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_offset_inner;                           // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_depth_target_stand_min;                 // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_depth_target_stand_max;                 // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_depth_target_moving_min;                // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_depth_target_moving_max;                // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         race_from_game;                                    // 0x0828(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         race_current;                                      // 0x082C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         gender_from_game;                                  // 0x0830(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         gender_current;                                    // 0x0834(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          trigger_update;                                    // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CR_PC_MASTER_Universal_Hardcoded_C">();
	}
	static class UCR_PC_MASTER_Universal_Hardcoded_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_PC_MASTER_Universal_Hardcoded_C>();
	}
};
static_assert(alignof(UCR_PC_MASTER_Universal_Hardcoded_C) == 0x000010, "Wrong alignment on UCR_PC_MASTER_Universal_Hardcoded_C");
static_assert(sizeof(UCR_PC_MASTER_Universal_Hardcoded_C) == 0x000840, "Wrong size on UCR_PC_MASTER_Universal_Hardcoded_C");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, feet_perform_ik_trace) == 0x000630, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::feet_perform_ik_trace' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, feet_perform_normal_adjust) == 0x000631, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::feet_perform_normal_adjust' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, pause_pose) == 0x000632, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::pause_pose' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, update_pose) == 0x000633, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::update_pose' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, movement_speed) == 0x000638, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::movement_speed' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, Ground_Offset_Pitch) == 0x000640, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::Ground_Offset_Pitch' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_ctrl_l_limits_name) == 0x000648, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_ctrl_l_limits_name' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_ctrl_r_limits_name) == 0x000650, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_ctrl_r_limits_name' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_l_lock_alpha) == 0x000658, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_l_lock_alpha' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_r_lock_alpha) == 0x000660, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_r_lock_alpha' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_l_lock_location) == 0x000668, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_l_lock_location' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_l_lock_rotation) == 0x000680, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_l_lock_rotation' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_l_z_offset) == 0x000698, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_l_z_offset' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_r_lock_location) == 0x0006A0, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_r_lock_location' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_r_lock_rotation) == 0x0006B8, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_r_lock_rotation' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_r_z_offset) == 0x0006D0, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_r_z_offset' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_l_z_offset_target) == 0x0006D8, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_l_z_offset_target' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_r_z_offset_target) == 0x0006E0, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_r_z_offset_target' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, pelvis_z_offset) == 0x0006E8, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::pelvis_z_offset' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_l_normal_hit) == 0x0006F0, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_l_normal_hit' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_r_normal_hit) == 0x000710, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_r_normal_hit' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_l_normal_hit_target) == 0x000730, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_l_normal_hit_target' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_r_normal_hit_target) == 0x000750, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_r_normal_hit_target' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, hit_pose) == 0x000770, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::hit_pose' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, is_moving) == 0x0007E0, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::is_moving' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, race_int) == 0x0007E4, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::race_int' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, gender_int) == 0x0007E8, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::gender_int' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, LOD) == 0x0007EC, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::LOD' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, pelvis_clamp_min) == 0x0007F0, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::pelvis_clamp_min' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_trace_height) == 0x0007F8, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_trace_height' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_trace_offset_inner) == 0x000800, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_trace_offset_inner' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_trace_depth_target_stand_min) == 0x000808, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_trace_depth_target_stand_min' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_trace_depth_target_stand_max) == 0x000810, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_trace_depth_target_stand_max' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_trace_depth_target_moving_min) == 0x000818, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_trace_depth_target_moving_min' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, foot_trace_depth_target_moving_max) == 0x000820, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::foot_trace_depth_target_moving_max' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, race_from_game) == 0x000828, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::race_from_game' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, race_current) == 0x00082C, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::race_current' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, gender_from_game) == 0x000830, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::gender_from_game' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, gender_current) == 0x000834, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::gender_current' has a wrong offset!");
static_assert(offsetof(UCR_PC_MASTER_Universal_Hardcoded_C, trigger_update) == 0x000838, "Member 'UCR_PC_MASTER_Universal_Hardcoded_C::trigger_update' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass CR_PC_MASTER_Universal_Hardcoded.RigVMMemory_Literal
// 0x1348 (0x1390 - 0x0048)
class CR_PC_MASTER_Universal_Hardcoded::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	bool                                          RigVMModel___VariableNode_93_Value__Const;         // 0x0048(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___VariableNode_95_Value__Const;         // 0x0049(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_4_2_1_1_Item__Const;    // 0x004C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_4_2_1_1_Space__Const;   // 0x0058(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_Value__Const;   // 0x0060(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_4_2_1_1_Weight__Const;  // 0x0078(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_2_2_Item__Const;      // 0x007C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_Value__Const;     // 0x0088(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_2_1_Item__Const;    // 0x00A0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_Value__Const;   // 0x00B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_1_2_1_Item__Const;  // 0x00C8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_Value__Const; // 0x00D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_1_1_1_1_Item__Const; // 0x00F0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_Value__Const; // 0x0100(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_3_Item__Const;        // 0x0118(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_3_Value__Const;       // 0x0128(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_3_Item__Const;      // 0x0140(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_3_Value__Const;     // 0x0150(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_1_3_Item__Const;    // 0x0168(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_Value__Const;   // 0x0178(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_1_1_2_Item__Const;  // 0x0190(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_Value__Const; // 0x01A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___VariableNode_55_Value__Const;         // 0x01B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___VariableNode_56_Value__Const;         // 0x01C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_59_Value__Const;         // 0x01C8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_66_Value__Const;         // 0x01D0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_65_Value__Const;         // 0x01D8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_60_Value__Const;         // 0x01E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_61_Value__Const;         // 0x01E8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_62_Value__Const;         // 0x01F0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_63_Value__Const;         // 0x01F8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_Value__Const; // 0x0200(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_Value__Const;   // 0x0218(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_Value__Const; // 0x0230(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_Value__Const; // 0x0248(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_Value__Const; // 0x0260(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_Value__Const;     // 0x0278(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_Value__Const;   // 0x0290(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_Value__Const; // 0x02A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___VariableNode_55_1_Value__Const;       // 0x02C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___VariableNode_56_1_Value__Const;       // 0x02C8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_Value__Const; // 0x02D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_1_Value__Const; // 0x02E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_1_Value__Const; // 0x0300(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_Value__Const; // 0x0318(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_Value__Const; // 0x0330(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_1_Value__Const; // 0x0348(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_Value__Const; // 0x0360(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_Value__Const; // 0x0378(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___VariableNode_55_1_1_Value__Const;     // 0x0390(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___VariableNode_56_1_1_Value__Const;     // 0x0398(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_60_3_Value__Const;       // 0x03A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_1_Value__Const; // 0x03A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_1_1_Value__Const; // 0x03C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_1_1_Value__Const; // 0x03D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_1_Value__Const; // 0x03F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_1_Value__Const; // 0x0408(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_1_1_Value__Const; // 0x0420(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_1_1_Value__Const; // 0x0438(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_1_Value__Const; // 0x0450(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_1_Value__Const; // 0x0468(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___VariableNode_55_1_1_1_Value__Const;   // 0x0480(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___VariableNode_56_1_1_1_Value__Const;   // 0x0488(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_59_1_1_1_Value__Const;   // 0x0490(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_65_3_Value__Const;       // 0x0498(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_60_4_Value__Const;       // 0x04A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_1_1_Value__Const; // 0x04A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_1_1_1_Value__Const; // 0x04C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_1_1_1_Value__Const; // 0x04D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_1_1_Value__Const; // 0x04F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_1_1_Value__Const; // 0x0508(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_1_1_1_Value__Const; // 0x0520(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_1_1_1_Value__Const; // 0x0538(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_1_1_Value__Const; // 0x0550(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_1_1_Value__Const; // 0x0568(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___VariableNode_55_1_1_1_1_Value__Const; // 0x0580(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___VariableNode_56_1_1_1_1_Value__Const; // 0x0588(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_1_1_1_Value__Const; // 0x0590(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_Value__Const;     // 0x05A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_Value__Const;       // 0x05C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_Value__Const;     // 0x05D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_Value__Const;   // 0x05F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_Value__Const; // 0x0608(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_Value__Const;         // 0x0620(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_Value__Const;       // 0x0638(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_Value__Const;     // 0x0650(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_Value__Const;   // 0x0668(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___VariableNode_55_1_1_1_1_1_1_Value__Const; // 0x0680(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___VariableNode_56_1_1_1_1_1_1_Value__Const; // 0x0688(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_65_6_Value__Const;       // 0x0690(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_60_7_Value__Const;       // 0x0698(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_61_7_Value__Const;       // 0x06A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_2_Value__Const;   // 0x06A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_3_Value__Const;     // 0x06C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_2_Value__Const;   // 0x06D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_2_Value__Const; // 0x06F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_2_Value__Const; // 0x0708(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_4_Value__Const;       // 0x0720(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_4_Value__Const;     // 0x0738(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_4_Value__Const;   // 0x0750(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_3_Value__Const; // 0x0768(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_2_Value__Const; // 0x0780(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_2_Value__Const; // 0x0798(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_2_Value__Const; // 0x07B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_2_Value__Const; // 0x07C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_2_Value__Const;   // 0x07E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_2_Value__Const; // 0x07F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_2_Value__Const; // 0x0810(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_65_8_Value__Const;       // 0x0828(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_66_8_Value__Const;       // 0x0830(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_2_Value__Const; // 0x0838(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_2_Value__Const; // 0x0850(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_2_Value__Const; // 0x0868(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_2_Value__Const; // 0x0880(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_2_Value__Const; // 0x0898(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_2_Value__Const;   // 0x08B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_2_Value__Const; // 0x08C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_2_Value__Const; // 0x08E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_2_Value__Const; // 0x08F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_2_Value__Const; // 0x0910(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_2_Value__Const; // 0x0928(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_1_2_Value__Const; // 0x0940(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_1_1_2_Value__Const; // 0x0958(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_1_1_2_Value__Const; // 0x0970(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_1_2_Value__Const; // 0x0988(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_1_2_Value__Const; // 0x09A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_1_1_2_Value__Const; // 0x09B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_1_1_2_Value__Const; // 0x09D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_1_2_Value__Const; // 0x09E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_1_2_Value__Const; // 0x0A00(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_1_1_1_1_Value__Const; // 0x0A18(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_1_1_1_1_Value__Const; // 0x0A30(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_1_1_1_1_Value__Const; // 0x0A48(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_1_1_1_1_Value__Const; // 0x0A60(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_3_Value__Const;   // 0x0A78(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_4_Value__Const;     // 0x0A90(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_3_Value__Const;   // 0x0AA8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_3_Value__Const; // 0x0AC0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_3_Value__Const; // 0x0AD8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_5_Value__Const;       // 0x0AF0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_5_Value__Const;     // 0x0B08(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_5_Value__Const;   // 0x0B20(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_4_Value__Const; // 0x0B38(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_2_1_Value__Const; // 0x0B50(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_3_1_Value__Const;   // 0x0B68(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_2_1_Value__Const; // 0x0B80(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_2_1_Value__Const; // 0x0B98(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_2_1_Value__Const; // 0x0BB0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_4_1_Value__Const;     // 0x0BC8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_4_1_Value__Const;   // 0x0BE0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_4_1_Value__Const; // 0x0BF8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_3_1_Value__Const; // 0x0C10(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigElementType                               RigVMModel___HierarchyGetPoseItemArray_ElementType__Const; // 0x0C28(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C29[0x7];                                      // 0x0C29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 RigVMModel___HierarchyGetPoseItemArray_ItemsToGet__Const; // 0x0C30(0x0010)(Edit, EditConst, NonTransactional)
	ERigVMTransformSpace                          RigVMModel___HierarchySetPoseItemArray_Space__Const; // 0x0C40(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C41[0x3];                                      // 0x0C41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_3_Item__Const;          // 0x0C44(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_3_Space__Const;         // 0x0C50(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C51[0xF];                                      // 0x0C51(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___Set_Transform_3_Value__Const;         // 0x0C60(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_3_1_Item__Const;        // 0x0CC0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_3_2_Item__Const;        // 0x0CCC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_3_1_1_Item__Const;      // 0x0CD8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE4[0x4];                                      // 0x0CE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_ItemToModify__Const; // 0x0CE8(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___ModifyTransforms_WeightMinimum__Const; // 0x0CF8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigModifyBoneMode                     RigVMModel___ModifyTransforms_Mode__Const;         // 0x0CFC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CFD[0x3];                                      // 0x0CFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_3_ItemToModify__Const; // 0x0D00(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___Set_Transform_Item__Const;            // 0x0D10(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___DISPATCH_RigVMDispatch_If_True__Const; // 0x0D1C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_Item__Const;          // 0x0D24(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___DISPATCH_RigVMDispatch_If_1_True__Const; // 0x0D30(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RigVMModel___Less_2_B__Const;                      // 0x0D38(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3C[0x4];                                      // 0x0D3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RigVMModel___FootTrace_side__Const;                // 0x0D40(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	ERigVMTransformSpace                          FootTrace___FootTrace_GetTransform_Space__Const;   // 0x0D50(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace___FootTrace_GetTransform_bInitial__Const; // 0x0D51(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D52[0x6];                                      // 0x0D52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTrace___FootTrace_Add_B__Const;                // 0x0D58(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_Subtract_1_B__Const;         // 0x0D70(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        FootTrace___FootTrace_Multiply_B__Const;           // 0x0D88(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        FootTrace___FootTrace_Remap_1_SourceMinimum__Const; // 0x0D90(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        FootTrace___FootTrace_Remap_1_SourceMaximum__Const; // 0x0D98(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               FootTrace___FootTrace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0DA0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA1[0x3];                                      // 0x0DA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootTrace___FootTrace_SphereTraceByTraceChannel_Radius__Const; // 0x0DA4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FootTrace___FootTrace_If_1_1_True__Const;          // 0x0DA8(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FootTrace___FootTrace_If_1_1_False__Const;         // 0x0DB8(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
