#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Crab01_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"
#include "Crab01_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Crab01_AnimBP.Crab01_AnimBP_C
// 0x1750 (0x3390 - 0x1C40)
class UCrab01_AnimBP_C final : public UAoCNPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1C40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Crab01_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                // 0x1C48(0x0038)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1C80(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1C88(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1C90(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x1CB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x1CD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x1D00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x1D28(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x1D50(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x1D70(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1DB8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1E00(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1E48(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x1E68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1E90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1EB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x1EE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1F08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1F30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1F58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1F80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1FA8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1FD0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x2018(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x2038(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2060(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2088(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x20B0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x20D8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2120(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x2140(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x2188(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x21A8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x21C8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x2290(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x22B0(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x22F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2340(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x2388(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x23D0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x23F0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2460(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x2480(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2548(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2568(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2630(0x0080)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x26B0(0x0118)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x27C8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x2810(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2838(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x28B8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x2900(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x2948(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x2990(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x29D8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x2A20(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x2A68(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x2AB0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x2AF8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x2B40(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x2B88(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x2BD0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x2BF8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x2C20(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x2C68(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x2C90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x2CB8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x2CE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x2D08(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2D30(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x2D78(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x2DC0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2DE8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x2E30(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x2E58(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2E80(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x2F00(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x2F28(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x3018(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x3040(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x3108(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x3130(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x3158(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x3248(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x3270(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3338(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3360(0x0028)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Crab01_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Crab01_AnimBP_C">();
	}
	static class UCrab01_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrab01_AnimBP_C>();
	}
};
static_assert(alignof(UCrab01_AnimBP_C) == 0x000010, "Wrong alignment on UCrab01_AnimBP_C");
static_assert(sizeof(UCrab01_AnimBP_C) == 0x003390, "Wrong size on UCrab01_AnimBP_C");
static_assert(offsetof(UCrab01_AnimBP_C, UberGraphFrame) == 0x001C40, "Member 'UCrab01_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, __AnimBlueprintMutables) == 0x001C48, "Member 'UCrab01_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x001C80, "Member 'UCrab01_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimBlueprintExtension_Base) == 0x001C88, "Member 'UCrab01_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_Root) == 0x001C90, "Member 'UCrab01_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_16) == 0x001CB0, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_15) == 0x001CD8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_14) == 0x001D00, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_13) == 0x001D28, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateResult_9) == 0x001D50, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x001D70, "Member 'UCrab01_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x001DB8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x001E00, "Member 'UCrab01_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateResult_8) == 0x001E48, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_12) == 0x001E68, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_11) == 0x001E90, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_10) == 0x001EB8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_9) == 0x001EE0, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x001F08, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x001F30, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x001F58, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x001F80, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x001FA8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x001FD0, "Member 'UCrab01_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateResult_7) == 0x002018, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x002038, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x002060, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x002088, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TransitionResult) == 0x0020B0, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x0020D8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateResult_6) == 0x002120, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x002140, "Member 'UCrab01_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateResult_5) == 0x002188, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateResult_4) == 0x0021A8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateMachine_2) == 0x0021C8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateResult_3) == 0x002290, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x0022B0, "Member 'UCrab01_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_BlendListByInt_2) == 0x0022F8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_BlendListByInt_2' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x002340, "Member 'UCrab01_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x002388, "Member 'UCrab01_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateResult_2) == 0x0023D0, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x0023F0, "Member 'UCrab01_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateResult_1) == 0x002460, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x002480, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateResult) == 0x002548, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_StateMachine) == 0x002568, "Member 'UCrab01_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_SaveCachedPose_2) == 0x002630, "Member 'UCrab01_AnimBP_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x0026B0, "Member 'UCrab01_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_Slot_10) == 0x0027C8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_Slot_10' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_17) == 0x002810, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_17' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x002838, "Member 'UCrab01_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x0028B8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_Slot_9) == 0x002900, "Member 'UCrab01_AnimBP_C::AnimGraphNode_Slot_9' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_BlendListByInt_1) == 0x002948, "Member 'UCrab01_AnimBP_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_Slot_8) == 0x002990, "Member 'UCrab01_AnimBP_C::AnimGraphNode_Slot_8' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_Slot_7) == 0x0029D8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_Slot_7' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x002A20, "Member 'UCrab01_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_Slot_6) == 0x002A68, "Member 'UCrab01_AnimBP_C::AnimGraphNode_Slot_6' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_BlendListByInt) == 0x002AB0, "Member 'UCrab01_AnimBP_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_Slot_5) == 0x002AF8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_Slot_4) == 0x002B40, "Member 'UCrab01_AnimBP_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_Slot_3) == 0x002B88, "Member 'UCrab01_AnimBP_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_16) == 0x002BD0, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_16' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_15) == 0x002BF8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_15' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_Slot_2) == 0x002C20, "Member 'UCrab01_AnimBP_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_14) == 0x002C68, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_14' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_13) == 0x002C90, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_13' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_12) == 0x002CB8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_12' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_11) == 0x002CE0, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_11' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_10) == 0x002D08, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x002D30, "Member 'UCrab01_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_Slot_1) == 0x002D78, "Member 'UCrab01_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_9) == 0x002DC0, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_Slot) == 0x002DE8, "Member 'UCrab01_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_8) == 0x002E30, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_7) == 0x002E58, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002E80, "Member 'UCrab01_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_6) == 0x002F00, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_LayeredBoneBlend_1) == 0x002F28, "Member 'UCrab01_AnimBP_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_5) == 0x003018, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TwoWayBlend_1) == 0x003040, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TwoWayBlend_1' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_4) == 0x003108, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_3) == 0x003130, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x003158, "Member 'UCrab01_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x003248, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_TwoWayBlend) == 0x003270, "Member 'UCrab01_AnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x003338, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UCrab01_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x003360, "Member 'UCrab01_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

