#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Crab01_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Crab01_AnimBP.Crab01_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01D7 (0x01D8 - 0x0001)
struct Crab01_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_421;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_422;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_423;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_424;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_425;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_426;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_427;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_428;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_429;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_430;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_431;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_432;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_433;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_434;                               // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          __StructProperty_435;                              // 0x0080(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_436;                                // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_437;                                 // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_438;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_439;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_440;                                 // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_441;                               // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_442;                                // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_443;                               // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_444;                                // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_445;                                // 0x00D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_446;                                // 0x00DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_447;                               // 0x00E8(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_448;                                // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_449;                                  // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_450;                                // 0x0108(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_451;                                // 0x0109(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_452;                                // 0x010A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_453;                               // 0x0110(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_454;                              // 0x0120(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0140(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C0(0x0018)()
};
static_assert(alignof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Crab01_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001D8, "Wrong size on Crab01_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_421) == 0x000004, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_421' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_422) == 0x00000C, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_422' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_423) == 0x000018, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_423' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_424) == 0x000028, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_424' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_425) == 0x000030, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_425' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_426) == 0x000038, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_426' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_427) == 0x00003C, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_427' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_428) == 0x000044, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_428' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_429) == 0x00004C, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_429' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_430) == 0x000054, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_430' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_431) == 0x00005C, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_431' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_432) == 0x000060, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_432' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_433) == 0x000064, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_433' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_434) == 0x000070, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_434' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_435) == 0x000080, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_435' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_436) == 0x0000AC, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_436' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_437) == 0x0000B4, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_437' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_438) == 0x0000B8, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_438' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_439) == 0x0000C0, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_439' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_440) == 0x0000C8, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_440' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_441) == 0x0000CC, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_441' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_442) == 0x0000D0, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_442' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_443) == 0x0000D4, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_443' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_444) == 0x0000D8, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_444' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_445) == 0x0000D9, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_445' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_446) == 0x0000DC, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_446' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_447) == 0x0000E8, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_447' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_448) == 0x0000F8, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_448' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_449) == 0x000100, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_449' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_450) == 0x000108, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_450' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_451) == 0x000109, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_451' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_452) == 0x00010A, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_452' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_453) == 0x000110, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_453' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_454) == 0x000120, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_454' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000140, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001C0, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Crab01_AnimBP.Crab01_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0037 (0x0038 - 0x0001)
struct Crab01_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2;                                   // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_4;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_9;                                   // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_11;                                  // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Crab01_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000038, "Wrong size on Crab01_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x000008, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_2) == 0x00000C, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_2' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x000010, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000014, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x000018, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x00001C, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000020, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_8) == 0x000024, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_8' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_9) == 0x000028, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_9' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_10) == 0x00002C, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_10' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_11) == 0x000030, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_11' has a wrong offset!");
static_assert(offsetof(Crab01_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_12) == 0x000034, "Member 'Crab01_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_12' has a wrong offset!");

}

