#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreatePointsGrid

#include "Basic.hpp"

#include "PCG_structs.hpp"
#include "PCGCoordinatePlaneAxes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CreatePointsGrid.CreatePointsGrid_C.ExecuteWithContext
// 0x0318 (0x0318 - 0x0000)
struct CreatePointsGrid_C_ExecuteWithContext final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Input;                                             // 0x00B8(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Output;                                            // 0x00D8(0x0020)(Parm, OutParm)
	struct FPCGContext                            Context;                                           // 0x00F8(0x00B8)(Edit, BlueprintVisible)
	TArray<struct FPCGPoint>                      OutPoints;                                         // 0x01B0(0x0010)(Edit, BlueprintVisible)
	class AActor*                                 Target_Actor;                                      // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPCGCoordinatePlaneAxes                       Temp_byte_Variable;                                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGData*                               CallFunc_GetActorData_ReturnValue;                 // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPCGSpatialData*                        K2Node_DynamicCast_AsPCGSpatial_Data;              // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue;                // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             CallFunc_FTruncVector_ReturnValue;                 // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_2;            // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_3;            // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_4;            // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPCGPointData*                          CallFunc_IterationLoop_OutData;                    // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPCGTaggedData                         K2Node_MakeStruct_PCGTaggedData;                   // 0x0280(0x0068)()
	TArray<struct FPCGTaggedData>                 K2Node_MakeArray_Array;                            // 0x02E8(0x0010)(ReferenceParm)
	struct FPCGDataCollection                     K2Node_MakeStruct_PCGDataCollection;               // 0x02F8(0x0020)()
};
static_assert(alignof(CreatePointsGrid_C_ExecuteWithContext) == 0x000008, "Wrong alignment on CreatePointsGrid_C_ExecuteWithContext");
static_assert(sizeof(CreatePointsGrid_C_ExecuteWithContext) == 0x000318, "Wrong size on CreatePointsGrid_C_ExecuteWithContext");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, InContext) == 0x000000, "Member 'CreatePointsGrid_C_ExecuteWithContext::InContext' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, Input) == 0x0000B8, "Member 'CreatePointsGrid_C_ExecuteWithContext::Input' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, Output) == 0x0000D8, "Member 'CreatePointsGrid_C_ExecuteWithContext::Output' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, Context) == 0x0000F8, "Member 'CreatePointsGrid_C_ExecuteWithContext::Context' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, OutPoints) == 0x0001B0, "Member 'CreatePointsGrid_C_ExecuteWithContext::OutPoints' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, Target_Actor) == 0x0001C0, "Member 'CreatePointsGrid_C_ExecuteWithContext::Target_Actor' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0001C8, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, Temp_byte_Variable) == 0x0001E0, "Member 'CreatePointsGrid_C_ExecuteWithContext::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_GetActorData_ReturnValue) == 0x0001E8, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_GetActorData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, K2Node_DynamicCast_AsPCGSpatial_Data) == 0x0001F0, "Member 'CreatePointsGrid_C_ExecuteWithContext::K2Node_DynamicCast_AsPCGSpatial_Data' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'CreatePointsGrid_C_ExecuteWithContext::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_Vector_GetAbs_ReturnValue) == 0x000200, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_Vector_GetAbs_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000218, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_Divide_VectorVector_ReturnValue) == 0x000230, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_FTruncVector_ReturnValue) == 0x000248, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_FTruncVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_Multiply_IntInt_ReturnValue) == 0x000254, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000258, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_Multiply_IntInt_ReturnValue_2) == 0x00025C, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_Multiply_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_Multiply_IntInt_ReturnValue_3) == 0x000260, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_Multiply_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, K2Node_Select_Default) == 0x000264, "Member 'CreatePointsGrid_C_ExecuteWithContext::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_Multiply_IntInt_ReturnValue_4) == 0x000268, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_Multiply_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_SelectInt_ReturnValue) == 0x00026C, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000270, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, CallFunc_IterationLoop_OutData) == 0x000278, "Member 'CreatePointsGrid_C_ExecuteWithContext::CallFunc_IterationLoop_OutData' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, K2Node_MakeStruct_PCGTaggedData) == 0x000280, "Member 'CreatePointsGrid_C_ExecuteWithContext::K2Node_MakeStruct_PCGTaggedData' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, K2Node_MakeArray_Array) == 0x0002E8, "Member 'CreatePointsGrid_C_ExecuteWithContext::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_ExecuteWithContext, K2Node_MakeStruct_PCGDataCollection) == 0x0002F8, "Member 'CreatePointsGrid_C_ExecuteWithContext::K2Node_MakeStruct_PCGDataCollection' has a wrong offset!");

// Function CreatePointsGrid.CreatePointsGrid_C.IsCacheableOverride
// 0x0002 (0x0002 - 0x0000)
struct CreatePointsGrid_C_IsCacheableOverride final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreatePointsGrid_C_IsCacheableOverride) == 0x000001, "Wrong alignment on CreatePointsGrid_C_IsCacheableOverride");
static_assert(sizeof(CreatePointsGrid_C_IsCacheableOverride) == 0x000002, "Wrong size on CreatePointsGrid_C_IsCacheableOverride");
static_assert(offsetof(CreatePointsGrid_C_IsCacheableOverride, ReturnValue) == 0x000000, "Member 'CreatePointsGrid_C_IsCacheableOverride::ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IsCacheableOverride, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'CreatePointsGrid_C_IsCacheableOverride::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function CreatePointsGrid.CreatePointsGrid_C.IterationLoopBody
// 0x0A90 (0x0A90 - 0x0000)
struct CreatePointsGrid_C_IterationLoopBody final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int64                                         Iteration;                                         // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UPCGSpatialData*                  InA;                                               // 0x00C0(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UPCGSpatialData*                  InB;                                               // 0x00C8(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPCGPoint                              OutPoint;                                          // 0x00D0(0x00D0)(Parm, OutParm, NoDestructor)
	class UPCGMetadata*                           OutMetadata;                                       // 0x01A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x01A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_Int64ToInt_ReturnValue;              // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGComponent*                          CallFunc_GetOriginalComponent_ReturnValue;         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x01F0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntVectorToVector_ReturnValue;       // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector;                       // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector_1;                     // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPCGCoordinatePlaneAxes                       Temp_byte_Variable;                                // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_1;                            // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_2;                            // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_3;                            // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPCGCoordinatePlaneAxes                       Temp_byte_Variable_1;                              // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_4;                            // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_5;                            // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_6;                            // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPCGCoordinatePlaneAxes                       Temp_byte_Variable_2;                              // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPCGCoordinatePlaneAxes                       Temp_byte_Variable_3;                              // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_492[0x6];                                      // 0x0492(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default_1;                           // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_Select_Default_2;                           // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_7;                            // 0x04C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA[0x2];                                      // 0x04DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector                             K2Node_Select_Default_3;                           // 0x04DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x3];                                      // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x04F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0518(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue_1;           // 0x0530(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_8;                            // 0x0550(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue_2;           // 0x0568(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x0580(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_4;                           // 0x0598(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x05B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_5;      // 0x05C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_6;      // 0x05E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x05F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0610(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0628(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_7;      // 0x0640(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_2;               // 0x0658(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0670(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_688[0x8];                                      // 0x0688(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0690(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ComputeSeedFromPosition_ReturnValue;      // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4[0x4];                                      // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x06F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0710(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0728(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPCGPoint                              K2Node_MakeStruct_PCGPoint;                        // 0x0740(0x00D0)(NoDestructor)
	int32                                         CallFunc_ComputeSeedFromPosition_ReturnValue_1;    // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814[0xC];                                      // 0x0814(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0820(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPCGPoint                              K2Node_MakeStruct_PCGPoint_1;                      // 0x0880(0x00D0)(NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x0950(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x0968(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0980(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ComputeSeedFromPosition_ReturnValue_2;    // 0x0998(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDensityAtPosition_ReturnValue;         // 0x099C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPCGPoint                              K2Node_MakeStruct_PCGPoint_2;                      // 0x09A0(0x00D0)(NoDestructor)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0A70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_5;                           // 0x0A71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A72[0x2];                                      // 0x0A72(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDensityAtPosition_ReturnValue_1;       // 0x0A74(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_6;                           // 0x0A79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A7A[0x6];                                      // 0x0A7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0A80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0A88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreatePointsGrid_C_IterationLoopBody) == 0x000010, "Wrong alignment on CreatePointsGrid_C_IterationLoopBody");
static_assert(sizeof(CreatePointsGrid_C_IterationLoopBody) == 0x000A90, "Wrong size on CreatePointsGrid_C_IterationLoopBody");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, InContext) == 0x000000, "Member 'CreatePointsGrid_C_IterationLoopBody::InContext' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Iteration) == 0x0000B8, "Member 'CreatePointsGrid_C_IterationLoopBody::Iteration' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, InA) == 0x0000C0, "Member 'CreatePointsGrid_C_IterationLoopBody::InA' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, InB) == 0x0000C8, "Member 'CreatePointsGrid_C_IterationLoopBody::InB' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, OutPoint) == 0x0000D0, "Member 'CreatePointsGrid_C_IterationLoopBody::OutPoint' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, OutMetadata) == 0x0001A0, "Member 'CreatePointsGrid_C_IterationLoopBody::OutMetadata' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, ReturnValue) == 0x0001A8, "Member 'CreatePointsGrid_C_IterationLoopBody::ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0001B0, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Conv_Int64ToInt_ReturnValue) == 0x0001C8, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Conv_Int64ToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_GetOriginalComponent_ReturnValue) == 0x0001D0, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_GetOriginalComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_bool_Variable) == 0x0001D8, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_GetOwner_ReturnValue) == 0x0001E0, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_bool_Variable_1) == 0x0001E8, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_GetTransform_ReturnValue) == 0x0001F0, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_BreakTransform_Location) == 0x000250, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_BreakTransform_Rotation) == 0x000268, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_BreakTransform_Scale) == 0x000280, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_MakeTransform_ReturnValue) == 0x0002A0, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000300, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Conv_IntVectorToVector_ReturnValue) == 0x000318, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Conv_IntVectorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, K2Node_MakeStruct_IntVector) == 0x000330, "Member 'CreatePointsGrid_C_IterationLoopBody::K2Node_MakeStruct_IntVector' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, K2Node_MakeStruct_IntVector_1) == 0x00033C, "Member 'CreatePointsGrid_C_IterationLoopBody::K2Node_MakeStruct_IntVector_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_struct_Variable) == 0x000348, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_byte_Variable) == 0x000360, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_struct_Variable_1) == 0x000368, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_struct_Variable_2) == 0x000380, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_struct_Variable_3) == 0x000398, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_byte_Variable_1) == 0x0003B0, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_struct_Variable_4) == 0x0003B8, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, K2Node_Select_Default) == 0x0003D0, "Member 'CreatePointsGrid_C_IterationLoopBody::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_SelectVector_ReturnValue) == 0x0003E8, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000400, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_struct_Variable_5) == 0x000418, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000430, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000448, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_struct_Variable_6) == 0x000460, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Divide_VectorVector_ReturnValue) == 0x000478, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_byte_Variable_2) == 0x000490, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_byte_Variable_3) == 0x000491, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, K2Node_Select_Default_1) == 0x000498, "Member 'CreatePointsGrid_C_IterationLoopBody::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, K2Node_Select_Default_2) == 0x0004B0, "Member 'CreatePointsGrid_C_IterationLoopBody::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_struct_Variable_7) == 0x0004C0, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_bool_Variable_2) == 0x0004D8, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_bool_Variable_3) == 0x0004D9, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, K2Node_Select_Default_3) == 0x0004DC, "Member 'CreatePointsGrid_C_IterationLoopBody::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_bool_Variable_4) == 0x0004E8, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Multiply_IntInt_ReturnValue) == 0x0004EC, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Divide_IntInt_ReturnValue) == 0x0004F0, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Divide_IntInt_ReturnValue_1) == 0x0004F4, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Conv_IntToVector_ReturnValue) == 0x0004F8, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Conv_IntToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Percent_IntInt_ReturnValue) == 0x000510, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000518, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Conv_IntToVector_ReturnValue_1) == 0x000530, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Conv_IntToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000548, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, Temp_struct_Variable_8) == 0x000550, "Member 'CreatePointsGrid_C_IterationLoopBody::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Conv_IntToVector_ReturnValue_2) == 0x000568, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Conv_IntToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Multiply_VectorVector_ReturnValue_4) == 0x000580, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Multiply_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, K2Node_Select_Default_4) == 0x000598, "Member 'CreatePointsGrid_C_IterationLoopBody::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_SelectVector_ReturnValue_1) == 0x0005B0, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Multiply_VectorVector_ReturnValue_5) == 0x0005C8, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Multiply_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Multiply_VectorVector_ReturnValue_6) == 0x0005E0, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Multiply_VectorVector_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Add_VectorVector_ReturnValue) == 0x0005F8, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000610, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000628, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Multiply_VectorVector_ReturnValue_7) == 0x000640, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Multiply_VectorVector_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_SelectVector_ReturnValue_2) == 0x000658, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_SelectVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000670, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_MakeTransform_ReturnValue_1) == 0x000690, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_ComputeSeedFromPosition_ReturnValue) == 0x0006F0, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_ComputeSeedFromPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_BreakTransform_Location_1) == 0x0006F8, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_BreakTransform_Rotation_1) == 0x000710, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_BreakTransform_Scale_1) == 0x000728, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, K2Node_MakeStruct_PCGPoint) == 0x000740, "Member 'CreatePointsGrid_C_IterationLoopBody::K2Node_MakeStruct_PCGPoint' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_ComputeSeedFromPosition_ReturnValue_1) == 0x000810, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_ComputeSeedFromPosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_ComposeTransforms_ReturnValue) == 0x000820, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, K2Node_MakeStruct_PCGPoint_1) == 0x000880, "Member 'CreatePointsGrid_C_IterationLoopBody::K2Node_MakeStruct_PCGPoint_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_BreakTransform_Location_2) == 0x000950, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_BreakTransform_Rotation_2) == 0x000968, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_BreakTransform_Scale_2) == 0x000980, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_ComputeSeedFromPosition_ReturnValue_2) == 0x000998, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_ComputeSeedFromPosition_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_GetDensityAtPosition_ReturnValue) == 0x00099C, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_GetDensityAtPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, K2Node_MakeStruct_PCGPoint_2) == 0x0009A0, "Member 'CreatePointsGrid_C_IterationLoopBody::K2Node_MakeStruct_PCGPoint_2' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000A70, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, K2Node_Select_Default_5) == 0x000A71, "Member 'CreatePointsGrid_C_IterationLoopBody::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_GetDensityAtPosition_ReturnValue_1) == 0x000A74, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_GetDensityAtPosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000A78, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, K2Node_Select_Default_6) == 0x000A79, "Member 'CreatePointsGrid_C_IterationLoopBody::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000A80, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CreatePointsGrid_C_IterationLoopBody, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000A88, "Member 'CreatePointsGrid_C_IterationLoopBody::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function CreatePointsGrid.CreatePointsGrid_C.NodeTitleOverride
// 0x0008 (0x0008 - 0x0000)
struct CreatePointsGrid_C_NodeTitleOverride final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreatePointsGrid_C_NodeTitleOverride) == 0x000004, "Wrong alignment on CreatePointsGrid_C_NodeTitleOverride");
static_assert(sizeof(CreatePointsGrid_C_NodeTitleOverride) == 0x000008, "Wrong size on CreatePointsGrid_C_NodeTitleOverride");
static_assert(offsetof(CreatePointsGrid_C_NodeTitleOverride, ReturnValue) == 0x000000, "Member 'CreatePointsGrid_C_NodeTitleOverride::ReturnValue' has a wrong offset!");

}

