#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CSQ_0033_TwilightDuty_Lantern_NPC

#include "Basic.hpp"


namespace SDK::Params
{

// Function CSQ_0033_TwilightDuty_Lantern_NPC.CSQ_0033_TwilightDuty_Lantern_NPC_C.BndEvt__CSQ_0033_TwilightDuty_Lantern_ActionResponse_K2Node_ComponentBoundEvent_0_BlueprintScriptBool__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct CSQ_0033_TwilightDuty_Lantern_NPC_C_BndEvt__CSQ_0033_TwilightDuty_Lantern_ActionResponse_K2Node_ComponentBoundEvent_0_BlueprintScriptBool__DelegateSignature final
{
public:
	int64                                         ResponseObjectId;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bValue;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CSQ_0033_TwilightDuty_Lantern_NPC_C_BndEvt__CSQ_0033_TwilightDuty_Lantern_ActionResponse_K2Node_ComponentBoundEvent_0_BlueprintScriptBool__DelegateSignature) == 0x000008, "Wrong alignment on CSQ_0033_TwilightDuty_Lantern_NPC_C_BndEvt__CSQ_0033_TwilightDuty_Lantern_ActionResponse_K2Node_ComponentBoundEvent_0_BlueprintScriptBool__DelegateSignature");
static_assert(sizeof(CSQ_0033_TwilightDuty_Lantern_NPC_C_BndEvt__CSQ_0033_TwilightDuty_Lantern_ActionResponse_K2Node_ComponentBoundEvent_0_BlueprintScriptBool__DelegateSignature) == 0x000010, "Wrong size on CSQ_0033_TwilightDuty_Lantern_NPC_C_BndEvt__CSQ_0033_TwilightDuty_Lantern_ActionResponse_K2Node_ComponentBoundEvent_0_BlueprintScriptBool__DelegateSignature");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_BndEvt__CSQ_0033_TwilightDuty_Lantern_ActionResponse_K2Node_ComponentBoundEvent_0_BlueprintScriptBool__DelegateSignature, ResponseObjectId) == 0x000000, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_BndEvt__CSQ_0033_TwilightDuty_Lantern_ActionResponse_K2Node_ComponentBoundEvent_0_BlueprintScriptBool__DelegateSignature::ResponseObjectId' has a wrong offset!");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_BndEvt__CSQ_0033_TwilightDuty_Lantern_ActionResponse_K2Node_ComponentBoundEvent_0_BlueprintScriptBool__DelegateSignature, bValue) == 0x000008, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_BndEvt__CSQ_0033_TwilightDuty_Lantern_ActionResponse_K2Node_ComponentBoundEvent_0_BlueprintScriptBool__DelegateSignature::bValue' has a wrong offset!");

// Function CSQ_0033_TwilightDuty_Lantern_NPC.CSQ_0033_TwilightDuty_Lantern_NPC_C.ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC
// 0x0048 (0x0048 - 0x0000)
struct CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         K2Node_ComponentBoundEvent_ResponseObjectId;       // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC) == 0x000008, "Wrong alignment on CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC");
static_assert(sizeof(CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC) == 0x000048, "Wrong size on CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC, EntryPoint) == 0x000000, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC::EntryPoint' has a wrong offset!");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC, K2Node_ComponentBoundEvent_ResponseObjectId) == 0x000018, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC::K2Node_ComponentBoundEvent_ResponseObjectId' has a wrong offset!");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC, K2Node_ComponentBoundEvent_bValue) == 0x000020, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC::K2Node_ComponentBoundEvent_bValue' has a wrong offset!");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000028, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000038, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000040, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000044, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function CSQ_0033_TwilightDuty_Lantern_NPC.CSQ_0033_TwilightDuty_Lantern_NPC_C.SwitchOn
// 0x0003 (0x0003 - 0x0000)
struct CSQ_0033_TwilightDuty_Lantern_NPC_C_SwitchOn final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnServer_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnClient_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CSQ_0033_TwilightDuty_Lantern_NPC_C_SwitchOn) == 0x000001, "Wrong alignment on CSQ_0033_TwilightDuty_Lantern_NPC_C_SwitchOn");
static_assert(sizeof(CSQ_0033_TwilightDuty_Lantern_NPC_C_SwitchOn) == 0x000003, "Wrong size on CSQ_0033_TwilightDuty_Lantern_NPC_C_SwitchOn");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_SwitchOn, Success) == 0x000000, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_SwitchOn::Success' has a wrong offset!");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_SwitchOn, CallFunc_IsRunningOnServer_ReturnValue) == 0x000001, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_SwitchOn::CallFunc_IsRunningOnServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CSQ_0033_TwilightDuty_Lantern_NPC_C_SwitchOn, CallFunc_IsRunningOnClient_ReturnValue) == 0x000002, "Member 'CSQ_0033_TwilightDuty_Lantern_NPC_C_SwitchOn::CallFunc_IsRunningOnClient_ReturnValue' has a wrong offset!");

}

