#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CSQ_0033_TwilightDuty_Lantern_NPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CSQ_0033_TwilightDuty_Lantern_NPC.CSQ_0033_TwilightDuty_Lantern_NPC_C
// 0x0060 (0x0590 - 0x0530)
class ACSQ_0033_TwilightDuty_Lantern_NPC_C final : public AInteractableStateMachineBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Light_Moths;                                    // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MountingMesh;                                      // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActionResponseComponent*               ActionResponse;                                    // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightSourceMesh;                                   // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Time_4C96063240F1BD4D5E8032BBF1CAFCAA;    // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_4C96063240F1BD4D5E8032BBF1CAFCAA; // 0x056C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D[0x3];                                      // 0x056D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMat;                                        // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOn;                                              // 0x0580(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__CSQ_0033_TwilightDuty_Lantern_ActionResponse_K2Node_ComponentBoundEvent_0_BlueprintScriptBool__DelegateSignature(const int64 ResponseObjectId, bool bValue);
	void ExecuteUbergraph_CSQ_0033_TwilightDuty_Lantern_NPC(int32 EntryPoint);
	void Off();
	void On();
	void ReceiveBeginPlay();
	void SwitchOn(bool* Success);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CSQ_0033_TwilightDuty_Lantern_NPC_C">();
	}
	static class ACSQ_0033_TwilightDuty_Lantern_NPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACSQ_0033_TwilightDuty_Lantern_NPC_C>();
	}
};
static_assert(alignof(ACSQ_0033_TwilightDuty_Lantern_NPC_C) == 0x000010, "Wrong alignment on ACSQ_0033_TwilightDuty_Lantern_NPC_C");
static_assert(sizeof(ACSQ_0033_TwilightDuty_Lantern_NPC_C) == 0x000590, "Wrong size on ACSQ_0033_TwilightDuty_Lantern_NPC_C");
static_assert(offsetof(ACSQ_0033_TwilightDuty_Lantern_NPC_C, UberGraphFrame) == 0x000530, "Member 'ACSQ_0033_TwilightDuty_Lantern_NPC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACSQ_0033_TwilightDuty_Lantern_NPC_C, NS_Light_Moths) == 0x000538, "Member 'ACSQ_0033_TwilightDuty_Lantern_NPC_C::NS_Light_Moths' has a wrong offset!");
static_assert(offsetof(ACSQ_0033_TwilightDuty_Lantern_NPC_C, PointLight1) == 0x000540, "Member 'ACSQ_0033_TwilightDuty_Lantern_NPC_C::PointLight1' has a wrong offset!");
static_assert(offsetof(ACSQ_0033_TwilightDuty_Lantern_NPC_C, MountingMesh) == 0x000548, "Member 'ACSQ_0033_TwilightDuty_Lantern_NPC_C::MountingMesh' has a wrong offset!");
static_assert(offsetof(ACSQ_0033_TwilightDuty_Lantern_NPC_C, ActionResponse) == 0x000550, "Member 'ACSQ_0033_TwilightDuty_Lantern_NPC_C::ActionResponse' has a wrong offset!");
static_assert(offsetof(ACSQ_0033_TwilightDuty_Lantern_NPC_C, PointLight) == 0x000558, "Member 'ACSQ_0033_TwilightDuty_Lantern_NPC_C::PointLight' has a wrong offset!");
static_assert(offsetof(ACSQ_0033_TwilightDuty_Lantern_NPC_C, LightSourceMesh) == 0x000560, "Member 'ACSQ_0033_TwilightDuty_Lantern_NPC_C::LightSourceMesh' has a wrong offset!");
static_assert(offsetof(ACSQ_0033_TwilightDuty_Lantern_NPC_C, Timeline_Time_4C96063240F1BD4D5E8032BBF1CAFCAA) == 0x000568, "Member 'ACSQ_0033_TwilightDuty_Lantern_NPC_C::Timeline_Time_4C96063240F1BD4D5E8032BBF1CAFCAA' has a wrong offset!");
static_assert(offsetof(ACSQ_0033_TwilightDuty_Lantern_NPC_C, Timeline__Direction_4C96063240F1BD4D5E8032BBF1CAFCAA) == 0x00056C, "Member 'ACSQ_0033_TwilightDuty_Lantern_NPC_C::Timeline__Direction_4C96063240F1BD4D5E8032BBF1CAFCAA' has a wrong offset!");
static_assert(offsetof(ACSQ_0033_TwilightDuty_Lantern_NPC_C, Timeline) == 0x000570, "Member 'ACSQ_0033_TwilightDuty_Lantern_NPC_C::Timeline' has a wrong offset!");
static_assert(offsetof(ACSQ_0033_TwilightDuty_Lantern_NPC_C, DynamicMat) == 0x000578, "Member 'ACSQ_0033_TwilightDuty_Lantern_NPC_C::DynamicMat' has a wrong offset!");
static_assert(offsetof(ACSQ_0033_TwilightDuty_Lantern_NPC_C, IsOn) == 0x000580, "Member 'ACSQ_0033_TwilightDuty_Lantern_NPC_C::IsOn' has a wrong offset!");

}

