#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Decal_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Decal_Base.Decal_Base_C
// 0x0028 (0x0370 - 0x0348)
class ADecal_Base_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DecalRoot;                                         // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Auto_Align;                                        // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Align();
	void ExecuteUbergraph_Decal_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Decal_Base_C">();
	}
	static class ADecal_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADecal_Base_C>();
	}
};
static_assert(alignof(ADecal_Base_C) == 0x000008, "Wrong alignment on ADecal_Base_C");
static_assert(sizeof(ADecal_Base_C) == 0x000370, "Wrong size on ADecal_Base_C");
static_assert(offsetof(ADecal_Base_C, UberGraphFrame) == 0x000348, "Member 'ADecal_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADecal_Base_C, DecalRoot) == 0x000350, "Member 'ADecal_Base_C::DecalRoot' has a wrong offset!");
static_assert(offsetof(ADecal_Base_C, Billboard) == 0x000358, "Member 'ADecal_Base_C::Billboard' has a wrong offset!");
static_assert(offsetof(ADecal_Base_C, Decal) == 0x000360, "Member 'ADecal_Base_C::Decal' has a wrong offset!");
static_assert(offsetof(ADecal_Base_C, Auto_Align) == 0x000368, "Member 'ADecal_Base_C::Auto_Align' has a wrong offset!");

}

