#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Decal_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Decal_Base.Decal_Base_C.ExecuteUbergraph_Decal_Base
// 0x02A0 (0x02A0 - 0x0000)
struct Decal_Base_C_ExecuteUbergraph_Decal_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00C0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x1];                                      // 0x01AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Decal_Base_C_ExecuteUbergraph_Decal_Base) == 0x000008, "Wrong alignment on Decal_Base_C_ExecuteUbergraph_Decal_Base");
static_assert(sizeof(Decal_Base_C_ExecuteUbergraph_Decal_Base) == 0x0002A0, "Wrong size on Decal_Base_C_ExecuteUbergraph_Decal_Base");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, EntryPoint) == 0x000000, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_GetActorForwardVector_ReturnValue) == 0x000008, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, Temp_object_Variable) == 0x000020, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_GetActorUpVector_ReturnValue) == 0x000048, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000060, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000078, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000A8, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_LineTraceSingle_OutHit) == 0x0000C0, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_LineTraceSingle_ReturnValue) == 0x0001A8, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_bBlockingHit) == 0x0001A9, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001AA, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_Time) == 0x0001AC, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_Distance) == 0x0001B0, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_Location) == 0x0001B8, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_ImpactPoint) == 0x0001D0, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_Normal) == 0x0001E8, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_ImpactNormal) == 0x000200, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_PhysMat) == 0x000218, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_HitActor) == 0x000220, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_HitComponent) == 0x000228, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_HitBoneName) == 0x000230, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_BoneName) == 0x000238, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_HitItem) == 0x000240, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_ElementIndex) == 0x000244, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_FaceIndex) == 0x000248, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_TraceStart) == 0x000250, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_BreakHitResult_TraceEnd) == 0x000268, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_MakeRotFromZX_ReturnValue) == 0x000280, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decal_Base_C_ExecuteUbergraph_Decal_Base, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000298, "Member 'Decal_Base_C_ExecuteUbergraph_Decal_Base::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");

}

