#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DesignDataPlugin

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "DesignDataPlugin_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class DesignDataPlugin.AocExpressionSubsystem
// 0x0018 (0x0068 - 0x0050)
class UAocExpressionSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AocExpressionSubsystem">();
	}
	static class UAocExpressionSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAocExpressionSubsystem>();
	}
};
static_assert(alignof(UAocExpressionSubsystem) == 0x000008, "Wrong alignment on UAocExpressionSubsystem");
static_assert(sizeof(UAocExpressionSubsystem) == 0x000068, "Wrong size on UAocExpressionSubsystem");

// Class DesignDataPlugin.AocExpressionTestContexts
// 0x0040 (0x0088 - 0x0048)
class UAocExpressionTestContexts final : public UObject
{
public:
	class FString                                 PlayerExpression;                                  // 0x0048(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AbilitySystemExpression;                           // 0x0058(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AbilityEventExpression;                            // 0x0068(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EffectExpression;                                  // 0x0078(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AocExpressionTestContexts">();
	}
	static class UAocExpressionTestContexts* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAocExpressionTestContexts>();
	}
};
static_assert(alignof(UAocExpressionTestContexts) == 0x000008, "Wrong alignment on UAocExpressionTestContexts");
static_assert(sizeof(UAocExpressionTestContexts) == 0x000088, "Wrong size on UAocExpressionTestContexts");
static_assert(offsetof(UAocExpressionTestContexts, PlayerExpression) == 0x000048, "Member 'UAocExpressionTestContexts::PlayerExpression' has a wrong offset!");
static_assert(offsetof(UAocExpressionTestContexts, AbilitySystemExpression) == 0x000058, "Member 'UAocExpressionTestContexts::AbilitySystemExpression' has a wrong offset!");
static_assert(offsetof(UAocExpressionTestContexts, AbilityEventExpression) == 0x000068, "Member 'UAocExpressionTestContexts::AbilityEventExpression' has a wrong offset!");
static_assert(offsetof(UAocExpressionTestContexts, EffectExpression) == 0x000078, "Member 'UAocExpressionTestContexts::EffectExpression' has a wrong offset!");

// Class DesignDataPlugin.DesignDataManagerBase
// 0x0238 (0x0280 - 0x0048)
class UDesignDataManagerBase : public UObject
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int64, struct FDesignDataTypeDef>        DesignDataTypeMap;                                 // 0x0050(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<int64, struct FRecordStructDef>          StaticTypeMap;                                     // 0x00A0(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x188];                                     // 0x00F0(0x0188)(Fixing Size After Last Property [ Dumper-7 ])
	class URecordEditCache*                       EditCache;                                         // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Initialize();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DesignDataManagerBase">();
	}
	static class UDesignDataManagerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignDataManagerBase>();
	}
};
static_assert(alignof(UDesignDataManagerBase) == 0x000008, "Wrong alignment on UDesignDataManagerBase");
static_assert(sizeof(UDesignDataManagerBase) == 0x000280, "Wrong size on UDesignDataManagerBase");
static_assert(offsetof(UDesignDataManagerBase, DesignDataTypeMap) == 0x000050, "Member 'UDesignDataManagerBase::DesignDataTypeMap' has a wrong offset!");
static_assert(offsetof(UDesignDataManagerBase, StaticTypeMap) == 0x0000A0, "Member 'UDesignDataManagerBase::StaticTypeMap' has a wrong offset!");
static_assert(offsetof(UDesignDataManagerBase, EditCache) == 0x000278, "Member 'UDesignDataManagerBase::EditCache' has a wrong offset!");

// Class DesignDataPlugin.DesignDataManager
// 0x0000 (0x0280 - 0x0280)
class UDesignDataManager : public UDesignDataManagerBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DesignDataManager">();
	}
	static class UDesignDataManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignDataManager>();
	}
};
static_assert(alignof(UDesignDataManager) == 0x000008, "Wrong alignment on UDesignDataManager");
static_assert(sizeof(UDesignDataManager) == 0x000280, "Wrong size on UDesignDataManager");

// Class DesignDataPlugin.RecordEditCache
// 0x0170 (0x01B8 - 0x0048)
class URecordEditCache final : public UObject
{
public:
	uint8                                         Pad_48[0x170];                                     // 0x0048(0x0170)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RecordEditCache">();
	}
	static class URecordEditCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<URecordEditCache>();
	}
};
static_assert(alignof(URecordEditCache) == 0x000008, "Wrong alignment on URecordEditCache");
static_assert(sizeof(URecordEditCache) == 0x0001B8, "Wrong size on URecordEditCache");

}

