#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DragonIKPlugin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum DragonIKPlugin.EIK_Type_Plugin
// NumValues: 0x0003
enum class EIK_Type_Plugin : uint8
{
	ENUM_Two_Bone_Ik                         = 0,
	ENUM_Single_Bone_Ik                      = 1,
	ENUM_MAX                                 = 2,
};

// Enum DragonIKPlugin.ERefPosePluginEnum
// NumValues: 0x0003
enum class ERefPosePluginEnum : uint8
{
	VE_Animated                              = 0,
	VE_Rest                                  = 1,
	VE_MAX                                   = 2,
};

// Enum DragonIKPlugin.ESolverComplexityPluginEnum
// NumValues: 0x0003
enum class ESolverComplexityPluginEnum : uint8
{
	VE_Simple                                = 0,
	VE_Complex                               = 1,
	VE_MAX                                   = 2,
};

// Enum DragonIKPlugin.EDragonIKTraceMType
// NumValues: 0x0003
enum class EDragonIKTraceMType : uint8
{
	LineTrace                                = 0,
	SphereTrace                              = 1,
	EDragonIKTraceMType_MAX                  = 2,
};

// Enum DragonIKPlugin.ETwist_Type_DragonIK
// NumValues: 0x0003
enum class ETwist_Type_DragonIK : uint8
{
	ENUM_PoseAxisTwist                       = 0,
	ENUM_UpAxisTwist                         = 1,
	ENUM_MAX                                 = 2,
};

// Enum DragonIKPlugin.EPole_System_DragonIK
// NumValues: 0x0004
enum class EPole_System_DragonIK : uint8
{
	ENUM_SinglePoleSystem                    = 0,
	ENUM_NSEWPoleSystem                      = 1,
	ENUM_PoseBendSystem                      = 2,
	ENUM_MAX                                 = 3,
};

// Enum DragonIKPlugin.EInputTransformSpace_DragonIK
// NumValues: 0x0003
enum class EInputTransformSpace_DragonIK : uint8
{
	ENUM_WorldSpaceSystem                    = 0,
	ENUM_ComponentSpaceSystem                = 1,
	ENUM_MAX                                 = 2,
};

// Enum DragonIKPlugin.ERotation_Type_DragonIK
// NumValues: 0x0003
enum class ERotation_Type_DragonIK : uint8
{
	ENUM_AdditiveRotation                    = 0,
	ENUM_ReplaceRotation                     = 1,
	ENUM_MAX                                 = 2,
};

// Enum DragonIKPlugin.EIKTrace_Type_Plugin
// NumValues: 0x0003
enum class EIKTrace_Type_Plugin : uint8
{
	ENUM_LineTrace_Type                      = 0,
	ENUM_SphereTrace_Type                    = 1,
	ENUM_MAX                                 = 2,
};

// Enum DragonIKPlugin.EInterpoLocation_Type_Plugin
// NumValues: 0x0003
enum class EInterpoLocation_Type_Plugin : uint8
{
	ENUM_DivisiveLoc_Interp                  = 0,
	ENUM_LegacyLoc_Interp                    = 1,
	ENUM_MAX                                 = 2,
};

// Enum DragonIKPlugin.EInterpoRotation_Type_Plugin
// NumValues: 0x0003
enum class EInterpoRotation_Type_Plugin : uint8
{
	ENUM_DivisiveRot_Interp                  = 0,
	ENUM_LegacyRot_Interp                    = 1,
	ENUM_MAX                                 = 2,
};

// ScriptStruct DragonIKPlugin.DragonData_StickySocketStruct
// 0x0010 (0x0010 - 0x0000)
struct FDragonData_StickySocketStruct final
{
public:
	TArray<struct FBoneSocketTarget>              sticky_socket_array;                               // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDragonData_StickySocketStruct) == 0x000008, "Wrong alignment on FDragonData_StickySocketStruct");
static_assert(sizeof(FDragonData_StickySocketStruct) == 0x000010, "Wrong size on FDragonData_StickySocketStruct");
static_assert(offsetof(FDragonData_StickySocketStruct, sticky_socket_array) == 0x000000, "Member 'FDragonData_StickySocketStruct::sticky_socket_array' has a wrong offset!");

// ScriptStruct DragonIKPlugin.DragonIKTraceKeyValuePair
// 0x00F8 (0x00F8 - 0x0000)
struct FDragonIKTraceKeyValuePair final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             hit_result;                                        // 0x0010(0x00E8)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDragonIKTraceKeyValuePair) == 0x000008, "Wrong alignment on FDragonIKTraceKeyValuePair");
static_assert(sizeof(FDragonIKTraceKeyValuePair) == 0x0000F8, "Wrong size on FDragonIKTraceKeyValuePair");
static_assert(offsetof(FDragonIKTraceKeyValuePair, Key) == 0x000000, "Member 'FDragonIKTraceKeyValuePair::Key' has a wrong offset!");
static_assert(offsetof(FDragonIKTraceKeyValuePair, BoneName) == 0x000008, "Member 'FDragonIKTraceKeyValuePair::BoneName' has a wrong offset!");
static_assert(offsetof(FDragonIKTraceKeyValuePair, hit_result) == 0x000010, "Member 'FDragonIKTraceKeyValuePair::hit_result' has a wrong offset!");

// ScriptStruct DragonIKPlugin.AnimNode_DragonControlBase
// 0x00B8 (0x00C8 - 0x0010)
struct FAnimNode_DragonControlBase : public FAnimNode_Base
{
public:
	struct FComponentSpacePoseLink                ComponentPose;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         LODThreshold;                                      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActualAlpha;                                       // 0x0024(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimAlphaInputType                           AlphaInputType;                                    // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlphaBoolEnabled;                                 // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ALPHA;                                             // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputScaleBias                        AlphaScaleBias;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FInputAlphaBoolBlend                   AlphaBoolBlend;                                    // 0x0038(0x0048)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   AlphaCurveName;                                    // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputScaleBiasClamp                   AlphaScaleBiasClamp;                               // 0x0088(0x0030)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_DragonControlBase) == 0x000008, "Wrong alignment on FAnimNode_DragonControlBase");
static_assert(sizeof(FAnimNode_DragonControlBase) == 0x0000C8, "Wrong size on FAnimNode_DragonControlBase");
static_assert(offsetof(FAnimNode_DragonControlBase, ComponentPose) == 0x000010, "Member 'FAnimNode_DragonControlBase::ComponentPose' has a wrong offset!");
static_assert(offsetof(FAnimNode_DragonControlBase, LODThreshold) == 0x000020, "Member 'FAnimNode_DragonControlBase::LODThreshold' has a wrong offset!");
static_assert(offsetof(FAnimNode_DragonControlBase, ActualAlpha) == 0x000024, "Member 'FAnimNode_DragonControlBase::ActualAlpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_DragonControlBase, AlphaInputType) == 0x000028, "Member 'FAnimNode_DragonControlBase::AlphaInputType' has a wrong offset!");
static_assert(offsetof(FAnimNode_DragonControlBase, bAlphaBoolEnabled) == 0x000029, "Member 'FAnimNode_DragonControlBase::bAlphaBoolEnabled' has a wrong offset!");
static_assert(offsetof(FAnimNode_DragonControlBase, ALPHA) == 0x00002C, "Member 'FAnimNode_DragonControlBase::ALPHA' has a wrong offset!");
static_assert(offsetof(FAnimNode_DragonControlBase, AlphaScaleBias) == 0x000030, "Member 'FAnimNode_DragonControlBase::AlphaScaleBias' has a wrong offset!");
static_assert(offsetof(FAnimNode_DragonControlBase, AlphaBoolBlend) == 0x000038, "Member 'FAnimNode_DragonControlBase::AlphaBoolBlend' has a wrong offset!");
static_assert(offsetof(FAnimNode_DragonControlBase, AlphaCurveName) == 0x000080, "Member 'FAnimNode_DragonControlBase::AlphaCurveName' has a wrong offset!");
static_assert(offsetof(FAnimNode_DragonControlBase, AlphaScaleBiasClamp) == 0x000088, "Member 'FAnimNode_DragonControlBase::AlphaScaleBiasClamp' has a wrong offset!");

// ScriptStruct DragonIKPlugin.DragonData_SingleArmElement
// 0x0080 (0x0080 - 0x0000)
struct FDragonData_SingleArmElement final
{
public:
	struct FTransform                             Overrided_Arm_Transform;                           // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_Alpha;                                         // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               rotation_offset;                                   // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDragonData_SingleArmElement) == 0x000010, "Wrong alignment on FDragonData_SingleArmElement");
static_assert(sizeof(FDragonData_SingleArmElement) == 0x000080, "Wrong size on FDragonData_SingleArmElement");
static_assert(offsetof(FDragonData_SingleArmElement, Overrided_Arm_Transform) == 0x000000, "Member 'FDragonData_SingleArmElement::Overrided_Arm_Transform' has a wrong offset!");
static_assert(offsetof(FDragonData_SingleArmElement, Arm_Alpha) == 0x000060, "Member 'FDragonData_SingleArmElement::Arm_Alpha' has a wrong offset!");
static_assert(offsetof(FDragonData_SingleArmElement, rotation_offset) == 0x000068, "Member 'FDragonData_SingleArmElement::rotation_offset' has a wrong offset!");

// ScriptStruct DragonIKPlugin.DragonData_Overrided_Location_Data
// 0x0010 (0x0010 - 0x0000)
struct FDragonData_Overrided_Location_Data final
{
public:
	TArray<struct FDragonData_SingleArmElement>   Arm_TargetLocation_Overrides;                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDragonData_Overrided_Location_Data) == 0x000008, "Wrong alignment on FDragonData_Overrided_Location_Data");
static_assert(sizeof(FDragonData_Overrided_Location_Data) == 0x000010, "Wrong size on FDragonData_Overrided_Location_Data");
static_assert(offsetof(FDragonData_Overrided_Location_Data, Arm_TargetLocation_Overrides) == 0x000000, "Member 'FDragonData_Overrided_Location_Data::Arm_TargetLocation_Overrides' has a wrong offset!");

// ScriptStruct DragonIKPlugin.DragonData_FingerData
// 0x0030 (0x0030 - 0x0000)
struct FDragonData_FingerData final
{
public:
	class FName                                   Finger_Bone_Name;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Trace_Scale;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_Offset;                                      // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Is_Finger_Backward;                                // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDragonData_FingerData) == 0x000008, "Wrong alignment on FDragonData_FingerData");
static_assert(sizeof(FDragonData_FingerData) == 0x000030, "Wrong size on FDragonData_FingerData");
static_assert(offsetof(FDragonData_FingerData, Finger_Bone_Name) == 0x000000, "Member 'FDragonData_FingerData::Finger_Bone_Name' has a wrong offset!");
static_assert(offsetof(FDragonData_FingerData, Trace_Scale) == 0x000008, "Member 'FDragonData_FingerData::Trace_Scale' has a wrong offset!");
static_assert(offsetof(FDragonData_FingerData, Trace_Offset) == 0x000010, "Member 'FDragonData_FingerData::Trace_Offset' has a wrong offset!");
static_assert(offsetof(FDragonData_FingerData, Is_Finger_Backward) == 0x000028, "Member 'FDragonData_FingerData::Is_Finger_Backward' has a wrong offset!");

// ScriptStruct DragonIKPlugin.DragonData_FootData
// 0x00C0 (0x00C0 - 0x0000)
struct FDragonData_FootData final
{
public:
	class FName                                   Feet_Bone_Name;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Knee_Bone_Name;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Second_Knee_Bone_Name;                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Thigh_Bone_Name;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Feet_Rotation_Offset;                              // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Fixed_Pole;                                        // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Knee_Direction_Offset;                             // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Feet_Trace_Offset;                                 // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Front_Trace_Point_Spacing;                         // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Side_Traces_Spacing;                               // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Feet_Rotation_Limit;                               // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Fixed_Foot_Height;                                 // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Feet_Heights;                                      // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Feet_Alpha;                                        // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Min_Feet_Extension;                                // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max_Feet_Extension;                                // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Feet_Upslope_Offset_Multiplier;                    // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Feet_Downslope_Offset_Multiplier;                  // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Feet_Slope_Offset_Clamp_Radius;                    // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max_Feet_Lift;                                     // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Overrided_Trace_Radius;                            // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDragonData_FingerData>         Finger_Array;                                      // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDragonData_FootData) == 0x000008, "Wrong alignment on FDragonData_FootData");
static_assert(sizeof(FDragonData_FootData) == 0x0000C0, "Wrong size on FDragonData_FootData");
static_assert(offsetof(FDragonData_FootData, Feet_Bone_Name) == 0x000000, "Member 'FDragonData_FootData::Feet_Bone_Name' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Knee_Bone_Name) == 0x000008, "Member 'FDragonData_FootData::Knee_Bone_Name' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Second_Knee_Bone_Name) == 0x000010, "Member 'FDragonData_FootData::Second_Knee_Bone_Name' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Thigh_Bone_Name) == 0x000018, "Member 'FDragonData_FootData::Thigh_Bone_Name' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Feet_Rotation_Offset) == 0x000028, "Member 'FDragonData_FootData::Feet_Rotation_Offset' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Fixed_Pole) == 0x000040, "Member 'FDragonData_FootData::Fixed_Pole' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Knee_Direction_Offset) == 0x000048, "Member 'FDragonData_FootData::Knee_Direction_Offset' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Feet_Trace_Offset) == 0x000060, "Member 'FDragonData_FootData::Feet_Trace_Offset' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Front_Trace_Point_Spacing) == 0x000078, "Member 'FDragonData_FootData::Front_Trace_Point_Spacing' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Side_Traces_Spacing) == 0x00007C, "Member 'FDragonData_FootData::Side_Traces_Spacing' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Feet_Rotation_Limit) == 0x000080, "Member 'FDragonData_FootData::Feet_Rotation_Limit' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Fixed_Foot_Height) == 0x000084, "Member 'FDragonData_FootData::Fixed_Foot_Height' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Feet_Heights) == 0x000088, "Member 'FDragonData_FootData::Feet_Heights' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Feet_Alpha) == 0x00008C, "Member 'FDragonData_FootData::Feet_Alpha' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Min_Feet_Extension) == 0x000090, "Member 'FDragonData_FootData::Min_Feet_Extension' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Max_Feet_Extension) == 0x000094, "Member 'FDragonData_FootData::Max_Feet_Extension' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Feet_Upslope_Offset_Multiplier) == 0x000098, "Member 'FDragonData_FootData::Feet_Upslope_Offset_Multiplier' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Feet_Downslope_Offset_Multiplier) == 0x00009C, "Member 'FDragonData_FootData::Feet_Downslope_Offset_Multiplier' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Feet_Slope_Offset_Clamp_Radius) == 0x0000A0, "Member 'FDragonData_FootData::Feet_Slope_Offset_Clamp_Radius' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Max_Feet_Lift) == 0x0000A4, "Member 'FDragonData_FootData::Max_Feet_Lift' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Overrided_Trace_Radius) == 0x0000A8, "Member 'FDragonData_FootData::Overrided_Trace_Radius' has a wrong offset!");
static_assert(offsetof(FDragonData_FootData, Finger_Array) == 0x0000B0, "Member 'FDragonData_FootData::Finger_Array' has a wrong offset!");

// ScriptStruct DragonIKPlugin.DragonData_MultiInput
// 0x0020 (0x0020 - 0x0000)
struct FDragonData_MultiInput final
{
public:
	class FName                                   Start_Spine;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Pelvis;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDragonData_FootData>           FeetBones;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDragonData_MultiInput) == 0x000008, "Wrong alignment on FDragonData_MultiInput");
static_assert(sizeof(FDragonData_MultiInput) == 0x000020, "Wrong size on FDragonData_MultiInput");
static_assert(offsetof(FDragonData_MultiInput, Start_Spine) == 0x000000, "Member 'FDragonData_MultiInput::Start_Spine' has a wrong offset!");
static_assert(offsetof(FDragonData_MultiInput, Pelvis) == 0x000008, "Member 'FDragonData_MultiInput::Pelvis' has a wrong offset!");
static_assert(offsetof(FDragonData_MultiInput, FeetBones) == 0x000010, "Member 'FDragonData_MultiInput::FeetBones' has a wrong offset!");

// ScriptStruct DragonIKPlugin.DragonData_ArmsData
// 0x0200 (0x0200 - 0x0000)
struct FDragonData_ArmsData final
{
public:
	struct FBoneReference                         Clavicle_Bone;                                     // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         Shoulder_Bone_Name;                                // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         Elbow_Bone_Name;                                   // 0x0020(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         Hand_Bone_Name;                                    // 0x0030(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          is_this_right_hand;                                // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          invert_lower_twist;                                // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          invert_upper_twist;                                // 0x0042(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         Twist_Forearm_Bone;                                // 0x0044(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         Twist_Shoulder_Bone;                               // 0x0054(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Local_Direction_Axis;                              // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Arm_Aiming_Offset;                                 // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          accurate_hand_rotation;                            // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          relative_axis;                                     // 0x0099(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Maximum_Extension;                                 // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Minimum_Extension;                                 // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max_Stretch_Ratio;                                 // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Stretch_lower_arm_Priorty;                         // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Elbow_Pole_Offset;                                 // 0x00B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                North_Pole_Offset;                                 // 0x00C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                South_Pole_Offset;                                 // 0x00E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                West_Pole_Offset;                                  // 0x00F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                East_Pole_Offset;                                  // 0x0110(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          override_limits;                                   // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Max_Arm_H_Angle;                                   // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Max_Arm_V_Angle;                                   // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Inner_Clavicle_Side_Limit;                         // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Inner_Clavicle_Vertical_Limit;                     // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Outer_Clavicle_Side_Limit;                         // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Outer_Clavicle_Vertical_Limit;                     // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Shoulder_Inner_Clamp;                              // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Shoulder_Outer_Clamp;                              // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ForeArm_Angle_Limit;                               // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Twist_Offset_Reverse;                              // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C4[0x3C];                                     // 0x01C4(0x003C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDragonData_ArmsData) == 0x000008, "Wrong alignment on FDragonData_ArmsData");
static_assert(sizeof(FDragonData_ArmsData) == 0x000200, "Wrong size on FDragonData_ArmsData");
static_assert(offsetof(FDragonData_ArmsData, Clavicle_Bone) == 0x000000, "Member 'FDragonData_ArmsData::Clavicle_Bone' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Shoulder_Bone_Name) == 0x000010, "Member 'FDragonData_ArmsData::Shoulder_Bone_Name' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Elbow_Bone_Name) == 0x000020, "Member 'FDragonData_ArmsData::Elbow_Bone_Name' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Hand_Bone_Name) == 0x000030, "Member 'FDragonData_ArmsData::Hand_Bone_Name' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, is_this_right_hand) == 0x000040, "Member 'FDragonData_ArmsData::is_this_right_hand' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, invert_lower_twist) == 0x000041, "Member 'FDragonData_ArmsData::invert_lower_twist' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, invert_upper_twist) == 0x000042, "Member 'FDragonData_ArmsData::invert_upper_twist' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Twist_Forearm_Bone) == 0x000044, "Member 'FDragonData_ArmsData::Twist_Forearm_Bone' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Twist_Shoulder_Bone) == 0x000054, "Member 'FDragonData_ArmsData::Twist_Shoulder_Bone' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Local_Direction_Axis) == 0x000068, "Member 'FDragonData_ArmsData::Local_Direction_Axis' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Arm_Aiming_Offset) == 0x000080, "Member 'FDragonData_ArmsData::Arm_Aiming_Offset' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, accurate_hand_rotation) == 0x000098, "Member 'FDragonData_ArmsData::accurate_hand_rotation' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, relative_axis) == 0x000099, "Member 'FDragonData_ArmsData::relative_axis' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Maximum_Extension) == 0x00009C, "Member 'FDragonData_ArmsData::Maximum_Extension' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Minimum_Extension) == 0x0000A0, "Member 'FDragonData_ArmsData::Minimum_Extension' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Max_Stretch_Ratio) == 0x0000A4, "Member 'FDragonData_ArmsData::Max_Stretch_Ratio' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Stretch_lower_arm_Priorty) == 0x0000A8, "Member 'FDragonData_ArmsData::Stretch_lower_arm_Priorty' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Elbow_Pole_Offset) == 0x0000B0, "Member 'FDragonData_ArmsData::Elbow_Pole_Offset' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, North_Pole_Offset) == 0x0000C8, "Member 'FDragonData_ArmsData::North_Pole_Offset' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, South_Pole_Offset) == 0x0000E0, "Member 'FDragonData_ArmsData::South_Pole_Offset' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, West_Pole_Offset) == 0x0000F8, "Member 'FDragonData_ArmsData::West_Pole_Offset' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, East_Pole_Offset) == 0x000110, "Member 'FDragonData_ArmsData::East_Pole_Offset' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, override_limits) == 0x000128, "Member 'FDragonData_ArmsData::override_limits' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Max_Arm_H_Angle) == 0x000130, "Member 'FDragonData_ArmsData::Max_Arm_H_Angle' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Max_Arm_V_Angle) == 0x000140, "Member 'FDragonData_ArmsData::Max_Arm_V_Angle' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Inner_Clavicle_Side_Limit) == 0x000150, "Member 'FDragonData_ArmsData::Inner_Clavicle_Side_Limit' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Inner_Clavicle_Vertical_Limit) == 0x000160, "Member 'FDragonData_ArmsData::Inner_Clavicle_Vertical_Limit' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Outer_Clavicle_Side_Limit) == 0x000170, "Member 'FDragonData_ArmsData::Outer_Clavicle_Side_Limit' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Outer_Clavicle_Vertical_Limit) == 0x000180, "Member 'FDragonData_ArmsData::Outer_Clavicle_Vertical_Limit' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Shoulder_Inner_Clamp) == 0x000190, "Member 'FDragonData_ArmsData::Shoulder_Inner_Clamp' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Shoulder_Outer_Clamp) == 0x0001A0, "Member 'FDragonData_ArmsData::Shoulder_Outer_Clamp' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, ForeArm_Angle_Limit) == 0x0001B0, "Member 'FDragonData_ArmsData::ForeArm_Angle_Limit' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmsData, Twist_Offset_Reverse) == 0x0001C0, "Member 'FDragonData_ArmsData::Twist_Offset_Reverse' has a wrong offset!");

// ScriptStruct DragonIKPlugin.DragonData_ElbowOffset_Struct
// 0x0010 (0x0010 - 0x0000)
struct FDragonData_ElbowOffset_Struct final
{
public:
	TArray<struct FVector>                        elbow_offset_array;                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDragonData_ElbowOffset_Struct) == 0x000008, "Wrong alignment on FDragonData_ElbowOffset_Struct");
static_assert(sizeof(FDragonData_ElbowOffset_Struct) == 0x000010, "Wrong size on FDragonData_ElbowOffset_Struct");
static_assert(offsetof(FDragonData_ElbowOffset_Struct, elbow_offset_array) == 0x000000, "Member 'FDragonData_ElbowOffset_Struct::elbow_offset_array' has a wrong offset!");

// ScriptStruct DragonIKPlugin.DragonData_ArmSizeStruct
// 0x000C (0x000C - 0x0000)
struct FDragonData_ArmSizeStruct final
{
public:
	bool                                          Use_Custom_Arm_Sizes;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         custom_upperArm_length;                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         custom_lowerArm_length;                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDragonData_ArmSizeStruct) == 0x000004, "Wrong alignment on FDragonData_ArmSizeStruct");
static_assert(sizeof(FDragonData_ArmSizeStruct) == 0x00000C, "Wrong size on FDragonData_ArmSizeStruct");
static_assert(offsetof(FDragonData_ArmSizeStruct, Use_Custom_Arm_Sizes) == 0x000000, "Member 'FDragonData_ArmSizeStruct::Use_Custom_Arm_Sizes' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmSizeStruct, custom_upperArm_length) == 0x000004, "Member 'FDragonData_ArmSizeStruct::custom_upperArm_length' has a wrong offset!");
static_assert(offsetof(FDragonData_ArmSizeStruct, custom_lowerArm_length) == 0x000008, "Member 'FDragonData_ArmSizeStruct::custom_lowerArm_length' has a wrong offset!");

// ScriptStruct DragonIKPlugin.DragonData_CustomArmLengths
// 0x0010 (0x0010 - 0x0000)
struct FDragonData_CustomArmLengths final
{
public:
	TArray<struct FDragonData_ArmSizeStruct>      CustomArmSizeArray;                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDragonData_CustomArmLengths) == 0x000008, "Wrong alignment on FDragonData_CustomArmLengths");
static_assert(sizeof(FDragonData_CustomArmLengths) == 0x000010, "Wrong size on FDragonData_CustomArmLengths");
static_assert(offsetof(FDragonData_CustomArmLengths, CustomArmSizeArray) == 0x000000, "Member 'FDragonData_CustomArmLengths::CustomArmSizeArray' has a wrong offset!");

// ScriptStruct DragonIKPlugin.AnimNode_DragonAimSolver
// 0x0C58 (0x0D20 - 0x00C8)
struct FAnimNode_DragonAimSolver final : public FAnimNode_DragonControlBase
{
public:
	bool                                          Use_FName_Bone_Input;                              // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         EndSplineBone;                                     // 0x00CC(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         StartSplineBone;                                   // 0x00DC(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   Name_EndSpline_Bone;                               // 0x00EC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_StartSpline_Bone;                             // 0x00F4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LookAtLocation;                                    // 0x0100(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDragonData_MultiInput                 dragon_input_data;                                 // 0x0160(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_180[0x98];                                     // 0x0180(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDragonData_ArmsData>           Aiming_Hand_Limbs;                                 // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_228[0x10];                                     // 0x0228(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDragonData_Overrided_Location_Data    Arm_TargetLocation_Overrides;                      // 0x0238(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          Use_Separate_Targets;                              // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Override_Hand_Rotation;                            // 0x0249(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          enable_head_aim;                                   // 0x024A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowHandStretching;                              // 0x024B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDragonData_ElbowOffset_Struct         Extra_Struct_Elbow_Pole_Array;                     // 0x0250(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          reach_instead;                                     // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Aggregate_Hand_Body;                               // 0x0261(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Let_Arm_Twist_With_Hand;                           // 0x0262(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPole_System_DragonIK                         pole_system_input;                                 // 0x0263(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETwist_Type_DragonIK                          arm_twist_axis;                                    // 0x0264(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERotation_Type_DragonIK                       hand_rotation_method;                              // 0x0265(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Override_Head_Rotation;                            // 0x0266(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enable_Hand_Interpolation;                         // 0x0267(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Hand_Interpolation_Speed;                          // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDragonData_CustomArmLengths           custom_arm_lengths;                                // 0x0270(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EInputTransformSpace_DragonIK                 arm_transform_space;                               // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Main_Arm_Index;                                    // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_288[0x128];                                    // 0x0288(0x0128)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Lookat_Radius;                                     // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Inner_Body_Clamp;                                  // 0x03B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Lookat_Clamp;                                      // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Limbs_Clamp;                                       // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Downward_Dip_Multiplier;                           // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Inverted_Dip_Multiplier;                           // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Vertical_Dip_Treshold;                             // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Side_Move_Multiplier;                              // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Side_Down_Multiplier;                              // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Up_Rot_Clamp;                                      // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Verticle_Range_Angles;                             // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Horizontal_Range_Angles;                           // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     Look_Bending_Curve;                                // 0x0410(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     Look_Multiplier_Curve;                             // 0x04A0(0x0090)(Edit, NativeAccessSpecifierPublic)
	EInputTransformSpace_DragonIK                 look_transform_space;                              // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Lock_Legs;                                         // 0x0531(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ignore_elbow_modification;                         // 0x0532(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ignore_separate_hand_solving;                      // 0x0533(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Use_Natural_Method;                                // 0x0534(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Head_Use_Separate_Clamp;                           // 0x0535(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Is_Head_Accurate;                                  // 0x0536(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          automatic_leg_make;                                // 0x0537(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_538[0x1];                                      // 0x0538(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          enable_solver;                                     // 0x0539(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Work_Outside_PIE;                                  // 0x053A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Use_Physics_Adaptation;                            // 0x053B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   physics_root_reference;                            // 0x053C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Adaptive_Terrain_Tail;                             // 0x0544(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETraceTypeQuery                               Trace_Channel;                                     // 0x0545(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_546[0x2];                                      // 0x0546(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_Up_Height;                                   // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Trace_Down_Height;                                 // 0x054C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_550[0xEC];                                     // 0x0550(0x00EC)(Fixing Size After Last Property [ Dumper-7 ])
	EInterpoLocation_Type_Plugin                  loc_interp_type;                                   // 0x063C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63D[0x8];                                      // 0x063D(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          Enable_Interpolation;                              // 0x0645(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_646[0x2];                                      // 0x0646(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Interpolation_Speed;                               // 0x0648(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Toggle_Interpolation_Speed;                        // 0x064C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_650[0x60];                                     // 0x0650(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LookAt_Axis;                                       // 0x06B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Upward_Axis;                                       // 0x06C8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetOffset;                                      // 0x06E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Use_Reference_Forward_Axis;                        // 0x06F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Reference_Constant_Forward_Axis;                   // 0x0700(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_718[0x11D];                                    // 0x0718(0x011D)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          DisplayLineTrace;                                  // 0x0835(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
