#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElderDragon_Fire_RainofFireQueryPoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ElderDragon_Fire_RainofFireQueryPoint.ElderDragon_Fire_RainofFireQueryPoint
// 0x0028 (0x0028 - 0x0000)
struct FElderDragon_Fire_RainofFireQueryPoint final
{
public:
	struct FVector                                Location_2_B563AA584634D34CFBCBF6962BB17848;       // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid_9_AEC23ABE43BE17AB0B08C2B7BA80F083;          // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         X_12_DB4523684129293067DD0A914C866518;             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Y_15_0E5A61714A0B93893A1346A6E2AA5D4C;             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FElderDragon_Fire_RainofFireQueryPoint) == 0x000008, "Wrong alignment on FElderDragon_Fire_RainofFireQueryPoint");
static_assert(sizeof(FElderDragon_Fire_RainofFireQueryPoint) == 0x000028, "Wrong size on FElderDragon_Fire_RainofFireQueryPoint");
static_assert(offsetof(FElderDragon_Fire_RainofFireQueryPoint, Location_2_B563AA584634D34CFBCBF6962BB17848) == 0x000000, "Member 'FElderDragon_Fire_RainofFireQueryPoint::Location_2_B563AA584634D34CFBCBF6962BB17848' has a wrong offset!");
static_assert(offsetof(FElderDragon_Fire_RainofFireQueryPoint, Valid_9_AEC23ABE43BE17AB0B08C2B7BA80F083) == 0x000018, "Member 'FElderDragon_Fire_RainofFireQueryPoint::Valid_9_AEC23ABE43BE17AB0B08C2B7BA80F083' has a wrong offset!");
static_assert(offsetof(FElderDragon_Fire_RainofFireQueryPoint, X_12_DB4523684129293067DD0A914C866518) == 0x00001C, "Member 'FElderDragon_Fire_RainofFireQueryPoint::X_12_DB4523684129293067DD0A914C866518' has a wrong offset!");
static_assert(offsetof(FElderDragon_Fire_RainofFireQueryPoint, Y_15_0E5A61714A0B93893A1346A6E2AA5D4C) == 0x000020, "Member 'FElderDragon_Fire_RainofFireQueryPoint::Y_15_0E5A61714A0B93893A1346A6E2AA5D4C' has a wrong offset!");

}

