#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElderDragon_Fire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ElderDragon_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ElderDragon_Fire.ElderDragon_Fire_C
// 0x0020 (0x1D80 - 0x1D60)
class AElderDragon_Fire_C final : public AElderDragon_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ElderDragon_Fire_C;                 // 0x1D60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBlackboardComponent*                   Blackboard;                                        // 0x1D68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AElderDragon_Fire_FlameMinion_C*> OwnedFlameMinions;                                // 0x1D70(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ElderDragon_Fire(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ElderDragon_Fire_C">();
	}
	static class AElderDragon_Fire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AElderDragon_Fire_C>();
	}
};
static_assert(alignof(AElderDragon_Fire_C) == 0x000010, "Wrong alignment on AElderDragon_Fire_C");
static_assert(sizeof(AElderDragon_Fire_C) == 0x001D80, "Wrong size on AElderDragon_Fire_C");
static_assert(offsetof(AElderDragon_Fire_C, UberGraphFrame_ElderDragon_Fire_C) == 0x001D60, "Member 'AElderDragon_Fire_C::UberGraphFrame_ElderDragon_Fire_C' has a wrong offset!");
static_assert(offsetof(AElderDragon_Fire_C, Blackboard) == 0x001D68, "Member 'AElderDragon_Fire_C::Blackboard' has a wrong offset!");
static_assert(offsetof(AElderDragon_Fire_C, OwnedFlameMinions) == 0x001D70, "Member 'AElderDragon_Fire_C::OwnedFlameMinions' has a wrong offset!");

}

