#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Elderdragon_Fire_FlameMinion_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Elderdragon_Fire_FlameMinion_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Elderdragon_Fire_FlameMinion_AnimBP.Elderdragon_Fire_FlameMinion_AnimBP_C
// 0x1790 (0x33D0 - 0x1C40)
class UElderdragon_Fire_FlameMinion_AnimBP_C final : public UAoCNPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1C40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1C48(0x0020)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1C68(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1C70(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1C78(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1C98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1CC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1CE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1D10(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1D38(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1D58(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1DA0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1DE8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1E30(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x1E78(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x1EC0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x1F08(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x1F50(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x2068(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2088(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x20B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x20F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2118(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2160(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x21A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x21F0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x2210(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x22D8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x22F8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x23C0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x23E0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x24A8(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x2528(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2650(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2670(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2690(0x0128)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x27B8(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x2800(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x2848(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x2890(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x28D8(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x2920(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x2968(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x29B0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x29F8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x2A40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x2A68(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x2A90(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x2AD8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x2B00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x2B28(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x2B50(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2B78(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x2BC0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x2C08(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x2C50(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x2C78(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x2CA0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2CE8(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x2D68(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x2DB0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x2DF8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2E20(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x2EA0(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x2F90(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x2FB8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x3080(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x30A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x30D0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x30F8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x31E8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x3210(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x32D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x3300(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3328(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3350(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x3378(0x0048)()
	bool                                          Spawned;                                           // 0x33C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UnderAbsorption;                                   // 0x33C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbsorptionDeath;                                   // 0x33C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_Spawned();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Elderdragon_Fire_FlameMinion_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Elderdragon_Fire_FlameMinion_AnimBP_C">();
	}
	static class UElderdragon_Fire_FlameMinion_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElderdragon_Fire_FlameMinion_AnimBP_C>();
	}
};
static_assert(alignof(UElderdragon_Fire_FlameMinion_AnimBP_C) == 0x000010, "Wrong alignment on UElderdragon_Fire_FlameMinion_AnimBP_C");
static_assert(sizeof(UElderdragon_Fire_FlameMinion_AnimBP_C) == 0x0033D0, "Wrong size on UElderdragon_Fire_FlameMinion_AnimBP_C");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, UberGraphFrame) == 0x001C40, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, __AnimBlueprintMutables) == 0x001C48, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x001C68, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimBlueprintExtension_Base) == 0x001C70, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Root) == 0x001C78, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x001C98, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x001CC0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x001CE8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x001D10, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_StateResult_5) == 0x001D38, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x001D58, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x001DA0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x001DE8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x001E30, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_BlendListByBool_6) == 0x001E78, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_BlendListByBool_5) == 0x001EC0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x001F08, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x001F50, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_StateResult_4) == 0x002068, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_TransitionResult) == 0x002088, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x0020B0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_StateResult_3) == 0x0020F8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x002118, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x002160, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x0021A8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_StateResult_2) == 0x0021F0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_StateMachine_2) == 0x002210, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_StateResult_1) == 0x0022D8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x0022F8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_StateResult) == 0x0023C0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_StateMachine) == 0x0023E0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_SaveCachedPose_2) == 0x0024A8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x002528, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002650, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002670, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_ModifyBone) == 0x002690, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x0027B8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_BlendListByInt_1) == 0x002800, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Slot_11) == 0x002848, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Slot_11' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Slot_10) == 0x002890, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Slot_10' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x0028D8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_BlendListByInt) == 0x002920, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Slot_9) == 0x002968, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Slot_9' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Slot_8) == 0x0029B0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Slot_8' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Slot_7) == 0x0029F8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Slot_7' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_17) == 0x002A40, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_17' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_16) == 0x002A68, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_16' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Slot_6) == 0x002A90, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Slot_6' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_15) == 0x002AD8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_15' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_14) == 0x002B00, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_14' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_13) == 0x002B28, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_13' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_12) == 0x002B50, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_12' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x002B78, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Slot_5) == 0x002BC0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Slot_4) == 0x002C08, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_11) == 0x002C50, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_11' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_10) == 0x002C78, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Slot_3) == 0x002CA0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x002CE8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Slot_2) == 0x002D68, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Slot_1) == 0x002DB0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_9) == 0x002DF8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002E20, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_LayeredBoneBlend_1) == 0x002EA0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_8) == 0x002F90, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_TwoWayBlend_1) == 0x002FB8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_TwoWayBlend_1' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_7) == 0x003080, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_6) == 0x0030A8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_5) == 0x0030D0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x0030F8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_4) == 0x0031E8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_TwoWayBlend) == 0x003210, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_3) == 0x0032D8, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x003300, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x003328, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x003350, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AnimGraphNode_Slot) == 0x003378, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, Spawned) == 0x0033C0, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::Spawned' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, UnderAbsorption) == 0x0033C1, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::UnderAbsorption' has a wrong offset!");
static_assert(offsetof(UElderdragon_Fire_FlameMinion_AnimBP_C, AbsorptionDeath) == 0x0033C2, "Member 'UElderdragon_Fire_FlameMinion_AnimBP_C::AbsorptionDeath' has a wrong offset!");

}

