#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Elderdragon_Fire_FlameMinion_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Elderdragon_Fire_FlameMinion_AnimBP.Elderdragon_Fire_FlameMinion_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01A7 (0x01A8 - 0x0001)
struct Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_367;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_368;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_369;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_370;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_371;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_372;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_373;                                // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_374;                               // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_375;                              // 0x0044(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_376;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_377;                                // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_378;                                // 0x0075(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_379;                                 // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_380;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_381;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_382;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_383;                                 // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_384;                               // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_385;                               // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_386;                               // 0x00B8(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_387;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_388;                                  // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_389;                                // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_390;                                // 0x00D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_391;                                // 0x00DA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_392;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_393;                              // 0x00F0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0110(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0190(0x0018)()
};
static_assert(alignof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001A8, "Wrong size on Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_367) == 0x000004, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_367' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_368) == 0x00000C, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_368' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_369) == 0x000018, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_369' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_370) == 0x000028, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_370' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_371) == 0x000030, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_371' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_372) == 0x000034, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_372' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_373) == 0x00003C, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_373' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_374) == 0x000040, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_374' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_375) == 0x000044, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_375' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_376) == 0x000070, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_376' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_377) == 0x000074, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_377' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_378) == 0x000075, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_378' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_379) == 0x000078, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_379' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_380) == 0x00007C, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_380' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_381) == 0x000084, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_381' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_382) == 0x00008C, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_382' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_383) == 0x000094, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_383' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_384) == 0x000098, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_384' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_385) == 0x0000A8, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_385' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_386) == 0x0000B8, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_386' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_387) == 0x0000C8, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_387' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_388) == 0x0000D0, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_388' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_389) == 0x0000D8, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_389' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_390) == 0x0000D9, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_390' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_391) == 0x0000DA, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_391' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_392) == 0x0000E0, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_392' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_393) == 0x0000F0, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_393' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000110, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000190, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Elderdragon_Fire_FlameMinion_AnimBP.Elderdragon_Fire_FlameMinion_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x001F (0x0020 - 0x0001)
struct Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_6;                                   // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_8;                                   // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000020, "Wrong size on Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000004, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000008, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_4) == 0x00000C, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_4' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x00000D, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_6) == 0x000010, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_6' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x000014, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_8) == 0x000018, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_8' has a wrong offset!");
static_assert(offsetof(Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_9) == 0x00001C, "Member 'Elderdragon_Fire_FlameMinion_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_9' has a wrong offset!");

}

