#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElderDragon_Ice_IceGaol

#include "Basic.hpp"


namespace SDK::Params
{

// Function ElderDragon_Ice_IceGaol.ElderDragon_Ice_IceGaol_C.ExecuteUbergraph_ElderDragon_Ice_IceGaol
// 0x000C (0x000C - 0x0000)
struct ElderDragon_Ice_IceGaol_C_ExecuteUbergraph_ElderDragon_Ice_IceGaol final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElderDragon_Ice_IceGaol_C_ExecuteUbergraph_ElderDragon_Ice_IceGaol) == 0x000004, "Wrong alignment on ElderDragon_Ice_IceGaol_C_ExecuteUbergraph_ElderDragon_Ice_IceGaol");
static_assert(sizeof(ElderDragon_Ice_IceGaol_C_ExecuteUbergraph_ElderDragon_Ice_IceGaol) == 0x00000C, "Wrong size on ElderDragon_Ice_IceGaol_C_ExecuteUbergraph_ElderDragon_Ice_IceGaol");
static_assert(offsetof(ElderDragon_Ice_IceGaol_C_ExecuteUbergraph_ElderDragon_Ice_IceGaol, EntryPoint) == 0x000000, "Member 'ElderDragon_Ice_IceGaol_C_ExecuteUbergraph_ElderDragon_Ice_IceGaol::EntryPoint' has a wrong offset!");
static_assert(offsetof(ElderDragon_Ice_IceGaol_C_ExecuteUbergraph_ElderDragon_Ice_IceGaol, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'ElderDragon_Ice_IceGaol_C_ExecuteUbergraph_ElderDragon_Ice_IceGaol::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ElderDragon_Ice_IceGaol_C_ExecuteUbergraph_ElderDragon_Ice_IceGaol, CallFunc_IsDead_ReturnValue) == 0x000008, "Member 'ElderDragon_Ice_IceGaol_C_ExecuteUbergraph_ElderDragon_Ice_IceGaol::CallFunc_IsDead_ReturnValue' has a wrong offset!");

// Function ElderDragon_Ice_IceGaol.ElderDragon_Ice_IceGaol_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ElderDragon_Ice_IceGaol_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElderDragon_Ice_IceGaol_C_ReceiveTick) == 0x000004, "Wrong alignment on ElderDragon_Ice_IceGaol_C_ReceiveTick");
static_assert(sizeof(ElderDragon_Ice_IceGaol_C_ReceiveTick) == 0x000004, "Wrong size on ElderDragon_Ice_IceGaol_C_ReceiveTick");
static_assert(offsetof(ElderDragon_Ice_IceGaol_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ElderDragon_Ice_IceGaol_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

