#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElderDragon_Fire_FlameMinion

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function ElderDragon_Fire_FlameMinion.ElderDragon_Fire_FlameMinion_C.Absorbed
// 0x0A78 (0x0A78 - 0x0000)
struct ElderDragon_Fire_FlameMinion_C_Absorbed final
{
public:
	class ABaseCharacter*                         Owner_Dragon;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FAbilityHitRecord                      CallFunc_GetHitRecordById_ReturnValue;             // 0x0020(0x0A28)(ConstParm)
	struct FHitHistory                            CallFunc_TriggerHitOnActors_HitHistory;            // 0x0A48(0x0018)(ContainsInstancedReference)
	TArray<struct FHitInst>                       CallFunc_TriggerHitOnActors_ReturnValue;           // 0x0A60(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IntrepidHasAuthority_ReturnValue;         // 0x0A70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElderDragon_Fire_FlameMinion_C_Absorbed) == 0x000008, "Wrong alignment on ElderDragon_Fire_FlameMinion_C_Absorbed");
static_assert(sizeof(ElderDragon_Fire_FlameMinion_C_Absorbed) == 0x000A78, "Wrong size on ElderDragon_Fire_FlameMinion_C_Absorbed");
static_assert(offsetof(ElderDragon_Fire_FlameMinion_C_Absorbed, Owner_Dragon) == 0x000000, "Member 'ElderDragon_Fire_FlameMinion_C_Absorbed::Owner_Dragon' has a wrong offset!");
static_assert(offsetof(ElderDragon_Fire_FlameMinion_C_Absorbed, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ElderDragon_Fire_FlameMinion_C_Absorbed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElderDragon_Fire_FlameMinion_C_Absorbed, K2Node_MakeArray_Array) == 0x000010, "Member 'ElderDragon_Fire_FlameMinion_C_Absorbed::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ElderDragon_Fire_FlameMinion_C_Absorbed, CallFunc_GetHitRecordById_ReturnValue) == 0x000020, "Member 'ElderDragon_Fire_FlameMinion_C_Absorbed::CallFunc_GetHitRecordById_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElderDragon_Fire_FlameMinion_C_Absorbed, CallFunc_TriggerHitOnActors_HitHistory) == 0x000A48, "Member 'ElderDragon_Fire_FlameMinion_C_Absorbed::CallFunc_TriggerHitOnActors_HitHistory' has a wrong offset!");
static_assert(offsetof(ElderDragon_Fire_FlameMinion_C_Absorbed, CallFunc_TriggerHitOnActors_ReturnValue) == 0x000A60, "Member 'ElderDragon_Fire_FlameMinion_C_Absorbed::CallFunc_TriggerHitOnActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElderDragon_Fire_FlameMinion_C_Absorbed, CallFunc_IntrepidHasAuthority_ReturnValue) == 0x000A70, "Member 'ElderDragon_Fire_FlameMinion_C_Absorbed::CallFunc_IntrepidHasAuthority_ReturnValue' has a wrong offset!");

// Function ElderDragon_Fire_FlameMinion.ElderDragon_Fire_FlameMinion_C.ExecuteUbergraph_ElderDragon_Fire_FlameMinion
// 0x000C (0x000C - 0x0000)
struct ElderDragon_Fire_FlameMinion_C_ExecuteUbergraph_ElderDragon_Fire_FlameMinion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElderDragon_Fire_FlameMinion_C_ExecuteUbergraph_ElderDragon_Fire_FlameMinion) == 0x000004, "Wrong alignment on ElderDragon_Fire_FlameMinion_C_ExecuteUbergraph_ElderDragon_Fire_FlameMinion");
static_assert(sizeof(ElderDragon_Fire_FlameMinion_C_ExecuteUbergraph_ElderDragon_Fire_FlameMinion) == 0x00000C, "Wrong size on ElderDragon_Fire_FlameMinion_C_ExecuteUbergraph_ElderDragon_Fire_FlameMinion");
static_assert(offsetof(ElderDragon_Fire_FlameMinion_C_ExecuteUbergraph_ElderDragon_Fire_FlameMinion, EntryPoint) == 0x000000, "Member 'ElderDragon_Fire_FlameMinion_C_ExecuteUbergraph_ElderDragon_Fire_FlameMinion::EntryPoint' has a wrong offset!");
static_assert(offsetof(ElderDragon_Fire_FlameMinion_C_ExecuteUbergraph_ElderDragon_Fire_FlameMinion, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'ElderDragon_Fire_FlameMinion_C_ExecuteUbergraph_ElderDragon_Fire_FlameMinion::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElderDragon_Fire_FlameMinion_C_ExecuteUbergraph_ElderDragon_Fire_FlameMinion, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'ElderDragon_Fire_FlameMinion_C_ExecuteUbergraph_ElderDragon_Fire_FlameMinion::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function ElderDragon_Fire_FlameMinion.ElderDragon_Fire_FlameMinion_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ElderDragon_Fire_FlameMinion_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElderDragon_Fire_FlameMinion_C_ReceiveTick) == 0x000004, "Wrong alignment on ElderDragon_Fire_FlameMinion_C_ReceiveTick");
static_assert(sizeof(ElderDragon_Fire_FlameMinion_C_ReceiveTick) == 0x000004, "Wrong size on ElderDragon_Fire_FlameMinion_C_ReceiveTick");
static_assert(offsetof(ElderDragon_Fire_FlameMinion_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ElderDragon_Fire_FlameMinion_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

