#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fishing_2H_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Fishing_2H_AnimBP.Fishing_2H_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00CF (0x00D0 - 0x0001)
struct Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_4;                                // 0x0008(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_5;                                  // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_6;                                  // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0038(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B8(0x0018)()
};
static_assert(alignof(Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000D0, "Wrong size on Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_4) == 0x000008, "Member 'Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_4' has a wrong offset!");
static_assert(offsetof(Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_5) == 0x000028, "Member 'Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_5' has a wrong offset!");
static_assert(offsetof(Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_6) == 0x000030, "Member 'Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_6' has a wrong offset!");
static_assert(offsetof(Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000038, "Member 'Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B8, "Member 'Fishing_2H_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

