#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fishing_2H_AnimBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Fishing_2H_AnimBP.Fishing_2H_AnimBP_C
// 0x00A0 (0x0410 - 0x0370)
class UFishing_2H_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0388(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03D0(0x0020)()
	struct FVector                                __CustomProperty_Location_923A4FED4363336A7F36528714685CC0; // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Fishing_2H_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fishing_2H_AnimBP_C">();
	}
	static class UFishing_2H_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFishing_2H_AnimBP_C>();
	}
};
static_assert(alignof(UFishing_2H_AnimBP_C) == 0x000010, "Wrong alignment on UFishing_2H_AnimBP_C");
static_assert(sizeof(UFishing_2H_AnimBP_C) == 0x000410, "Wrong size on UFishing_2H_AnimBP_C");
static_assert(offsetof(UFishing_2H_AnimBP_C, UberGraphFrame) == 0x000370, "Member 'UFishing_2H_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFishing_2H_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UFishing_2H_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UFishing_2H_AnimBP_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UFishing_2H_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UFishing_2H_AnimBP_C, AnimGraphNode_Slot) == 0x000388, "Member 'UFishing_2H_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UFishing_2H_AnimBP_C, AnimGraphNode_Root) == 0x0003D0, "Member 'UFishing_2H_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFishing_2H_AnimBP_C, __CustomProperty_Location_923A4FED4363336A7F36528714685CC0) == 0x0003F0, "Member 'UFishing_2H_AnimBP_C::__CustomProperty_Location_923A4FED4363336A7F36528714685CC0' has a wrong offset!");

}

