#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayDebugger

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayDebugger_structs.hpp"
#include "Engine_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class GameplayDebugger.GameplayDebuggerCategoryReplicator
// 0x00C0 (0x0408 - 0x0348)
class AGameplayDebuggerCategoryReplicator final : public AActor
{
public:
	class APlayerController*                      OwnerPC;                                           // 0x0348(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEnabled;                                        // 0x0350(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayDebuggerNetPack               ReplicatedData;                                    // 0x0358(0x0018)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FGameplayDebuggerDebugActor            DebugActor;                                        // 0x0370(0x0014)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayDebuggerVisLogSync            VisLogSync;                                        // 0x0388(0x0010)(Net, Protected, NativeAccessSpecifierProtected)
	class UGameplayDebuggerRenderingComponent*    RenderingComp;                                     // 0x0398(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A0[0x68];                                     // 0x03A0(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientDataPackPacket(const struct FGameplayDebuggerDataPackRPCParams& Params_0);
	void OnRep_ReplicatedData();
	void ServerResetViewPoint();
	void ServerSendCategoryInputEvent(int32 CategoryId, int32 HandlerId);
	void ServerSendExtensionInputEvent(int32 ExtensionId, int32 HandlerId);
	void ServerSetCategoryEnabled(int32 CategoryId, bool bEnable);
	void ServerSetDebugActor(class AActor* Actor, bool bSelectInEditor);
	void ServerSetEnabled(bool bEnable);
	void ServerSetViewPoint(const struct FVector& InViewLocation, const struct FVector& InViewDirection);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayDebuggerCategoryReplicator">();
	}
	static class AGameplayDebuggerCategoryReplicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayDebuggerCategoryReplicator>();
	}
};
static_assert(alignof(AGameplayDebuggerCategoryReplicator) == 0x000008, "Wrong alignment on AGameplayDebuggerCategoryReplicator");
static_assert(sizeof(AGameplayDebuggerCategoryReplicator) == 0x000408, "Wrong size on AGameplayDebuggerCategoryReplicator");
static_assert(offsetof(AGameplayDebuggerCategoryReplicator, OwnerPC) == 0x000348, "Member 'AGameplayDebuggerCategoryReplicator::OwnerPC' has a wrong offset!");
static_assert(offsetof(AGameplayDebuggerCategoryReplicator, bIsEnabled) == 0x000350, "Member 'AGameplayDebuggerCategoryReplicator::bIsEnabled' has a wrong offset!");
static_assert(offsetof(AGameplayDebuggerCategoryReplicator, ReplicatedData) == 0x000358, "Member 'AGameplayDebuggerCategoryReplicator::ReplicatedData' has a wrong offset!");
static_assert(offsetof(AGameplayDebuggerCategoryReplicator, DebugActor) == 0x000370, "Member 'AGameplayDebuggerCategoryReplicator::DebugActor' has a wrong offset!");
static_assert(offsetof(AGameplayDebuggerCategoryReplicator, VisLogSync) == 0x000388, "Member 'AGameplayDebuggerCategoryReplicator::VisLogSync' has a wrong offset!");
static_assert(offsetof(AGameplayDebuggerCategoryReplicator, RenderingComp) == 0x000398, "Member 'AGameplayDebuggerCategoryReplicator::RenderingComp' has a wrong offset!");

// Class GameplayDebugger.GameplayDebuggerConfig
// 0x0230 (0x0278 - 0x0048)
class UGameplayDebuggerConfig final : public UObject
{
public:
	struct FKey                                   ActivationKey;                                     // 0x0048(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   CategoryRowNextKey;                                // 0x0060(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   CategoryRowPrevKey;                                // 0x0078(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   CategorySlot0;                                     // 0x0090(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   CategorySlot1;                                     // 0x00A8(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   CategorySlot2;                                     // 0x00C0(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   CategorySlot3;                                     // 0x00D8(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   CategorySlot4;                                     // 0x00F0(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   CategorySlot5;                                     // 0x0108(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   CategorySlot6;                                     // 0x0120(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   CategorySlot7;                                     // 0x0138(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   CategorySlot8;                                     // 0x0150(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   CategorySlot9;                                     // 0x0168(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugCanvasPaddingLeft;                            // 0x0180(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugCanvasPaddingRight;                           // 0x0184(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugCanvasPaddingTop;                             // 0x0188(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugCanvasPaddingBottom;                          // 0x018C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugCanvasEnableTextShadow;                      // 0x0190(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayDebuggerCategoryConfig> Categories;                                       // 0x0198(0x0010)(Edit, EditFixedSize, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FGameplayDebuggerExtensionConfig> Extensions;                                      // 0x01A8(0x0010)(Edit, EditFixedSize, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B8[0xC0];                                     // 0x01B8(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayDebuggerConfig">();
	}
	static class UGameplayDebuggerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayDebuggerConfig>();
	}
};
static_assert(alignof(UGameplayDebuggerConfig) == 0x000008, "Wrong alignment on UGameplayDebuggerConfig");
static_assert(sizeof(UGameplayDebuggerConfig) == 0x000278, "Wrong size on UGameplayDebuggerConfig");
static_assert(offsetof(UGameplayDebuggerConfig, ActivationKey) == 0x000048, "Member 'UGameplayDebuggerConfig::ActivationKey' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, CategoryRowNextKey) == 0x000060, "Member 'UGameplayDebuggerConfig::CategoryRowNextKey' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, CategoryRowPrevKey) == 0x000078, "Member 'UGameplayDebuggerConfig::CategoryRowPrevKey' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, CategorySlot0) == 0x000090, "Member 'UGameplayDebuggerConfig::CategorySlot0' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, CategorySlot1) == 0x0000A8, "Member 'UGameplayDebuggerConfig::CategorySlot1' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, CategorySlot2) == 0x0000C0, "Member 'UGameplayDebuggerConfig::CategorySlot2' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, CategorySlot3) == 0x0000D8, "Member 'UGameplayDebuggerConfig::CategorySlot3' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, CategorySlot4) == 0x0000F0, "Member 'UGameplayDebuggerConfig::CategorySlot4' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, CategorySlot5) == 0x000108, "Member 'UGameplayDebuggerConfig::CategorySlot5' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, CategorySlot6) == 0x000120, "Member 'UGameplayDebuggerConfig::CategorySlot6' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, CategorySlot7) == 0x000138, "Member 'UGameplayDebuggerConfig::CategorySlot7' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, CategorySlot8) == 0x000150, "Member 'UGameplayDebuggerConfig::CategorySlot8' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, CategorySlot9) == 0x000168, "Member 'UGameplayDebuggerConfig::CategorySlot9' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, DebugCanvasPaddingLeft) == 0x000180, "Member 'UGameplayDebuggerConfig::DebugCanvasPaddingLeft' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, DebugCanvasPaddingRight) == 0x000184, "Member 'UGameplayDebuggerConfig::DebugCanvasPaddingRight' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, DebugCanvasPaddingTop) == 0x000188, "Member 'UGameplayDebuggerConfig::DebugCanvasPaddingTop' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, DebugCanvasPaddingBottom) == 0x00018C, "Member 'UGameplayDebuggerConfig::DebugCanvasPaddingBottom' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, bDebugCanvasEnableTextShadow) == 0x000190, "Member 'UGameplayDebuggerConfig::bDebugCanvasEnableTextShadow' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, Categories) == 0x000198, "Member 'UGameplayDebuggerConfig::Categories' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerConfig, Extensions) == 0x0001A8, "Member 'UGameplayDebuggerConfig::Extensions' has a wrong offset!");

// Class GameplayDebugger.GameplayDebuggerUserSettings
// 0x0010 (0x0068 - 0x0058)
class UGameplayDebuggerUserSettings final : public UDeveloperSettings
{
public:
	uint8                                         bEnableGameplayDebuggerInEditor : 1;               // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxViewDistance;                                   // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxViewAngle;                                      // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FontSize;                                          // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayDebuggerUserSettings">();
	}
	static class UGameplayDebuggerUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayDebuggerUserSettings>();
	}
};
static_assert(alignof(UGameplayDebuggerUserSettings) == 0x000008, "Wrong alignment on UGameplayDebuggerUserSettings");
static_assert(sizeof(UGameplayDebuggerUserSettings) == 0x000068, "Wrong size on UGameplayDebuggerUserSettings");
static_assert(offsetof(UGameplayDebuggerUserSettings, MaxViewDistance) == 0x00005C, "Member 'UGameplayDebuggerUserSettings::MaxViewDistance' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerUserSettings, MaxViewAngle) == 0x000060, "Member 'UGameplayDebuggerUserSettings::MaxViewAngle' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerUserSettings, FontSize) == 0x000064, "Member 'UGameplayDebuggerUserSettings::FontSize' has a wrong offset!");

// Class GameplayDebugger.GameplayDebuggerLocalController
// 0x0060 (0x00A8 - 0x0048)
class UGameplayDebuggerLocalController final : public UObject
{
public:
	class AGameplayDebuggerCategoryReplicator*    CachedReplicator;                                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AGameplayDebuggerPlayerManager*         CachedPlayerManager;                               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 DebugActorCandidate;                               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFont*                                  HUDFont;                                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x40];                                      // 0x0068(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayDebuggerLocalController">();
	}
	static class UGameplayDebuggerLocalController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayDebuggerLocalController>();
	}
};
static_assert(alignof(UGameplayDebuggerLocalController) == 0x000008, "Wrong alignment on UGameplayDebuggerLocalController");
static_assert(sizeof(UGameplayDebuggerLocalController) == 0x0000A8, "Wrong size on UGameplayDebuggerLocalController");
static_assert(offsetof(UGameplayDebuggerLocalController, CachedReplicator) == 0x000048, "Member 'UGameplayDebuggerLocalController::CachedReplicator' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerLocalController, CachedPlayerManager) == 0x000050, "Member 'UGameplayDebuggerLocalController::CachedPlayerManager' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerLocalController, DebugActorCandidate) == 0x000058, "Member 'UGameplayDebuggerLocalController::DebugActorCandidate' has a wrong offset!");
static_assert(offsetof(UGameplayDebuggerLocalController, HUDFont) == 0x000060, "Member 'UGameplayDebuggerLocalController::HUDFont' has a wrong offset!");

// Class GameplayDebugger.GameplayDebuggerPlayerManager
// 0x0030 (0x0378 - 0x0348)
class AGameplayDebuggerPlayerManager final : public AActor
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayDebuggerPlayerData>    PlayerData;                                        // 0x0350(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class AGameplayDebuggerCategoryReplicator*> PendingRegistrations;                         // 0x0360(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_370[0x8];                                      // 0x0370(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayDebuggerPlayerManager">();
	}
	static class AGameplayDebuggerPlayerManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayDebuggerPlayerManager>();
	}
};
static_assert(alignof(AGameplayDebuggerPlayerManager) == 0x000008, "Wrong alignment on AGameplayDebuggerPlayerManager");
static_assert(sizeof(AGameplayDebuggerPlayerManager) == 0x000378, "Wrong size on AGameplayDebuggerPlayerManager");
static_assert(offsetof(AGameplayDebuggerPlayerManager, PlayerData) == 0x000350, "Member 'AGameplayDebuggerPlayerManager::PlayerData' has a wrong offset!");
static_assert(offsetof(AGameplayDebuggerPlayerManager, PendingRegistrations) == 0x000360, "Member 'AGameplayDebuggerPlayerManager::PendingRegistrations' has a wrong offset!");

// Class GameplayDebugger.GameplayDebuggerRenderingComponent
// 0x0060 (0x0670 - 0x0610)
class UGameplayDebuggerRenderingComponent final : public UDebugDrawComponent
{
public:
	uint8                                         Pad_610[0x60];                                     // 0x0610(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayDebuggerRenderingComponent">();
	}
	static class UGameplayDebuggerRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayDebuggerRenderingComponent>();
	}
};
static_assert(alignof(UGameplayDebuggerRenderingComponent) == 0x000010, "Wrong alignment on UGameplayDebuggerRenderingComponent");
static_assert(sizeof(UGameplayDebuggerRenderingComponent) == 0x000670, "Wrong size on UGameplayDebuggerRenderingComponent");

}

