#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameUtilsPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameUtilsPlugin_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GameUtilsPlugin.GameAuthorityLibrary.IsAuthorityOf
// 0x0010 (0x0010 - 0x0000)
struct GameAuthorityLibrary_IsAuthorityOf final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameAuthorityLibrary_IsAuthorityOf) == 0x000008, "Wrong alignment on GameAuthorityLibrary_IsAuthorityOf");
static_assert(sizeof(GameAuthorityLibrary_IsAuthorityOf) == 0x000010, "Wrong size on GameAuthorityLibrary_IsAuthorityOf");
static_assert(offsetof(GameAuthorityLibrary_IsAuthorityOf, Actor) == 0x000000, "Member 'GameAuthorityLibrary_IsAuthorityOf::Actor' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsAuthorityOf, ReturnValue) == 0x000008, "Member 'GameAuthorityLibrary_IsAuthorityOf::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameAuthorityLibrary.IsClientAuthorityOf
// 0x0010 (0x0010 - 0x0000)
struct GameAuthorityLibrary_IsClientAuthorityOf final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOrStandalone;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameAuthorityLibrary_IsClientAuthorityOf) == 0x000008, "Wrong alignment on GameAuthorityLibrary_IsClientAuthorityOf");
static_assert(sizeof(GameAuthorityLibrary_IsClientAuthorityOf) == 0x000010, "Wrong size on GameAuthorityLibrary_IsClientAuthorityOf");
static_assert(offsetof(GameAuthorityLibrary_IsClientAuthorityOf, Actor) == 0x000000, "Member 'GameAuthorityLibrary_IsClientAuthorityOf::Actor' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsClientAuthorityOf, bOrStandalone) == 0x000008, "Member 'GameAuthorityLibrary_IsClientAuthorityOf::bOrStandalone' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsClientAuthorityOf, ReturnValue) == 0x000009, "Member 'GameAuthorityLibrary_IsClientAuthorityOf::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameAuthorityLibrary.IsNoAuthority
// 0x0010 (0x0010 - 0x0000)
struct GameAuthorityLibrary_IsNoAuthority final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameAuthorityLibrary_IsNoAuthority) == 0x000008, "Wrong alignment on GameAuthorityLibrary_IsNoAuthority");
static_assert(sizeof(GameAuthorityLibrary_IsNoAuthority) == 0x000010, "Wrong size on GameAuthorityLibrary_IsNoAuthority");
static_assert(offsetof(GameAuthorityLibrary_IsNoAuthority, Actor) == 0x000000, "Member 'GameAuthorityLibrary_IsNoAuthority::Actor' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsNoAuthority, ReturnValue) == 0x000008, "Member 'GameAuthorityLibrary_IsNoAuthority::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameAuthorityLibrary.IsProxying
// 0x0010 (0x0010 - 0x0000)
struct GameAuthorityLibrary_IsProxying final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameAuthorityLibrary_IsProxying) == 0x000008, "Wrong alignment on GameAuthorityLibrary_IsProxying");
static_assert(sizeof(GameAuthorityLibrary_IsProxying) == 0x000010, "Wrong size on GameAuthorityLibrary_IsProxying");
static_assert(offsetof(GameAuthorityLibrary_IsProxying, Actor) == 0x000000, "Member 'GameAuthorityLibrary_IsProxying::Actor' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsProxying, ReturnValue) == 0x000008, "Member 'GameAuthorityLibrary_IsProxying::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameAuthorityLibrary.IsRunningOnClient
// 0x0010 (0x0010 - 0x0000)
struct GameAuthorityLibrary_IsRunningOnClient final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOrStandalone;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameAuthorityLibrary_IsRunningOnClient) == 0x000008, "Wrong alignment on GameAuthorityLibrary_IsRunningOnClient");
static_assert(sizeof(GameAuthorityLibrary_IsRunningOnClient) == 0x000010, "Wrong size on GameAuthorityLibrary_IsRunningOnClient");
static_assert(offsetof(GameAuthorityLibrary_IsRunningOnClient, Actor) == 0x000000, "Member 'GameAuthorityLibrary_IsRunningOnClient::Actor' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsRunningOnClient, bOrStandalone) == 0x000008, "Member 'GameAuthorityLibrary_IsRunningOnClient::bOrStandalone' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsRunningOnClient, ReturnValue) == 0x000009, "Member 'GameAuthorityLibrary_IsRunningOnClient::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameAuthorityLibrary.IsRunningOnServer
// 0x0010 (0x0010 - 0x0000)
struct GameAuthorityLibrary_IsRunningOnServer final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOrStandalone;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameAuthorityLibrary_IsRunningOnServer) == 0x000008, "Wrong alignment on GameAuthorityLibrary_IsRunningOnServer");
static_assert(sizeof(GameAuthorityLibrary_IsRunningOnServer) == 0x000010, "Wrong size on GameAuthorityLibrary_IsRunningOnServer");
static_assert(offsetof(GameAuthorityLibrary_IsRunningOnServer, Actor) == 0x000000, "Member 'GameAuthorityLibrary_IsRunningOnServer::Actor' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsRunningOnServer, bOrStandalone) == 0x000008, "Member 'GameAuthorityLibrary_IsRunningOnServer::bOrStandalone' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsRunningOnServer, ReturnValue) == 0x000009, "Member 'GameAuthorityLibrary_IsRunningOnServer::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameAuthorityLibrary.IsRunningOnStandalone
// 0x0010 (0x0010 - 0x0000)
struct GameAuthorityLibrary_IsRunningOnStandalone final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameAuthorityLibrary_IsRunningOnStandalone) == 0x000008, "Wrong alignment on GameAuthorityLibrary_IsRunningOnStandalone");
static_assert(sizeof(GameAuthorityLibrary_IsRunningOnStandalone) == 0x000010, "Wrong size on GameAuthorityLibrary_IsRunningOnStandalone");
static_assert(offsetof(GameAuthorityLibrary_IsRunningOnStandalone, Actor) == 0x000000, "Member 'GameAuthorityLibrary_IsRunningOnStandalone::Actor' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsRunningOnStandalone, ReturnValue) == 0x000008, "Member 'GameAuthorityLibrary_IsRunningOnStandalone::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameAuthorityLibrary.IsServerAuthorityOf
// 0x0010 (0x0010 - 0x0000)
struct GameAuthorityLibrary_IsServerAuthorityOf final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameAuthorityLibrary_IsServerAuthorityOf) == 0x000008, "Wrong alignment on GameAuthorityLibrary_IsServerAuthorityOf");
static_assert(sizeof(GameAuthorityLibrary_IsServerAuthorityOf) == 0x000010, "Wrong size on GameAuthorityLibrary_IsServerAuthorityOf");
static_assert(offsetof(GameAuthorityLibrary_IsServerAuthorityOf, Actor) == 0x000000, "Member 'GameAuthorityLibrary_IsServerAuthorityOf::Actor' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsServerAuthorityOf, ReturnValue) == 0x000008, "Member 'GameAuthorityLibrary_IsServerAuthorityOf::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameAuthorityLibrary.IsSharedAuthorityOf
// 0x0010 (0x0010 - 0x0000)
struct GameAuthorityLibrary_IsSharedAuthorityOf final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameAuthorityLibrary_IsSharedAuthorityOf) == 0x000008, "Wrong alignment on GameAuthorityLibrary_IsSharedAuthorityOf");
static_assert(sizeof(GameAuthorityLibrary_IsSharedAuthorityOf) == 0x000010, "Wrong size on GameAuthorityLibrary_IsSharedAuthorityOf");
static_assert(offsetof(GameAuthorityLibrary_IsSharedAuthorityOf, Actor) == 0x000000, "Member 'GameAuthorityLibrary_IsSharedAuthorityOf::Actor' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsSharedAuthorityOf, ReturnValue) == 0x000008, "Member 'GameAuthorityLibrary_IsSharedAuthorityOf::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameAuthorityLibrary.IsSharingAuthorityOf
// 0x0010 (0x0010 - 0x0000)
struct GameAuthorityLibrary_IsSharingAuthorityOf final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameAuthorityLibrary_IsSharingAuthorityOf) == 0x000008, "Wrong alignment on GameAuthorityLibrary_IsSharingAuthorityOf");
static_assert(sizeof(GameAuthorityLibrary_IsSharingAuthorityOf) == 0x000010, "Wrong size on GameAuthorityLibrary_IsSharingAuthorityOf");
static_assert(offsetof(GameAuthorityLibrary_IsSharingAuthorityOf, Actor) == 0x000000, "Member 'GameAuthorityLibrary_IsSharingAuthorityOf::Actor' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsSharingAuthorityOf, ReturnValue) == 0x000008, "Member 'GameAuthorityLibrary_IsSharingAuthorityOf::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameAuthorityLibrary.IsSimulating
// 0x0010 (0x0010 - 0x0000)
struct GameAuthorityLibrary_IsSimulating final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameAuthorityLibrary_IsSimulating) == 0x000008, "Wrong alignment on GameAuthorityLibrary_IsSimulating");
static_assert(sizeof(GameAuthorityLibrary_IsSimulating) == 0x000010, "Wrong size on GameAuthorityLibrary_IsSimulating");
static_assert(offsetof(GameAuthorityLibrary_IsSimulating, Actor) == 0x000000, "Member 'GameAuthorityLibrary_IsSimulating::Actor' has a wrong offset!");
static_assert(offsetof(GameAuthorityLibrary_IsSimulating, ReturnValue) == 0x000008, "Member 'GameAuthorityLibrary_IsSimulating::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameBuildVersionInfo.GetBuildVersionString
// 0x0010 (0x0010 - 0x0000)
struct GameBuildVersionInfo_GetBuildVersionString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameBuildVersionInfo_GetBuildVersionString) == 0x000008, "Wrong alignment on GameBuildVersionInfo_GetBuildVersionString");
static_assert(sizeof(GameBuildVersionInfo_GetBuildVersionString) == 0x000010, "Wrong size on GameBuildVersionInfo_GetBuildVersionString");
static_assert(offsetof(GameBuildVersionInfo_GetBuildVersionString, ReturnValue) == 0x000000, "Member 'GameBuildVersionInfo_GetBuildVersionString::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameBuildVersionInfo.IsDevVersion
// 0x0001 (0x0001 - 0x0000)
struct GameBuildVersionInfo_IsDevVersion final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameBuildVersionInfo_IsDevVersion) == 0x000001, "Wrong alignment on GameBuildVersionInfo_IsDevVersion");
static_assert(sizeof(GameBuildVersionInfo_IsDevVersion) == 0x000001, "Wrong size on GameBuildVersionInfo_IsDevVersion");
static_assert(offsetof(GameBuildVersionInfo_IsDevVersion, ReturnValue) == 0x000000, "Member 'GameBuildVersionInfo_IsDevVersion::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameBuildVersionInterface.GetVersion
// 0x0010 (0x0010 - 0x0000)
struct GameBuildVersionInterface_GetVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameBuildVersionInterface_GetVersion) == 0x000008, "Wrong alignment on GameBuildVersionInterface_GetVersion");
static_assert(sizeof(GameBuildVersionInterface_GetVersion) == 0x000010, "Wrong size on GameBuildVersionInterface_GetVersion");
static_assert(offsetof(GameBuildVersionInterface_GetVersion, ReturnValue) == 0x000000, "Member 'GameBuildVersionInterface_GetVersion::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.AddFlag
// 0x000C (0x000C - 0x0000)
struct GameUtils_AddFlag final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Flag;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameUtils_AddFlag) == 0x000004, "Wrong alignment on GameUtils_AddFlag");
static_assert(sizeof(GameUtils_AddFlag) == 0x00000C, "Wrong size on GameUtils_AddFlag");
static_assert(offsetof(GameUtils_AddFlag, Value) == 0x000000, "Member 'GameUtils_AddFlag::Value' has a wrong offset!");
static_assert(offsetof(GameUtils_AddFlag, Flag) == 0x000004, "Member 'GameUtils_AddFlag::Flag' has a wrong offset!");
static_assert(offsetof(GameUtils_AddFlag, ReturnValue) == 0x000008, "Member 'GameUtils_AddFlag::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.AddPCGComp
// 0x0010 (0x0010 - 0x0000)
struct GameUtils_AddPCGComp final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPCGComponent*                          ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameUtils_AddPCGComp) == 0x000008, "Wrong alignment on GameUtils_AddPCGComp");
static_assert(sizeof(GameUtils_AddPCGComp) == 0x000010, "Wrong size on GameUtils_AddPCGComp");
static_assert(offsetof(GameUtils_AddPCGComp, InActor) == 0x000000, "Member 'GameUtils_AddPCGComp::InActor' has a wrong offset!");
static_assert(offsetof(GameUtils_AddPCGComp, ReturnValue) == 0x000008, "Member 'GameUtils_AddPCGComp::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.ComponentTraceSingle
// 0x0150 (0x0150 - 0x0000)
struct GameUtils_ComponentTraceSingle final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Start;                                             // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                End;                                               // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTraceComplex;                                     // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      AddIgnoredObjectChannels;                          // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FHitResult                             OutHit;                                            // 0x0060(0x00E8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bIgnoreSelf;                                       // 0x0148(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0149(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameUtils_ComponentTraceSingle) == 0x000008, "Wrong alignment on GameUtils_ComponentTraceSingle");
static_assert(sizeof(GameUtils_ComponentTraceSingle) == 0x000150, "Wrong size on GameUtils_ComponentTraceSingle");
static_assert(offsetof(GameUtils_ComponentTraceSingle, Component) == 0x000000, "Member 'GameUtils_ComponentTraceSingle::Component' has a wrong offset!");
static_assert(offsetof(GameUtils_ComponentTraceSingle, Start) == 0x000008, "Member 'GameUtils_ComponentTraceSingle::Start' has a wrong offset!");
static_assert(offsetof(GameUtils_ComponentTraceSingle, End) == 0x000020, "Member 'GameUtils_ComponentTraceSingle::End' has a wrong offset!");
static_assert(offsetof(GameUtils_ComponentTraceSingle, bTraceComplex) == 0x000038, "Member 'GameUtils_ComponentTraceSingle::bTraceComplex' has a wrong offset!");
static_assert(offsetof(GameUtils_ComponentTraceSingle, AddIgnoredObjectChannels) == 0x000040, "Member 'GameUtils_ComponentTraceSingle::AddIgnoredObjectChannels' has a wrong offset!");
static_assert(offsetof(GameUtils_ComponentTraceSingle, ActorsToIgnore) == 0x000050, "Member 'GameUtils_ComponentTraceSingle::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(GameUtils_ComponentTraceSingle, OutHit) == 0x000060, "Member 'GameUtils_ComponentTraceSingle::OutHit' has a wrong offset!");
static_assert(offsetof(GameUtils_ComponentTraceSingle, bIgnoreSelf) == 0x000148, "Member 'GameUtils_ComponentTraceSingle::bIgnoreSelf' has a wrong offset!");
static_assert(offsetof(GameUtils_ComponentTraceSingle, ReturnValue) == 0x000149, "Member 'GameUtils_ComponentTraceSingle::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.ConeAABBIntersection
// 0x0080 (0x0080 - 0x0000)
struct GameUtils_ConeAABBIntersection final
{
public:
	struct FVector                                ConeOrigin;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ConeNormal;                                        // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConeHalfAngle;                                     // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConeHeightMin;                                     // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConeHeightMax;                                     // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   AxisAlignedBox;                                    // 0x0040(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EConeAABBIntersectionResult                   ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameUtils_ConeAABBIntersection) == 0x000008, "Wrong alignment on GameUtils_ConeAABBIntersection");
static_assert(sizeof(GameUtils_ConeAABBIntersection) == 0x000080, "Wrong size on GameUtils_ConeAABBIntersection");
static_assert(offsetof(GameUtils_ConeAABBIntersection, ConeOrigin) == 0x000000, "Member 'GameUtils_ConeAABBIntersection::ConeOrigin' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeAABBIntersection, ConeNormal) == 0x000018, "Member 'GameUtils_ConeAABBIntersection::ConeNormal' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeAABBIntersection, ConeHalfAngle) == 0x000030, "Member 'GameUtils_ConeAABBIntersection::ConeHalfAngle' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeAABBIntersection, ConeHeightMin) == 0x000034, "Member 'GameUtils_ConeAABBIntersection::ConeHeightMin' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeAABBIntersection, ConeHeightMax) == 0x000038, "Member 'GameUtils_ConeAABBIntersection::ConeHeightMax' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeAABBIntersection, AxisAlignedBox) == 0x000040, "Member 'GameUtils_ConeAABBIntersection::AxisAlignedBox' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeAABBIntersection, ReturnValue) == 0x000078, "Member 'GameUtils_ConeAABBIntersection::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.ConeOrientedAABBIntersection
// 0x00B0 (0x00B0 - 0x0000)
struct GameUtils_ConeOrientedAABBIntersection final
{
public:
	struct FVector                                ConeOrigin;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ConeNormal;                                        // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConeHalfAngle;                                     // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConeHeightMin;                                     // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConeHeightMax;                                     // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   Box;                                               // 0x0040(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  BoxOrientation;                                    // 0x0080(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConeAABBIntersectionResult                   ReturnValue;                                       // 0x00A0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0xF];                                       // 0x00A1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameUtils_ConeOrientedAABBIntersection) == 0x000010, "Wrong alignment on GameUtils_ConeOrientedAABBIntersection");
static_assert(sizeof(GameUtils_ConeOrientedAABBIntersection) == 0x0000B0, "Wrong size on GameUtils_ConeOrientedAABBIntersection");
static_assert(offsetof(GameUtils_ConeOrientedAABBIntersection, ConeOrigin) == 0x000000, "Member 'GameUtils_ConeOrientedAABBIntersection::ConeOrigin' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeOrientedAABBIntersection, ConeNormal) == 0x000018, "Member 'GameUtils_ConeOrientedAABBIntersection::ConeNormal' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeOrientedAABBIntersection, ConeHalfAngle) == 0x000030, "Member 'GameUtils_ConeOrientedAABBIntersection::ConeHalfAngle' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeOrientedAABBIntersection, ConeHeightMin) == 0x000034, "Member 'GameUtils_ConeOrientedAABBIntersection::ConeHeightMin' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeOrientedAABBIntersection, ConeHeightMax) == 0x000038, "Member 'GameUtils_ConeOrientedAABBIntersection::ConeHeightMax' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeOrientedAABBIntersection, Box) == 0x000040, "Member 'GameUtils_ConeOrientedAABBIntersection::Box' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeOrientedAABBIntersection, BoxOrientation) == 0x000080, "Member 'GameUtils_ConeOrientedAABBIntersection::BoxOrientation' has a wrong offset!");
static_assert(offsetof(GameUtils_ConeOrientedAABBIntersection, ReturnValue) == 0x0000A0, "Member 'GameUtils_ConeOrientedAABBIntersection::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.ConvertStringToGameplayTag
// 0x0018 (0x0018 - 0x0000)
struct GameUtils_ConvertStringToGameplayTag final
{
public:
	class FString                                 TagString;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameUtils_ConvertStringToGameplayTag) == 0x000008, "Wrong alignment on GameUtils_ConvertStringToGameplayTag");
static_assert(sizeof(GameUtils_ConvertStringToGameplayTag) == 0x000018, "Wrong size on GameUtils_ConvertStringToGameplayTag");
static_assert(offsetof(GameUtils_ConvertStringToGameplayTag, TagString) == 0x000000, "Member 'GameUtils_ConvertStringToGameplayTag::TagString' has a wrong offset!");
static_assert(offsetof(GameUtils_ConvertStringToGameplayTag, ReturnValue) == 0x000010, "Member 'GameUtils_ConvertStringToGameplayTag::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.DrawDebugRoundedCone
// 0x0040 (0x0040 - 0x0000)
struct GameUtils_DrawDebugRoundedCone final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ConeOrigin;                                        // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ConeNormal;                                        // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConeHalfAngle;                                     // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConeHeightMax;                                     // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameUtils_DrawDebugRoundedCone) == 0x000008, "Wrong alignment on GameUtils_DrawDebugRoundedCone");
static_assert(sizeof(GameUtils_DrawDebugRoundedCone) == 0x000040, "Wrong size on GameUtils_DrawDebugRoundedCone");
static_assert(offsetof(GameUtils_DrawDebugRoundedCone, WorldContextObject) == 0x000000, "Member 'GameUtils_DrawDebugRoundedCone::WorldContextObject' has a wrong offset!");
static_assert(offsetof(GameUtils_DrawDebugRoundedCone, ConeOrigin) == 0x000008, "Member 'GameUtils_DrawDebugRoundedCone::ConeOrigin' has a wrong offset!");
static_assert(offsetof(GameUtils_DrawDebugRoundedCone, ConeNormal) == 0x000020, "Member 'GameUtils_DrawDebugRoundedCone::ConeNormal' has a wrong offset!");
static_assert(offsetof(GameUtils_DrawDebugRoundedCone, ConeHalfAngle) == 0x000038, "Member 'GameUtils_DrawDebugRoundedCone::ConeHalfAngle' has a wrong offset!");
static_assert(offsetof(GameUtils_DrawDebugRoundedCone, ConeHeightMax) == 0x00003C, "Member 'GameUtils_DrawDebugRoundedCone::ConeHeightMax' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.EditorClearPCGLinksKeepActor
// 0x0008 (0x0008 - 0x0000)
struct GameUtils_EditorClearPCGLinksKeepActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameUtils_EditorClearPCGLinksKeepActor) == 0x000008, "Wrong alignment on GameUtils_EditorClearPCGLinksKeepActor");
static_assert(sizeof(GameUtils_EditorClearPCGLinksKeepActor) == 0x000008, "Wrong size on GameUtils_EditorClearPCGLinksKeepActor");
static_assert(offsetof(GameUtils_EditorClearPCGLinksKeepActor, InActor) == 0x000000, "Member 'GameUtils_EditorClearPCGLinksKeepActor::InActor' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.EditorGetBoundsFromUObject
// 0x0038 (0x0038 - 0x0000)
struct GameUtils_EditorGetBoundsFromUObject final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Origin;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Extents;                                           // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameUtils_EditorGetBoundsFromUObject) == 0x000008, "Wrong alignment on GameUtils_EditorGetBoundsFromUObject");
static_assert(sizeof(GameUtils_EditorGetBoundsFromUObject) == 0x000038, "Wrong size on GameUtils_EditorGetBoundsFromUObject");
static_assert(offsetof(GameUtils_EditorGetBoundsFromUObject, Object) == 0x000000, "Member 'GameUtils_EditorGetBoundsFromUObject::Object' has a wrong offset!");
static_assert(offsetof(GameUtils_EditorGetBoundsFromUObject, Origin) == 0x000008, "Member 'GameUtils_EditorGetBoundsFromUObject::Origin' has a wrong offset!");
static_assert(offsetof(GameUtils_EditorGetBoundsFromUObject, Extents) == 0x000020, "Member 'GameUtils_EditorGetBoundsFromUObject::Extents' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.EditorRegenPCG
// 0x0010 (0x0010 - 0x0000)
struct GameUtils_EditorRegenPCG final
{
public:
	class UPCGComponent*                          InPCGComp;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCleanupOnly;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameUtils_EditorRegenPCG) == 0x000008, "Wrong alignment on GameUtils_EditorRegenPCG");
static_assert(sizeof(GameUtils_EditorRegenPCG) == 0x000010, "Wrong size on GameUtils_EditorRegenPCG");
static_assert(offsetof(GameUtils_EditorRegenPCG, InPCGComp) == 0x000000, "Member 'GameUtils_EditorRegenPCG::InPCGComp' has a wrong offset!");
static_assert(offsetof(GameUtils_EditorRegenPCG, bCleanupOnly) == 0x000008, "Member 'GameUtils_EditorRegenPCG::bCleanupOnly' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.FindClosestPointOnFiniteLine
// 0x0060 (0x0060 - 0x0000)
struct GameUtils_FindClosestPointOnFiniteLine final
{
public:
	struct FVector                                Point;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineStart;                                         // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineEnd;                                           // 0x0030(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameUtils_FindClosestPointOnFiniteLine) == 0x000008, "Wrong alignment on GameUtils_FindClosestPointOnFiniteLine");
static_assert(sizeof(GameUtils_FindClosestPointOnFiniteLine) == 0x000060, "Wrong size on GameUtils_FindClosestPointOnFiniteLine");
static_assert(offsetof(GameUtils_FindClosestPointOnFiniteLine, Point) == 0x000000, "Member 'GameUtils_FindClosestPointOnFiniteLine::Point' has a wrong offset!");
static_assert(offsetof(GameUtils_FindClosestPointOnFiniteLine, LineStart) == 0x000018, "Member 'GameUtils_FindClosestPointOnFiniteLine::LineStart' has a wrong offset!");
static_assert(offsetof(GameUtils_FindClosestPointOnFiniteLine, LineEnd) == 0x000030, "Member 'GameUtils_FindClosestPointOnFiniteLine::LineEnd' has a wrong offset!");
static_assert(offsetof(GameUtils_FindClosestPointOnFiniteLine, ReturnValue) == 0x000048, "Member 'GameUtils_FindClosestPointOnFiniteLine::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.FindComponentSnapLocationNearestToSurface
// 0x0058 (0x0058 - 0x0000)
struct GameUtils_FindComponentSnapLocationNearestToSurface final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SweepCenter;                                       // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSweepDist;                                      // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSweepDist;                                      // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SweepIncrement;                                    // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnorePawn;                                       // 0x0034(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutComponentSnapLocation;                          // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameUtils_FindComponentSnapLocationNearestToSurface) == 0x000008, "Wrong alignment on GameUtils_FindComponentSnapLocationNearestToSurface");
static_assert(sizeof(GameUtils_FindComponentSnapLocationNearestToSurface) == 0x000058, "Wrong size on GameUtils_FindComponentSnapLocationNearestToSurface");
static_assert(offsetof(GameUtils_FindComponentSnapLocationNearestToSurface, World) == 0x000000, "Member 'GameUtils_FindComponentSnapLocationNearestToSurface::World' has a wrong offset!");
static_assert(offsetof(GameUtils_FindComponentSnapLocationNearestToSurface, Component) == 0x000008, "Member 'GameUtils_FindComponentSnapLocationNearestToSurface::Component' has a wrong offset!");
static_assert(offsetof(GameUtils_FindComponentSnapLocationNearestToSurface, SweepCenter) == 0x000010, "Member 'GameUtils_FindComponentSnapLocationNearestToSurface::SweepCenter' has a wrong offset!");
static_assert(offsetof(GameUtils_FindComponentSnapLocationNearestToSurface, MinSweepDist) == 0x000028, "Member 'GameUtils_FindComponentSnapLocationNearestToSurface::MinSweepDist' has a wrong offset!");
static_assert(offsetof(GameUtils_FindComponentSnapLocationNearestToSurface, MaxSweepDist) == 0x00002C, "Member 'GameUtils_FindComponentSnapLocationNearestToSurface::MaxSweepDist' has a wrong offset!");
static_assert(offsetof(GameUtils_FindComponentSnapLocationNearestToSurface, SweepIncrement) == 0x000030, "Member 'GameUtils_FindComponentSnapLocationNearestToSurface::SweepIncrement' has a wrong offset!");
static_assert(offsetof(GameUtils_FindComponentSnapLocationNearestToSurface, bIgnorePawn) == 0x000034, "Member 'GameUtils_FindComponentSnapLocationNearestToSurface::bIgnorePawn' has a wrong offset!");
static_assert(offsetof(GameUtils_FindComponentSnapLocationNearestToSurface, OutComponentSnapLocation) == 0x000038, "Member 'GameUtils_FindComponentSnapLocationNearestToSurface::OutComponentSnapLocation' has a wrong offset!");
static_assert(offsetof(GameUtils_FindComponentSnapLocationNearestToSurface, ReturnValue) == 0x000050, "Member 'GameUtils_FindComponentSnapLocationNearestToSurface::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.GetEditorCameraPosition
// 0x0030 (0x0030 - 0x0000)
struct GameUtils_GetEditorCameraPosition final
{
public:
	struct FVector                                CameraLocation;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraRotation;                                    // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameUtils_GetEditorCameraPosition) == 0x000008, "Wrong alignment on GameUtils_GetEditorCameraPosition");
static_assert(sizeof(GameUtils_GetEditorCameraPosition) == 0x000030, "Wrong size on GameUtils_GetEditorCameraPosition");
static_assert(offsetof(GameUtils_GetEditorCameraPosition, CameraLocation) == 0x000000, "Member 'GameUtils_GetEditorCameraPosition::CameraLocation' has a wrong offset!");
static_assert(offsetof(GameUtils_GetEditorCameraPosition, CameraRotation) == 0x000018, "Member 'GameUtils_GetEditorCameraPosition::CameraRotation' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.GetIndecesForSortedArray
// 0x0020 (0x0020 - 0x0000)
struct GameUtils_GetIndecesForSortedArray final
{
public:
	TArray<class FString>                         StringList;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameUtils_GetIndecesForSortedArray) == 0x000008, "Wrong alignment on GameUtils_GetIndecesForSortedArray");
static_assert(sizeof(GameUtils_GetIndecesForSortedArray) == 0x000020, "Wrong size on GameUtils_GetIndecesForSortedArray");
static_assert(offsetof(GameUtils_GetIndecesForSortedArray, StringList) == 0x000000, "Member 'GameUtils_GetIndecesForSortedArray::StringList' has a wrong offset!");
static_assert(offsetof(GameUtils_GetIndecesForSortedArray, ReturnValue) == 0x000010, "Member 'GameUtils_GetIndecesForSortedArray::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.GetLookAtTarget
// 0x0058 (0x0058 - 0x0000)
struct GameUtils_GetLookAtTarget final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAoCTargetInfo                         ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameUtils_GetLookAtTarget) == 0x000008, "Wrong alignment on GameUtils_GetLookAtTarget");
static_assert(sizeof(GameUtils_GetLookAtTarget) == 0x000058, "Wrong size on GameUtils_GetLookAtTarget");
static_assert(offsetof(GameUtils_GetLookAtTarget, PlayerController) == 0x000000, "Member 'GameUtils_GetLookAtTarget::PlayerController' has a wrong offset!");
static_assert(offsetof(GameUtils_GetLookAtTarget, ReturnValue) == 0x000008, "Member 'GameUtils_GetLookAtTarget::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.GetLowestLineTracedGroundImpact
// 0x0038 (0x0038 - 0x0000)
struct GameUtils_GetLowestLineTracedGroundImpact final
{
public:
	struct FVector                                Result;                                            // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        TraceStartLocations;                               // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         RayDistance;                                       // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameUtils_GetLowestLineTracedGroundImpact) == 0x000008, "Wrong alignment on GameUtils_GetLowestLineTracedGroundImpact");
static_assert(sizeof(GameUtils_GetLowestLineTracedGroundImpact) == 0x000038, "Wrong size on GameUtils_GetLowestLineTracedGroundImpact");
static_assert(offsetof(GameUtils_GetLowestLineTracedGroundImpact, Result) == 0x000000, "Member 'GameUtils_GetLowestLineTracedGroundImpact::Result' has a wrong offset!");
static_assert(offsetof(GameUtils_GetLowestLineTracedGroundImpact, WorldContextObject) == 0x000018, "Member 'GameUtils_GetLowestLineTracedGroundImpact::WorldContextObject' has a wrong offset!");
static_assert(offsetof(GameUtils_GetLowestLineTracedGroundImpact, TraceStartLocations) == 0x000020, "Member 'GameUtils_GetLowestLineTracedGroundImpact::TraceStartLocations' has a wrong offset!");
static_assert(offsetof(GameUtils_GetLowestLineTracedGroundImpact, RayDistance) == 0x000030, "Member 'GameUtils_GetLowestLineTracedGroundImpact::RayDistance' has a wrong offset!");
static_assert(offsetof(GameUtils_GetLowestLineTracedGroundImpact, ReturnValue) == 0x000034, "Member 'GameUtils_GetLowestLineTracedGroundImpact::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.GetNameHashIndex
// 0x0010 (0x0010 - 0x0000)
struct GameUtils_GetNameHashIndex final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameUtils_GetNameHashIndex) == 0x000008, "Wrong alignment on GameUtils_GetNameHashIndex");
static_assert(sizeof(GameUtils_GetNameHashIndex) == 0x000010, "Wrong size on GameUtils_GetNameHashIndex");
static_assert(offsetof(GameUtils_GetNameHashIndex, InObject) == 0x000000, "Member 'GameUtils_GetNameHashIndex::InObject' has a wrong offset!");
static_assert(offsetof(GameUtils_GetNameHashIndex, ReturnValue) == 0x000008, "Member 'GameUtils_GetNameHashIndex::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.GetOnlyAlphanumeric
// 0x0020 (0x0020 - 0x0000)
struct GameUtils_GetOnlyAlphanumeric final
{
public:
	class FString                                 Dirty;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameUtils_GetOnlyAlphanumeric) == 0x000008, "Wrong alignment on GameUtils_GetOnlyAlphanumeric");
static_assert(sizeof(GameUtils_GetOnlyAlphanumeric) == 0x000020, "Wrong size on GameUtils_GetOnlyAlphanumeric");
static_assert(offsetof(GameUtils_GetOnlyAlphanumeric, Dirty) == 0x000000, "Member 'GameUtils_GetOnlyAlphanumeric::Dirty' has a wrong offset!");
static_assert(offsetof(GameUtils_GetOnlyAlphanumeric, ReturnValue) == 0x000010, "Member 'GameUtils_GetOnlyAlphanumeric::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.GetOrientedBoundingBox
// 0x0070 (0x0070 - 0x0000)
struct GameUtils_GetOrientedBoundingBox final
{
public:
	const class UPrimitiveComponent*              PrimitiveComponent;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   OutBox;                                            // 0x0008(0x0038)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FQuat                                  OutOrientation;                                    // 0x0040(0x0020)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0xF];                                       // 0x0061(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameUtils_GetOrientedBoundingBox) == 0x000010, "Wrong alignment on GameUtils_GetOrientedBoundingBox");
static_assert(sizeof(GameUtils_GetOrientedBoundingBox) == 0x000070, "Wrong size on GameUtils_GetOrientedBoundingBox");
static_assert(offsetof(GameUtils_GetOrientedBoundingBox, PrimitiveComponent) == 0x000000, "Member 'GameUtils_GetOrientedBoundingBox::PrimitiveComponent' has a wrong offset!");
static_assert(offsetof(GameUtils_GetOrientedBoundingBox, OutBox) == 0x000008, "Member 'GameUtils_GetOrientedBoundingBox::OutBox' has a wrong offset!");
static_assert(offsetof(GameUtils_GetOrientedBoundingBox, OutOrientation) == 0x000040, "Member 'GameUtils_GetOrientedBoundingBox::OutOrientation' has a wrong offset!");
static_assert(offsetof(GameUtils_GetOrientedBoundingBox, ReturnValue) == 0x000060, "Member 'GameUtils_GetOrientedBoundingBox::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.GetSystemEnvironmentValue
// 0x0020 (0x0020 - 0x0000)
struct GameUtils_GetSystemEnvironmentValue final
{
public:
	class FString                                 EnvironmentVariable;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameUtils_GetSystemEnvironmentValue) == 0x000008, "Wrong alignment on GameUtils_GetSystemEnvironmentValue");
static_assert(sizeof(GameUtils_GetSystemEnvironmentValue) == 0x000020, "Wrong size on GameUtils_GetSystemEnvironmentValue");
static_assert(offsetof(GameUtils_GetSystemEnvironmentValue, EnvironmentVariable) == 0x000000, "Member 'GameUtils_GetSystemEnvironmentValue::EnvironmentVariable' has a wrong offset!");
static_assert(offsetof(GameUtils_GetSystemEnvironmentValue, ReturnValue) == 0x000010, "Member 'GameUtils_GetSystemEnvironmentValue::ReturnValue' has a wrong offset!");

// Function GameUtilsPlugin.GameUtils.GetTargetUnderCursor
// 0x0060 (0x0060 - 0x0000)
struct GameUtils_GetTargetUnderCursor final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsiderPlayer;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreHUD;                                        // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnorePawns;                                      // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowOverlapHits;                                 // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
