#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Goblin_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Goblin_AnimBP.Goblin_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x022F (0x0230 - 0x0001)
struct Goblin_AnimBP::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_803;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_804;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_805;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_806;                               // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_807;                               // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_808;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_809;                               // 0x0050(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_810;                                // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_811;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_812;                               // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_813;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_814;                                // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_815;                               // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_816;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_817;                                 // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_818;                               // 0x00B0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_819;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_820;                                 // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_821;                              // 0x00CC(0x002C)(BlueprintVisible, NoDestructor)
	EAnimSyncMethod                               __EnumProperty_822;                                // 0x00F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_823;                                // 0x00FC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_824;                                // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_825;                                  // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_826;                                // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_827;                                // 0x0119(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_828;                               // 0x0120(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_829;                                // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_830;                                // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_831;                                // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_832;                                 // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_833;                               // 0x014C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_834;                                // 0x0150(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_835;                               // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_836;                                // 0x0158(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_837;                                // 0x0159(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_838;                                // 0x015A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x1];                                      // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_839;                                // 0x015C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_840;                                // 0x0164(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_841;                                // 0x016C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_842;                                 // 0x0174(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_843;                              // 0x0178(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0198(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0218(0x0018)()
};
static_assert(alignof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Goblin_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000230, "Wrong size on Goblin_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_803) == 0x000004, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_803' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_804) == 0x000010, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_804' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_805) == 0x000020, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_805' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_806) == 0x000028, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_806' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_807) == 0x000038, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_807' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_808) == 0x000048, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_808' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_809) == 0x000050, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_809' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_810) == 0x000060, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_810' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_811) == 0x000068, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_811' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_812) == 0x000070, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_812' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_813) == 0x000080, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_813' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_814) == 0x000088, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_814' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_815) == 0x000090, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_815' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_816) == 0x0000A0, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_816' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_817) == 0x0000A8, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_817' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_818) == 0x0000B0, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_818' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_819) == 0x0000C0, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_819' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_820) == 0x0000C8, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_820' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_821) == 0x0000CC, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_821' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_822) == 0x0000F8, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_822' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_823) == 0x0000FC, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_823' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_824) == 0x000108, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_824' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_825) == 0x000110, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_825' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_826) == 0x000118, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_826' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_827) == 0x000119, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_827' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_828) == 0x000120, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_828' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_829) == 0x000130, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_829' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_830) == 0x000138, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_830' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_831) == 0x000140, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_831' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_832) == 0x000148, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_832' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_833) == 0x00014C, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_833' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_834) == 0x000150, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_834' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_835) == 0x000154, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_835' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_836) == 0x000158, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_836' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_837) == 0x000159, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_837' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_838) == 0x00015A, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_838' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_839) == 0x00015C, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_839' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_840) == 0x000164, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_840' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_841) == 0x00016C, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_841' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_842) == 0x000174, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_842' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_843) == 0x000178, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_843' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000198, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000218, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Goblin_AnimBP.Goblin_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x009B (0x009C - 0x0001)
struct Goblin_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_0;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_2;                                   // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0011(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0012(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_9;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_15;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_17;                                  // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_24;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_28;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_29;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_30;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_31;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_32;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_33;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_34;                                  // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_35;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_37;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_38;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_39;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_40;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Goblin_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Goblin_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Goblin_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00009C, "Wrong size on Goblin_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(Goblin_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_0) == 0x000004, "Member 'Goblin_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_0' has a wrong offset!");
