#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gorilla

#include "Basic.hpp"


namespace SDK::Params
{

// Function Gorilla.Gorilla_C.ExecuteUbergraph_Gorilla
// 0x0008 (0x0008 - 0x0000)
struct Gorilla_C_ExecuteUbergraph_Gorilla final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gorilla_C_ExecuteUbergraph_Gorilla) == 0x000004, "Wrong alignment on Gorilla_C_ExecuteUbergraph_Gorilla");
static_assert(sizeof(Gorilla_C_ExecuteUbergraph_Gorilla) == 0x000008, "Wrong size on Gorilla_C_ExecuteUbergraph_Gorilla");
static_assert(offsetof(Gorilla_C_ExecuteUbergraph_Gorilla, EntryPoint) == 0x000000, "Member 'Gorilla_C_ExecuteUbergraph_Gorilla::EntryPoint' has a wrong offset!");
static_assert(offsetof(Gorilla_C_ExecuteUbergraph_Gorilla, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Gorilla_C_ExecuteUbergraph_Gorilla::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function Gorilla.Gorilla_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Gorilla_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gorilla_C_ReceiveTick) == 0x000004, "Wrong alignment on Gorilla_C_ReceiveTick");
static_assert(sizeof(Gorilla_C_ReceiveTick) == 0x000004, "Wrong size on Gorilla_C_ReceiveTick");
static_assert(offsetof(Gorilla_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Gorilla_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

