#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gorilla

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NPCPawn_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Gorilla.Gorilla_C
// 0x0020 (0x1D70 - 0x1D50)
class AGorilla_C final : public ANPCPawn_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Gorilla_C;                          // 0x1D50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBlackboardComponent*                   Blackboard;                                        // 0x1D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class ABaseCharacter* Target)> AddSpecialTargetGorilla;            // 0x1D60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_Gorilla(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Gorilla_C">();
	}
	static class AGorilla_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGorilla_C>();
	}
};
static_assert(alignof(AGorilla_C) == 0x000010, "Wrong alignment on AGorilla_C");
static_assert(sizeof(AGorilla_C) == 0x001D70, "Wrong size on AGorilla_C");
static_assert(offsetof(AGorilla_C, UberGraphFrame_Gorilla_C) == 0x001D50, "Member 'AGorilla_C::UberGraphFrame_Gorilla_C' has a wrong offset!");
static_assert(offsetof(AGorilla_C, Blackboard) == 0x001D58, "Member 'AGorilla_C::Blackboard' has a wrong offset!");
static_assert(offsetof(AGorilla_C, AddSpecialTargetGorilla) == 0x001D60, "Member 'AGorilla_C::AddSpecialTargetGorilla' has a wrong offset!");

}

