#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HammerThrow_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HammerThrow_Projectile.HammerThrow_Projectile_C
// 0x0038 (0x05C8 - 0x0590)
class AHammerThrow_Projectile_C final : public AAoCAbilityProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara1;                                          // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HammerMesh;                                        // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Saved_Relative_Rotation;                           // 0x05B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_HammerThrow_Projectile(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HammerThrow_Projectile_C">();
	}
	static class AHammerThrow_Projectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHammerThrow_Projectile_C>();
	}
};
static_assert(alignof(AHammerThrow_Projectile_C) == 0x000008, "Wrong alignment on AHammerThrow_Projectile_C");
static_assert(sizeof(AHammerThrow_Projectile_C) == 0x0005C8, "Wrong size on AHammerThrow_Projectile_C");
static_assert(offsetof(AHammerThrow_Projectile_C, UberGraphFrame) == 0x000590, "Member 'AHammerThrow_Projectile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHammerThrow_Projectile_C, Niagara1) == 0x000598, "Member 'AHammerThrow_Projectile_C::Niagara1' has a wrong offset!");
static_assert(offsetof(AHammerThrow_Projectile_C, Niagara) == 0x0005A0, "Member 'AHammerThrow_Projectile_C::Niagara' has a wrong offset!");
static_assert(offsetof(AHammerThrow_Projectile_C, HammerMesh) == 0x0005A8, "Member 'AHammerThrow_Projectile_C::HammerMesh' has a wrong offset!");
static_assert(offsetof(AHammerThrow_Projectile_C, Saved_Relative_Rotation) == 0x0005B0, "Member 'AHammerThrow_Projectile_C::Saved_Relative_Rotation' has a wrong offset!");

}

