#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: hanging_brazier_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function hanging_brazier_BP.hanging_brazier_BP_C.ExecuteUbergraph_hanging_brazier_BP
// 0x0018 (0x0018 - 0x0000)
struct hanging_brazier_BP_C_ExecuteUbergraph_hanging_brazier_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(hanging_brazier_BP_C_ExecuteUbergraph_hanging_brazier_BP) == 0x000004, "Wrong alignment on hanging_brazier_BP_C_ExecuteUbergraph_hanging_brazier_BP");
static_assert(sizeof(hanging_brazier_BP_C_ExecuteUbergraph_hanging_brazier_BP) == 0x000018, "Wrong size on hanging_brazier_BP_C_ExecuteUbergraph_hanging_brazier_BP");
static_assert(offsetof(hanging_brazier_BP_C_ExecuteUbergraph_hanging_brazier_BP, EntryPoint) == 0x000000, "Member 'hanging_brazier_BP_C_ExecuteUbergraph_hanging_brazier_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(hanging_brazier_BP_C_ExecuteUbergraph_hanging_brazier_BP, Temp_delegate_Variable) == 0x000004, "Member 'hanging_brazier_BP_C_ExecuteUbergraph_hanging_brazier_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(hanging_brazier_BP_C_ExecuteUbergraph_hanging_brazier_BP, CallFunc_PostAkEvent_ReturnValue) == 0x000014, "Member 'hanging_brazier_BP_C_ExecuteUbergraph_hanging_brazier_BP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

