#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: hanging_brazier_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass hanging_brazier_BP.hanging_brazier_BP_C
// 0x0028 (0x0370 - 0x0348)
class Ahanging_brazier_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIntrepidAkComponent*                   IntrepidAK;                                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_Large_Camp_Fire8_NiagaraComponent0;             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   hanging_brazier8_StaticMeshComponent0;             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_hanging_brazier_BP(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"hanging_brazier_BP_C">();
	}
	static class Ahanging_brazier_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ahanging_brazier_BP_C>();
	}
};
static_assert(alignof(Ahanging_brazier_BP_C) == 0x000008, "Wrong alignment on Ahanging_brazier_BP_C");
static_assert(sizeof(Ahanging_brazier_BP_C) == 0x000370, "Wrong size on Ahanging_brazier_BP_C");
static_assert(offsetof(Ahanging_brazier_BP_C, UberGraphFrame) == 0x000348, "Member 'Ahanging_brazier_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ahanging_brazier_BP_C, IntrepidAK) == 0x000350, "Member 'Ahanging_brazier_BP_C::IntrepidAK' has a wrong offset!");
static_assert(offsetof(Ahanging_brazier_BP_C, FX_Large_Camp_Fire8_NiagaraComponent0) == 0x000358, "Member 'Ahanging_brazier_BP_C::FX_Large_Camp_Fire8_NiagaraComponent0' has a wrong offset!");
static_assert(offsetof(Ahanging_brazier_BP_C, hanging_brazier8_StaticMeshComponent0) == 0x000360, "Member 'Ahanging_brazier_BP_C::hanging_brazier8_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(Ahanging_brazier_BP_C, SharedRoot) == 0x000368, "Member 'Ahanging_brazier_BP_C::SharedRoot' has a wrong offset!");

}

