#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HarvestableResource

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NPCPawn_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HarvestableResource.HarvestableResource_C
// 0x0040 (0x1D70 - 0x1D30)
class AHarvestableResource_C final : public ANPCPawn_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_HarvestableResource_C;              // 0x1D30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHarvestingComponent*                   harvesting;                                        // 0x1D38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       Player;                                            // 0x1D40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DirectHit;                                         // 0x1D48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D49[0x7];                                     // 0x1D49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HarvestLocation;                                   // 0x1D50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentBeginCursorOverSignature__DelegateSignature(class UPrimitiveComponent* TouchedComponent);
	void BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature(class UPrimitiveComponent* TouchedComponent, const struct FKey& ButtonPressed);
	void BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentEndCursorOverSignature__DelegateSignature(class UPrimitiveComponent* TouchedComponent);
	void ExecuteUbergraph_HarvestableResource(int32 EntryPoint);
	void On_Click_From_Player(const struct FVector& Location);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HarvestableResource_C">();
	}
	static class AHarvestableResource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHarvestableResource_C>();
	}
};
static_assert(alignof(AHarvestableResource_C) == 0x000010, "Wrong alignment on AHarvestableResource_C");
static_assert(sizeof(AHarvestableResource_C) == 0x001D70, "Wrong size on AHarvestableResource_C");
static_assert(offsetof(AHarvestableResource_C, UberGraphFrame_HarvestableResource_C) == 0x001D30, "Member 'AHarvestableResource_C::UberGraphFrame_HarvestableResource_C' has a wrong offset!");
static_assert(offsetof(AHarvestableResource_C, harvesting) == 0x001D38, "Member 'AHarvestableResource_C::harvesting' has a wrong offset!");
static_assert(offsetof(AHarvestableResource_C, Player) == 0x001D40, "Member 'AHarvestableResource_C::Player' has a wrong offset!");
static_assert(offsetof(AHarvestableResource_C, DirectHit) == 0x001D48, "Member 'AHarvestableResource_C::DirectHit' has a wrong offset!");
static_assert(offsetof(AHarvestableResource_C, HarvestLocation) == 0x001D50, "Member 'AHarvestableResource_C::HarvestLocation' has a wrong offset!");

}

