#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuKaelar_Props_N3_HangingLantern_2_Blueprint

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HuKaelar_Props_N3_HangingLantern_2_Blueprint.HuKaelar_Props_N3_HangingLantern_2_Blueprint_C
// 0x0020 (0x0368 - 0x0348)
class AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Hu_Kaelar_SignHook_1;                              // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuKaelar_Props_N3_HangingLantern_2_StaticMeshComponent0; // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HuKaelar_Props_N3_HangingLantern_2_Blueprint_C">();
	}
	static class AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C>();
	}
};
static_assert(alignof(AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C) == 0x000008, "Wrong alignment on AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C");
static_assert(sizeof(AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C) == 0x000368, "Wrong size on AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C");
static_assert(offsetof(AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C, Hu_Kaelar_SignHook_1) == 0x000348, "Member 'AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C::Hu_Kaelar_SignHook_1' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C, PointLight) == 0x000350, "Member 'AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C::PointLight' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C, SM_HuKaelar_Props_N3_HangingLantern_2_StaticMeshComponent0) == 0x000358, "Member 'AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C::SM_HuKaelar_Props_N3_HangingLantern_2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C, SharedRoot) == 0x000360, "Member 'AHuKaelar_Props_N3_HangingLantern_2_Blueprint_C::SharedRoot' has a wrong offset!");

}

