#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuKaelar_BookStack_Instance

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HuKaelar_BookStack_Instance.HuKaelar_BookStack_Instance_C
// 0x0038 (0x0380 - 0x0348)
class AHuKaelar_BookStack_Instance_C final : public AActor
{
public:
	class UInstancedStaticMeshComponent*          Books;                                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberofBooks;                                     // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Random_Minor_Rotation;                             // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Random_Minor_Position_X;                           // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Random_Minor_Position_Y;                           // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Random_Minor_Scale;                                // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HuKaelar_BookStack_Instance_C">();
	}
	static class AHuKaelar_BookStack_Instance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHuKaelar_BookStack_Instance_C>();
	}
};
static_assert(alignof(AHuKaelar_BookStack_Instance_C) == 0x000008, "Wrong alignment on AHuKaelar_BookStack_Instance_C");
static_assert(sizeof(AHuKaelar_BookStack_Instance_C) == 0x000380, "Wrong size on AHuKaelar_BookStack_Instance_C");
static_assert(offsetof(AHuKaelar_BookStack_Instance_C, Books) == 0x000348, "Member 'AHuKaelar_BookStack_Instance_C::Books' has a wrong offset!");
static_assert(offsetof(AHuKaelar_BookStack_Instance_C, DefaultSceneRoot) == 0x000350, "Member 'AHuKaelar_BookStack_Instance_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AHuKaelar_BookStack_Instance_C, NumberofBooks) == 0x000358, "Member 'AHuKaelar_BookStack_Instance_C::NumberofBooks' has a wrong offset!");
static_assert(offsetof(AHuKaelar_BookStack_Instance_C, Random_Minor_Rotation) == 0x000360, "Member 'AHuKaelar_BookStack_Instance_C::Random_Minor_Rotation' has a wrong offset!");
static_assert(offsetof(AHuKaelar_BookStack_Instance_C, Random_Minor_Position_X) == 0x000368, "Member 'AHuKaelar_BookStack_Instance_C::Random_Minor_Position_X' has a wrong offset!");
static_assert(offsetof(AHuKaelar_BookStack_Instance_C, Random_Minor_Position_Y) == 0x000370, "Member 'AHuKaelar_BookStack_Instance_C::Random_Minor_Position_Y' has a wrong offset!");
static_assert(offsetof(AHuKaelar_BookStack_Instance_C, Random_Minor_Scale) == 0x000378, "Member 'AHuKaelar_BookStack_Instance_C::Random_Minor_Scale' has a wrong offset!");

}

