#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuKaelar_BookStack_Instance

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HuKaelar_BookStack_Instance.HuKaelar_BookStack_Instance_C.UserConstructionScript
// 0x0310 (0x0310 - 0x0000)
struct HuKaelar_BookStack_Instance_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_GetBoundingBox_ReturnValue;               // 0x0028(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetInstanceCount_ReturnValue;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInstanceTransform_OutInstanceTransform; // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInstanceTransform_ReturnValue;         // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HuKaelar_BookStack_Instance_C_UserConstructionScript) == 0x000010, "Wrong alignment on HuKaelar_BookStack_Instance_C_UserConstructionScript");
static_assert(sizeof(HuKaelar_BookStack_Instance_C_UserConstructionScript) == 0x000310, "Wrong size on HuKaelar_BookStack_Instance_C_UserConstructionScript");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, Temp_real_Variable) == 0x000008, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_GetBoundingBox_ReturnValue) == 0x000028, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_GetBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_GetInstanceCount_ReturnValue) == 0x000060, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_GetInstanceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000068, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000070, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000078, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x000080, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000084, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_GetInstanceTransform_OutInstanceTransform) == 0x000090, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_GetInstanceTransform_OutInstanceTransform' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_GetInstanceTransform_ReturnValue) == 0x0000F0, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_GetInstanceTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x0000F8, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000100, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000108, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x000110, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x000128, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x000140, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000158, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakVector_X_2) == 0x000160, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakVector_Y_2) == 0x000168, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakVector_Z_2) == 0x000170, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakVector_X_3) == 0x000178, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakVector_Y_3) == 0x000180, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_BreakVector_Z_3) == 0x000188, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000190, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000198, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0001A0, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_RandomFloat_ReturnValue) == 0x0001A8, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001B0, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001B8, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, K2Node_Select_Default) == 0x0001C0, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0001C8, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0001D0, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0001D8, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0001E0, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0001E8, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0001F0, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0001F8, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000200, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000208, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, Temp_int_Variable) == 0x000220, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000228, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000230, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000238, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x000240, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000248, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000250, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000258, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x000260, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000268, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000280, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000288, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x0002A0, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue) == 0x000300, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuKaelar_BookStack_Instance_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000304, "Member 'HuKaelar_BookStack_Instance_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

}

