#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuKaelar_Props_N3_LampPost_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HuKaelar_Props_N3_LampPost_01.HuKaelar_Props_N3_LampPost_01_C
// 0x0018 (0x0360 - 0x0348)
class AHuKaelar_Props_N3_LampPost_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   HuKaelar_Props_N3_LampPost_01;                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HuKaelar_Props_N3_LampPost_01_C">();
	}
	static class AHuKaelar_Props_N3_LampPost_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHuKaelar_Props_N3_LampPost_01_C>();
	}
};
static_assert(alignof(AHuKaelar_Props_N3_LampPost_01_C) == 0x000008, "Wrong alignment on AHuKaelar_Props_N3_LampPost_01_C");
static_assert(sizeof(AHuKaelar_Props_N3_LampPost_01_C) == 0x000360, "Wrong size on AHuKaelar_Props_N3_LampPost_01_C");
static_assert(offsetof(AHuKaelar_Props_N3_LampPost_01_C, HuKaelar_Props_N3_LampPost_01) == 0x000348, "Member 'AHuKaelar_Props_N3_LampPost_01_C::HuKaelar_Props_N3_LampPost_01' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Props_N3_LampPost_01_C, SpotLight) == 0x000350, "Member 'AHuKaelar_Props_N3_LampPost_01_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Props_N3_LampPost_01_C, DefaultSceneRoot) == 0x000358, "Member 'AHuKaelar_Props_N3_LampPost_01_C::DefaultSceneRoot' has a wrong offset!");

}

