#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuKaelar_Light_N3_WatchtowerChandelier

#include "Basic.hpp"

#include "BP_MasterLightSource_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HuKaelar_Light_N3_WatchtowerChandelier.HuKaelar_Light_N3_WatchtowerChandelier_C
// 0x00D8 (0x0558 - 0x0480)
class AHuKaelar_Light_N3_WatchtowerChandelier_C final : public ABP_MasterLightSource_C
{
public:
	class UNiagaraComponent*                      NS_CandleFlame_Converted7;                         // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CandleFlame_Converted6;                         // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CandleFlame_Converted5;                         // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CandleFlame_Converted4;                         // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CandleFlame_Converted3;                         // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CandleFlame_Converted2;                         // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CandleFlame_Converted1;                         // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CandleFlame_Converted;                          // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Flame_013;                                      // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Flame_012;                                      // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Flame_011;                                      // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Flame_010;                                      // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Flame_09;                                       // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Flame_08;                                       // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Flame_07;                                       // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Flame_06;                                       // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Flame_04;                                       // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Flame_02;                                       // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Flame_01;                                       // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle_S4;                                         // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle_XS2;                                        // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle_S3;                                         // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle_XS1;                                        // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle_XS;                                         // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle_S2;                                         // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle_S1;                                         // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle_S;                                          // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HuKaelar_Light_N3_WatchtowerChandelier_C">();
	}
	static class AHuKaelar_Light_N3_WatchtowerChandelier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHuKaelar_Light_N3_WatchtowerChandelier_C>();
	}
};
static_assert(alignof(AHuKaelar_Light_N3_WatchtowerChandelier_C) == 0x000008, "Wrong alignment on AHuKaelar_Light_N3_WatchtowerChandelier_C");
static_assert(sizeof(AHuKaelar_Light_N3_WatchtowerChandelier_C) == 0x000558, "Wrong size on AHuKaelar_Light_N3_WatchtowerChandelier_C");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, NS_CandleFlame_Converted7) == 0x000480, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::NS_CandleFlame_Converted7' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, NS_CandleFlame_Converted6) == 0x000488, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::NS_CandleFlame_Converted6' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, NS_CandleFlame_Converted5) == 0x000490, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::NS_CandleFlame_Converted5' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, NS_CandleFlame_Converted4) == 0x000498, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::NS_CandleFlame_Converted4' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, NS_CandleFlame_Converted3) == 0x0004A0, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::NS_CandleFlame_Converted3' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, NS_CandleFlame_Converted2) == 0x0004A8, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::NS_CandleFlame_Converted2' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, NS_CandleFlame_Converted1) == 0x0004B0, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::NS_CandleFlame_Converted1' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, NS_CandleFlame_Converted) == 0x0004B8, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::NS_CandleFlame_Converted' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, SM_Flame_013) == 0x0004C0, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::SM_Flame_013' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, SM_Flame_012) == 0x0004C8, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::SM_Flame_012' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, SM_Flame_011) == 0x0004D0, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::SM_Flame_011' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, SM_Flame_010) == 0x0004D8, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::SM_Flame_010' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, SM_Flame_09) == 0x0004E0, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::SM_Flame_09' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, SM_Flame_08) == 0x0004E8, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::SM_Flame_08' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, SM_Flame_07) == 0x0004F0, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::SM_Flame_07' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, SM_Flame_06) == 0x0004F8, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::SM_Flame_06' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, SM_Flame_04) == 0x000500, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::SM_Flame_04' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, SM_Flame_02) == 0x000508, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::SM_Flame_02' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, SM_Flame_01) == 0x000510, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::SM_Flame_01' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, Candle_S4) == 0x000518, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::Candle_S4' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, Candle_XS2) == 0x000520, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::Candle_XS2' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, Candle_S3) == 0x000528, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::Candle_S3' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, Candle_XS1) == 0x000530, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::Candle_XS1' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, Candle_XS) == 0x000538, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::Candle_XS' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, Candle_S2) == 0x000540, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::Candle_S2' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, Candle_S1) == 0x000548, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::Candle_S1' has a wrong offset!");
static_assert(offsetof(AHuKaelar_Light_N3_WatchtowerChandelier_C, Candle_S) == 0x000550, "Member 'AHuKaelar_Light_N3_WatchtowerChandelier_C::Candle_S' has a wrong offset!");

}

