#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Humanoid_NPC_Control_Rig_High

#include "Basic.hpp"

#include "AnimationCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "Engine_structs.hpp"
#include "PBIK_structs.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass Humanoid_NPC_Control_Rig_High.Humanoid_NPC_Control_Rig_High_C
// 0x0150 (0x0780 - 0x0630)
class UHumanoid_NPC_Control_Rig_High_C final : public UControlRig
{
public:
	int32                                         race_int;                                          // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         gender_int;                                        // 0x0634(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         gender_from_game;                                  // 0x0638(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         race_from_game;                                    // 0x063C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         race_current;                                      // 0x0640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         gender_current;                                    // 0x0644(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          trigger_update;                                    // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_moving;                                         // 0x0649(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          in_combat;                                         // 0x064A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64B[0x5];                                      // 0x064B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ground_pitch;                                      // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ground_roll;                                       // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pitch_roll_pelvis_lift;                            // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ground_degree;                                     // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pelvis_z_foot_stop;                                // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_height;                                 // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_height_adjusted;                        // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_depth_target_stand_min;                 // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_depth_target_stand_max;                 // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_depth_target_moving_min;                // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_trace_depth_target_moving_max;                // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          pelvis_side_trace_hit;                             // 0x06A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        foot_L_pitch_pos_max;                              // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_L_pitch_neg_max;                              // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_L_roll_pos_max;                               // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_L_roll_neg_max;                               // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_R_pitch_pos_max;                              // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_R_pitch_neg_max;                              // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_R_roll_pos_max;                               // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_R_roll_neg_max;                               // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pelvis_additional_pos_max;                         // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pelvis_additional_neg_max;                         // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pelvis_offset_push_up_max;                         // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pelvis_walking_z_Max;                              // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                foot_l;                                            // 0x0710(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          foot_L_hit_Bool;                                   // 0x0728(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                foot_L_hit;                                        // 0x0730(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                foot_r;                                            // 0x0748(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          foot_R_hit_Bool;                                   // 0x0760(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                foot_R_hit;                                        // 0x0768(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Humanoid_NPC_Control_Rig_High_C">();
	}
	static class UHumanoid_NPC_Control_Rig_High_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHumanoid_NPC_Control_Rig_High_C>();
	}
};
static_assert(alignof(UHumanoid_NPC_Control_Rig_High_C) == 0x000008, "Wrong alignment on UHumanoid_NPC_Control_Rig_High_C");
static_assert(sizeof(UHumanoid_NPC_Control_Rig_High_C) == 0x000780, "Wrong size on UHumanoid_NPC_Control_Rig_High_C");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, race_int) == 0x000630, "Member 'UHumanoid_NPC_Control_Rig_High_C::race_int' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, gender_int) == 0x000634, "Member 'UHumanoid_NPC_Control_Rig_High_C::gender_int' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, gender_from_game) == 0x000638, "Member 'UHumanoid_NPC_Control_Rig_High_C::gender_from_game' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, race_from_game) == 0x00063C, "Member 'UHumanoid_NPC_Control_Rig_High_C::race_from_game' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, race_current) == 0x000640, "Member 'UHumanoid_NPC_Control_Rig_High_C::race_current' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, gender_current) == 0x000644, "Member 'UHumanoid_NPC_Control_Rig_High_C::gender_current' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, trigger_update) == 0x000648, "Member 'UHumanoid_NPC_Control_Rig_High_C::trigger_update' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, is_moving) == 0x000649, "Member 'UHumanoid_NPC_Control_Rig_High_C::is_moving' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, in_combat) == 0x00064A, "Member 'UHumanoid_NPC_Control_Rig_High_C::in_combat' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, ground_pitch) == 0x000650, "Member 'UHumanoid_NPC_Control_Rig_High_C::ground_pitch' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, ground_roll) == 0x000658, "Member 'UHumanoid_NPC_Control_Rig_High_C::ground_roll' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, pitch_roll_pelvis_lift) == 0x000660, "Member 'UHumanoid_NPC_Control_Rig_High_C::pitch_roll_pelvis_lift' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, ground_degree) == 0x000668, "Member 'UHumanoid_NPC_Control_Rig_High_C::ground_degree' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, pelvis_z_foot_stop) == 0x000670, "Member 'UHumanoid_NPC_Control_Rig_High_C::pelvis_z_foot_stop' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_trace_height) == 0x000678, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_trace_height' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_trace_height_adjusted) == 0x000680, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_trace_height_adjusted' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_trace_depth_target_stand_min) == 0x000688, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_trace_depth_target_stand_min' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_trace_depth_target_stand_max) == 0x000690, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_trace_depth_target_stand_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_trace_depth_target_moving_min) == 0x000698, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_trace_depth_target_moving_min' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_trace_depth_target_moving_max) == 0x0006A0, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_trace_depth_target_moving_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, pelvis_side_trace_hit) == 0x0006A8, "Member 'UHumanoid_NPC_Control_Rig_High_C::pelvis_side_trace_hit' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_L_pitch_pos_max) == 0x0006B0, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_L_pitch_pos_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_L_pitch_neg_max) == 0x0006B8, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_L_pitch_neg_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_L_roll_pos_max) == 0x0006C0, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_L_roll_pos_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_L_roll_neg_max) == 0x0006C8, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_L_roll_neg_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_R_pitch_pos_max) == 0x0006D0, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_R_pitch_pos_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_R_pitch_neg_max) == 0x0006D8, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_R_pitch_neg_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_R_roll_pos_max) == 0x0006E0, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_R_roll_pos_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_R_roll_neg_max) == 0x0006E8, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_R_roll_neg_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, pelvis_additional_pos_max) == 0x0006F0, "Member 'UHumanoid_NPC_Control_Rig_High_C::pelvis_additional_pos_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, pelvis_additional_neg_max) == 0x0006F8, "Member 'UHumanoid_NPC_Control_Rig_High_C::pelvis_additional_neg_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, pelvis_offset_push_up_max) == 0x000700, "Member 'UHumanoid_NPC_Control_Rig_High_C::pelvis_offset_push_up_max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, pelvis_walking_z_Max) == 0x000708, "Member 'UHumanoid_NPC_Control_Rig_High_C::pelvis_walking_z_Max' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_l) == 0x000710, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_l' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_L_hit_Bool) == 0x000728, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_L_hit_Bool' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_L_hit) == 0x000730, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_L_hit' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_r) == 0x000748, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_r' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_R_hit_Bool) == 0x000760, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_R_hit_Bool' has a wrong offset!");
static_assert(offsetof(UHumanoid_NPC_Control_Rig_High_C, foot_R_hit) == 0x000768, "Member 'UHumanoid_NPC_Control_Rig_High_C::foot_R_hit' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass Humanoid_NPC_Control_Rig_High.RigVMMemory_Literal
// 0x1828 (0x1870 - 0x0048)
class Humanoid_NPC_Control_Rig_High::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	bool                                          RigVMModel___VariableNode_93_Value__Const;         // 0x0048(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___VariableNode_95_Value__Const;         // 0x0049(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_4_2_1_1_Item__Const;    // 0x004C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_4_2_1_1_Space__Const;   // 0x0058(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_Value__Const;   // 0x0060(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_4_2_1_1_Weight__Const;  // 0x0078(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_2_2_Item__Const;      // 0x007C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_Value__Const;     // 0x0088(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_2_1_Item__Const;    // 0x00A0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_Value__Const;   // 0x00B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_1_2_1_Item__Const;  // 0x00C8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_Value__Const; // 0x00D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_1_1_1_1_Item__Const; // 0x00F0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_Value__Const; // 0x0100(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_3_Item__Const;        // 0x0118(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_3_Value__Const;       // 0x0128(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_3_Item__Const;      // 0x0140(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_3_Value__Const;     // 0x0150(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_1_3_Item__Const;    // 0x0168(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_Value__Const;   // 0x0178(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_4_1_1_1_2_Item__Const;  // 0x0190(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_Value__Const; // 0x01A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_65_Value__Const;         // 0x01B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_60_Value__Const;         // 0x01C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_61_Value__Const;         // 0x01C8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_62_Value__Const;         // 0x01D0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_63_Value__Const;         // 0x01D8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_25_Value__Const;         // 0x01E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_26_Value__Const;         // 0x01E8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_27_Value__Const;         // 0x01F0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_28_Value__Const;         // 0x01F8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_29_Value__Const;         // 0x0200(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_33_Value__Const;         // 0x0208(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_35_Value__Const;         // 0x0210(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_36_Value__Const;         // 0x0218(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_Value__Const; // 0x0220(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_Value__Const;   // 0x0238(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_Value__Const; // 0x0250(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_Value__Const; // 0x0268(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_Value__Const; // 0x0280(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_Value__Const;     // 0x0298(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_Value__Const;   // 0x02B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_Value__Const; // 0x02C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_Value__Const; // 0x02E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_1_Value__Const; // 0x02F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_1_Value__Const; // 0x0310(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_Value__Const; // 0x0328(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_Value__Const; // 0x0340(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_1_Value__Const; // 0x0358(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_Value__Const; // 0x0370(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_Value__Const; // 0x0388(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_1_Value__Const; // 0x03A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_1_1_Value__Const; // 0x03B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_1_1_Value__Const; // 0x03D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_1_Value__Const; // 0x03E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_1_Value__Const; // 0x0400(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_1_1_Value__Const; // 0x0418(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_1_1_Value__Const; // 0x0430(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_1_Value__Const; // 0x0448(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_1_Value__Const; // 0x0460(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_65_3_Value__Const;       // 0x0478(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_1_1_Value__Const; // 0x0480(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_1_1_1_Value__Const; // 0x0498(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_1_1_1_Value__Const; // 0x04B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_1_1_Value__Const; // 0x04C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_1_1_Value__Const; // 0x04E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_1_1_1_Value__Const; // 0x04F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_1_1_1_Value__Const; // 0x0510(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_1_1_Value__Const; // 0x0528(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_1_1_Value__Const; // 0x0540(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_1_1_1_Value__Const; // 0x0558(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_Value__Const;     // 0x0570(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_Value__Const;       // 0x0588(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_Value__Const;     // 0x05A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_Value__Const;   // 0x05B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_Value__Const; // 0x05D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_Value__Const;         // 0x05E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_Value__Const;       // 0x0600(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_Value__Const;     // 0x0618(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_Value__Const;   // 0x0630(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_62_7_Value__Const;       // 0x0648(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_63_7_Value__Const;       // 0x0650(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_28_6_Value__Const;       // 0x0658(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_31_6_Value__Const;       // 0x0660(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___VariableNode_35_6_Value__Const;       // 0x0668(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_2_Value__Const;   // 0x0670(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_3_Value__Const;     // 0x0688(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_2_Value__Const;   // 0x06A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_2_Value__Const; // 0x06B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_2_Value__Const; // 0x06D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_4_Value__Const;       // 0x06E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_4_Value__Const;     // 0x0700(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_4_Value__Const;   // 0x0718(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_3_Value__Const; // 0x0730(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_2_Value__Const; // 0x0748(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_2_Value__Const; // 0x0760(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_2_Value__Const; // 0x0778(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_2_Value__Const; // 0x0790(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_2_Value__Const;   // 0x07A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_2_Value__Const; // 0x07C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_2_Value__Const; // 0x07D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_2_Value__Const; // 0x07F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_2_Value__Const; // 0x0808(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_2_Value__Const; // 0x0820(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_2_Value__Const; // 0x0838(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_2_Value__Const; // 0x0850(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_2_Value__Const;   // 0x0868(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_2_Value__Const; // 0x0880(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_2_Value__Const; // 0x0898(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_2_Value__Const; // 0x08B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_2_Value__Const; // 0x08C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_2_Value__Const; // 0x08E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_1_1_1_1_2_Value__Const; // 0x08F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_2_1_1_1_2_Value__Const; // 0x0910(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_1_1_1_1_2_Value__Const; // 0x0928(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_1_2_Value__Const; // 0x0940(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_1_2_Value__Const; // 0x0958(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_3_1_1_1_2_Value__Const; // 0x0970(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_3_1_1_1_2_Value__Const; // 0x0988(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_1_2_Value__Const; // 0x09A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_1_2_Value__Const; // 0x09B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_1_1_1_1_1_1_1_Value__Const; // 0x09D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_1_1_1_1_1_1_1_Value__Const; // 0x09E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_3_1_1_1_1_1_1_Value__Const; // 0x0A00(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_2_1_1_1_1_1_1_Value__Const; // 0x0A18(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_3_Value__Const;   // 0x0A30(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_4_Value__Const;     // 0x0A48(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_3_Value__Const;   // 0x0A60(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_3_Value__Const; // 0x0A78(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_3_Value__Const; // 0x0A90(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_5_Value__Const;       // 0x0AA8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_5_Value__Const;     // 0x0AC0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_5_Value__Const;   // 0x0AD8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_4_Value__Const; // 0x0AF0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_1_2_1_Value__Const; // 0x0B08(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_2_3_1_Value__Const;   // 0x0B20(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_2_2_1_Value__Const; // 0x0B38(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_2_2_1_Value__Const; // 0x0B50(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_1_2_1_Value__Const; // 0x0B68(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_4_1_Value__Const;     // 0x0B80(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_4_1_Value__Const;   // 0x0B98(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_4_1_Value__Const; // 0x0BB0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Set_Transform_4_1_1_1_3_1_Value__Const; // 0x0BC8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_1_1_Item__Const;  // 0x0BE0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_1_1_1_1_1_Space__Const; // 0x0BEC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BED[0x3];                                      // 0x0BED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_1_Item__Const;    // 0x0BF0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BFC[0x4];                                      // 0x0BFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__Pelvis_Trace_Down_foot_normal_hit_L__Const; // 0x0C00(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Pelvis_Trace_Down_foot_normal_hit_target__Const; // 0x0C20(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Pelvis_Trace_Down_foot_normal_hit_r__Const; // 0x0C40(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Pelvis_Trace_Down_foot_normal_hit_r_target__Const; // 0x0C60(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pelvis_Trace_Down___Pelvis_Trace_Down_Add_A__Const; // 0x0C80(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Pelvis_Trace_Down___Pelvis_Trace_Down_GetTransform_Space__Const; // 0x0C98(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Pelvis_Trace_Down___Pelvis_Trace_Down_GetTransform_bInitial__Const; // 0x0C99(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9A[0x6];                                      // 0x0C9A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Pelvis_Trace_Down___Pelvis_Trace_Down_Add_B__Const; // 0x0CA0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pelvis_Trace_Down___Pelvis_Trace_Down_Subtract_B__Const; // 0x0CB8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Pelvis_Trace_Down___Pelvis_Trace_Down_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0CD0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Pelvis_Trace_Down___Pelvis_Trace_Down_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0CE0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE4[0xC];                                      // 0x0CE4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Pelvis_Trace_Down___Pelvis_Trace_Down_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0CF0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Pelvis_Trace_Down___Pelvis_Trace_Down_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0D50(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D51[0x7];                                      // 0x0D51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                Pelvis_Trace_Down___Pelvis_Trace_Down_AimBoneMath_Primary__Const; // 0x0D58(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	ETraceTypeQuery                               Pelvis_Trace_Down___Pelvis_Trace_Down_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0DA0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA1[0x3];                                      // 0x0DA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Pelvis_Trace_Down___Pelvis_Trace_Down_SphereTraceByTraceChannel_Radius__Const; // 0x0DA4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                Pelvis_Trace_Down___Pelvis_Trace_Down_AimBoneMath_Secondary__Const; // 0x0DA8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         Pelvis_Trace_Down___Pelvis_Trace_Down_AimBoneMath_Weight__Const; // 0x0DF0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF4[0xC];                                      // 0x0DF4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         Pelvis_Trace_Down___Pelvis_Trace_Down_AimBoneMath_DebugSettings__Const; // 0x0E00(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathQuaternionToEuler_RotationOrder__Const; // 0x0E70(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E71[0x7];                                      // 0x0E71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RigVMModel___DISPATCH_RigVMDispatch_Print_1_Prefix__Const; // 0x0E78(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	float                                         RigVMModel___DISPATCH_RigVMDispatch_Print_1_ScreenDuration__Const; // 0x0E88(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___DISPATCH_RigVMDispatch_Print_1_ScreenColor__Const; // 0x0E8C(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9C[0x4];                                      // 0x0E9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RigVMModel___DISPATCH_RigVMDispatch_Print_2_Prefix__Const; // 0x0EA0(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	class FString                                 RigVMModel___DISPATCH_RigVMDispatch_Print_Prefix__Const; // 0x0EB0(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	class FString                                 RigVMModel___DISPATCH_RigVMDispatch_Print_3_Prefix__Const; // 0x0EC0(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_2_1_2_3_2_4_SourceMaximum__Const; // 0x0ED0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Multiply_B__Const;                    // 0x0ED8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Multiply_1_1_1_B__Const;              // 0x0EE0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Multiply_1_1_B__Const;                // 0x0EE8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0EF0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0F50(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F51[0x3];                                      // 0x0F51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
