#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Humanoid_NPC_AnimBP_AoC

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Humanoid_NPC_AnimBP_AoC.Humanoid_NPC_AnimBP_AoC_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Humanoid_NPC_AnimBP_AoC_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Humanoid_NPC_AnimBP_AoC_C_AnimGraph) == 0x000008, "Wrong alignment on Humanoid_NPC_AnimBP_AoC_C_AnimGraph");
static_assert(sizeof(Humanoid_NPC_AnimBP_AoC_C_AnimGraph) == 0x000010, "Wrong size on Humanoid_NPC_AnimBP_AoC_C_AnimGraph");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Humanoid_NPC_AnimBP_AoC_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Humanoid_NPC_AnimBP_AoC.Humanoid_NPC_AnimBP_AoC_C.BaseLayer
// 0x0010 (0x0010 - 0x0000)
struct Humanoid_NPC_AnimBP_AoC_C_BaseLayer final
{
public:
	struct FPoseLink                              BaseLayer_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Humanoid_NPC_AnimBP_AoC_C_BaseLayer) == 0x000008, "Wrong alignment on Humanoid_NPC_AnimBP_AoC_C_BaseLayer");
static_assert(sizeof(Humanoid_NPC_AnimBP_AoC_C_BaseLayer) == 0x000010, "Wrong size on Humanoid_NPC_AnimBP_AoC_C_BaseLayer");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_BaseLayer, BaseLayer_0) == 0x000000, "Member 'Humanoid_NPC_AnimBP_AoC_C_BaseLayer::BaseLayer_0' has a wrong offset!");

// Function Humanoid_NPC_AnimBP_AoC.Humanoid_NPC_AnimBP_AoC_C.BasePoses
// 0x0010 (0x0010 - 0x0000)
struct Humanoid_NPC_AnimBP_AoC_C_BasePoses final
{
public:
	struct FPoseLink                              BasePoses_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Humanoid_NPC_AnimBP_AoC_C_BasePoses) == 0x000008, "Wrong alignment on Humanoid_NPC_AnimBP_AoC_C_BasePoses");
static_assert(sizeof(Humanoid_NPC_AnimBP_AoC_C_BasePoses) == 0x000010, "Wrong size on Humanoid_NPC_AnimBP_AoC_C_BasePoses");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_BasePoses, BasePoses_0) == 0x000000, "Member 'Humanoid_NPC_AnimBP_AoC_C_BasePoses::BasePoses_0' has a wrong offset!");

// Function Humanoid_NPC_AnimBP_AoC.Humanoid_NPC_AnimBP_AoC_C.ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC
// 0x0028 (0x0028 - 0x0000)
struct Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_2;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_3;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_4;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC) == 0x000008, "Wrong alignment on Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC");
static_assert(sizeof(Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC) == 0x000028, "Wrong size on Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC, EntryPoint) == 0x000000, "Member 'Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC::EntryPoint' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000008, "Member 'Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC, CallFunc_GetCurveValue_ReturnValue_1) == 0x00000C, "Member 'Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC, CallFunc_GetCurveValue_ReturnValue_2) == 0x000010, "Member 'Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC::CallFunc_GetCurveValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC, CallFunc_GetCurveValue_ReturnValue_3) == 0x000014, "Member 'Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC::CallFunc_GetCurveValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC, CallFunc_GetCurveValue_ReturnValue_4) == 0x000018, "Member 'Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC::CallFunc_GetCurveValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'Humanoid_NPC_AnimBP_AoC_C_ExecuteUbergraph_Humanoid_NPC_AnimBP_AoC::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Humanoid_NPC_AnimBP_AoC.Humanoid_NPC_AnimBP_AoC_C.FootIK
// 0x0020 (0x0020 - 0x0000)
struct Humanoid_NPC_AnimBP_AoC_C_FootIK final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FootIK_0;                                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Humanoid_NPC_AnimBP_AoC_C_FootIK) == 0x000008, "Wrong alignment on Humanoid_NPC_AnimBP_AoC_C_FootIK");
static_assert(sizeof(Humanoid_NPC_AnimBP_AoC_C_FootIK) == 0x000020, "Wrong size on Humanoid_NPC_AnimBP_AoC_C_FootIK");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_FootIK, InPose) == 0x000000, "Member 'Humanoid_NPC_AnimBP_AoC_C_FootIK::InPose' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_FootIK, FootIK_0) == 0x000010, "Member 'Humanoid_NPC_AnimBP_AoC_C_FootIK::FootIK_0' has a wrong offset!");

// Function Humanoid_NPC_AnimBP_AoC.Humanoid_NPC_AnimBP_AoC_C.HandIK
// 0x0020 (0x0020 - 0x0000)
struct Humanoid_NPC_AnimBP_AoC_C_HandIK final
{
public:
	struct FPoseLink                              InputPose;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HandIK_0;                                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Humanoid_NPC_AnimBP_AoC_C_HandIK) == 0x000008, "Wrong alignment on Humanoid_NPC_AnimBP_AoC_C_HandIK");
static_assert(sizeof(Humanoid_NPC_AnimBP_AoC_C_HandIK) == 0x000020, "Wrong size on Humanoid_NPC_AnimBP_AoC_C_HandIK");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_HandIK, InputPose) == 0x000000, "Member 'Humanoid_NPC_AnimBP_AoC_C_HandIK::InputPose' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_HandIK, HandIK_0) == 0x000010, "Member 'Humanoid_NPC_AnimBP_AoC_C_HandIK::HandIK_0' has a wrong offset!");

// Function Humanoid_NPC_AnimBP_AoC.Humanoid_NPC_AnimBP_AoC_C.LayerBleding
// 0x0040 (0x0040 - 0x0000)
struct Humanoid_NPC_AnimBP_AoC_C_LayerBleding final
{
public:
	struct FPoseLink                              BaseLayerInput;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              OverlayLayerInput;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              BasePosesInput;                                    // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LayerBleding_0;                                    // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Humanoid_NPC_AnimBP_AoC_C_LayerBleding) == 0x000008, "Wrong alignment on Humanoid_NPC_AnimBP_AoC_C_LayerBleding");
static_assert(sizeof(Humanoid_NPC_AnimBP_AoC_C_LayerBleding) == 0x000040, "Wrong size on Humanoid_NPC_AnimBP_AoC_C_LayerBleding");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_LayerBleding, BaseLayerInput) == 0x000000, "Member 'Humanoid_NPC_AnimBP_AoC_C_LayerBleding::BaseLayerInput' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_LayerBleding, OverlayLayerInput) == 0x000010, "Member 'Humanoid_NPC_AnimBP_AoC_C_LayerBleding::OverlayLayerInput' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_LayerBleding, BasePosesInput) == 0x000020, "Member 'Humanoid_NPC_AnimBP_AoC_C_LayerBleding::BasePosesInput' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_LayerBleding, LayerBleding_0) == 0x000030, "Member 'Humanoid_NPC_AnimBP_AoC_C_LayerBleding::LayerBleding_0' has a wrong offset!");

// Function Humanoid_NPC_AnimBP_AoC.Humanoid_NPC_AnimBP_AoC_C.OverlayLayer
// 0x0010 (0x0010 - 0x0000)
struct Humanoid_NPC_AnimBP_AoC_C_OverlayLayer final
{
public:
	struct FPoseLink                              OverlayLayer_0;                                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Humanoid_NPC_AnimBP_AoC_C_OverlayLayer) == 0x000008, "Wrong alignment on Humanoid_NPC_AnimBP_AoC_C_OverlayLayer");
static_assert(sizeof(Humanoid_NPC_AnimBP_AoC_C_OverlayLayer) == 0x000010, "Wrong size on Humanoid_NPC_AnimBP_AoC_C_OverlayLayer");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC_C_OverlayLayer, OverlayLayer_0) == 0x000000, "Member 'Humanoid_NPC_AnimBP_AoC_C_OverlayLayer::OverlayLayer_0' has a wrong offset!");

}

