#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Humanoid_NPC_AnimBP_AoC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Humanoid_NPC_AnimBP_AoC.Humanoid_NPC_AnimBP_AoC_C.AnimBlueprintGeneratedConstantData
// 0x0477 (0x0478 - 0x0001)
struct Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_3211;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3212;                              // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_3213;                              // 0x0020(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_3214;                               // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3215;                               // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3216;                               // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3217;                               // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3218;                               // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3219;                               // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3220;                               // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3221;                               // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3222;                               // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3223;                               // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3224;                               // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3225;                               // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3226;                               // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3227;                               // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3228;                               // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3229;                               // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3230;                               // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_3231;                              // 0x00B8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_3232;                               // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_3233;                           // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_3234;                               // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3235;                               // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3236;                                // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3237;                               // 0x00EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3238;                               // 0x00F4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3239;                               // 0x00FC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3240;                                // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3241;                               // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_3242;                           // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_3243;                               // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3244;                               // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3245;                                // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3246;                               // 0x012C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_3247;                           // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_3248;                               // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3249;                               // 0x0148(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3250;                                // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3251;                               // 0x0154(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3252;                                // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3253;                              // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3254;                               // 0x0164(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_3255;                           // 0x0170(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_3256;                               // 0x0178(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3257;                               // 0x0180(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3258;                                // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3259;                               // 0x018C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_3260;                           // 0x0198(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_3261;                               // 0x01A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3262;                               // 0x01A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3263;                                // 0x01B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_3264;                               // 0x01B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_3265;                               // 0x01B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_3266;                              // 0x01C0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_3267;                               // 0x01D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_3268;                              // 0x01D8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_3269;                               // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3270;                               // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3271;                              // 0x01F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_3272;                           // 0x0200(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_3273;                               // 0x0208(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3274;                               // 0x0210(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3275;                                // 0x0218(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_3276;                           // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_3277;                              // 0x0228(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3278;                               // 0x022C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3279;                              // 0x0234(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_3280;                           // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_3281;                               // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3282;                               // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3283;                                // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3284;                              // 0x0254(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3285;                              // 0x0258(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3286;                               // 0x025C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3287;                                // 0x0264(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3288;                              // 0x0268(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_3289;                           // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_3290;                               // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3291;                               // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3292;                                // 0x0288(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3293;                              // 0x0290(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_3294;                              // 0x02A0(0x0010)(BlueprintVisible)
	float                                         __FloatProperty_3295;                              // 0x02B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_3296;                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_3297;                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_3298;                               // 0x02C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_3299;                               // 0x02CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3300;                               // 0x02D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3301;                                // 0x02DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3302;                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_3303;                               // 0x02E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_3304;                           // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_3305;                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3306;                               // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_3307;                              // 0x0308(0x0010)(BlueprintVisible, EditFixedSize)
	EBlendListTransitionType                      __EnumProperty_3308;                               // 0x0318(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3309;                              // 0x0320(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_3310;                              // 0x0330(0x0010)(BlueprintVisible)
	bool                                          __BoolProperty_3311;                               // 0x0340(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3312;                              // 0x0344(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_3313;                             // 0x0348(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_3314;                              // 0x0374(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_3315;                               // 0x0378(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_3316;                               // 0x0379(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A[0x2];                                      // 0x037A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_3317;                               // 0x037C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3318;                              // 0x0388(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_3319;                               // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_3320;                                 // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_3321;                               // 0x03A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_3322;                               // 0x03A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_3323;                               // 0x03AA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB[0x5];                                      // 0x03AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3324;                              // 0x03B0(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_3325;                             // 0x03C0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x03E0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0460(0x0018)()
};
static_assert(alignof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData) == 0x000478, "Wrong size on Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3211) == 0x000004, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3211' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3212) == 0x000010, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3212' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3213) == 0x000020, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3213' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3214) == 0x000030, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3214' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3215) == 0x000038, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3215' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3216) == 0x000040, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3216' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3217) == 0x000048, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3217' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3218) == 0x000050, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3218' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3219) == 0x000058, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3219' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3220) == 0x000060, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3220' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3221) == 0x000068, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3221' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3222) == 0x000070, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3222' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3223) == 0x000078, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3223' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3224) == 0x000080, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3224' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3225) == 0x000088, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3225' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3226) == 0x000090, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3226' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3227) == 0x000098, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3227' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3228) == 0x0000A0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3228' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3229) == 0x0000A8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3229' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3230) == 0x0000B0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3230' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3231) == 0x0000B8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3231' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3232) == 0x0000C8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3232' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_3233) == 0x0000D0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_3233' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3234) == 0x0000D8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3234' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3235) == 0x0000E0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3235' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __IntProperty_3236) == 0x0000E8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__IntProperty_3236' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3237) == 0x0000EC, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3237' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3238) == 0x0000F4, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3238' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3239) == 0x0000FC, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3239' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __IntProperty_3240) == 0x000104, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__IntProperty_3240' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3241) == 0x000108, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3241' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_3242) == 0x000110, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_3242' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3243) == 0x000118, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3243' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3244) == 0x000120, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3244' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __IntProperty_3245) == 0x000128, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__IntProperty_3245' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3246) == 0x00012C, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3246' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_3247) == 0x000138, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_3247' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3248) == 0x000140, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3248' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3249) == 0x000148, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3249' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __IntProperty_3250) == 0x000150, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__IntProperty_3250' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3251) == 0x000154, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3251' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __IntProperty_3252) == 0x00015C, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__IntProperty_3252' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __FloatProperty_3253) == 0x000160, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__FloatProperty_3253' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3254) == 0x000164, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3254' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_3255) == 0x000170, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_3255' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3256) == 0x000178, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3256' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3257) == 0x000180, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3257' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __IntProperty_3258) == 0x000188, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__IntProperty_3258' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3259) == 0x00018C, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3259' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_3260) == 0x000198, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_3260' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3261) == 0x0001A0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3261' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3262) == 0x0001A8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3262' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __IntProperty_3263) == 0x0001B0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__IntProperty_3263' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ByteProperty_3264) == 0x0001B4, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ByteProperty_3264' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3265) == 0x0001B8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3265' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3266) == 0x0001C0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3266' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3267) == 0x0001D0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3267' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3268) == 0x0001D8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3268' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3269) == 0x0001E8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3269' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3270) == 0x0001F0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3270' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __FloatProperty_3271) == 0x0001F8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__FloatProperty_3271' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_3272) == 0x000200, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_3272' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3273) == 0x000208, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3273' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3274) == 0x000210, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3274' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __IntProperty_3275) == 0x000218, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__IntProperty_3275' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_3276) == 0x000220, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_3276' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __FloatProperty_3277) == 0x000228, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__FloatProperty_3277' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3278) == 0x00022C, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3278' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __FloatProperty_3279) == 0x000234, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__FloatProperty_3279' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_3280) == 0x000238, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_3280' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3281) == 0x000240, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3281' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3282) == 0x000248, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3282' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __IntProperty_3283) == 0x000250, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__IntProperty_3283' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __FloatProperty_3284) == 0x000254, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__FloatProperty_3284' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __FloatProperty_3285) == 0x000258, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__FloatProperty_3285' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3286) == 0x00025C, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3286' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __IntProperty_3287) == 0x000264, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__IntProperty_3287' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __FloatProperty_3288) == 0x000268, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__FloatProperty_3288' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_3289) == 0x000270, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_3289' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3290) == 0x000278, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3290' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3291) == 0x000280, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3291' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __IntProperty_3292) == 0x000288, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__IntProperty_3292' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3293) == 0x000290, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3293' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3294) == 0x0002A0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3294' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __FloatProperty_3295) == 0x0002B0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__FloatProperty_3295' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_3296) == 0x0002B8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_3296' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_3297) == 0x0002C0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_3297' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __EnumProperty_3298) == 0x0002C8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__EnumProperty_3298' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3299) == 0x0002CC, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3299' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3300) == 0x0002D4, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3300' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __IntProperty_3301) == 0x0002DC, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__IntProperty_3301' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3302) == 0x0002E0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3302' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ByteProperty_3303) == 0x0002E8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ByteProperty_3303' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_3304) == 0x0002F0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_3304' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3305) == 0x0002F8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3305' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3306) == 0x000300, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3306' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3307) == 0x000308, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3307' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __EnumProperty_3308) == 0x000318, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__EnumProperty_3308' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3309) == 0x000320, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3309' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3310) == 0x000330, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3310' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __BoolProperty_3311) == 0x000340, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__BoolProperty_3311' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __FloatProperty_3312) == 0x000344, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__FloatProperty_3312' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __StructProperty_3313) == 0x000348, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__StructProperty_3313' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __FloatProperty_3314) == 0x000374, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__FloatProperty_3314' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __EnumProperty_3315) == 0x000378, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__EnumProperty_3315' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ByteProperty_3316) == 0x000379, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ByteProperty_3316' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __NameProperty_3317) == 0x00037C, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__NameProperty_3317' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3318) == 0x000388, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3318' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __BlendProfile_3319) == 0x000398, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__BlendProfile_3319' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __CurveFloat_3320) == 0x0003A0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__CurveFloat_3320' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __BoolProperty_3321) == 0x0003A8, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__BoolProperty_3321' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __EnumProperty_3322) == 0x0003A9, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__EnumProperty_3322' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __EnumProperty_3323) == 0x0003AA, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__EnumProperty_3323' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3324) == 0x0003B0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3324' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, __StructProperty_3325) == 0x0003C0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::__StructProperty_3325' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0003E0, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000460, "Member 'Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Humanoid_NPC_AnimBP_AoC.Humanoid_NPC_AnimBP_AoC_C.AnimBlueprintGeneratedMutableData
// 0x0043 (0x0044 - 0x0001)
struct Humanoid_NPC_AnimBP_AoC::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_2;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x002D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x002E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x002F(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0032(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x0033(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_18;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_19;                                 // 0x0035(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0036(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_21;                                 // 0x0037(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_22;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_23;                                 // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_24;                                 // 0x003A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
