#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Intrepid

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Intrepid.IntrepidSystemManager.Cleanup
// 0x0008 (0x0008 - 0x0000)
struct IntrepidSystemManager_Cleanup final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IntrepidSystemManager_Cleanup) == 0x000008, "Wrong alignment on IntrepidSystemManager_Cleanup");
static_assert(sizeof(IntrepidSystemManager_Cleanup) == 0x000008, "Wrong size on IntrepidSystemManager_Cleanup");
static_assert(offsetof(IntrepidSystemManager_Cleanup, World) == 0x000000, "Member 'IntrepidSystemManager_Cleanup::World' has a wrong offset!");

// Function Intrepid.IntrepidSystemManager.HandleActorEndPlay
// 0x0010 (0x0010 - 0x0000)
struct IntrepidSystemManager_HandleActorEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(IntrepidSystemManager_HandleActorEndPlay) == 0x000008, "Wrong alignment on IntrepidSystemManager_HandleActorEndPlay");
static_assert(sizeof(IntrepidSystemManager_HandleActorEndPlay) == 0x000010, "Wrong size on IntrepidSystemManager_HandleActorEndPlay");
static_assert(offsetof(IntrepidSystemManager_HandleActorEndPlay, Actor) == 0x000000, "Member 'IntrepidSystemManager_HandleActorEndPlay::Actor' has a wrong offset!");
static_assert(offsetof(IntrepidSystemManager_HandleActorEndPlay, EndPlayReason) == 0x000008, "Member 'IntrepidSystemManager_HandleActorEndPlay::EndPlayReason' has a wrong offset!");

// Function Intrepid.IntrepidSystemManager.HandleComponentEndPlay
// 0x0008 (0x0008 - 0x0000)
struct IntrepidSystemManager_HandleComponentEndPlay final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IntrepidSystemManager_HandleComponentEndPlay) == 0x000008, "Wrong alignment on IntrepidSystemManager_HandleComponentEndPlay");
static_assert(sizeof(IntrepidSystemManager_HandleComponentEndPlay) == 0x000008, "Wrong size on IntrepidSystemManager_HandleComponentEndPlay");
static_assert(offsetof(IntrepidSystemManager_HandleComponentEndPlay, Object) == 0x000000, "Member 'IntrepidSystemManager_HandleComponentEndPlay::Object' has a wrong offset!");

}

