#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IntrepidNetCore

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class IntrepidNetCore.AnalyticsLightProfiler
// 0x00A8 (0x00F0 - 0x0048)
class UAnalyticsLightProfiler final : public UObject
{
public:
	uint8                                         Pad_48[0xA0];                                      // 0x0048(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnabled;                                          // 0x00E8(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnalyticsLightProfiler">();
	}
	static class UAnalyticsLightProfiler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnalyticsLightProfiler>();
	}
};
static_assert(alignof(UAnalyticsLightProfiler) == 0x000008, "Wrong alignment on UAnalyticsLightProfiler");
static_assert(sizeof(UAnalyticsLightProfiler) == 0x0000F0, "Wrong size on UAnalyticsLightProfiler");
static_assert(offsetof(UAnalyticsLightProfiler, bEnabled) == 0x0000E8, "Member 'UAnalyticsLightProfiler::bEnabled' has a wrong offset!");

// Class IntrepidNetCore.IntrepidNetCoreService
// 0x0020 (0x0068 - 0x0048)
class UIntrepidNetCoreService : public UObject
{
public:
	float                                         AnalyticsUpdateThrottleS;                          // 0x0048(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C[0x1C];                                      // 0x004C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IntrepidNetCoreService">();
	}
	static class UIntrepidNetCoreService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetCoreService>();
	}
};
static_assert(alignof(UIntrepidNetCoreService) == 0x000008, "Wrong alignment on UIntrepidNetCoreService");
static_assert(sizeof(UIntrepidNetCoreService) == 0x000068, "Wrong size on UIntrepidNetCoreService");
static_assert(offsetof(UIntrepidNetCoreService, AnalyticsUpdateThrottleS) == 0x000048, "Member 'UIntrepidNetCoreService::AnalyticsUpdateThrottleS' has a wrong offset!");

}

