#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IterateMeshesAlongSpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "Engine_structs.hpp"
#include "PCG_structs.hpp"
#include "S_RoadSetDressingData_structs.hpp"


namespace SDK::Params
{

// Function IterateMeshesAlongSpline.IterateMeshesAlongSpline_C.Assign Length
// 0x0300 (0x0300 - 0x0000)
struct IterateMeshesAlongSpline_C_Assign_Length final
{
public:
	struct FAoCSplineMeshEntry                    Entry;                                             // 0x0000(0x0100)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FRandomStream                          Stream;                                            // 0x0100(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	double                                        Total_Length;                                      // 0x0108(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scaled_Mesh_Length;                                // 0x0110(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x0118(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Random_Padding;                                    // 0x0120(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Random_Scale;                                      // 0x0124(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Local_Stream;                                      // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Origin;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Extents;       // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x01B0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin;              // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent;           // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius;        // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               Temp_byte_Variable;                                // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1; // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IterateMeshesAlongSpline_C_Assign_Length) == 0x000010, "Wrong alignment on IterateMeshesAlongSpline_C_Assign_Length");
static_assert(sizeof(IterateMeshesAlongSpline_C_Assign_Length) == 0x000300, "Wrong size on IterateMeshesAlongSpline_C_Assign_Length");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Entry) == 0x000000, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Entry' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Stream) == 0x000100, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Stream' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Total_Length) == 0x000108, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Total_Length' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Scaled_Mesh_Length) == 0x000110, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Scaled_Mesh_Length' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Scale) == 0x000118, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Scale' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Random_Padding) == 0x000120, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Random_Padding' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Random_Scale) == 0x000124, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Random_Scale' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Local_Stream) == 0x000128, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Local_Stream' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Temp_bool_Variable) == 0x000130, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector_X) == 0x000138, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector_Y) == 0x000140, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector_Z) == 0x000148, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector2D_X) == 0x000150, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector2D_Y) == 0x000158, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000160, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Abs_ReturnValue) == 0x000168, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_EditorGetBoundsFromUObject_Origin) == 0x000170, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_EditorGetBoundsFromUObject_Origin' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_EditorGetBoundsFromUObject_Extents) == 0x000188, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_EditorGetBoundsFromUObject_Extents' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, K2Node_DynamicCast_AsStatic_Mesh) == 0x0001A0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_IsValid_ReturnValue) == 0x0001A9, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_GetBounds_ReturnValue) == 0x0001B0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakBoxSphereBounds_Origin) == 0x0001E8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakBoxSphereBounds_Origin' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakBoxSphereBounds_BoxExtent) == 0x000200, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakBoxSphereBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakBoxSphereBounds_SphereRadius) == 0x000218, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakBoxSphereBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_SelectVector_ReturnValue) == 0x000220, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000238, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector_X_1) == 0x000240, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector_Y_1) == 0x000248, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector_Z_1) == 0x000250, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x000258, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000260, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000268, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000270, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_FMax_ReturnValue) == 0x000278, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000280, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_SelectVector_ReturnValue_1) == 0x000288, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Temp_byte_Variable) == 0x0002A0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, K2Node_Select_Default) == 0x0002A8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0002B0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0002B8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0002C0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0002C8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x0002D0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0002D8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_SelectFloat_ReturnValue) == 0x0002E0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast) == 0x0002E8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1) == 0x0002EC, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0002F0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x0002F8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");

// Function IterateMeshesAlongSpline.IterateMeshesAlongSpline_C.Choose Next Mesh Entry
// 0x0AD0 (0x0AD0 - 0x0000)
struct IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry final
{
public:
	TArray<struct FIterationPointData>            Point_Data_Array;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FAoCSplineMeshEntry>            Mesh_Entry_List;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Consecutive_Index;                                 // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Mesh_Found;                                        // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0xB];                                       // 0x0025(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIterationPointData                    Point_Data;                                        // 0x0030(0x0320)(Parm, OutParm)
	struct FAoCSplineMeshEntry                    Entry_to_Check;                                    // 0x0350(0x0100)(Edit, BlueprintVisible)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0xF];                                      // 0x0461(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIterationPointData                    CallFunc_Array_Get_Item;                           // 0x0470(0x0320)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0794(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue; // 0x0795(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_796[0xA];                                      // 0x0796(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIterationPointData                    CallFunc_Array_RandomFromStream_OutItem;           // 0x07A0(0x0320)()
	int32                                         CallFunc_Array_RandomFromStream_OutIndex;          // 0x0AC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry) == 0x000010, "Wrong alignment on IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry");
static_assert(sizeof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry) == 0x000AD0, "Wrong size on IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Point_Data_Array) == 0x000000, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Point_Data_Array' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Mesh_Entry_List) == 0x000010, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Mesh_Entry_List' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Consecutive_Index) == 0x000020, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Consecutive_Index' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Mesh_Found) == 0x000024, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Mesh_Found' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Point_Data) == 0x000030, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Point_Data' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Entry_to_Check) == 0x000350, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Entry_to_Check' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000450, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Temp_int_Loop_Counter_Variable) == 0x000454, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Add_IntInt_ReturnValue) == 0x000458, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Temp_int_Array_Index_Variable) == 0x00045C, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000460, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Array_Get_Item) == 0x000470, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Array_Length_ReturnValue) == 0x000790, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Less_IntInt_ReturnValue) == 0x000794, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_EqualEqual_SoftObjectReference_ReturnValue) == 0x000795, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_EqualEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Array_RandomFromStream_OutItem) == 0x0007A0, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Array_RandomFromStream_OutItem' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Array_RandomFromStream_OutIndex) == 0x000AC0, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Array_RandomFromStream_OutIndex' has a wrong offset!");

// Function IterateMeshesAlongSpline.IterateMeshesAlongSpline_C.ExecuteWithContext
// 0x24C0 (0x24C0 - 0x0000)
struct IterateMeshesAlongSpline_C_ExecuteWithContext final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Input;                                             // 0x00B8(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Output;                                            // 0x00D8(0x0020)(Parm, OutParm)
	TArray<struct FVector>                        Reversed_Spline_Tangents;                          // 0x00F8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector>                        Reversed_Spline_Points;                            // 0x0108(0x0010)(Edit, BlueprintVisible)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGPoint                              Point_to_Test;                                     // 0x0120(0x00D0)(Edit, BlueprintVisible, NoDestructor)
	struct FPCGPoint                              Brick_To_Check;                                    // 0x01F0(0x00D0)(Edit, BlueprintVisible, NoDestructor)
	class USplineComponent*                       Spline_to_Check;                                   // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Stack_End_Gap_Offset;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_Last_Entry_Scaled_Length;                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_Last_Entry_Random_Padding;                    // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Temp_New_Rot;                                      // 0x02E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Final_Point_Index;                                 // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGPoint                              Final_Point;                                       // 0x0300(0x00D0)(Edit, BlueprintVisible, NoDestructor)
	class UPCGPointData*                          Final_Out_Data;                                    // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPCGMetadata*                           Final_Metadata;                                    // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPCGPoint>                      Final_Out_Points;                                  // 0x03E0(0x0010)(Edit, BlueprintVisible)
	bool                                          Filling_Spline;                                    // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ready_to_Scale;                                    // 0x03F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Override_First_Mesh_0;                             // 0x03F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Override_Last_Mesh_0;                              // 0x03F3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Stack;                                     // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mesh_Entry_Index;                                  // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Corrected_Last_Index_On_Spline;                    // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mesh_Start_Index;                                  // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Point_Index;                               // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Next_Point_Location;                               // 0x0408(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Current_Point_Location;                            // 0x0420(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_New_Pos;                                      // 0x0438(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIterationPointData                    Override_End_Iteration_Point;                      // 0x0450(0x0320)(Edit, BlueprintVisible)
	struct FIterationPointData                    Current_Iteration_Data;                            // 0x0770(0x0320)(Edit, BlueprintVisible)
	struct FIterationPointData                    Active_Iteration_Data;                             // 0x0A90(0x0320)(Edit, BlueprintVisible)
	struct FAoCSplineMeshEntry                    Current_Entry;                                     // 0x0DB0(0x0100)(Edit, BlueprintVisible)
	struct FPCGPoint                              Active_Point;                                      // 0x0EB0(0x00D0)(Edit, BlueprintVisible, NoDestructor)
	TArray<struct FAoCSplineMeshEntry>            Mesh_Entry_List;                                   // 0x0F80(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPCGPoint>                      All_Points;                                        // 0x0F90(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0FA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA1[0x7];                                      // 0x0FA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_RoadSetDressingData>         CallFunc_Retrieve_Set_Dressing_Data_Set_Dressing_Data; // 0x0FA8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Retrieve_Set_Dressing_Data_Is_Intersection; // 0x0FB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0FB9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0FBA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0FBB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FBC[0x4];                                      // 0x0FBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0FC0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0FD8(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0FE8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorArrayAverage_ReturnValue;        // 0x1000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x1018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Should_Break_Variable;                   // 0x101C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x101D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101E[0x2];                                     // 0x101E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x1020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1024[0x4];                                     // 0x1024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGMetadata*                           CallFunc_MutableMetadata_ReturnValue;              // 0x1028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x1030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Current_Loop_Index_Variable;              // 0x1034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x1038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1039[0x3];                                     // 0x1039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x103C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x1040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x1041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x1042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1043[0x5];                                     // 0x1043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAoCSplineMeshEntry>            K2Node_Select_Default;                             // 0x1048(0x0010)(ReferenceParm)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x1058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x1060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Origin;        // 0x1070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Extents;       // 0x1088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x10A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x10A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x10A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10AA[0x6];                                     // 0x10AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x10B0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin;              // 0x10E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent;           // 0x1100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius;        // 0x1118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x111C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x1120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x1128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x1130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1134[0x4];                                     // 0x1134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x1138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x1140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x1158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x115C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x1160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x1164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1165[0x3];                                     // 0x1165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x1168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x1180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1184[0x4];                                     // 0x1184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x1188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x1190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x1198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x11A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x11A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x11B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x11B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x11D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D1[0x3];                                     // 0x11D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x11D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x11D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11DC[0x4];                                     // 0x11DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCSplineMeshEntry                    CallFunc_Array_Get_Item;                           // 0x11E0(0x0100)()
	int32                                         Temp_int_Variable_1;                               // 0x12E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x12E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x12E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12E6[0x2];                                     // 0x12E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x12E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x12EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x12F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12F1[0x3];                                     // 0x12F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x12F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x12F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x12FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x1300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x1304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1305[0x3];                                     // 0x1305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x1308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x1310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtLocation_ReturnValue; // 0x1328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtLocation_ReturnValue_1; // 0x132C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x1330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x1338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x1340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x1348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1349[0x7];                                     // 0x1349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x1350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x1368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x1380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromY_ReturnValue;                 // 0x1398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x13B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x13C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x13CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x13D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x13D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x13D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x13DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x13E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x13F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x1410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x1418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x1420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x1424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x1428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x1430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x1438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x1440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x1448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144C[0x4];                                     // 0x144C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x1450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               Temp_byte_Variable;                                // 0x1458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1459[0x3];                                     // 0x1459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x145C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x1460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1464[0x4];                                     // 0x1464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x1468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x1470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1471[0x7];                                     // 0x1471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Origin_1;      // 0x1478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Extents_1;     // 0x1490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh_1;                // 0x14A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x14B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
