#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IterateMeshesAlongSpline

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PCG_structs.hpp"


namespace SDK::Params
{

// Function IterateMeshesAlongSpline.IterateMeshesAlongSpline_C.Assign Length
// 0x02D0 (0x02D0 - 0x0000)
struct IterateMeshesAlongSpline_C_Assign_Length final
{
public:
	struct FAoCSplineMeshEntry                    Entry;                                             // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FRandomStream                          Stream;                                            // 0x00D0(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	double                                        Total_Length;                                      // 0x00D8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scaled_Mesh_Length;                                // 0x00E0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x00E8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Random_Padding;                                    // 0x00F0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Random_Scale;                                      // 0x00F4(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Local_Stream;                                      // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Origin;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Extents;       // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x0180(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin;              // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent;           // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius;        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               Temp_byte_Variable;                                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1; // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IterateMeshesAlongSpline_C_Assign_Length) == 0x000010, "Wrong alignment on IterateMeshesAlongSpline_C_Assign_Length");
static_assert(sizeof(IterateMeshesAlongSpline_C_Assign_Length) == 0x0002D0, "Wrong size on IterateMeshesAlongSpline_C_Assign_Length");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Entry) == 0x000000, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Entry' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Stream) == 0x0000D0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Stream' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Total_Length) == 0x0000D8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Total_Length' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Scaled_Mesh_Length) == 0x0000E0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Scaled_Mesh_Length' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Scale) == 0x0000E8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Scale' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Random_Padding) == 0x0000F0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Random_Padding' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Random_Scale) == 0x0000F4, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Random_Scale' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Local_Stream) == 0x0000F8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Local_Stream' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Temp_bool_Variable) == 0x000100, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector_X) == 0x000108, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector_Y) == 0x000110, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector_Z) == 0x000118, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector2D_X) == 0x000120, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector2D_Y) == 0x000128, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000130, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Abs_ReturnValue) == 0x000138, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_EditorGetBoundsFromUObject_Origin) == 0x000140, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_EditorGetBoundsFromUObject_Origin' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_EditorGetBoundsFromUObject_Extents) == 0x000158, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_EditorGetBoundsFromUObject_Extents' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, K2Node_DynamicCast_AsStatic_Mesh) == 0x000170, "Member 'IterateMeshesAlongSpline_C_Assign_Length::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'IterateMeshesAlongSpline_C_Assign_Length::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_IsValid_ReturnValue) == 0x000179, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_GetBounds_ReturnValue) == 0x000180, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakBoxSphereBounds_Origin) == 0x0001B8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakBoxSphereBounds_Origin' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakBoxSphereBounds_BoxExtent) == 0x0001D0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakBoxSphereBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakBoxSphereBounds_SphereRadius) == 0x0001E8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakBoxSphereBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_SelectVector_ReturnValue) == 0x0001F0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000208, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector_X_1) == 0x000210, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector_Y_1) == 0x000218, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_BreakVector_Z_1) == 0x000220, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x000228, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000230, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000238, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000240, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_FMax_ReturnValue) == 0x000248, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000250, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_SelectVector_ReturnValue_1) == 0x000258, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, Temp_byte_Variable) == 0x000270, "Member 'IterateMeshesAlongSpline_C_Assign_Length::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, K2Node_Select_Default) == 0x000278, "Member 'IterateMeshesAlongSpline_C_Assign_Length::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000280, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000288, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000290, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000298, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x0002A0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0002A8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_SelectFloat_ReturnValue) == 0x0002B0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast) == 0x0002B8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1) == 0x0002BC, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0002C0, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Assign_Length, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x0002C8, "Member 'IterateMeshesAlongSpline_C_Assign_Length::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");

// Function IterateMeshesAlongSpline.IterateMeshesAlongSpline_C.Choose Next Mesh Entry
// 0x0A10 (0x0A10 - 0x0000)
struct IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry final
{
public:
	TArray<struct FIterationPointData>            Point_Data_Array;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FAoCSplineMeshEntry>            Mesh_Entry_List;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Consecutive_Index;                                 // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Mesh_Found;                                        // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0xB];                                       // 0x0025(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIterationPointData                    Point_Data;                                        // 0x0030(0x02F0)(Parm, OutParm)
	struct FAoCSplineMeshEntry                    Entry_to_Check;                                    // 0x0320(0x00D0)(Edit, BlueprintVisible)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x3];                                      // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0xF];                                      // 0x0401(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIterationPointData                    CallFunc_Array_Get_Item;                           // 0x0410(0x02F0)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0704(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue; // 0x0705(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_706[0xA];                                      // 0x0706(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIterationPointData                    CallFunc_Array_RandomFromStream_OutItem;           // 0x0710(0x02F0)()
	int32                                         CallFunc_Array_RandomFromStream_OutIndex;          // 0x0A00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry) == 0x000010, "Wrong alignment on IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry");
static_assert(sizeof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry) == 0x000A10, "Wrong size on IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Point_Data_Array) == 0x000000, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Point_Data_Array' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Mesh_Entry_List) == 0x000010, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Mesh_Entry_List' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Consecutive_Index) == 0x000020, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Consecutive_Index' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Mesh_Found) == 0x000024, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Mesh_Found' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Point_Data) == 0x000030, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Point_Data' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Entry_to_Check) == 0x000320, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Entry_to_Check' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0003F0, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Temp_int_Loop_Counter_Variable) == 0x0003F4, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Add_IntInt_ReturnValue) == 0x0003F8, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, Temp_int_Array_Index_Variable) == 0x0003FC, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000400, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Array_Get_Item) == 0x000410, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Array_Length_ReturnValue) == 0x000700, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Less_IntInt_ReturnValue) == 0x000704, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_EqualEqual_SoftObjectReference_ReturnValue) == 0x000705, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_EqualEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Array_RandomFromStream_OutItem) == 0x000710, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Array_RandomFromStream_OutItem' has a wrong offset!");
static_assert(offsetof(IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry, CallFunc_Array_RandomFromStream_OutIndex) == 0x000A00, "Member 'IterateMeshesAlongSpline_C_Choose_Next_Mesh_Entry::CallFunc_Array_RandomFromStream_OutIndex' has a wrong offset!");

// Function IterateMeshesAlongSpline.IterateMeshesAlongSpline_C.ExecuteWithContext
// 0x26B0 (0x26B0 - 0x0000)
struct IterateMeshesAlongSpline_C_ExecuteWithContext final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Input;                                             // 0x00B8(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Output;                                            // 0x00D8(0x0020)(Parm, OutParm)
	TArray<struct FVector>                        Reversed_Spline_Tangents;                          // 0x00F8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector>                        Reversed_Spline_Points;                            // 0x0108(0x0010)(Edit, BlueprintVisible)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGPoint                              Point_to_Test;                                     // 0x0120(0x00D0)(Edit, BlueprintVisible, NoDestructor)
	struct FPCGPoint                              Brick_To_Check;                                    // 0x01F0(0x00D0)(Edit, BlueprintVisible, NoDestructor)
	class USplineComponent*                       Spline_to_Check;                                   // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Stack_End_Gap_Offset;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_Last_Entry_Scaled_Length;                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_Last_Entry_Random_Padding;                    // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Temp_New_Rot;                                      // 0x02E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Final_Point_Index;                                 // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGPoint                              Final_Point;                                       // 0x0300(0x00D0)(Edit, BlueprintVisible, NoDestructor)
	class UPCGPointData*                          Final_Out_Data;                                    // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPCGMetadata*                           Final_Metadata;                                    // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPCGPoint>                      Final_Out_Points;                                  // 0x03E0(0x0010)(Edit, BlueprintVisible)
	bool                                          Filling_Spline;                                    // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ready_to_Scale;                                    // 0x03F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Override_First_Mesh_0;                             // 0x03F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Override_Last_Mesh_0;                              // 0x03F3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Stack;                                     // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mesh_Entry_Index;                                  // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Corrected_Last_Index_On_Spline;                    // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mesh_Start_Index;                                  // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Point_Index;                               // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Next_Point_Location;                               // 0x0408(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Current_Point_Location;                            // 0x0420(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_New_Pos;                                      // 0x0438(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIterationPointData                    Override_End_Iteration_Point;                      // 0x0450(0x02F0)(Edit, BlueprintVisible)
	struct FIterationPointData                    Current_Iteration_Data;                            // 0x0740(0x02F0)(Edit, BlueprintVisible)
	struct FIterationPointData                    Active_Iteration_Data;                             // 0x0A30(0x02F0)(Edit, BlueprintVisible)
	struct FAoCSplineMeshEntry                    Current_Entry;                                     // 0x0D20(0x00D0)(Edit, BlueprintVisible)
	struct FPCGPoint                              Active_Point;                                      // 0x0DF0(0x00D0)(Edit, BlueprintVisible, NoDestructor)
	TArray<struct FAoCSplineMeshEntry>            Mesh_Entry_List;                                   // 0x0EC0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPCGPoint>                      All_Points;                                        // 0x0ED0(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Should_Break_Variable;                   // 0x0EE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0EE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE2[0x2];                                      // 0x0EE2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Current_Loop_Index_Variable;              // 0x0EE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0EE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0EEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0EED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EEE[0x2];                                      // 0x0EEE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGMetadata*                           CallFunc_MutableMetadata_ReturnValue;              // 0x0EF0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0EF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0EFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0F00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F01[0x3];                                      // 0x0F01(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0F04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0F08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F0C[0x4];                                      // 0x0F0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0F10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0F18(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Origin;        // 0x0F28(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Extents;       // 0x0F40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0F58(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0F60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0F61(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F62[0x6];                                      // 0x0F62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x0F68(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin;              // 0x0FA0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent;           // 0x0FB8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius;        // 0x0FD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD4[0x4];                                      // 0x0FD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0FD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0FE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0FE8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x1000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1004[0x4];                                     // 0x1004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x1008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x1020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x1028(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x1038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorArrayAverage_ReturnValue;        // 0x1050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x1068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x106C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x1070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x1074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1075[0x3];                                     // 0x1075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x1078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x1090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1091[0x3];                                     // 0x1091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x1094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x1098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x10A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x10A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x10B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x10B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x10C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x10D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x10E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E1[0x3];                                     // 0x10E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x10E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x10E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10EC[0x4];                                     // 0x10EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCSplineMeshEntry                    CallFunc_Array_Get_Item;                           // 0x10F0(0x00D0)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x11C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x11C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C5[0x3];                                     // 0x11C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PCGSplineMesh_C>  UniqueObjectNameForCooking_AsBPI_PCGSpline_Mesh;   // 0x11C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueObjectNameForCooking_bSuccess;               // 0x11D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D9[0x3];                                     // 0x11D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x11DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAoCSplineMeshEntry                    CallFunc_Get_Mesh_List_First_Override_Beginning_Mesh; // 0x11E0(0x00D0)()
	struct FAoCSplineMeshEntry                    CallFunc_Get_Mesh_List_First_Override_End_Mesh;    // 0x12B0(0x00D0)()
	TArray<struct FAoCSplineMeshEntry>            CallFunc_Get_Mesh_List_First_Fence_Objects;        // 0x1380(0x0010)(ReferenceParm)
	TArray<struct FAoCSplineDebrisEntry>          CallFunc_Get_Mesh_List_First_Debris_Objects;       // 0x1390(0x0010)(ReferenceParm)
	struct FAoCSplineMeshEntry                    CallFunc_Get_Mesh_List_Second_Override_Beginning_Mesh; // 0x13A0(0x00D0)()
	struct FAoCSplineMeshEntry                    CallFunc_Get_Mesh_List_Second_Override_End_Mesh;   // 0x1470(0x00D0)()
	TArray<struct FAoCSplineMeshEntry>            CallFunc_Get_Mesh_List_Second_Fence_Objects;       // 0x1540(0x0010)(ReferenceParm)
	TArray<struct FAoCSplineDebrisEntry>          CallFunc_Get_Mesh_List_Second_Debris_Objects;      // 0x1550(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x1560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1561[0x3];                                     // 0x1561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x1564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x1568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x156C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156D[0x3];                                     // 0x156D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x1570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x1574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x1578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_157C[0x4];                                     // 0x157C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x1580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x1588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x15A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A1[0x3];                                     // 0x15A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceAlongSplineAtLocation_ReturnValue; // 0x15A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtLocation_ReturnValue_1; // 0x15A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15AC[0x4];                                     // 0x15AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x15B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x15B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x15C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x15C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x15E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x15F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromY_ReturnValue;                 // 0x1610(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x1628(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x1640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x1644(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x1648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x164C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x1650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x1654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x1658(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x1670(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x1688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_168C[0x4];                                     // 0x168C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x1690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               Temp_byte_Variable;                                // 0x1698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1699[0x7];                                     // 0x1699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x16A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x16A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x16AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x16B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x16B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x16C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x16C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x16D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x16D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x16DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x16E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Origin_1;      // 0x16E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Extents_1;     // 0x1700(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh_1;                // 0x1718(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x1720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x1721(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
