#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LootCorpseInteractBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function LootCorpseInteractBP.LootCorpseInteractBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LootCorpseInteractBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LootCorpseInteractBP_C_ReceiveTick) == 0x000004, "Wrong alignment on LootCorpseInteractBP_C_ReceiveTick");
static_assert(sizeof(LootCorpseInteractBP_C_ReceiveTick) == 0x000004, "Wrong size on LootCorpseInteractBP_C_ReceiveTick");
static_assert(offsetof(LootCorpseInteractBP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'LootCorpseInteractBP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function LootCorpseInteractBP.LootCorpseInteractBP_C.ExecuteUbergraph_LootCorpseInteractBP
// 0x0008 (0x0008 - 0x0000)
struct LootCorpseInteractBP_C_ExecuteUbergraph_LootCorpseInteractBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LootCorpseInteractBP_C_ExecuteUbergraph_LootCorpseInteractBP) == 0x000004, "Wrong alignment on LootCorpseInteractBP_C_ExecuteUbergraph_LootCorpseInteractBP");
static_assert(sizeof(LootCorpseInteractBP_C_ExecuteUbergraph_LootCorpseInteractBP) == 0x000008, "Wrong size on LootCorpseInteractBP_C_ExecuteUbergraph_LootCorpseInteractBP");
static_assert(offsetof(LootCorpseInteractBP_C_ExecuteUbergraph_LootCorpseInteractBP, EntryPoint) == 0x000000, "Member 'LootCorpseInteractBP_C_ExecuteUbergraph_LootCorpseInteractBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LootCorpseInteractBP_C_ExecuteUbergraph_LootCorpseInteractBP, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'LootCorpseInteractBP_C_ExecuteUbergraph_LootCorpseInteractBP::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

