#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MA0007_ZanisTree

#include "Basic.hpp"


namespace SDK::Params
{

// Function MA0007_ZanisTree.MA0007_ZanisTree_C.OnInteractSuccess
// 0x0010 (0x0010 - 0x0000)
struct MA0007_ZanisTree_C_OnInteractSuccess final
{
public:
	class UInteractableComponent*                 Interactable_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Interactee;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MA0007_ZanisTree_C_OnInteractSuccess) == 0x000008, "Wrong alignment on MA0007_ZanisTree_C_OnInteractSuccess");
static_assert(sizeof(MA0007_ZanisTree_C_OnInteractSuccess) == 0x000010, "Wrong size on MA0007_ZanisTree_C_OnInteractSuccess");
static_assert(offsetof(MA0007_ZanisTree_C_OnInteractSuccess, Interactable_0) == 0x000000, "Member 'MA0007_ZanisTree_C_OnInteractSuccess::Interactable_0' has a wrong offset!");
static_assert(offsetof(MA0007_ZanisTree_C_OnInteractSuccess, Interactee) == 0x000008, "Member 'MA0007_ZanisTree_C_OnInteractSuccess::Interactee' has a wrong offset!");

// Function MA0007_ZanisTree.MA0007_ZanisTree_C.ExecuteUbergraph_MA0007_ZanisTree
// 0x0030 (0x0030 - 0x0000)
struct MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableComponent*                 K2Node_CustomEvent_Interactable;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         K2Node_CustomEvent_Interactee;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInteractableComponent* Interactable, class ABaseCharacter* Interactee)> UniqueObjectNameForCooking_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree) == 0x000008, "Wrong alignment on MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree");
static_assert(sizeof(MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree) == 0x000030, "Wrong size on MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree");
static_assert(offsetof(MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree, EntryPoint) == 0x000000, "Member 'MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree::EntryPoint' has a wrong offset!");
static_assert(offsetof(MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree, K2Node_CustomEvent_Interactable) == 0x000008, "Member 'MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree::K2Node_CustomEvent_Interactable' has a wrong offset!");
static_assert(offsetof(MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree, K2Node_CustomEvent_Interactee) == 0x000010, "Member 'MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree::K2Node_CustomEvent_Interactee' has a wrong offset!");
static_assert(offsetof(MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree, UniqueObjectNameForCooking_OutputDelegate) == 0x000018, "Member 'MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree::UniqueObjectNameForCooking_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'MA0007_ZanisTree_C_ExecuteUbergraph_MA0007_ZanisTree::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

}

