#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MA0015_TowerArcana

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NPCPawn_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MA0015_TowerArcana.MA0015_TowerArcana_C
// 0x0020 (0x1D70 - 0x1D50)
class AMA0015_TowerArcana_C final : public ANPCPawn_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MA0015_TowerArcana_C;               // 0x1D50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x1D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FireFX_;                                           // 0x1D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x1D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OnInteractSuccess(class UInteractableComponent* Interactable_0, class ABaseCharacter* Interactee);
	void ExecuteUbergraph_MA0015_TowerArcana(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MA0015_TowerArcana_C">();
	}
	static class AMA0015_TowerArcana_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMA0015_TowerArcana_C>();
	}
};
static_assert(alignof(AMA0015_TowerArcana_C) == 0x000010, "Wrong alignment on AMA0015_TowerArcana_C");
static_assert(sizeof(AMA0015_TowerArcana_C) == 0x001D70, "Wrong size on AMA0015_TowerArcana_C");
static_assert(offsetof(AMA0015_TowerArcana_C, UberGraphFrame_MA0015_TowerArcana_C) == 0x001D50, "Member 'AMA0015_TowerArcana_C::UberGraphFrame_MA0015_TowerArcana_C' has a wrong offset!");
static_assert(offsetof(AMA0015_TowerArcana_C, StaticMesh) == 0x001D58, "Member 'AMA0015_TowerArcana_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AMA0015_TowerArcana_C, FireFX_) == 0x001D60, "Member 'AMA0015_TowerArcana_C::FireFX_' has a wrong offset!");
static_assert(offsetof(AMA0015_TowerArcana_C, Interactable) == 0x001D68, "Member 'AMA0015_TowerArcana_C::Interactable' has a wrong offset!");

}

