#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Minotaur_Summoner_Raven

#include "Basic.hpp"


namespace SDK::Params
{

// Function Minotaur_Summoner_Raven.Minotaur_Summoner_Raven_C.ExecuteUbergraph_Minotaur_Summoner_Raven
// 0x0008 (0x0008 - 0x0000)
struct Minotaur_Summoner_Raven_C_ExecuteUbergraph_Minotaur_Summoner_Raven final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Minotaur_Summoner_Raven_C_ExecuteUbergraph_Minotaur_Summoner_Raven) == 0x000004, "Wrong alignment on Minotaur_Summoner_Raven_C_ExecuteUbergraph_Minotaur_Summoner_Raven");
static_assert(sizeof(Minotaur_Summoner_Raven_C_ExecuteUbergraph_Minotaur_Summoner_Raven) == 0x000008, "Wrong size on Minotaur_Summoner_Raven_C_ExecuteUbergraph_Minotaur_Summoner_Raven");
static_assert(offsetof(Minotaur_Summoner_Raven_C_ExecuteUbergraph_Minotaur_Summoner_Raven, EntryPoint) == 0x000000, "Member 'Minotaur_Summoner_Raven_C_ExecuteUbergraph_Minotaur_Summoner_Raven::EntryPoint' has a wrong offset!");
static_assert(offsetof(Minotaur_Summoner_Raven_C_ExecuteUbergraph_Minotaur_Summoner_Raven, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Minotaur_Summoner_Raven_C_ExecuteUbergraph_Minotaur_Summoner_Raven::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function Minotaur_Summoner_Raven.Minotaur_Summoner_Raven_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Minotaur_Summoner_Raven_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Minotaur_Summoner_Raven_C_ReceiveTick) == 0x000004, "Wrong alignment on Minotaur_Summoner_Raven_C_ReceiveTick");
static_assert(sizeof(Minotaur_Summoner_Raven_C_ReceiveTick) == 0x000004, "Wrong size on Minotaur_Summoner_Raven_C_ReceiveTick");
static_assert(offsetof(Minotaur_Summoner_Raven_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Minotaur_Summoner_Raven_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

