#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Minotaur_Summoner_Raven

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Raven_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Minotaur_Summoner_Raven.Minotaur_Summoner_Raven_C
// 0x0040 (0x1DA0 - 0x1D60)
class AMinotaur_Summoner_Raven_C : public ARaven_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Minotaur_Summoner_Raven_C;          // 0x1D60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Spawn;                                             // 0x1D68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          StartFade;                                         // 0x1D70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D71[0x7];                                     // 0x1D71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentFade;                                       // 0x1D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetFade;                                        // 0x1D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeSpeed;                                         // 0x1D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       BodyFade;                                          // 0x1D90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Minotaur_Summoner_Raven(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Minotaur_Summoner_Raven_C">();
	}
	static class AMinotaur_Summoner_Raven_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMinotaur_Summoner_Raven_C>();
	}
};
static_assert(alignof(AMinotaur_Summoner_Raven_C) == 0x000010, "Wrong alignment on AMinotaur_Summoner_Raven_C");
static_assert(sizeof(AMinotaur_Summoner_Raven_C) == 0x001DA0, "Wrong size on AMinotaur_Summoner_Raven_C");
static_assert(offsetof(AMinotaur_Summoner_Raven_C, UberGraphFrame_Minotaur_Summoner_Raven_C) == 0x001D60, "Member 'AMinotaur_Summoner_Raven_C::UberGraphFrame_Minotaur_Summoner_Raven_C' has a wrong offset!");
static_assert(offsetof(AMinotaur_Summoner_Raven_C, Spawn) == 0x001D68, "Member 'AMinotaur_Summoner_Raven_C::Spawn' has a wrong offset!");
static_assert(offsetof(AMinotaur_Summoner_Raven_C, StartFade) == 0x001D70, "Member 'AMinotaur_Summoner_Raven_C::StartFade' has a wrong offset!");
static_assert(offsetof(AMinotaur_Summoner_Raven_C, CurrentFade) == 0x001D78, "Member 'AMinotaur_Summoner_Raven_C::CurrentFade' has a wrong offset!");
static_assert(offsetof(AMinotaur_Summoner_Raven_C, TargetFade) == 0x001D80, "Member 'AMinotaur_Summoner_Raven_C::TargetFade' has a wrong offset!");
static_assert(offsetof(AMinotaur_Summoner_Raven_C, FadeSpeed) == 0x001D88, "Member 'AMinotaur_Summoner_Raven_C::FadeSpeed' has a wrong offset!");
static_assert(offsetof(AMinotaur_Summoner_Raven_C, BodyFade) == 0x001D90, "Member 'AMinotaur_Summoner_Raven_C::BodyFade' has a wrong offset!");

}

