#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MNT_Wyrmling_AnimBP_Child_New

#include "Basic.hpp"


namespace SDK::Params
{

// Function MNT_Wyrmling_AnimBP_Child_New.MNT_Wyrmling_AnimBP_Child_New_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct MNT_Wyrmling_AnimBP_Child_New_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MNT_Wyrmling_AnimBP_Child_New_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on MNT_Wyrmling_AnimBP_Child_New_C_BlueprintUpdateAnimation");
static_assert(sizeof(MNT_Wyrmling_AnimBP_Child_New_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on MNT_Wyrmling_AnimBP_Child_New_C_BlueprintUpdateAnimation");
static_assert(offsetof(MNT_Wyrmling_AnimBP_Child_New_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'MNT_Wyrmling_AnimBP_Child_New_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function MNT_Wyrmling_AnimBP_Child_New.MNT_Wyrmling_AnimBP_Child_New_C.ExecuteUbergraph_MNT_Wyrmling_AnimBP_Child_New
// 0x0008 (0x0008 - 0x0000)
struct MNT_Wyrmling_AnimBP_Child_New_C_ExecuteUbergraph_MNT_Wyrmling_AnimBP_Child_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MNT_Wyrmling_AnimBP_Child_New_C_ExecuteUbergraph_MNT_Wyrmling_AnimBP_Child_New) == 0x000004, "Wrong alignment on MNT_Wyrmling_AnimBP_Child_New_C_ExecuteUbergraph_MNT_Wyrmling_AnimBP_Child_New");
static_assert(sizeof(MNT_Wyrmling_AnimBP_Child_New_C_ExecuteUbergraph_MNT_Wyrmling_AnimBP_Child_New) == 0x000008, "Wrong size on MNT_Wyrmling_AnimBP_Child_New_C_ExecuteUbergraph_MNT_Wyrmling_AnimBP_Child_New");
static_assert(offsetof(MNT_Wyrmling_AnimBP_Child_New_C_ExecuteUbergraph_MNT_Wyrmling_AnimBP_Child_New, EntryPoint) == 0x000000, "Member 'MNT_Wyrmling_AnimBP_Child_New_C_ExecuteUbergraph_MNT_Wyrmling_AnimBP_Child_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(MNT_Wyrmling_AnimBP_Child_New_C_ExecuteUbergraph_MNT_Wyrmling_AnimBP_Child_New, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'MNT_Wyrmling_AnimBP_Child_New_C_ExecuteUbergraph_MNT_Wyrmling_AnimBP_Child_New::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

