#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MNT_Gryphon_AnimBP_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct MNT_Gryphon_AnimBP_New.MNT_Gryphon_AnimBP_New_C.AnimBlueprintGeneratedConstantData
// 0x02EF (0x02F0 - 0x0001)
struct MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1421;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1422;                               // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1423;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1424;                               // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1425;                               // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1426;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1427;                               // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1428;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1429;                               // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1430;                               // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1431;                               // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1432;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1433;                              // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1434;                               // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1435;                               // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1436;                               // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1437;                               // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1438;                               // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1439;                               // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1440;                               // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1441;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1442;                               // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1443;                               // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1444;                               // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1445;                               // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1446;                              // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1447;                               // 0x00B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1448;                               // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1449;                               // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1450;                               // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1451;                               // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1452;                               // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1453;                               // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1454;                               // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1455;                                // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1456;                               // 0x00F4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1457;                               // 0x00FC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1458;                               // 0x00FD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1459;                               // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1460;                               // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1461;                               // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1462;                               // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1463;                               // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1464;                               // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1465;                               // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1466;                               // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1467;                                // 0x0140(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1468;                             // 0x0144(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1469;                               // 0x0170(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1470;                               // 0x0178(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1471;                               // 0x0180(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1472;                              // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1473;                             // 0x018C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1474;                              // 0x01B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1475;                               // 0x01BC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1476;                               // 0x01BD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1477;                               // 0x01BE(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1478;                               // 0x01BF(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1479;                               // 0x01C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1480;                               // 0x01C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1481;                                // 0x01D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1482;                               // 0x01D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1483;                               // 0x01DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1484;                                // 0x01E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1485;                              // 0x01E8(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_1486;                               // 0x01F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1487;                                 // 0x0200(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1488;                               // 0x0208(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1489;                               // 0x0209(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1490;                               // 0x020A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B[0x5];                                      // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1491;                              // 0x0210(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_1492;                             // 0x0220(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0240(0x0080)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x02C0(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02D8(0x0018)()
};
static_assert(alignof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData) == 0x0002F0, "Wrong size on MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1421) == 0x000004, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1421' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1422) == 0x00000C, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1422' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1423) == 0x000014, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1423' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __EnumProperty_1424) == 0x000018, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__EnumProperty_1424' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1425) == 0x00001C, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1425' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1426) == 0x000024, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1426' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1427) == 0x000028, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1427' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1428) == 0x000030, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1428' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1429) == 0x000034, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1429' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1430) == 0x00003C, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1430' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1431) == 0x000044, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1431' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1432) == 0x00004C, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1432' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __FloatProperty_1433) == 0x000050, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__FloatProperty_1433' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1434) == 0x000054, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1434' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1435) == 0x00005C, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1435' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1436) == 0x000064, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1436' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1437) == 0x00006C, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1437' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1438) == 0x000074, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1438' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1439) == 0x00007C, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1439' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1440) == 0x000084, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1440' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1441) == 0x00008C, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1441' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1442) == 0x000090, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1442' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1443) == 0x000098, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1443' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1444) == 0x0000A0, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1444' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1445) == 0x0000A8, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1445' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __FloatProperty_1446) == 0x0000B0, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__FloatProperty_1446' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ByteProperty_1447) == 0x0000B4, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ByteProperty_1447' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1448) == 0x0000B8, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1448' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1449) == 0x0000C0, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1449' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1450) == 0x0000C8, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1450' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1451) == 0x0000D0, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1451' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1452) == 0x0000D8, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1452' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1453) == 0x0000E0, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1453' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1454) == 0x0000E8, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1454' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1455) == 0x0000F0, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1455' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1456) == 0x0000F4, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1456' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __EnumProperty_1457) == 0x0000FC, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__EnumProperty_1457' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ByteProperty_1458) == 0x0000FD, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ByteProperty_1458' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1459) == 0x000100, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1459' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1460) == 0x000108, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1460' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1461) == 0x000110, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1461' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1462) == 0x000118, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1462' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1463) == 0x000120, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1463' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1464) == 0x000128, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1464' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1465) == 0x000130, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1465' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1466) == 0x000138, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1466' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1467) == 0x000140, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1467' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __StructProperty_1468) == 0x000144, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__StructProperty_1468' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1469) == 0x000170, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1469' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1470) == 0x000178, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1470' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1471) == 0x000180, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1471' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __FloatProperty_1472) == 0x000188, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__FloatProperty_1472' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __StructProperty_1473) == 0x00018C, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__StructProperty_1473' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __FloatProperty_1474) == 0x0001B8, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__FloatProperty_1474' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __EnumProperty_1475) == 0x0001BC, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__EnumProperty_1475' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ByteProperty_1476) == 0x0001BD, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ByteProperty_1476' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __BoolProperty_1477) == 0x0001BE, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__BoolProperty_1477' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __EnumProperty_1478) == 0x0001BF, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__EnumProperty_1478' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1479) == 0x0001C0, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1479' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1480) == 0x0001C8, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1480' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1481) == 0x0001D0, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1481' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1482) == 0x0001D4, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1482' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1483) == 0x0001DC, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1483' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1484) == 0x0001E4, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1484' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1485) == 0x0001E8, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1485' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __BlendProfile_1486) == 0x0001F8, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__BlendProfile_1486' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __CurveFloat_1487) == 0x000200, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__CurveFloat_1487' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __BoolProperty_1488) == 0x000208, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__BoolProperty_1488' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __EnumProperty_1489) == 0x000209, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__EnumProperty_1489' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __EnumProperty_1490) == 0x00020A, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__EnumProperty_1490' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1491) == 0x000210, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1491' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __StructProperty_1492) == 0x000220, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__StructProperty_1492' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000240, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x0002C0, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0002D8, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct MNT_Gryphon_AnimBP_New.MNT_Gryphon_AnimBP_New_C.AnimBlueprintGeneratedMutableData
// 0x00A7 (0x00A8 - 0x0001)
struct MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_12;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_24;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_28;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_29;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_30;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_31;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_32;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_33;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_34;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_35;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_37;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_38;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_39;                                  // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_40;                                 // 0x00A4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_41;                                 // 0x00A5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData) == 0x0000A8, "Wrong size on MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'MNT_Gryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
