#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mount_Grounded_DaystriderMule_0

#include "Basic.hpp"


namespace SDK::Params
{

// Function Mount_Grounded_DaystriderMule_0.Mount_Grounded_DaystriderMule_0_C.ExecuteUbergraph_Mount_Grounded_DaystriderMule_0
// 0x0008 (0x0008 - 0x0000)
struct Mount_Grounded_DaystriderMule_0_C_ExecuteUbergraph_Mount_Grounded_DaystriderMule_0 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mount_Grounded_DaystriderMule_0_C_ExecuteUbergraph_Mount_Grounded_DaystriderMule_0) == 0x000004, "Wrong alignment on Mount_Grounded_DaystriderMule_0_C_ExecuteUbergraph_Mount_Grounded_DaystriderMule_0");
static_assert(sizeof(Mount_Grounded_DaystriderMule_0_C_ExecuteUbergraph_Mount_Grounded_DaystriderMule_0) == 0x000008, "Wrong size on Mount_Grounded_DaystriderMule_0_C_ExecuteUbergraph_Mount_Grounded_DaystriderMule_0");
static_assert(offsetof(Mount_Grounded_DaystriderMule_0_C_ExecuteUbergraph_Mount_Grounded_DaystriderMule_0, EntryPoint) == 0x000000, "Member 'Mount_Grounded_DaystriderMule_0_C_ExecuteUbergraph_Mount_Grounded_DaystriderMule_0::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mount_Grounded_DaystriderMule_0_C_ExecuteUbergraph_Mount_Grounded_DaystriderMule_0, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Mount_Grounded_DaystriderMule_0_C_ExecuteUbergraph_Mount_Grounded_DaystriderMule_0::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function Mount_Grounded_DaystriderMule_0.Mount_Grounded_DaystriderMule_0_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Mount_Grounded_DaystriderMule_0_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mount_Grounded_DaystriderMule_0_C_ReceiveTick) == 0x000004, "Wrong alignment on Mount_Grounded_DaystriderMule_0_C_ReceiveTick");
static_assert(sizeof(Mount_Grounded_DaystriderMule_0_C_ReceiveTick) == 0x000004, "Wrong size on Mount_Grounded_DaystriderMule_0_C_ReceiveTick");
static_assert(offsetof(Mount_Grounded_DaystriderMule_0_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Mount_Grounded_DaystriderMule_0_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

