#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mount_Grounded_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function Mount_Grounded_Base.Mount_Grounded_Base_C.ExecuteUbergraph_Mount_Grounded_Base
// 0x0028 (0x0028 - 0x0000)
struct Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         CallFunc_GetRider_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base) == 0x000008, "Wrong alignment on Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base");
static_assert(sizeof(Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base) == 0x000028, "Wrong size on Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base");
static_assert(offsetof(Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base, EntryPoint) == 0x000000, "Member 'Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base, CallFunc_GetRider_ReturnValue) == 0x000008, "Member 'Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base::CallFunc_GetRider_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base, CallFunc_IsServer_ReturnValue) == 0x000010, "Member 'Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base, K2Node_DynamicCast_AsPlayer_Character) == 0x000018, "Member 'Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base::K2Node_DynamicCast_AsPlayer_Character' has a wrong offset!");
static_assert(offsetof(Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base, CallFunc_HasAuthority_ReturnValue) == 0x000021, "Member 'Mount_Grounded_Base_C_ExecuteUbergraph_Mount_Grounded_Base::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function Mount_Grounded_Base.Mount_Grounded_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Mount_Grounded_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mount_Grounded_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on Mount_Grounded_Base_C_ReceiveTick");
static_assert(sizeof(Mount_Grounded_Base_C_ReceiveTick) == 0x000004, "Wrong size on Mount_Grounded_Base_C_ReceiveTick");
static_assert(offsetof(Mount_Grounded_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Mount_Grounded_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

