#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mount_Grounded_Scorpion_1

#include "Basic.hpp"

#include "Mount_Grounded_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mount_Grounded_Scorpion_1.Mount_Grounded_Scorpion_1_C
// 0x0020 (0x16B0 - 0x1690)
class AMount_Grounded_Scorpion_1_C final : public AMount_Grounded_Base_C
{
public:
	class UAIPerceptionStimuliSourceComponent*    AIPerceptionStimuliSource_0;                       // 0x1690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera_0;                                          // 0x1698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm_0;                                       // 0x16A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mount_Grounded_Scorpion_1_C">();
	}
	static class AMount_Grounded_Scorpion_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMount_Grounded_Scorpion_1_C>();
	}
};
static_assert(alignof(AMount_Grounded_Scorpion_1_C) == 0x000010, "Wrong alignment on AMount_Grounded_Scorpion_1_C");
static_assert(sizeof(AMount_Grounded_Scorpion_1_C) == 0x0016B0, "Wrong size on AMount_Grounded_Scorpion_1_C");
static_assert(offsetof(AMount_Grounded_Scorpion_1_C, AIPerceptionStimuliSource_0) == 0x001690, "Member 'AMount_Grounded_Scorpion_1_C::AIPerceptionStimuliSource_0' has a wrong offset!");
static_assert(offsetof(AMount_Grounded_Scorpion_1_C, Camera_0) == 0x001698, "Member 'AMount_Grounded_Scorpion_1_C::Camera_0' has a wrong offset!");
static_assert(offsetof(AMount_Grounded_Scorpion_1_C, SpringArm_0) == 0x0016A0, "Member 'AMount_Grounded_Scorpion_1_C::SpringArm_0' has a wrong offset!");

}

