#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mount_Grounded_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mount_Grounded_Base.Mount_Grounded_Base_C
// 0x0060 (0x1690 - 0x1630)
class AMount_Grounded_Base_C : public ABaseCharacter
{
public:
	uint8                                         Pad_1628[0x8];                                     // 0x1628(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNameplateComponent*                    Nameplate;                                         // 0x1638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InteractableComponent;                             // 0x1640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMountComponent_C*                      GroundMountComponent;                              // 0x1648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x1650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x1658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Target_Camera_Arm_Length;                          // 0x1660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InitialCameraArmLength;                            // 0x1668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitialCameraBoomLocation;                         // 0x1670(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurnRateVal;                                       // 0x1688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mount_Grounded_Base(int32 EntryPoint);
	void GetAttachedCaravan();
	void GetMountSpringArmRotation();
	void QuestCompletedCaravan();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mount_Grounded_Base_C">();
	}
	static class AMount_Grounded_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMount_Grounded_Base_C>();
	}
};
static_assert(alignof(AMount_Grounded_Base_C) == 0x000010, "Wrong alignment on AMount_Grounded_Base_C");
static_assert(sizeof(AMount_Grounded_Base_C) == 0x001690, "Wrong size on AMount_Grounded_Base_C");
static_assert(offsetof(AMount_Grounded_Base_C, UberGraphFrame) == 0x001630, "Member 'AMount_Grounded_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMount_Grounded_Base_C, Nameplate) == 0x001638, "Member 'AMount_Grounded_Base_C::Nameplate' has a wrong offset!");
static_assert(offsetof(AMount_Grounded_Base_C, InteractableComponent) == 0x001640, "Member 'AMount_Grounded_Base_C::InteractableComponent' has a wrong offset!");
static_assert(offsetof(AMount_Grounded_Base_C, GroundMountComponent) == 0x001648, "Member 'AMount_Grounded_Base_C::GroundMountComponent' has a wrong offset!");
static_assert(offsetof(AMount_Grounded_Base_C, Camera) == 0x001650, "Member 'AMount_Grounded_Base_C::Camera' has a wrong offset!");
static_assert(offsetof(AMount_Grounded_Base_C, SpringArm) == 0x001658, "Member 'AMount_Grounded_Base_C::SpringArm' has a wrong offset!");
static_assert(offsetof(AMount_Grounded_Base_C, Target_Camera_Arm_Length) == 0x001660, "Member 'AMount_Grounded_Base_C::Target_Camera_Arm_Length' has a wrong offset!");
static_assert(offsetof(AMount_Grounded_Base_C, InitialCameraArmLength) == 0x001668, "Member 'AMount_Grounded_Base_C::InitialCameraArmLength' has a wrong offset!");
static_assert(offsetof(AMount_Grounded_Base_C, InitialCameraBoomLocation) == 0x001670, "Member 'AMount_Grounded_Base_C::InitialCameraBoomLocation' has a wrong offset!");
static_assert(offsetof(AMount_Grounded_Base_C, TurnRateVal) == 0x001688, "Member 'AMount_Grounded_Base_C::TurnRateVal' has a wrong offset!");

}

