#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mount_Flying_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mount_Flying_Base.Mount_Flying_Base_C
// 0x0040 (0x1610 - 0x15D0)
class AMount_Flying_Base_C : public ABaseCharacter
{
public:
	uint8                                         Pad_15C8[0x8];                                     // 0x15C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNameplateComponent*                    Nameplate;                                         // 0x15D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMovementAkComponent*                   MovementAk_Glide;                                  // 0x15E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMovementAkComponent*                   MovementAk_Dive;                                   // 0x15E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InteractableComponent;                             // 0x15F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMountComponent_C*                      FlyingMountComponent;                              // 0x15F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x1600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x1608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mount_Flying_Base(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mount_Flying_Base_C">();
	}
	static class AMount_Flying_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMount_Flying_Base_C>();
	}
};
static_assert(alignof(AMount_Flying_Base_C) == 0x000010, "Wrong alignment on AMount_Flying_Base_C");
static_assert(sizeof(AMount_Flying_Base_C) == 0x001610, "Wrong size on AMount_Flying_Base_C");
static_assert(offsetof(AMount_Flying_Base_C, UberGraphFrame) == 0x0015D0, "Member 'AMount_Flying_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMount_Flying_Base_C, Nameplate) == 0x0015D8, "Member 'AMount_Flying_Base_C::Nameplate' has a wrong offset!");
static_assert(offsetof(AMount_Flying_Base_C, MovementAk_Glide) == 0x0015E0, "Member 'AMount_Flying_Base_C::MovementAk_Glide' has a wrong offset!");
static_assert(offsetof(AMount_Flying_Base_C, MovementAk_Dive) == 0x0015E8, "Member 'AMount_Flying_Base_C::MovementAk_Dive' has a wrong offset!");
static_assert(offsetof(AMount_Flying_Base_C, InteractableComponent) == 0x0015F0, "Member 'AMount_Flying_Base_C::InteractableComponent' has a wrong offset!");
static_assert(offsetof(AMount_Flying_Base_C, FlyingMountComponent) == 0x0015F8, "Member 'AMount_Flying_Base_C::FlyingMountComponent' has a wrong offset!");
static_assert(offsetof(AMount_Flying_Base_C, SpringArm) == 0x001600, "Member 'AMount_Flying_Base_C::SpringArm' has a wrong offset!");
static_assert(offsetof(AMount_Flying_Base_C, Camera) == 0x001608, "Member 'AMount_Flying_Base_C::Camera' has a wrong offset!");

}

