#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mushroom_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function Mushroom_Base.Mushroom_Base_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct Mushroom_Base_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mushroom_Base_C_UserConstructionScript) == 0x000008, "Wrong alignment on Mushroom_Base_C_UserConstructionScript");
static_assert(sizeof(Mushroom_Base_C_UserConstructionScript) == 0x000018, "Wrong size on Mushroom_Base_C_UserConstructionScript");
static_assert(offsetof(Mushroom_Base_C_UserConstructionScript, CallFunc_RandomInteger_ReturnValue) == 0x000000, "Member 'Mushroom_Base_C_UserConstructionScript::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mushroom_Base_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'Mushroom_Base_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mushroom_Base_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000008, "Member 'Mushroom_Base_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Mushroom_Base_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'Mushroom_Base_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

