#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Ooze_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_Ooze_AnimBP.NPC_Ooze_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0207 (0x0208 - 0x0001)
struct NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_617;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_618;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_619;                               // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_620;                               // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_621;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_622;                               // 0x0048(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_623;                                // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_624;                               // 0x0060(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_625;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_626;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_627;                               // 0x0080(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_628;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_629;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_630;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_631;                                 // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_632;                                // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_633;                                // 0x00B4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_634;                                 // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_635;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_636;                                  // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_637;                                // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_638;                                // 0x00D1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_639;                               // 0x00D8(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          __StructProperty_640;                              // 0x00E8(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_641;                                // 0x0114(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_642;                                 // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_643;                                // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_644;                                // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_645;                                 // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_646;                               // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_647;                                // 0x0138(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_648;                               // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_649;                                // 0x0140(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_650;                                // 0x0141(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_651;                                // 0x0142(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x1];                                      // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_652;                                // 0x0144(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_653;                              // 0x0150(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0170(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01F0(0x0018)()
};
static_assert(alignof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000208, "Wrong size on NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_617) == 0x000004, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_617' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_618) == 0x000010, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_618' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_619) == 0x000020, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_619' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_620) == 0x000030, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_620' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_621) == 0x000040, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_621' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_622) == 0x000048, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_622' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_623) == 0x000058, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_623' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_624) == 0x000060, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_624' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_625) == 0x000070, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_625' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_626) == 0x000078, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_626' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_627) == 0x000080, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_627' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_628) == 0x000090, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_628' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_629) == 0x000098, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_629' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_630) == 0x0000A0, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_630' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_631) == 0x0000A8, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_631' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_632) == 0x0000AC, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_632' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_633) == 0x0000B4, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_633' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_634) == 0x0000BC, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_634' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_635) == 0x0000C0, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_635' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_636) == 0x0000C8, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_636' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_637) == 0x0000D0, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_637' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_638) == 0x0000D1, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_638' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_639) == 0x0000D8, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_639' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_640) == 0x0000E8, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_640' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_641) == 0x000114, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_641' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_642) == 0x00011C, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_642' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_643) == 0x000120, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_643' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_644) == 0x000128, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_644' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_645) == 0x000130, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_645' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_646) == 0x000134, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_646' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_647) == 0x000138, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_647' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_648) == 0x00013C, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_648' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_649) == 0x000140, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_649' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_650) == 0x000141, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_650' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_651) == 0x000142, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_651' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_652) == 0x000144, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_652' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_653) == 0x000150, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_653' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000170, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001F0, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct NPC_Ooze_AnimBP.NPC_Ooze_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0037 (0x0038 - 0x0001)
struct NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_0;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_2;                                   // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0011(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0012(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0013(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0015(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_9;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_11;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000038, "Wrong size on NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_0) == 0x000004, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_0' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000008, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_2) == 0x00000C, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_2' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x000010, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_4) == 0x000011, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_4' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000012, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_6) == 0x000013, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_6' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x000014, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_8) == 0x000015, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_8' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x000018, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x00001C, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_11) == 0x000020, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_11' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x000024, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_13) == 0x000028, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_13' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_14) == 0x00002C, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_14' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_15) == 0x000030, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_15' has a wrong offset!");
static_assert(offsetof(NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_16) == 0x000034, "Member 'NPC_Ooze_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_16' has a wrong offset!");

}

