#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Elder_Dragon_Control_Rig_Head

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "AnimationCore_structs.hpp"
#include "ControlRigSpline_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass NPC_Elder_Dragon_Control_Rig_Head.NPC_Elder_Dragon_Control_Rig_Head_C
// 0x0068 (0x0698 - 0x0630)
class UNPC_Elder_Dragon_Control_Rig_Head_C final : public UControlRig
{
public:
	bool                                          Should_Do_Head_IK;                                 // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Neck_01_Z_Offset;                                  // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_01_Z_Offset_Target;                           // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_02_Z_Offset;                                  // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_02_Z_Offset_Target;                           // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_03_Z_Offset;                                  // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_03_Z_Offset_Target;                           // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_04_Z_Offset;                                  // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_04_Z_Offset_Target;                           // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_05_Z_Offset;                                  // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_05_Z_Offset_Target;                           // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Head_Z_Offset;                                     // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Head_Z_Offset_Target;                              // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Elder_Dragon_Control_Rig_Head_C">();
	}
	static class UNPC_Elder_Dragon_Control_Rig_Head_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_Elder_Dragon_Control_Rig_Head_C>();
	}
};
static_assert(alignof(UNPC_Elder_Dragon_Control_Rig_Head_C) == 0x000008, "Wrong alignment on UNPC_Elder_Dragon_Control_Rig_Head_C");
static_assert(sizeof(UNPC_Elder_Dragon_Control_Rig_Head_C) == 0x000698, "Wrong size on UNPC_Elder_Dragon_Control_Rig_Head_C");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Should_Do_Head_IK) == 0x000630, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Should_Do_Head_IK' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Neck_01_Z_Offset) == 0x000638, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Neck_01_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Neck_01_Z_Offset_Target) == 0x000640, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Neck_01_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Neck_02_Z_Offset) == 0x000648, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Neck_02_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Neck_02_Z_Offset_Target) == 0x000650, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Neck_02_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Neck_03_Z_Offset) == 0x000658, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Neck_03_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Neck_03_Z_Offset_Target) == 0x000660, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Neck_03_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Neck_04_Z_Offset) == 0x000668, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Neck_04_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Neck_04_Z_Offset_Target) == 0x000670, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Neck_04_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Neck_05_Z_Offset) == 0x000678, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Neck_05_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Neck_05_Z_Offset_Target) == 0x000680, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Neck_05_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Head_Z_Offset) == 0x000688, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Head_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Head_C, Head_Z_Offset_Target) == 0x000690, "Member 'UNPC_Elder_Dragon_Control_Rig_Head_C::Head_Z_Offset_Target' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass NPC_Elder_Dragon_Control_Rig_Head.RigVMMemory_Literal
// 0x1068 (0x10B0 - 0x0048)
class NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_1_Items__Const;     // 0x0048(0x0010)(Edit, EditConst, NonTransactional)
	ERigVMTransformSpace                          RigVMModel___SetTransformItemArray_Space__Const;   // 0x0058(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SetTransformItemArray_bInitial__Const; // 0x0059(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_4_Items__Const;     // 0x0060(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___SetTransformItemArray_Weight__Const;  // 0x0070(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_1_1_1_2_Bone__Const; // 0x0074(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_1_1_1_2_Ray_Cast_Start__Const; // 0x0080(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_1_1_1_2_Ray_Cast_End__Const; // 0x0088(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const; // 0x0090(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const; // 0x00B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const; // 0x00D0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const; // 0x00F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_Add_A__Const;  // 0x0110(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_GetTransform_Space__Const; // 0x0128(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_GetTransform_bInitial__Const; // 0x0129(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_Add_B__Const;  // 0x0130(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_Subtract_B__Const; // 0x0148(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0160(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0170(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0xC];                                      // 0x0174(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0180(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x01E0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0xF];                                      // 0x01E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x01F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0250(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0254(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0258(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x025C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_1_1_1_Bone__Const; // 0x0260(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_1_1_1_Ray_Cast_Start__Const; // 0x0270(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_1_1_1_Ray_Cast_End__Const; // 0x0278(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const_0; // 0x0280(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const_0; // 0x02A0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const_0; // 0x02C0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const_0; // 0x02E0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1_1___Trace_Add_A__Const;    // 0x0300(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1_1_1_1___Trace_GetTransform_Space__Const; // 0x0318(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1_1_1___Trace_GetTransform_bInitial__Const; // 0x0319(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1_1___Trace_Add_B__Const;    // 0x0320(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1_1___Trace_Subtract_B__Const; // 0x0338(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0350(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0360(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0xC];                                      // 0x0364(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0370(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x03D0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0xF];                                      // 0x03D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x03E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0440(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0444(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0448(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x044C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_1_1_Bone__Const;  // 0x0450(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_1_1_Ray_Cast_Start__Const; // 0x0460(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_1_1_Ray_Cast_End__Const; // 0x0468(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const_1; // 0x0470(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const_1; // 0x0490(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const_1; // 0x04B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const_1; // 0x04D0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1___Trace_Add_A__Const;      // 0x04F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1_1_1___Trace_GetTransform_Space__Const; // 0x0508(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1_1___Trace_GetTransform_bInitial__Const; // 0x0509(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A[0x6];                                      // 0x050A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1___Trace_Add_B__Const;      // 0x0510(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1___Trace_Subtract_B__Const; // 0x0528(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0540(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0550(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0xC];                                      // 0x0554(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0560(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x05C0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1[0xF];                                      // 0x05C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x05D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0630(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0634(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0638(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639[0x3];                                      // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x063C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_1_Bone__Const;    // 0x0640(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C[0x4];                                      // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_1_Ray_Cast_End__Const; // 0x0650(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658[0x8];                                      // 0x0658(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const_2; // 0x0660(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const_2; // 0x0680(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const_2; // 0x06A0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const_2; // 0x06C0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1___Trace_Add_A__Const;        // 0x06E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1_1___Trace_GetTransform_Space__Const; // 0x06F8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1___Trace_GetTransform_bInitial__Const; // 0x06F9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FA[0x6];                                      // 0x06FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1_1___Trace_Add_B__Const;        // 0x0700(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1___Trace_Subtract_B__Const;   // 0x0718(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0730(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0740(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_744[0xC];                                      // 0x0744(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0750(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x07B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B1[0xF];                                      // 0x07B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x07C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0820(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_821[0x3];                                      // 0x0821(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0824(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0828(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829[0x3];                                      // 0x0829(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x082C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_Bone__Const;      // 0x0830(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83C[0x4];                                      // 0x083C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_Ray_Cast_End__Const; // 0x0840(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const_3; // 0x0850(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const_3; // 0x0870(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const_3; // 0x0890(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const_3; // 0x08B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1___Trace_Add_A__Const;          // 0x08D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1___Trace_GetTransform_Space__Const; // 0x08E8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1___Trace_GetTransform_bInitial__Const; // 0x08E9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8EA[0x6];                                      // 0x08EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1___Trace_Add_B__Const;          // 0x08F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1___Trace_Subtract_B__Const;     // 0x0908(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0920(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0930(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_934[0xC];                                      // 0x0934(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0940(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x09A0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A1[0xF];                                      // 0x09A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x09B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0A10(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A11[0x3];                                      // 0x0A11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0A14(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0A18(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A19[0x3];                                      // 0x0A19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0A1C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_Bias__Const;              // 0x0A20(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FInputRange                            RigVMModel___AlphaInterp_InRange__Const;           // 0x0A24(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	bool                                          RigVMModel___AlphaInterp_bInterpResult__Const;     // 0x0A2C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2D[0x3];                                      // 0x0A2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___AlphaInterp_InterpSpeedIncreasing__Const; // 0x0A30(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A34[0x4];                                      // 0x0A34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_ItemToModify__Const; // 0x0A38(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___ModifyTransforms_Weight__Const;       // 0x0A48(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigModifyBoneMode                     RigVMModel___ModifyTransforms_Mode__Const;         // 0x0A4C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4D[0x3];                                      // 0x0A4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_ItemToModify__Const; // 0x0A50(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___ModifyTransforms_1_Weight__Const;     // 0x0A60(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A64[0x4];                                      // 0x0A64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_ItemToModify__Const; // 0x0A68(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___ModifyTransforms_1_1_Weight__Const;   // 0x0A78(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A7C[0x4];                                      // 0x0A7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_1_ItemToModify__Const; // 0x0A80(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___ModifyTransforms_1_1_1_Weight__Const; // 0x0A90(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A94[0x4];                                      // 0x0A94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_1_1_ItemToModify__Const; // 0x0A98(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___ModifyTransforms_1_1_1_1_Weight__Const; // 0x0AA8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AAC[0x4];                                      // 0x0AAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___SplineIK_Primary_Axis__Const;         // 0x0AB0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SplineIK_Secondary_Spline_Direction__Const; // 0x0AC8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ESplineType                                   RigVMModel___SplineIK_Spline_Mode__Const;          // 0x0AE0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE1[0x3];                                      // 0x0AE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RigVMModel___SplineIK_Samples_Per_Segment__Const;  // 0x0AE4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        LocalVariableDefault__SplineIK_aim_transforms__Const; // 0x0AE8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FVector>                        LocalVariableDefault__SplineIK_offset_positions__Const; // 0x0AF8(0x0010)(Edit, EditConst, NonTransactional)
	struct FControlRigSpline                      LocalVariableDefault__SplineIK_local_spline__Const; // 0x0B08(0x0018)(Edit, EditConst, NonTransactional)
	struct FControlRigSpline                      LocalVariableDefault__SplineIK_template_spline__Const; // 0x0B20(0x0018)(Edit, EditConst, NonTransactional)
	TArray<struct FTransform>                     LocalVariableDefault__SplineIK_template_transforms__Const; // 0x0B38(0x0010)(Edit, EditConst, NonTransactional)
	int32                                         SplineIK___SplineIK_MathIntLess_B__Const;          // 0x0B48(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          SplineIK___SplineIK_GetTransformItemArray_Space__Const; // 0x0B4C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          SplineIK___SplineIK_GetTransformItemArray_bInitial__Const; // 0x0B4D(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4E[0x2];                                      // 0x0B4E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SplineIK___SplineIK_ControlRigSplineFromPoints_1_Compression__Const; // 0x0B50(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigCurveAlignment                     SplineIK___SplineIK_FitChainToSplineCurveItemArray_1_Alignment__Const; // 0x0B54(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B55[0x3];                                      // 0x0B55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SplineIK___SplineIK_FitChainToSplineCurveItemArray_1_Maximum__Const; // 0x0B58(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SplineIK___SplineIK_FitChainToSplineCurveItemArray_1_SamplingPrecision__Const; // 0x0B5C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SplineIK___SplineIK_FitChainToSplineCurveItemArray_1_SecondaryAxis__Const; // 0x0B60(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_FitChainToCurve_Rotation> SplineIK___SplineIK_FitChainToSplineCurveItemArray_1_Rotations__Const; // 0x0B78(0x0010)(Edit, EditConst, NonTransactional)
	ERigVMAnimEasingType                          SplineIK___SplineIK_FitChainToSplineCurveItemArray_1_RotationEaseType__Const; // 0x0B88(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          SplineIK___SplineIK_FitChainToSplineCurveItemArray_1_bPropagateToChildren__Const; // 0x0B89(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8A[0x6];                                      // 0x0B8A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_FitChainToCurve_DebugSettings SplineIK___SplineIK_FitChainToSplineCurveItemArray_1_DebugSettings__Const; // 0x0B90(0x0090)(Edit, EditConst, NonTransactional, NoDestructor)
	EControlRigCurveAlignment                     SplineIK___SplineIK_FitChainToSplineCurveItemArray_Alignment__Const; // 0x0C20(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMAnimEasingType                          SplineIK___SplineIK_FitChainToSplineCurveItemArray_RotationEaseType__Const; // 0x0C21(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C22[0x2];                                      // 0x0C22(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SplineIK___SplineIK_DrawControlRigSpline_1_Color__Const; // 0x0C24(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SplineIK___SplineIK_DrawControlRigSpline_1_Detail__Const; // 0x0C34(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                SplineIK___SplineIK_AimBoneMath_Primary__Const;    // 0x0C38(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                SplineIK___SplineIK_AimBoneMath_Secondary__Const;  // 0x0C80(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_CC8[0x8];                                      // 0x0CC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         SplineIK___SplineIK_AimBoneMath_DebugSettings__Const; // 0x0CD0(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	int32                                         SplineIK___SplineIK_MathIntSub_B__Const;           // 0x0D40(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    SplineIK___SplineIK_DebugTransformMutableItemSpace_2_Mode__Const; // 0x0D44(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D45[0x3];                                      // 0x0D45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SplineIK___SplineIK_DebugTransformMutableItemSpace_2_Thickness__Const; // 0x0D48(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SplineIK___SplineIK_DebugTransformMutableItemSpace_2_Scale__Const; // 0x0D4C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         SplineIK___SplineIK_DebugTransformMutableItemSpace_2_Space__Const; // 0x0D50(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5C[0x4];                                      // 0x0D5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SplineIK___SplineIK_DebugTransformMutableItemSpace_2_WorldOffset__Const; // 0x0D60(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SplineIK___SplineIK_ArrayGetAtIndex_2_Index__Const; // 0x0DC0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransformFilter                       SplineIK___SplineIK_ParentConstraint_Filter__Const; // 0x0DC4(0x0009)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_DCD[0x3];                                      // 0x0DCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              SplineIK___SplineIK_ParentConstraint_Parents__Const; // 0x0DD0(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_ParentConstraint_AdvancedSettings SplineIK___SplineIK_ParentConstraint_AdvancedSettings__Const; // 0x0DE0(0x0002)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FTransformFilter                       SplineIK___SplineIK_ParentConstraint_1_Filter__Const; // 0x0DE2(0x0009)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_DEB[0x1];                                      // 0x0DEB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_Parent__Const;  // 0x0DEC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Item_Name__Const;    // 0x0DF8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___Control_Stack_at_Item_Settings__Const; // 0x0E00(0x00D0)(Edit, EditConst, NonTransactional)
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___Control_Stack_at_Item_Secondary_Settings__Const; // 0x0ED0(0x00D0)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___Control_Stack_at_Item_Control_Suffix__Const; // 0x0FA0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Item_Null_Suffix__Const; // 0x0FA8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Item___Control_Stack_at_Item_GetTransform_1_Space__Const; // 0x0FB0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Item___Control_Stack_at_Item_GetTransform_1_bInitial__Const; // 0x0FB1(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB2[0x2];                                      // 0x0FB2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Item___Control_Stack_at_Item_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x0FB4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_control__Const; // 0x0FBC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_null__Const; // 0x0FC8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_secondary_ctrl__Const; // 0x0FD4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_bottom_null__Const; // 0x0FE0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_Parent__Const; // 0x0FEC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_OffsetSpace__Const; // 0x0FF8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF9[0x3];                                      // 0x0FF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_2_B__Const; // 0x0FFC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1004[0xC];                                     // 0x1004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_1_OffsetTransform__Const; // 0x1010(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Add_Null_Above___Add_Null_Above_Replace_New__Const; // 0x1070(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Add_Null_Above___Add_Null_Above_GetTransform_1_Space__Const; // 0x1078(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Add_Null_Above___Add_Null_Above_GetTransform_1_bInitial__Const; // 0x1079(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_107A[0x2];                                     // 0x107A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_Name__Const; // 0x107C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_Space__Const; // 0x1084(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_bInitial__Const; // 0x1085(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1086[0x2];                                     // 0x1086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_Weight__Const; // 0x1088(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_1_1_B__Const; // 0x108C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_2_Name__Const; // 0x1094(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_1_Name__Const; // 0x109C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Item___Control_Stack_at_Item_DISPATCH_RigDispatch_SetMetadata_1_1_1_Name__Const; // 0x10A4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass NPC_Elder_Dragon_Control_Rig_Head.RigVMMemory_Literal", true>();
	}
	static class NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal>();
	}
};
static_assert(alignof(NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal) == 0x000010, "Wrong alignment on NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal");
static_assert(sizeof(NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal) == 0x0010B0, "Wrong size on NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal");
static_assert(offsetof(NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal, RigVMModel___RigUnit_ItemArray_1_Items__Const) == 0x000048, "Member 'NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal::RigVMModel___RigUnit_ItemArray_1_Items__Const' has a wrong offset!");
static_assert(offsetof(NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal, RigVMModel___SetTransformItemArray_Space__Const) == 0x000058, "Member 'NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal::RigVMModel___SetTransformItemArray_Space__Const' has a wrong offset!");
static_assert(offsetof(NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal, RigVMModel___SetTransformItemArray_bInitial__Const) == 0x000059, "Member 'NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal::RigVMModel___SetTransformItemArray_bInitial__Const' has a wrong offset!");
static_assert(offsetof(NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal, RigVMModel___RigUnit_ItemArray_4_Items__Const) == 0x000060, "Member 'NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal::RigVMModel___RigUnit_ItemArray_4_Items__Const' has a wrong offset!");
static_assert(offsetof(NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal, RigVMModel___SetTransformItemArray_Weight__Const) == 0x000070, "Member 'NPC_Elder_Dragon_Control_Rig_Head::URigVMMemory_Literal::RigVMModel___SetTransformItemArray_Weight__Const' has a wrong offset!");
