#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Minotaur_Shaman_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_Minotaur_Shaman_AnimBP.NPC_Minotaur_Shaman_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x021F (0x0220 - 0x0001)
struct NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_672;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_673;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_674;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_675;                               // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_676;                               // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_677;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_678;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_679;                                 // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_680;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_681;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_682;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_683;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_684;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_685;                              // 0x0078(0x002C)(BlueprintVisible, NoDestructor)
	EAnimSyncMethod                               __EnumProperty_686;                                // 0x00A4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_687;                                // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_688;                               // 0x00B0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_689;                               // 0x00C0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_690;                                // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_691;                                 // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_692;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_693;                               // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_694;                                // 0x00F4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_695;                               // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_696;                                // 0x00FC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_697;                                // 0x00FD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_698;                                // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_699;                                // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_700;                                // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_701;                                 // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_702;                               // 0x0120(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_703;                               // 0x0130(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_704;                                // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_705;                                  // 0x0148(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_706;                                // 0x0150(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_707;                                // 0x0151(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_708;                                // 0x0152(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_709;                               // 0x0158(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_710;                              // 0x0168(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0188(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0208(0x0018)()
};
static_assert(alignof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000220, "Wrong size on NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_672) == 0x000004, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_672' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_673) == 0x00000C, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_673' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_674) == 0x000014, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_674' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_675) == 0x000020, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_675' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_676) == 0x000030, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_676' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_677) == 0x000040, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_677' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_678) == 0x000048, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_678' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_679) == 0x000050, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_679' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_680) == 0x000054, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_680' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_681) == 0x00005C, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_681' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_682) == 0x000064, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_682' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_683) == 0x00006C, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_683' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_684) == 0x000074, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_684' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_685) == 0x000078, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_685' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_686) == 0x0000A4, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_686' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_687) == 0x0000A8, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_687' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_688) == 0x0000B0, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_688' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_689) == 0x0000C0, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_689' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_690) == 0x0000D0, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_690' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_691) == 0x0000D8, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_691' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_692) == 0x0000E0, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_692' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_693) == 0x0000F0, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_693' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_694) == 0x0000F4, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_694' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_695) == 0x0000F8, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_695' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_696) == 0x0000FC, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_696' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_697) == 0x0000FD, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_697' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_698) == 0x000100, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_698' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_699) == 0x000108, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_699' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_700) == 0x000110, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_700' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_701) == 0x000118, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_701' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_702) == 0x000120, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_702' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_703) == 0x000130, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_703' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_704) == 0x000140, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_704' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_705) == 0x000148, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_705' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_706) == 0x000150, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_706' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_707) == 0x000151, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_707' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_708) == 0x000152, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_708' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_709) == 0x000158, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_709' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_710) == 0x000168, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_710' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000188, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000208, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct NPC_Minotaur_Shaman_AnimBP.NPC_Minotaur_Shaman_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x00A3 (0x00A4 - 0x0001)
struct NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_5;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_13;                                  // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_24;                                  // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_27;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_28;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_29;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_30;                                 // 0x007C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_31;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_32;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_33;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_34;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_35;                                 // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_36;                                  // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_37;                                 // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_38;                                  // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_39;                                 // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_40;                                 // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x0000A4, "Wrong size on NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000008, "Member 'NPC_Minotaur_Shaman_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
