#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Elder_Dragon_Control_Rig_Tail

#include "Basic.hpp"

#include "AnimationCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "Engine_structs.hpp"
#include "ControlRigSpline_structs.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass NPC_Elder_Dragon_Control_Rig_Tail.NPC_Elder_Dragon_Control_Rig_Tail_C
// 0x00C8 (0x06F8 - 0x0630)
class UNPC_Elder_Dragon_Control_Rig_Tail_C final : public UControlRig
{
public:
	bool                                          Should_Do_Tail_IK;                                 // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        tail_01_Z_Offset;                                  // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_01_Z_Offset_Target;                           // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_02_Z_Offset;                                  // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_02_Z_Offset_Target;                           // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_03_Z_Offset;                                  // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_03_Z_Offset_Target;                           // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_04_Z_Offset;                                  // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_04_Z_Offset_Target;                           // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_05_Z_Offset;                                  // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_05_Z_Offset_Target;                           // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_06_Z_Offset;                                  // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_06_Z_Offset_Target;                           // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_07_Z_Offset;                                  // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_07_Z_Offset_Target;                           // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_08_Z_Offset;                                  // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_08_Z_Offset_Target;                           // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_09_Z_Offset;                                  // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_09_Z_Offset_Target;                           // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_10_Z_Offset;                                  // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_10_Z_Offset_Target;                           // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_11_Z_Offset;                                  // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_11_Z_Offset_Target;                           // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_12_Z_Offset;                                  // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        tail_12_Z_Offset_Target;                           // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Elder_Dragon_Control_Rig_Tail_C">();
	}
	static class UNPC_Elder_Dragon_Control_Rig_Tail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_Elder_Dragon_Control_Rig_Tail_C>();
	}
};
static_assert(alignof(UNPC_Elder_Dragon_Control_Rig_Tail_C) == 0x000008, "Wrong alignment on UNPC_Elder_Dragon_Control_Rig_Tail_C");
static_assert(sizeof(UNPC_Elder_Dragon_Control_Rig_Tail_C) == 0x0006F8, "Wrong size on UNPC_Elder_Dragon_Control_Rig_Tail_C");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, Should_Do_Tail_IK) == 0x000630, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::Should_Do_Tail_IK' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_01_Z_Offset) == 0x000638, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_01_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_01_Z_Offset_Target) == 0x000640, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_01_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_02_Z_Offset) == 0x000648, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_02_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_02_Z_Offset_Target) == 0x000650, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_02_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_03_Z_Offset) == 0x000658, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_03_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_03_Z_Offset_Target) == 0x000660, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_03_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_04_Z_Offset) == 0x000668, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_04_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_04_Z_Offset_Target) == 0x000670, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_04_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_05_Z_Offset) == 0x000678, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_05_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_05_Z_Offset_Target) == 0x000680, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_05_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_06_Z_Offset) == 0x000688, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_06_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_06_Z_Offset_Target) == 0x000690, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_06_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_07_Z_Offset) == 0x000698, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_07_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_07_Z_Offset_Target) == 0x0006A0, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_07_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_08_Z_Offset) == 0x0006A8, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_08_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_08_Z_Offset_Target) == 0x0006B0, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_08_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_09_Z_Offset) == 0x0006B8, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_09_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_09_Z_Offset_Target) == 0x0006C0, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_09_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_10_Z_Offset) == 0x0006C8, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_10_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_10_Z_Offset_Target) == 0x0006D0, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_10_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_11_Z_Offset) == 0x0006D8, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_11_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_11_Z_Offset_Target) == 0x0006E0, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_11_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_12_Z_Offset) == 0x0006E8, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_12_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_Tail_C, tail_12_Z_Offset_Target) == 0x0006F0, "Member 'UNPC_Elder_Dragon_Control_Rig_Tail_C::tail_12_Z_Offset_Target' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass NPC_Elder_Dragon_Control_Rig_Tail.RigVMMemory_Literal
// 0x1DF8 (0x1E40 - 0x0048)
class NPC_Elder_Dragon_Control_Rig_Tail::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_Items__Const;       // 0x0048(0x0010)(Edit, EditConst, NonTransactional)
	ERigVMTransformSpace                          RigVMModel___SetTransformItemArray_Space__Const;   // 0x0058(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SetTransformItemArray_bInitial__Const; // 0x0059(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_5_2_Items__Const;   // 0x0060(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___SetTransformItemArray_Weight__Const;  // 0x0070(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SetTransformItemArray_bPropagateToChildren__Const; // 0x0074(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_1_1_1_1_Bone__Const; // 0x0078(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_1_1_1_1_Ray_Cast_Start__Const; // 0x0088(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_1_1_1_1_Ray_Cast_End__Const; // 0x0090(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const; // 0x00A0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const; // 0x00C0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const; // 0x00E0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const; // 0x0100(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_Add_A__Const;  // 0x0120(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_GetTransform_Space__Const; // 0x0138(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_GetTransform_bInitial__Const; // 0x0139(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_Add_B__Const;  // 0x0140(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_Subtract_B__Const; // 0x0158(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0170(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0180(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0xC];                                      // 0x0184(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0190(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x01F0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0xF];                                      // 0x01F1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0200(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0260(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0264(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0268(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x026C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_1_1_1_Bone__Const; // 0x0270(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_1_1_1_Ray_Cast_End__Const; // 0x0280(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const_0; // 0x0290(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const_0; // 0x02B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const_0; // 0x02D0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const_0; // 0x02F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1_1___Trace_Add_A__Const;    // 0x0310(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1_1_1_1___Trace_GetTransform_Space__Const; // 0x0328(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1_1_1___Trace_GetTransform_bInitial__Const; // 0x0329(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1_1___Trace_Add_B__Const;    // 0x0330(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1_1___Trace_Subtract_B__Const; // 0x0348(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0360(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0370(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0xC];                                      // 0x0374(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0380(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x03E0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0xF];                                      // 0x03E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x03F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0450(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0454(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0458(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x045C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_1_1_Bone__Const;  // 0x0460(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const_1; // 0x0470(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const_1; // 0x0490(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const_1; // 0x04B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const_1; // 0x04D0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1___Trace_Add_A__Const;      // 0x04F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1_1_1___Trace_GetTransform_Space__Const; // 0x0508(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1_1___Trace_GetTransform_bInitial__Const; // 0x0509(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A[0x6];                                      // 0x050A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1___Trace_Add_B__Const;      // 0x0510(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1_1___Trace_Subtract_B__Const; // 0x0528(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0540(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0550(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0xC];                                      // 0x0554(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0560(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x05C0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1[0xF];                                      // 0x05C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x05D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0630(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0634(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0638(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639[0x3];                                      // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x063C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_1_Bone__Const;    // 0x0640(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C[0x4];                                      // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_1_Ray_Cast_End__Const; // 0x0650(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658[0x8];                                      // 0x0658(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const_2; // 0x0660(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const_2; // 0x0680(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const_2; // 0x06A0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const_2; // 0x06C0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1___Trace_Add_A__Const;        // 0x06E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1_1___Trace_GetTransform_Space__Const; // 0x06F8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1___Trace_GetTransform_bInitial__Const; // 0x06F9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FA[0x6];                                      // 0x06FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1_1___Trace_Add_B__Const;        // 0x0700(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_1___Trace_Subtract_B__Const;   // 0x0718(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0730(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0740(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_744[0xC];                                      // 0x0744(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0750(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x07B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B1[0xF];                                      // 0x07B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x07C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0820(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_821[0x3];                                      // 0x0821(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0824(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0828(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829[0x3];                                      // 0x0829(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x082C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_Bone__Const;      // 0x0830(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83C[0x4];                                      // 0x083C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_Ray_Cast_End__Const; // 0x0840(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const_3; // 0x0850(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const_3; // 0x0870(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const_3; // 0x0890(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const_3; // 0x08B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1___Trace_Add_A__Const;          // 0x08D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1___Trace_GetTransform_Space__Const; // 0x08E8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1___Trace_GetTransform_bInitial__Const; // 0x08E9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8EA[0x6];                                      // 0x08EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1___Trace_Add_B__Const;          // 0x08F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1___Trace_Subtract_B__Const;     // 0x0908(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0920(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0930(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_934[0xC];                                      // 0x0934(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0940(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x09A0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A1[0xF];                                      // 0x09A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x09B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0A10(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A11[0x3];                                      // 0x0A11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0A14(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0A18(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A19[0x3];                                      // 0x0A19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0A1C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_2_Bone__Const;    // 0x0A20(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2C[0x4];                                      // 0x0A2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const_4; // 0x0A30(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const_4; // 0x0A50(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const_4; // 0x0A70(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const_4; // 0x0A90(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_2___Trace_Add_A__Const;        // 0x0AB0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1_2___Trace_GetTransform_Space__Const; // 0x0AC8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_2___Trace_GetTransform_bInitial__Const; // 0x0AC9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACA[0x6];                                      // 0x0ACA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1_2___Trace_Add_B__Const;        // 0x0AD0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_2___Trace_Subtract_B__Const;   // 0x0AE8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0B00(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0B10(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B14[0xC];                                      // 0x0B14(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0B20(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0B80(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B81[0xF];                                      // 0x0B81(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0B90(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1_2___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0BF0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF1[0x3];                                      // 0x0BF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_2___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0BF4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0BF8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF9[0x3];                                      // 0x0BF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_2___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0BFC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_2_1_Bone__Const;  // 0x0C00(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C0C[0x4];                                      // 0x0C0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_2_1_Ray_Cast_Start__Const; // 0x0C10(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_2_1_Ray_Cast_End__Const; // 0x0C18(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const_5; // 0x0C20(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const_5; // 0x0C40(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const_5; // 0x0C60(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const_5; // 0x0C80(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_2_1___Trace_Add_A__Const;      // 0x0CA0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1_2_1___Trace_GetTransform_Space__Const; // 0x0CB8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_2_1___Trace_GetTransform_bInitial__Const; // 0x0CB9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CBA[0x6];                                      // 0x0CBA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1_2_1___Trace_Add_B__Const;      // 0x0CC0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_2_1___Trace_Subtract_B__Const; // 0x0CD8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1_2_1___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0CF0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1_2_1___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0D00(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D04[0xC];                                      // 0x0D04(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_2_1___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0D10(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_2_1___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0D70(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D71[0xF];                                      // 0x0D71(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_2_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0D80(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1_2_1___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0DE0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE1[0x3];                                      // 0x0DE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_2_1___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0DE4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1_2_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0DE8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE9[0x3];                                      // 0x0DE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_2_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0DEC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_2_1_1_1_Bone__Const; // 0x0DF0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DFC[0x4];                                      // 0x0DFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_2_1_1_1_Ray_Cast_End__Const; // 0x0E00(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E08[0x8];                                      // 0x0E08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const_6; // 0x0E10(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_target__Const_6; // 0x0E30(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r__Const_6; // 0x0E50(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_r_target__Const_6; // 0x0E70(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_Add_A__Const;  // 0x0E90(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_GetTransform_Space__Const; // 0x0EA8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_GetTransform_bInitial__Const; // 0x0EA9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EAA[0x6];                                      // 0x0EAA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_Add_B__Const;  // 0x0EB0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_Subtract_B__Const; // 0x0EC8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0EE0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0EF0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EF4[0xC];                                      // 0x0EF4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0F00(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0F60(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F61[0xF];                                      // 0x0F61(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0F70(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0FD0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD1[0x3];                                      // 0x0FD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_SphereTraceByTraceChannel_Radius__Const; // 0x0FD4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0FD8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD9[0x3];                                      // 0x0FD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trace_4_1_1_1_1_1_1_2_1_1_1___Trace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0FDC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Trace_4_1_1_1_1_1_1_2_1_1_1_1_Bone__Const; // 0x0FE0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FEC[0x4];                                      // 0x0FEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Trace_4_1_1_1_1_1_1_2_1_1_1_1_Ray_Cast_End__Const; // 0x0FF0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF8[0x8];                                      // 0x0FF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__Trace_foot_normal_hit_L__Const_7; // 0x1000(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
