#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Beetle_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_Beetle_AnimBP.NPC_Beetle_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x00A7 (0x00A8 - 0x0001)
struct NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_15;                                  // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_24;                                  // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_27;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_28;                                 // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_29;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_30;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_31;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_32;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_33;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_34;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_35;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_37;                                 // 0x0094(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_38;                                  // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_39;                                 // 0x009C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_40;                                  // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_41;                                 // 0x00A4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_42;                                 // 0x00A5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x0000A8, "Wrong size on NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x000008, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x00000C, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000010, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000014, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x000018, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x00001C, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000020, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000024, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x000028, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x00002C, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000030, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x000034, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_13) == 0x000038, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_13' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_14) == 0x00003C, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_14' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_15) == 0x000040, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_15' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_16) == 0x000044, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_16' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_17) == 0x000048, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_17' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_18) == 0x00004C, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_18' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_19) == 0x000050, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_19' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_20) == 0x000054, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_20' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_21) == 0x000058, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_21' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_22) == 0x00005C, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_22' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_23) == 0x000060, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_23' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_24) == 0x000064, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_24' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_25) == 0x000068, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_25' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_26) == 0x00006C, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_26' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_27) == 0x000070, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_27' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_28) == 0x000071, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_28' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_29) == 0x000074, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_29' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_30) == 0x000078, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_30' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_31) == 0x00007C, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_31' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_32) == 0x000080, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_32' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_33) == 0x000084, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_33' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_34) == 0x000088, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_34' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_35) == 0x00008C, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_35' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_36) == 0x000090, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_36' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_37) == 0x000094, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_37' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_38) == 0x000098, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_38' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_39) == 0x00009C, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_39' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_40) == 0x0000A0, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_40' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_41) == 0x0000A4, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_41' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_42) == 0x0000A5, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_42' has a wrong offset!");

// ScriptStruct NPC_Beetle_AnimBP.NPC_Beetle_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01DF (0x01E0 - 0x0001)
struct NPC_Beetle_AnimBP::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_616;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_617;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_618;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_619;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_620;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_621;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_622;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_623;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_624;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_625;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_626;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_627;                              // 0x0060(0x002C)(BlueprintVisible, NoDestructor)
	EAnimSyncMethod                               __EnumProperty_628;                                // 0x008C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_629;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_630;                               // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_631;                                // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_632;                                 // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_633;                               // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_634;                               // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_635;                                // 0x00BC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_636;                                // 0x00BD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_637;                                // 0x00BE(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_638;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_639;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_640;                                // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_641;                                 // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_642;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_643;                               // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_644;                                // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_645;                                  // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_646;                                // 0x0110(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_647;                                // 0x0111(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_648;                                // 0x0112(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_649;                               // 0x0118(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_650;                              // 0x0128(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0148(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C8(0x0018)()
};
static_assert(alignof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_Beetle_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001E0, "Wrong size on NPC_Beetle_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_616) == 0x000004, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_616' has a wrong offset!");
static_assert(offsetof(NPC_Beetle_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_617) == 0x00000C, "Member 'NPC_Beetle_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_617' has a wrong offset!");
