#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_GraveyardGolem_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_GraveyardGolem_AnimBP.NPC_GraveyardGolem_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01DF (0x01E0 - 0x0001)
struct NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_544;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_545;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_546;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_547;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_548;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_549;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_550;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_551;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_552;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_553;                                 // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_554;                                // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_555;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_556;                              // 0x0064(0x002C)(BlueprintVisible, NoDestructor)
	TArray<float>                                 __ArrayProperty_557;                               // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_558;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_559;                                 // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_560;                               // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_561;                                // 0x00B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_562;                               // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_563;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_564;                                // 0x00B9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_565;                                // 0x00BC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_566;                                // 0x00C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_567;                                 // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_568;                               // 0x00D0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_569;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_570;                                // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_571;                                  // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_572;                                // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_573;                                // 0x0101(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_574;                                // 0x0102(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_575;                               // 0x0108(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_576;                                // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_577;                                // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_578;                              // 0x0128(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0148(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C8(0x0018)()
};
static_assert(alignof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001E0, "Wrong size on NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_544) == 0x000004, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_544' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_545) == 0x000010, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_545' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_546) == 0x000020, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_546' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_547) == 0x000028, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_547' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_548) == 0x000030, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_548' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_549) == 0x000034, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_549' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_550) == 0x00003C, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_550' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_551) == 0x000044, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_551' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_552) == 0x00004C, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_552' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_553) == 0x000054, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_553' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_554) == 0x000058, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_554' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_555) == 0x00005C, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_555' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_556) == 0x000064, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_556' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_557) == 0x000090, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_557' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_558) == 0x0000A0, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_558' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_559) == 0x0000A8, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_559' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_560) == 0x0000AC, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_560' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_561) == 0x0000B0, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_561' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_562) == 0x0000B4, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_562' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_563) == 0x0000B8, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_563' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_564) == 0x0000B9, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_564' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_565) == 0x0000BC, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_565' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_566) == 0x0000C4, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_566' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_567) == 0x0000CC, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_567' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_568) == 0x0000D0, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_568' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_569) == 0x0000E0, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_569' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_570) == 0x0000F0, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_570' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_571) == 0x0000F8, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_571' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_572) == 0x000100, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_572' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_573) == 0x000101, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_573' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_574) == 0x000102, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_574' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_575) == 0x000108, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_575' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_576) == 0x000118, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_576' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_577) == 0x000120, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_577' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_578) == 0x000128, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_578' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000148, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001C8, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct NPC_GraveyardGolem_AnimBP.NPC_GraveyardGolem_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x007F (0x0080 - 0x0001)
struct NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_16;                                  // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x004C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_18;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_21;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_24;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_25;                                 // 0x006C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_26;                                  // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_27;                                 // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_28;                                  // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_29;                                 // 0x007C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_30;                                 // 0x007D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000080, "Wrong size on NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
