#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Hippo_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_Hippo_AnimBP.NPC_Hippo_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01DF (0x01E0 - 0x0001)
struct NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_496;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_497;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_498;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_499;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_500;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_501;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_502;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_503;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_504;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_505;                                // 0x0054(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_506;                                // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_507;                               // 0x0060(0x0010)(BlueprintVisible, EditFixedSize)
	int32                                         __IntProperty_508;                                 // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_509;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_510;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_511;                                 // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_512;                              // 0x0088(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_513;                               // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_514;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_515;                               // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_516;                                // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_517;                                // 0x00C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_518;                                // 0x00C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_519;                                // 0x00CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_520;                                // 0x00D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_521;                                 // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_522;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_523;                               // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_524;                                // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_525;                                  // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_526;                                // 0x0110(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_527;                                // 0x0111(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_528;                                // 0x0112(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_529;                               // 0x0118(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_530;                              // 0x0128(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0148(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C8(0x0018)()
};
static_assert(alignof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001E0, "Wrong size on NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_496) == 0x000004, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_496' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_497) == 0x00000C, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_497' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_498) == 0x000018, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_498' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_499) == 0x000028, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_499' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_500) == 0x000030, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_500' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_501) == 0x000038, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_501' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_502) == 0x00003C, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_502' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_503) == 0x000044, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_503' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_504) == 0x00004C, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_504' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_505) == 0x000054, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_505' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_506) == 0x000058, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_506' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_507) == 0x000060, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_507' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_508) == 0x000070, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_508' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_509) == 0x000074, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_509' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_510) == 0x00007C, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_510' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_511) == 0x000084, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_511' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_512) == 0x000088, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_512' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_513) == 0x0000B4, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_513' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_514) == 0x0000B8, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_514' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_515) == 0x0000BC, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_515' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_516) == 0x0000C0, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_516' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_517) == 0x0000C1, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_517' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_518) == 0x0000C4, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_518' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_519) == 0x0000CC, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_519' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_520) == 0x0000D4, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_520' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_521) == 0x0000DC, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_521' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_522) == 0x0000E0, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_522' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_523) == 0x0000F0, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_523' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_524) == 0x000100, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_524' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_525) == 0x000108, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_525' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_526) == 0x000110, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_526' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_527) == 0x000111, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_527' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_528) == 0x000112, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_528' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_529) == 0x000118, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_529' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_530) == 0x000128, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_530' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000148, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001C8, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct NPC_Hippo_AnimBP.NPC_Hippo_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0033 (0x0034 - 0x0001)
struct NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_4;                                   // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_9;                                   // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_11;                                  // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000034, "Wrong size on NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x000008, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x00000C, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000010, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_4) == 0x000014, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_4' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x000018, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x00001C, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x000020, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_8) == 0x000021, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_8' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_9) == 0x000024, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_9' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_10) == 0x000028, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_10' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_11) == 0x00002C, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_11' has a wrong offset!");
static_assert(offsetof(NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_12) == 0x000030, "Member 'NPC_Hippo_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_12' has a wrong offset!");

}

