#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Haunt_Knight_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NPC_Haunt_Knight_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NPC_Haunt_Knight_AnimBP.NPC_Haunt_Knight_AnimBP_C
// 0x1A60 (0x36A0 - 0x1C40)
class UNPC_Haunt_Knight_AnimBP_C final : public UAoCNPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1C40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x1C48(0x0038)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1C80(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1C88(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1C90(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x1CB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x1CD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x1D00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x1D28(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x1D50(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1D70(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x1DB8(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x1E00(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1F18(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1F60(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x1F80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1FA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1FD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x1FF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x2020(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x2048(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x2070(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x2098(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x20C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x20E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x2130(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x2150(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2178(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x21A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x21C8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x21F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2238(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x2258(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x22A0(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x22C0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x22E0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x23A8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x23C8(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x2410(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2458(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x24A0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x24E8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x2508(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2578(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x2598(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2660(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2680(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x2748(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x27C8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x28F0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2910(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2930(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x2A58(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x2A80(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x2AC8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2AF0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x2B70(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x2B98(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x2BE0(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x2C28(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x2C70(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x2CB8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x2D00(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x2D48(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x2D90(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x2DD8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x2E20(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x2E68(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x2EB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x2ED8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x2F00(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x2F28(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x2F70(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x2F98(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x2FC0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x2FE8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x3010(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x3038(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x3080(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x3100(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3128(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x3170(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x3198(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x3260(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x32A8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x3398(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x33C0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3488(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x3508(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x3530(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3558(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x3580(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3670(0x0028)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_NPCNotAttacking();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_NPC_Haunt_Knight_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Haunt_Knight_AnimBP_C">();
	}
	static class UNPC_Haunt_Knight_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_Haunt_Knight_AnimBP_C>();
	}
};
static_assert(alignof(UNPC_Haunt_Knight_AnimBP_C) == 0x000010, "Wrong alignment on UNPC_Haunt_Knight_AnimBP_C");
static_assert(sizeof(UNPC_Haunt_Knight_AnimBP_C) == 0x0036A0, "Wrong size on UNPC_Haunt_Knight_AnimBP_C");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, UberGraphFrame) == 0x001C40, "Member 'UNPC_Haunt_Knight_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, __AnimBlueprintMutables) == 0x001C48, "Member 'UNPC_Haunt_Knight_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x001C80, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimBlueprintExtension_Base) == 0x001C88, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Root) == 0x001C90, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_16) == 0x001CB0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_15) == 0x001CD8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_14) == 0x001D00, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_13) == 0x001D28, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_9) == 0x001D50, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x001D70, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByBool_5) == 0x001DB8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x001E00, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x001F18, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_8) == 0x001F60, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_12) == 0x001F80, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_11) == 0x001FA8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_10) == 0x001FD0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_9) == 0x001FF8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x002020, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x002048, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x002070, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x002098, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x0020C0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x0020E8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_7) == 0x002130, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x002150, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x002178, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x0021A0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult) == 0x0021C8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x0021F0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_6) == 0x002238, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x002258, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_5) == 0x0022A0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_4) == 0x0022C0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateMachine_2) == 0x0022E0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_3) == 0x0023A8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x0023C8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByInt_2) == 0x002410, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByInt_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x002458, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x0024A0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_2) == 0x0024E8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x002508, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_1) == 0x002578, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x002598, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult) == 0x002660, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateMachine) == 0x002680, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SaveCachedPose_3) == 0x002748, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0027C8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0028F0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002910, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_ModifyBone) == 0x002930, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_17) == 0x002A58, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_17' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_9) == 0x002A80, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_9' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_16) == 0x002AC8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_16' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SaveCachedPose_2) == 0x002AF0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_15) == 0x002B70, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_15' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x002B98, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_8) == 0x002BE0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_8' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByInt_1) == 0x002C28, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_7) == 0x002C70, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_7' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_6) == 0x002CB8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_6' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x002D00, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_5) == 0x002D48, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByInt) == 0x002D90, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_4) == 0x002DD8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_3) == 0x002E20, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_2) == 0x002E68, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_14) == 0x002EB0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_14' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_13) == 0x002ED8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_13' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_12) == 0x002F00, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_12' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_1) == 0x002F28, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_11) == 0x002F70, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_11' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_10) == 0x002F98, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_9) == 0x002FC0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_8) == 0x002FE8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_7) == 0x003010, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x003038, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x003080, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_6) == 0x003100, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x003128, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_5) == 0x003170, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TwoWayBlend_1) == 0x003198, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TwoWayBlend_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot) == 0x003260, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_LayeredBoneBlend_1) == 0x0032A8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_4) == 0x003398, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TwoWayBlend) == 0x0033C0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x003488, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_3) == 0x003508, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x003530, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x003558, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x003580, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x003670, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

