#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_SkeletonWarrior_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_SkeletonWarrior_AnimBP.NPC_SkeletonWarrior_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0227 (0x0228 - 0x0001)
struct NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_897;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_898;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_899;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_900;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_901;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_902;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_903;                               // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_904;                               // 0x0048(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_905;                                // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_906;                                // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_907;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_908;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_909;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_910;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_911;                                // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_912;                                 // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_913;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_914;                                 // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_915;                              // 0x00A0(0x002C)(BlueprintVisible, NoDestructor)
	EAnimSyncMethod                               __EnumProperty_916;                                // 0x00CC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_917;                                // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_918;                               // 0x00D8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_919;                                // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_920;                                // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_921;                                 // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_922;                               // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_923;                                // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_924;                               // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_925;                                // 0x0108(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_926;                                // 0x0109(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_927;                                // 0x010C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_928;                                // 0x0114(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_929;                                // 0x011C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_930;                                 // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_931;                               // 0x0128(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_932;                               // 0x0138(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_933;                                // 0x0148(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_934;                                  // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_935;                                // 0x0158(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_936;                                // 0x0159(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_937;                                // 0x015A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_938;                               // 0x0160(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_939;                              // 0x0170(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0190(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0210(0x0018)()
};
static_assert(alignof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000228, "Wrong size on NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_897) == 0x000004, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_897' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_898) == 0x00000C, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_898' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_899) == 0x000014, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_899' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_900) == 0x000018, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_900' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_901) == 0x000028, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_901' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_902) == 0x000030, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_902' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_903) == 0x000038, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_903' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_904) == 0x000048, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_904' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_905) == 0x000058, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_905' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_906) == 0x000060, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_906' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_907) == 0x000068, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_907' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_908) == 0x000070, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_908' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_909) == 0x000078, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_909' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_910) == 0x000080, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_910' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_911) == 0x000088, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_911' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_912) == 0x000090, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_912' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_913) == 0x000094, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_913' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_914) == 0x00009C, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_914' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_915) == 0x0000A0, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_915' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_916) == 0x0000CC, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_916' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_917) == 0x0000D0, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_917' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_918) == 0x0000D8, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_918' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_919) == 0x0000E8, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_919' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_920) == 0x0000F0, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_920' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_921) == 0x0000F8, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_921' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_922) == 0x0000FC, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_922' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_923) == 0x000100, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_923' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_924) == 0x000104, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_924' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_925) == 0x000108, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_925' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_926) == 0x000109, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_926' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_927) == 0x00010C, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_927' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_928) == 0x000114, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_928' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_929) == 0x00011C, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_929' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_930) == 0x000124, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_930' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_931) == 0x000128, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_931' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_932) == 0x000138, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_932' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_933) == 0x000148, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_933' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_934) == 0x000150, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_934' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_935) == 0x000158, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_935' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_936) == 0x000159, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_936' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_937) == 0x00015A, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_937' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_938) == 0x000160, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_938' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_939) == 0x000170, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_939' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000190, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000210, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct NPC_SkeletonWarrior_AnimBP.NPC_SkeletonWarrior_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x00BF (0x00C0 - 0x0001)
struct NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty;                                     // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_0;                                   // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_13;                                  // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_18;                                 // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_19;                                 // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0052(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_21;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_24;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_28;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_29;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_30;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_31;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_32;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_33;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_34;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_35;                                  // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_37;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_38;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_39;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_40;                                 // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_41;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_42;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_43;                                 // 0x00AC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_44;                                  // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_45;                                 // 0x00B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_46;                                  // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_47;                                 // 0x00BC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_48;                                 // 0x00BD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_49;                                 // 0x00BE(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x0000C0, "Wrong size on NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty) == 0x000004, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_0) == 0x000008, "Member 'NPC_SkeletonWarrior_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_0' has a wrong offset!");
