#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_PlantMonster_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_PlantMonster_AnimBP.NPC_PlantMonster_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01EF (0x01F0 - 0x0001)
struct NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_615;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_616;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_617;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_618;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_619;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_620;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_621;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_622;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_623;                                // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_624;                               // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_625;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_626;                                 // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_627;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_628;                                 // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_629;                              // 0x0080(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_630;                                // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_631;                                // 0x00B4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_632;                                // 0x00BC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_633;                               // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_634;                               // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_635;                                // 0x00C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_636;                                // 0x00C9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_637;                                // 0x00CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_638;                                 // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_639;                                // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_640;                                // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_641;                                 // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_642;                               // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_643;                               // 0x0100(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_644;                                // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_645;                                  // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_646;                                // 0x0120(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_647;                                // 0x0121(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_648;                                // 0x0122(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_649;                               // 0x0128(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_650;                              // 0x0138(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0158(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01D8(0x0018)()
};
static_assert(alignof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001F0, "Wrong size on NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_615) == 0x000004, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_615' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_616) == 0x000010, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_616' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_617) == 0x000020, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_617' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_618) == 0x000028, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_618' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_619) == 0x000030, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_619' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_620) == 0x000038, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_620' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_621) == 0x000040, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_621' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_622) == 0x000048, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_622' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_623) == 0x000050, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_623' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_624) == 0x000058, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_624' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_625) == 0x000068, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_625' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_626) == 0x000070, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_626' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_627) == 0x000074, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_627' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_628) == 0x00007C, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_628' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_629) == 0x000080, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_629' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_630) == 0x0000AC, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_630' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_631) == 0x0000B4, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_631' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_632) == 0x0000BC, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_632' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_633) == 0x0000C0, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_633' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_634) == 0x0000C4, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_634' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_635) == 0x0000C8, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_635' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_636) == 0x0000C9, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_636' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_637) == 0x0000CC, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_637' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_638) == 0x0000D4, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_638' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_639) == 0x0000D8, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_639' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_640) == 0x0000E0, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_640' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_641) == 0x0000E8, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_641' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_642) == 0x0000F0, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_642' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_643) == 0x000100, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_643' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_644) == 0x000110, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_644' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_645) == 0x000118, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_645' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_646) == 0x000120, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_646' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_647) == 0x000121, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_647' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_648) == 0x000122, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_648' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_649) == 0x000128, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_649' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_650) == 0x000138, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_650' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000158, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001D8, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct NPC_PlantMonster_AnimBP.NPC_PlantMonster_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x004B (0x004C - 0x0001)
struct NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_7;                                   // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_14;                                  // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_16;                                  // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00004C, "Wrong size on NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x000008, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x00000C, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000010, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000014, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x000018, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x00001C, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_7) == 0x000020, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_7' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000024, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x000028, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x00002C, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000030, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x000034, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_13) == 0x000038, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_13' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_14) == 0x00003C, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_14' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_15) == 0x000040, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_15' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_16) == 0x000044, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_16' has a wrong offset!");
static_assert(offsetof(NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_17) == 0x000048, "Member 'NPC_PlantMonster_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_17' has a wrong offset!");

}

