#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Elder_Dragon_Control_Rig

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "PBIK_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass NPC_Elder_Dragon_Control_Rig.NPC_Elder_Dragon_Control_Rig_C
// 0x0190 (0x07C0 - 0x0630)
class UNPC_Elder_Dragon_Control_Rig_C final : public UControlRig
{
public:
	bool                                          Should_Do_Feet_IK_Trace;                           // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Should_Do_Feet_Normal_Adjust;                      // 0x0631(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_632[0x6];                                      // 0x0632(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        pelvis_z_offset;                                   // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_l_z_offset;                                   // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_l_z_offset_target;                            // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Foot_L_Hit_Normal;                                 // 0x0650(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Foot_L_Hit_Normal_Target;                          // 0x0670(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_r_z_offset;                                   // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_r_z_offset_target;                            // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Foot_R_Hit_Normal;                                 // 0x06A0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Foot_R_Hit_Normal_Target;                          // 0x06C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Hand_L_Z_Offset;                                   // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Hand_L_Z_Offset_Target;                            // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Hand_L_Hit_Normal;                                 // 0x06F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Hand_L_Hit_Normal_Target;                          // 0x0710(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Hand_R_Z_Offset;                                   // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Hand_R_Z_Offset_Target;                            // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Hand_R_Hit_Normal;                                 // 0x0740(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Hand_R_Hit_Normal_Target;                          // 0x0760(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Pelvis_Joint;                                      // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Hand_L_Joint;                                      // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Hand_R_Joint;                                      // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Foot_L_Joint;                                      // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Foot_R_Joint;                                      // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Chest_Z_Offset;                                    // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Chest_Z_Offset_Target;                             // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Ground_Slope_Pitch;                                // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Elder_Dragon_Control_Rig_C">();
	}
	static class UNPC_Elder_Dragon_Control_Rig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_Elder_Dragon_Control_Rig_C>();
	}
};
static_assert(alignof(UNPC_Elder_Dragon_Control_Rig_C) == 0x000010, "Wrong alignment on UNPC_Elder_Dragon_Control_Rig_C");
static_assert(sizeof(UNPC_Elder_Dragon_Control_Rig_C) == 0x0007C0, "Wrong size on UNPC_Elder_Dragon_Control_Rig_C");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Should_Do_Feet_IK_Trace) == 0x000630, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Should_Do_Feet_IK_Trace' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Should_Do_Feet_Normal_Adjust) == 0x000631, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Should_Do_Feet_Normal_Adjust' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, pelvis_z_offset) == 0x000638, "Member 'UNPC_Elder_Dragon_Control_Rig_C::pelvis_z_offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, foot_l_z_offset) == 0x000640, "Member 'UNPC_Elder_Dragon_Control_Rig_C::foot_l_z_offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, foot_l_z_offset_target) == 0x000648, "Member 'UNPC_Elder_Dragon_Control_Rig_C::foot_l_z_offset_target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Foot_L_Hit_Normal) == 0x000650, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Foot_L_Hit_Normal' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Foot_L_Hit_Normal_Target) == 0x000670, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Foot_L_Hit_Normal_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, foot_r_z_offset) == 0x000690, "Member 'UNPC_Elder_Dragon_Control_Rig_C::foot_r_z_offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, foot_r_z_offset_target) == 0x000698, "Member 'UNPC_Elder_Dragon_Control_Rig_C::foot_r_z_offset_target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Foot_R_Hit_Normal) == 0x0006A0, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Foot_R_Hit_Normal' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Foot_R_Hit_Normal_Target) == 0x0006C0, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Foot_R_Hit_Normal_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Hand_L_Z_Offset) == 0x0006E0, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Hand_L_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Hand_L_Z_Offset_Target) == 0x0006E8, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Hand_L_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Hand_L_Hit_Normal) == 0x0006F0, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Hand_L_Hit_Normal' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Hand_L_Hit_Normal_Target) == 0x000710, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Hand_L_Hit_Normal_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Hand_R_Z_Offset) == 0x000730, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Hand_R_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Hand_R_Z_Offset_Target) == 0x000738, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Hand_R_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Hand_R_Hit_Normal) == 0x000740, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Hand_R_Hit_Normal' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Hand_R_Hit_Normal_Target) == 0x000760, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Hand_R_Hit_Normal_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Pelvis_Joint) == 0x000780, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Pelvis_Joint' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Hand_L_Joint) == 0x000788, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Hand_L_Joint' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Hand_R_Joint) == 0x000790, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Hand_R_Joint' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Foot_L_Joint) == 0x000798, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Foot_L_Joint' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Foot_R_Joint) == 0x0007A0, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Foot_R_Joint' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Chest_Z_Offset) == 0x0007A8, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Chest_Z_Offset' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Chest_Z_Offset_Target) == 0x0007B0, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Chest_Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(UNPC_Elder_Dragon_Control_Rig_C, Ground_Slope_Pitch) == 0x0007B8, "Member 'UNPC_Elder_Dragon_Control_Rig_C::Ground_Slope_Pitch' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass NPC_Elder_Dragon_Control_Rig.RigVMMemory_Literal
// 0x1358 (0x13A0 - 0x0048)
class NPC_Elder_Dragon_Control_Rig::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_1_Item__Const;    // 0x0048(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_1_1_1_1_Space__Const;   // 0x0054(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_1_1_1_1_bInitial__Const; // 0x0055(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_2_2_Item__Const;         // 0x0058(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_1_1_1_1_Weight__Const;  // 0x0064(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_1_1_1_1_bPropagateToChildren__Const; // 0x0068(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_Item__Const;      // 0x006C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_Item__Const;       // 0x0078(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_Item__Const;          // 0x0084(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_Item__Const;           // 0x0090(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_Item__Const;        // 0x009C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_Item__Const;         // 0x00A8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___traces_2_Ray_Cast_Start__Const;       // 0x00B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___traces_2_Ray_Cast_End__Const;         // 0x00C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const; // 0x00D0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const; // 0x00F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const; // 0x0110(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const; // 0x0130(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_2___traces_GetTransform_Space__Const;       // 0x0150(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_2___traces_GetTransform_bInitial__Const;    // 0x0151(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_2___traces_Add_A__Const;                    // 0x0158(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_2___traces_Add_B__Const;                    // 0x0170(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_2___traces_Subtract_B__Const;               // 0x0188(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_2___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x01A0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_2___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x01B0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0xC];                                      // 0x01B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_2___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x01C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_2___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0220(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0xF];                                      // 0x0221(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_2___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0230(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_2___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0290(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_2___traces_SphereTraceByTraceChannel_Radius__Const; // 0x0294(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_2___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0298(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_2___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x029C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_2___traces_AimBoneMath_Primary__Const;      // 0x02A0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_2___traces_AimBoneMath_Secondary__Const;    // 0x02E8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces_2___traces_AimBoneMath_Weight__Const;       // 0x0330(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0xC];                                      // 0x0334(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces_2___traces_AimBoneMath_DebugSettings__Const; // 0x0340(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const_0; // 0x03B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const_0; // 0x03D0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const_0; // 0x03F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const_0; // 0x0410(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_3___traces_GetTransform_Space__Const;       // 0x0430(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_3___traces_GetTransform_bInitial__Const;    // 0x0431(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_3___traces_Add_A__Const;                    // 0x0438(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_3___traces_Add_B__Const;                    // 0x0450(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_3___traces_Subtract_B__Const;               // 0x0468(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_3___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0480(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_3___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0490(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0xC];                                      // 0x0494(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_3___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x04A0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_3___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0500(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0xF];                                      // 0x0501(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_3___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0510(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_3___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0570(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_3___traces_SphereTraceByTraceChannel_Radius__Const; // 0x0574(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_3___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0578(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_3___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x057C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_3___traces_AimBoneMath_Primary__Const;      // 0x0580(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_3___traces_AimBoneMath_Secondary__Const;    // 0x05C8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces_3___traces_AimBoneMath_Weight__Const;       // 0x0610(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614[0xC];                                      // 0x0614(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces_3___traces_AimBoneMath_DebugSettings__Const; // 0x0620(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	double                                        RigVMModel___traces_Ray_Cast_End__Const;           // 0x0690(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const_1; // 0x06A0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const_1; // 0x06C0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const_1; // 0x06E0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const_1; // 0x0700(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces___traces_GetTransform_Space__Const;         // 0x0720(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces___traces_GetTransform_bInitial__Const;      // 0x0721(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_722[0x6];                                      // 0x0722(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces___traces_Add_A__Const;                      // 0x0728(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces___traces_Add_B__Const;                      // 0x0740(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces___traces_Subtract_B__Const;                 // 0x0758(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0770(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0780(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_784[0xC];                                      // 0x0784(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0790(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x07F0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F1[0xF];                                      // 0x07F1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0800(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0860(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_861[0x3];                                      // 0x0861(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces___traces_SphereTraceByTraceChannel_Radius__Const; // 0x0864(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0868(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_869[0x3];                                      // 0x0869(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x086C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces___traces_AimBoneMath_Primary__Const;        // 0x0870(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces___traces_AimBoneMath_Secondary__Const;      // 0x08B8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces___traces_AimBoneMath_Weight__Const;         // 0x0900(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_904[0xC];                                      // 0x0904(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces___traces_AimBoneMath_DebugSettings__Const;  // 0x0910(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const_2; // 0x0980(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const_2; // 0x09A0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const_2; // 0x09C0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const_2; // 0x09E0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_1___traces_GetTransform_Space__Const;       // 0x0A00(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1___traces_GetTransform_bInitial__Const;    // 0x0A01(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A02[0x6];                                      // 0x0A02(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_1___traces_Add_A__Const;                    // 0x0A08(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1___traces_Add_B__Const;                    // 0x0A20(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1___traces_Subtract_B__Const;               // 0x0A38(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_1___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0A50(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_1___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0A60(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A64[0xC];                                      // 0x0A64(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0A70(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0AD0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD1[0xF];                                      // 0x0AD1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0AE0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_1___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0B40(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B41[0x3];                                      // 0x0B41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1___traces_SphereTraceByTraceChannel_Radius__Const; // 0x0B44(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0B48(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B49[0x3];                                      // 0x0B49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0B4C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_1___traces_AimBoneMath_Primary__Const;      // 0x0B50(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_1___traces_AimBoneMath_Secondary__Const;    // 0x0B98(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces_1___traces_AimBoneMath_Weight__Const;       // 0x0BE0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE4[0xC];                                      // 0x0BE4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces_1___traces_AimBoneMath_DebugSettings__Const; // 0x0BF0(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         RigVMModel___AlphaInterp_2_Bias__Const;            // 0x0C60(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FInputRange                            RigVMModel___AlphaInterp_2_InRange__Const;         // 0x0C64(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         RigVMModel___AlphaInterp_2_InterpSpeedIncreasing__Const; // 0x0C6C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Multiply_3_B__Const;                  // 0x0C70(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_2_ItemToModify__Const; // 0x0C78(0x0010)(Edit, EditConst, NonTransactional)
	EControlRigModifyBoneMode                     RigVMModel___ModifyTransforms_2_Mode__Const;       // 0x0C88(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C89[0x7];                                      // 0x0C89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_2_ItemToModify__Const; // 0x0C90(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_ItemToModify__Const; // 0x0CA0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_3_ItemToModify__Const; // 0x0CB0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_ItemToModify__Const; // 0x0CC0(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___SpringInterpQuaternionV2_2_Strength__Const; // 0x0CD0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD4[0x4];                                      // 0x0CD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___SpringInterpQuaternionV2_2_Torque__Const; // 0x0CD8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___VariableNode_27_Value__Const;         // 0x0CF0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__Const;                // 0x0D10(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_Curve__Const;     // 0x0D20(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_Curve__Const;       // 0x0D28(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_1_Curve__Const;   // 0x0D30(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_2_Curve__Const;     // 0x0D38(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_BoneSettings__Const;             // 0x0D40(0x0010)(Edit, EditConst, NonTransactional)
	TArray<class FName>                           RigVMModel___PBIK_ExcludedBones__Const;            // 0x0D50(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_Settings__Const;                 // 0x0D60(0x003C)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_Debug__Const;                    // 0x0D9C(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_DA4[0xC];                                      // 0x0DA4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___Control_Stack_at_Position_Global_Position__Const; // 0x0DB0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Position_Parent__Const; // 0x0E10(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Position_Name__Const; // 0x0E1C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E24[0xC];                                      // 0x0E24(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___Control_Stack_at_Position_Settings__Const; // 0x0E30(0x00D0)(Edit, EditConst, NonTransactional)
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___Control_Stack_at_Position_Secondary_Settings__Const; // 0x0F00(0x00D0)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___Control_Stack_at_Position_Control_Suffix__Const; // 0x0FD0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Position_Null_Suffix__Const; // 0x0FD8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_control__Const; // 0x0FE0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_null__Const; // 0x0FEC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_secondary_ctrl__Const; // 0x0FF8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_bottom_null__Const; // 0x1004(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_Parent__Const; // 0x1010(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_OffsetSpace__Const; // 0x101C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101D[0x3];                                     // 0x101D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_2_B__Const; // 0x1020(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_1_OffsetTransform__Const; // 0x1030(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Add_Null_Above___Add_Null_Above_Replace_New__Const; // 0x1090(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Add_Null_Above___Add_Null_Above_GetTransform_1_Space__Const; // 0x1098(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Add_Null_Above___Add_Null_Above_GetTransform_1_bInitial__Const; // 0x1099(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109A[0x2];                                     // 0x109A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_Name__Const; // 0x109C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_Space__Const; // 0x10A4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_bInitial__Const; // 0x10A5(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A6[0x2];                                     // 0x10A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_Weight__Const; // 0x10A8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_1_1_B__Const; // 0x10AC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_2_Name__Const; // 0x10B4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_1_Name__Const; // 0x10BC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Position_1_Name__Const; // 0x10C4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_control__Const_0; // 0x10CC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_null__Const_0; // 0x10D8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_secondary_ctrl__Const_0; // 0x10E4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_bottom_null__Const_0; // 0x10F0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position_1___Control_Stack_at_Position_SpawnControl_Parent__Const; // 0x10FC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position_1___Control_Stack_at_Position_SpawnControl_OffsetSpace__Const; // 0x1108(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1109[0x3];                                     // 0x1109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position_1___Control_Stack_at_Position_Concat_2_B__Const; // 0x110C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1114[0xC];                                     // 0x1114(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Position_1___Control_Stack_at_Position_SpawnControl_1_OffsetTransform__Const; // 0x1120(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Add_Null_Above___Add_Null_Above_Replace_New__Const_0; // 0x1180(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Add_Null_Above___Add_Null_Above_GetTransform_1_Space__Const_0; // 0x1188(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Add_Null_Above___Add_Null_Above_GetTransform_1_bInitial__Const_0; // 0x1189(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_118A[0x2];                                     // 0x118A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position_1___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_Name__Const; // 0x118C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position_1___Control_Stack_at_Position_Set_Transform_Space__Const; // 0x1194(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Position_1___Control_Stack_at_Position_Set_Transform_bInitial__Const; // 0x1195(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1196[0x2];                                     // 0x1196(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Control_Stack_at_Position_1___Control_Stack_at_Position_Set_Transform_Weight__Const; // 0x1198(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position_1___Control_Stack_at_Position_Concat_1_1_B__Const; // 0x119C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position_1___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_2_Name__Const; // 0x11A4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position_1___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_1_Name__Const; // 0x11AC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Position_1_1_Name__Const; // 0x11B4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_control__Const_1; // 0x11BC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_null__Const_1; // 0x11C8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_secondary_ctrl__Const_1; // 0x11D4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_bottom_null__Const_1; // 0x11E0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position_1_1___Control_Stack_at_Position_SpawnControl_Parent__Const; // 0x11EC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position_1_1___Control_Stack_at_Position_SpawnControl_OffsetSpace__Const; // 0x11F8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11F9[0x3];                                     // 0x11F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position_1_1___Control_Stack_at_Position_Concat_2_B__Const; // 0x11FC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1204[0xC];                                     // 0x1204(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Position_1_1___Control_Stack_at_Position_SpawnControl_1_OffsetTransform__Const; // 0x1210(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Add_Null_Above___Add_Null_Above_Replace_New__Const_1; // 0x1270(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Add_Null_Above___Add_Null_Above_GetTransform_1_Space__Const_1; // 0x1278(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Add_Null_Above___Add_Null_Above_GetTransform_1_bInitial__Const_1; // 0x1279(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_127A[0x2];                                     // 0x127A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position_1_1___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_Name__Const; // 0x127C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position_1_1___Control_Stack_at_Position_Set_Transform_Space__Const; // 0x1284(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Position_1_1___Control_Stack_at_Position_Set_Transform_bInitial__Const; // 0x1285(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1286[0x2];                                     // 0x1286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Control_Stack_at_Position_1_1___Control_Stack_at_Position_Set_Transform_Weight__Const; // 0x1288(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position_1_1___Control_Stack_at_Position_Concat_1_1_B__Const; // 0x128C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
