#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Haunt_Knight_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NPC_Haunt_Knight_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NPC_Haunt_Knight_AnimBP.NPC_Haunt_Knight_AnimBP_C
// 0x1A60 (0x36B0 - 0x1C50)
class UNPC_Haunt_Knight_AnimBP_C final : public UAoCNPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1C50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x1C58(0x0038)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1C90(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1C98(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1CA0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x1CC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x1CE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x1D10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x1D38(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x1D60(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1D80(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x1DC8(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x1E10(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1F28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1F70(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x1F90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1FB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1FE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x2008(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x2030(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x2058(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x2080(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x20A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x20D0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x20F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x2140(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x2160(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2188(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x21B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x21D8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x2200(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2248(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x2268(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x22B0(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x22D0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x22F0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x23B8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x23D8(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x2420(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2468(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x24B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x24F8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x2518(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2588(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x25A8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2670(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2690(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x2758(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x27D8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2900(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2920(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2940(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x2A68(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x2A90(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x2AD8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2B00(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x2B80(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x2BA8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x2BF0(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x2C38(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x2C80(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x2CC8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x2D10(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x2D58(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x2DA0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x2DE8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x2E30(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x2E78(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x2EC0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x2EE8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x2F10(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x2F38(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x2F80(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x2FA8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x2FD0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x2FF8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x3020(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x3048(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x3090(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x3110(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3138(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x3180(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x31A8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x3270(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x32B8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x33A8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x33D0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3498(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x3518(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x3540(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3568(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x3590(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3680(0x0028)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_NPCNotAttacking();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_NPC_Haunt_Knight_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Haunt_Knight_AnimBP_C">();
	}
	static class UNPC_Haunt_Knight_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_Haunt_Knight_AnimBP_C>();
	}
};
static_assert(alignof(UNPC_Haunt_Knight_AnimBP_C) == 0x000010, "Wrong alignment on UNPC_Haunt_Knight_AnimBP_C");
static_assert(sizeof(UNPC_Haunt_Knight_AnimBP_C) == 0x0036B0, "Wrong size on UNPC_Haunt_Knight_AnimBP_C");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, UberGraphFrame) == 0x001C50, "Member 'UNPC_Haunt_Knight_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, __AnimBlueprintMutables) == 0x001C58, "Member 'UNPC_Haunt_Knight_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x001C90, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimBlueprintExtension_Base) == 0x001C98, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Root) == 0x001CA0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_16) == 0x001CC0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_15) == 0x001CE8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_14) == 0x001D10, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_13) == 0x001D38, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_9) == 0x001D60, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x001D80, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByBool_5) == 0x001DC8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x001E10, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x001F28, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_8) == 0x001F70, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_12) == 0x001F90, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_11) == 0x001FB8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_10) == 0x001FE0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_9) == 0x002008, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x002030, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x002058, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x002080, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x0020A8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x0020D0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x0020F8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_7) == 0x002140, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x002160, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x002188, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x0021B0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TransitionResult) == 0x0021D8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x002200, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_6) == 0x002248, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x002268, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_5) == 0x0022B0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_4) == 0x0022D0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateMachine_2) == 0x0022F0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_3) == 0x0023B8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x0023D8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByInt_2) == 0x002420, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByInt_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x002468, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x0024B0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_2) == 0x0024F8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x002518, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult_1) == 0x002588, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x0025A8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateResult) == 0x002670, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_StateMachine) == 0x002690, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SaveCachedPose_3) == 0x002758, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0027D8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002900, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002920, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_ModifyBone) == 0x002940, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_17) == 0x002A68, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_17' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_9) == 0x002A90, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_9' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_16) == 0x002AD8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_16' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SaveCachedPose_2) == 0x002B00, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_15) == 0x002B80, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_15' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x002BA8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_8) == 0x002BF0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_8' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByInt_1) == 0x002C38, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_7) == 0x002C80, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_7' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_6) == 0x002CC8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_6' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x002D10, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_5) == 0x002D58, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByInt) == 0x002DA0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_4) == 0x002DE8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_3) == 0x002E30, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_2) == 0x002E78, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_14) == 0x002EC0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_14' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_13) == 0x002EE8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_13' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_12) == 0x002F10, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_12' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot_1) == 0x002F38, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_11) == 0x002F80, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_11' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_10) == 0x002FA8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_9) == 0x002FD0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_8) == 0x002FF8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_7) == 0x003020, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x003048, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x003090, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_6) == 0x003110, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x003138, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_5) == 0x003180, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TwoWayBlend_1) == 0x0031A8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TwoWayBlend_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_Slot) == 0x003270, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_LayeredBoneBlend_1) == 0x0032B8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_4) == 0x0033A8, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_TwoWayBlend) == 0x0033D0, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x003498, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_3) == 0x003518, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x003540, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x003568, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x003590, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UNPC_Haunt_Knight_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x003680, "Member 'UNPC_Haunt_Knight_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

