#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_GraveyardGolem_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_GraveyardGolem_AnimBP.NPC_GraveyardGolem_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01F7 (0x01F8 - 0x0001)
struct NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_545;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_546;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_547;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_548;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_549;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_550;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_551;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_552;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_553;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_554;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_555;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_556;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_557;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_558;                              // 0x006C(0x002C)(BlueprintVisible, NoDestructor)
	TArray<float>                                 __ArrayProperty_559;                               // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_560;                                // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_561;                                 // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_562;                               // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_563;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_564;                               // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_565;                                // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_566;                                // 0x00C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_567;                                // 0x00C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_568;                                // 0x00CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_569;                                // 0x00D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_570;                                 // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_571;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_572;                               // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	EAlphaBlendOption                             __EnumProperty_573;                                // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_574;                               // 0x0108(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_575;                                // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_576;                                  // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_577;                                // 0x0128(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_578;                                // 0x0129(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_579;                                // 0x012A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_580;                               // 0x0130(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_581;                              // 0x0140(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0160(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01E0(0x0018)()
};
static_assert(alignof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001F8, "Wrong size on NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_545) == 0x000004, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_545' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_546) == 0x00000C, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_546' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_547) == 0x000018, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_547' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_548) == 0x000028, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_548' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_549) == 0x000030, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_549' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_550) == 0x000038, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_550' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_551) == 0x00003C, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_551' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_552) == 0x000044, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_552' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_553) == 0x00004C, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_553' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_554) == 0x000054, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_554' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_555) == 0x00005C, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_555' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_556) == 0x000060, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_556' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_557) == 0x000064, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_557' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_558) == 0x00006C, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_558' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_559) == 0x000098, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_559' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_560) == 0x0000A8, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_560' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_561) == 0x0000B0, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_561' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_562) == 0x0000B4, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_562' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_563) == 0x0000B8, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_563' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_564) == 0x0000BC, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_564' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_565) == 0x0000C0, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_565' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_566) == 0x0000C1, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_566' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_567) == 0x0000C4, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_567' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_568) == 0x0000CC, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_568' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_569) == 0x0000D4, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_569' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_570) == 0x0000DC, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_570' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_571) == 0x0000E0, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_571' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_572) == 0x0000F0, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_572' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_573) == 0x000100, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_573' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_574) == 0x000108, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_574' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_575) == 0x000118, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_575' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_576) == 0x000120, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_576' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_577) == 0x000128, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_577' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_578) == 0x000129, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_578' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_579) == 0x00012A, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_579' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_580) == 0x000130, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_580' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_581) == 0x000140, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_581' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000160, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001E0, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct NPC_GraveyardGolem_AnimBP.NPC_GraveyardGolem_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x006B (0x006C - 0x0001)
struct NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_12;                                  // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_14;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_17;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_19;                                 // 0x0054(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_20;                                  // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_21;                                 // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_22;                                  // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_23;                                 // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_24;                                 // 0x0065(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_25;                                  // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00006C, "Wrong size on NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'NPC_GraveyardGolem_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
