#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Hippo_Control_Rig

#include "Basic.hpp"

#include "ControlRigSpline_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "PBIK_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass NPC_Hippo_Control_Rig.NPC_Hippo_Control_Rig_C
// 0x01A0 (0x07D0 - 0x0630)
class UNPC_Hippo_Control_Rig_C final : public UControlRig
{
public:
	double                                        ground_pitch;                                      // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ground_roll;                                       // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Pelvis_Z;                                          // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Pelvis_Z_Hit;                                      // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Ball_L_Z;                                          // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Ball_L_Z_Hit;                                      // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Ball_R_Z;                                          // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Ball_R_Z_Hit;                                      // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Front_Foot_L_Z;                                    // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Front_Foot_L_Z_Hit;                                // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Front_Foot_R_Z;                                    // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Front_Foot_R_Z_Hit;                                // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Ball_L_Normal;                                     // 0x0690(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Ball_L_Normal_Hit;                                 // 0x06B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Ball_R_Normal;                                     // 0x06D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Ball_R_Normal_Hit;                                 // 0x06F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Front_Foot_L_Normal;                               // 0x0710(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Front_Foot_L_Normal_Hit;                           // 0x0730(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Front_Foot_R_Normal;                               // 0x0750(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  Front_Foot_R_Normal_Hit;                           // 0x0770(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_01_Z;                                         // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_01_Z_Hit;                                     // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_02_Z;                                         // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_02_Z_Hit;                                     // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Head_Z;                                            // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Head_Z_Hit;                                        // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Head_End_Z;                                        // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Head_End_Z_Hit;                                    // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Hippo_Control_Rig_C">();
	}
	static class UNPC_Hippo_Control_Rig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_Hippo_Control_Rig_C>();
	}
};
static_assert(alignof(UNPC_Hippo_Control_Rig_C) == 0x000010, "Wrong alignment on UNPC_Hippo_Control_Rig_C");
static_assert(sizeof(UNPC_Hippo_Control_Rig_C) == 0x0007D0, "Wrong size on UNPC_Hippo_Control_Rig_C");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, ground_pitch) == 0x000630, "Member 'UNPC_Hippo_Control_Rig_C::ground_pitch' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, ground_roll) == 0x000638, "Member 'UNPC_Hippo_Control_Rig_C::ground_roll' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Pelvis_Z) == 0x000640, "Member 'UNPC_Hippo_Control_Rig_C::Pelvis_Z' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Pelvis_Z_Hit) == 0x000648, "Member 'UNPC_Hippo_Control_Rig_C::Pelvis_Z_Hit' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Ball_L_Z) == 0x000650, "Member 'UNPC_Hippo_Control_Rig_C::Ball_L_Z' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Ball_L_Z_Hit) == 0x000658, "Member 'UNPC_Hippo_Control_Rig_C::Ball_L_Z_Hit' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Ball_R_Z) == 0x000660, "Member 'UNPC_Hippo_Control_Rig_C::Ball_R_Z' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Ball_R_Z_Hit) == 0x000668, "Member 'UNPC_Hippo_Control_Rig_C::Ball_R_Z_Hit' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Front_Foot_L_Z) == 0x000670, "Member 'UNPC_Hippo_Control_Rig_C::Front_Foot_L_Z' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Front_Foot_L_Z_Hit) == 0x000678, "Member 'UNPC_Hippo_Control_Rig_C::Front_Foot_L_Z_Hit' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Front_Foot_R_Z) == 0x000680, "Member 'UNPC_Hippo_Control_Rig_C::Front_Foot_R_Z' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Front_Foot_R_Z_Hit) == 0x000688, "Member 'UNPC_Hippo_Control_Rig_C::Front_Foot_R_Z_Hit' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Ball_L_Normal) == 0x000690, "Member 'UNPC_Hippo_Control_Rig_C::Ball_L_Normal' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Ball_L_Normal_Hit) == 0x0006B0, "Member 'UNPC_Hippo_Control_Rig_C::Ball_L_Normal_Hit' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Ball_R_Normal) == 0x0006D0, "Member 'UNPC_Hippo_Control_Rig_C::Ball_R_Normal' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Ball_R_Normal_Hit) == 0x0006F0, "Member 'UNPC_Hippo_Control_Rig_C::Ball_R_Normal_Hit' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Front_Foot_L_Normal) == 0x000710, "Member 'UNPC_Hippo_Control_Rig_C::Front_Foot_L_Normal' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Front_Foot_L_Normal_Hit) == 0x000730, "Member 'UNPC_Hippo_Control_Rig_C::Front_Foot_L_Normal_Hit' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Front_Foot_R_Normal) == 0x000750, "Member 'UNPC_Hippo_Control_Rig_C::Front_Foot_R_Normal' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Front_Foot_R_Normal_Hit) == 0x000770, "Member 'UNPC_Hippo_Control_Rig_C::Front_Foot_R_Normal_Hit' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Neck_01_Z) == 0x000790, "Member 'UNPC_Hippo_Control_Rig_C::Neck_01_Z' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Neck_01_Z_Hit) == 0x000798, "Member 'UNPC_Hippo_Control_Rig_C::Neck_01_Z_Hit' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Neck_02_Z) == 0x0007A0, "Member 'UNPC_Hippo_Control_Rig_C::Neck_02_Z' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Neck_02_Z_Hit) == 0x0007A8, "Member 'UNPC_Hippo_Control_Rig_C::Neck_02_Z_Hit' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Head_Z) == 0x0007B0, "Member 'UNPC_Hippo_Control_Rig_C::Head_Z' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Head_Z_Hit) == 0x0007B8, "Member 'UNPC_Hippo_Control_Rig_C::Head_Z_Hit' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Head_End_Z) == 0x0007C0, "Member 'UNPC_Hippo_Control_Rig_C::Head_End_Z' has a wrong offset!");
static_assert(offsetof(UNPC_Hippo_Control_Rig_C, Head_End_Z_Hit) == 0x0007C8, "Member 'UNPC_Hippo_Control_Rig_C::Head_End_Z_Hit' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass NPC_Hippo_Control_Rig.RigVMMemory_Literal
// 0x22F8 (0x2340 - 0x0048)
class NPC_Hippo_Control_Rig::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_1_1_Item__Const;  // 0x0048(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_1_1_1_1_1_Space__Const; // 0x0054(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_1_1_1_1_1_bInitial__Const; // 0x0055(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_2_2_1_Item__Const;       // 0x0058(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_1_1_1_1_1_Weight__Const; // 0x0064(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_1_1_1_1_1_bPropagateToChildren__Const; // 0x0068(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_1_Item__Const;    // 0x006C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_2_Item__Const;         // 0x0078(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_Item__Const;      // 0x0084(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_Item__Const;       // 0x0090(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_3_Item__Const;    // 0x009C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_2_Item__Const;     // 0x00A8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_2_Item__Const;    // 0x00B4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_1_Item__Const;     // 0x00C0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ParentConstraint_Child__Const;        // 0x00CC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransformFilter                       RigVMModel___ParentConstraint_Filter__Const;       // 0x00D8(0x0009)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___ParentConstraint_Parents__Const;      // 0x00E8(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_ParentConstraint_AdvancedSettings RigVMModel___ParentConstraint_AdvancedSettings__Const; // 0x00F8(0x0002)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___traces_1_Ray_Cast_Start__Const;       // 0x0100(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const; // 0x0110(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const; // 0x0130(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const; // 0x0150(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const; // 0x0170(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1___traces_Add_A__Const;                    // 0x0190(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_1___traces_GetTransform_Space__Const;       // 0x01A8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1___traces_GetTransform_bInitial__Const;    // 0x01A9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_1___traces_Add_B__Const;                    // 0x01B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1___traces_Subtract_B__Const;               // 0x01C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_1___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x01E0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_1___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x01F0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0xC];                                      // 0x01F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0200(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0260(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0xF];                                      // 0x0261(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0270(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_1___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x02D0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1___traces_SphereTraceByTraceChannel_Radius__Const; // 0x02D4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x02D8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x02DC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_1___traces_AimBoneMath_Primary__Const;      // 0x02E0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_1___traces_AimBoneMath_Secondary__Const;    // 0x0328(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces_1___traces_AimBoneMath_Weight__Const;       // 0x0370(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0xC];                                      // 0x0374(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces_1___traces_AimBoneMath_DebugSettings__Const; // 0x0380(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const_0; // 0x03F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const_0; // 0x0410(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const_0; // 0x0430(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const_0; // 0x0450(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_1___traces_Add_A__Const;                  // 0x0470(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_1_1___traces_GetTransform_Space__Const;     // 0x0488(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_1___traces_GetTransform_bInitial__Const;  // 0x0489(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48A[0x6];                                      // 0x048A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_1_1___traces_Add_B__Const;                  // 0x0490(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_1___traces_Subtract_B__Const;             // 0x04A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_1_1___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x04C0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_1_1___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x04D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0xC];                                      // 0x04D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_1___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x04E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_1___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0540(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0xF];                                      // 0x0541(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0550(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_1_1___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x05B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_1___traces_SphereTraceByTraceChannel_Radius__Const; // 0x05B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x05B8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x3];                                      // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x05BC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_1_1___traces_AimBoneMath_Primary__Const;    // 0x05C0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_1_1___traces_AimBoneMath_Secondary__Const;  // 0x0608(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces_1_1___traces_AimBoneMath_Weight__Const;     // 0x0650(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_654[0xC];                                      // 0x0654(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces_1_1___traces_AimBoneMath_DebugSettings__Const; // 0x0660(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const_1; // 0x06D0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const_1; // 0x06F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const_1; // 0x0710(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const_1; // 0x0730(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_1_1___traces_Add_A__Const;                // 0x0750(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_1_1_1___traces_GetTransform_Space__Const;   // 0x0768(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_1_1___traces_GetTransform_bInitial__Const; // 0x0769(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76A[0x6];                                      // 0x076A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_1_1_1___traces_Add_B__Const;                // 0x0770(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_1_1___traces_Subtract_B__Const;           // 0x0788(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_1_1_1___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x07A0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_1_1_1___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x07B0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B4[0xC];                                      // 0x07B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_1_1___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x07C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_1_1___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0820(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_821[0xF];                                      // 0x0821(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0830(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_1_1_1___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0890(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_891[0x3];                                      // 0x0891(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_1_1___traces_SphereTraceByTraceChannel_Radius__Const; // 0x0894(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_1_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0898(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_899[0x3];                                      // 0x0899(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x089C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_1_1_1___traces_AimBoneMath_Primary__Const;  // 0x08A0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_1_1_1___traces_AimBoneMath_Secondary__Const; // 0x08E8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces_1_1_1___traces_AimBoneMath_Weight__Const;   // 0x0930(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_934[0xC];                                      // 0x0934(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces_1_1_1___traces_AimBoneMath_DebugSettings__Const; // 0x0940(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const_2; // 0x09B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const_2; // 0x09D0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const_2; // 0x09F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const_2; // 0x0A10(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_1_1_1___traces_Add_A__Const;              // 0x0A30(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_1_1_1_1___traces_GetTransform_Space__Const; // 0x0A48(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_1_1_1___traces_GetTransform_bInitial__Const; // 0x0A49(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4A[0x6];                                      // 0x0A4A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_1_1_1_1___traces_Add_B__Const;              // 0x0A50(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_1_1_1___traces_Subtract_B__Const;         // 0x0A68(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_1_1_1_1___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0A80(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_1_1_1_1___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0A90(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A94[0xC];                                      // 0x0A94(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_1_1_1___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0AA0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_1_1_1___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0B00(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B01[0xF];                                      // 0x0B01(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_1_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0B10(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_1_1_1_1___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0B70(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B71[0x3];                                      // 0x0B71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_1_1_1___traces_SphereTraceByTraceChannel_Radius__Const; // 0x0B74(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_1_1_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0B78(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B79[0x3];                                      // 0x0B79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_1_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0B7C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_1_1_1_1___traces_AimBoneMath_Primary__Const; // 0x0B80(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_1_1_1_1___traces_AimBoneMath_Secondary__Const; // 0x0BC8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces_1_1_1_1___traces_AimBoneMath_Weight__Const; // 0x0C10(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C14[0xC];                                      // 0x0C14(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces_1_1_1_1___traces_AimBoneMath_DebugSettings__Const; // 0x0C20(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	double                                        RigVMModel___Divide_B__Const;                      // 0x0C90(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_2_3_Bias__Const;          // 0x0C98(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FInputRange                            RigVMModel___AlphaInterp_2_3_InRange__Const;       // 0x0C9C(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         RigVMModel___AlphaInterp_2_3_InterpSpeedIncreasing__Const; // 0x0CA4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterpQuaternionV2_2_Strength__Const; // 0x0CA8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAC[0x4];                                      // 0x0CAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___SpringInterpQuaternionV2_2_Torque__Const; // 0x0CB0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_2_3_ItemToModify__Const; // 0x0CC8(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___RigVMFunction_MathQuaternionFromEuler_1_Euler__Const; // 0x0CD8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Multiply_1_1_B__Const;                // 0x0CF0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathQuaternionFromEuler_1_RotationOrder__Const; // 0x0CF8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF9[0x7];                                      // 0x0CF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___SpringInterpQuaternionV2_Current__Const; // 0x0D00(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Greater_B__Const;                     // 0x0D20(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_SourceMaximum__Const;           // 0x0D28(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_TargetMaximum__Const;           // 0x0D30(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_1_SourceMaximum__Const;         // 0x0D38(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_Strength__Const;         // 0x0D40(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigModifyBoneMode                     RigVMModel___ModifyTransforms_2_3_Mode__Const;     // 0x0D44(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D45[0x3];                                      // 0x0D45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_2_ItemToModify__Const; // 0x0D48(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_2_1_ItemToModify__Const; // 0x0D58(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_2_2_ItemToModify__Const; // 0x0D68(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_2_2_1_ItemToModify__Const; // 0x0D78(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_1_1_1_1_1_Item__Const; // 0x0D88(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D94[0xC];                                      // 0x0D94(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___Set_Transform_1_1_1_1_1_1_1_1_Value__Const; // 0x0DA0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_Root__Const;                     // 0x0E00(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__Const;                // 0x0E08(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___GetCurveValue_2_1_Curve__Const;       // 0x0E18(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_Curve__Const;     // 0x0E20(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_1_Curve__Const;   // 0x0E28(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_1_1_Curve__Const; // 0x0E30(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_BoneSettings__Const;             // 0x0E38(0x0010)(Edit, EditConst, NonTransactional)
	TArray<class FName>                           RigVMModel___PBIK_ExcludedBones__Const;            // 0x0E48(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_Settings__Const;                 // 0x0E58(0x003C)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_Debug__Const;                    // 0x0E94(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_2_1_Item__Const;  // 0x0E9C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_1_1_Item__Const;   // 0x0EA8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_2_1_1_Item__Const; // 0x0EB4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_1_1_1_Item__Const; // 0x0EC0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_2_1_1_1_Item__Const; // 0x0ECC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_1_1_1_1_Item__Const; // 0x0ED8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ParentConstraint_1_Child__Const;      // 0x0EE4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConstraintParent>              RigVMModel___ParentConstraint_1_Parents__Const;    // 0x0EF0(0x0010)(Edit, EditConst, NonTransactional)
	double                                        RigVMModel___traces_1_1_1_1_1_1_Ray_Cast_Start__Const; // 0x0F00(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F08[0x8];                                      // 0x0F08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const_3; // 0x0F10(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const_3; // 0x0F30(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const_3; // 0x0F50(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const_3; // 0x0F70(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_1_1_1_1_1___traces_Add_A__Const;          // 0x0F90(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_1_1_1_1_1_1___traces_GetTransform_Space__Const; // 0x0FA8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_1_1_1_1_1___traces_GetTransform_bInitial__Const; // 0x0FA9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FAA[0x6];                                      // 0x0FAA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_1_1_1_1_1_1___traces_Add_B__Const;          // 0x0FB0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_1_1_1_1_1___traces_Subtract_B__Const;     // 0x0FC8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_1_1_1_1_1_1___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0FE0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_1_1_1_1_1_1___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0FF0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF4[0xC];                                      // 0x0FF4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_1_1_1_1_1___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x1000(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_1_1_1_1_1___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x1060(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1061[0xF];                                     // 0x1061(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_1_1_1_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x1070(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_1_1_1_1_1_1___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x10D0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D1[0x3];                                     // 0x10D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_1_1_1_1_1___traces_SphereTraceByTraceChannel_Radius__Const; // 0x10D4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_1_1_1_1_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x10D8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D9[0x3];                                     // 0x10D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_1_1_1_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x10DC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_1_1_1_1_1_1___traces_AimBoneMath_Primary__Const; // 0x10E0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_1_1_1_1_1_1___traces_AimBoneMath_Secondary__Const; // 0x1128(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces_1_1_1_1_1_1___traces_AimBoneMath_Weight__Const; // 0x1170(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1174[0xC];                                     // 0x1174(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces_1_1_1_1_1_1___traces_AimBoneMath_DebugSettings__Const; // 0x1180(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	double                                        RigVMModel___traces_1_1_1_1_1_1_1_Ray_Cast_Start__Const; // 0x11F0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___traces_1_1_1_1_1_1_1_Ray_Cast_End__Const; // 0x11F8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const_4; // 0x1200(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const_4; // 0x1220(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const_4; // 0x1240(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const_4; // 0x1260(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_1_1_1_1_1_1___traces_Add_A__Const;        // 0x1280(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_1_1_1_1_1_1_1___traces_GetTransform_Space__Const; // 0x1298(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_1_1_1_1_1_1___traces_GetTransform_bInitial__Const; // 0x1299(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129A[0x6];                                     // 0x129A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_1_1_1_1_1_1_1___traces_Add_B__Const;        // 0x12A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_1_1_1_1_1_1___traces_Subtract_B__Const;   // 0x12B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_1_1_1_1_1_1_1___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x12D0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_1_1_1_1_1_1_1___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x12E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12E4[0xC];                                     // 0x12E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_1_1_1_1_1_1___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x12F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_1_1_1_1_1_1___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x1350(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1351[0xF];                                     // 0x1351(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_1_1_1_1_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x1360(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_1_1_1_1_1_1_1___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x13C0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C1[0x3];                                     // 0x13C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_1_1_1_1_1_1___traces_SphereTraceByTraceChannel_Radius__Const; // 0x13C4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_1_1_1_1_1_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x13C8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C9[0x3];                                     // 0x13C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_1_1_1_1_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x13CC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_1_1_1_1_1_1_1___traces_AimBoneMath_Primary__Const; // 0x13D0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_1_1_1_1_1_1_1___traces_AimBoneMath_Secondary__Const; // 0x1418(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
