#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Seer_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_Seer_AnimBP.NPC_Seer_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01CF (0x01D0 - 0x0001)
struct NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_470;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_471;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_472;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_473;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_474;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_475;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_476;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_477;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_478;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_479;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_480;                                 // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_481;                                // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_482;                                // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_483;                               // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          __StructProperty_484;                              // 0x0078(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_485;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_486;                               // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_487;                                // 0x00B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_488;                               // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_489;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_490;                                // 0x00B9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_491;                                // 0x00BC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_492;                                 // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_493;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_494;                                // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_495;                                 // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_496;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_497;                                // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_498;                                  // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_499;                                // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_500;                                // 0x0101(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_501;                                // 0x0102(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_502;                               // 0x0108(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_503;                              // 0x0118(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0138(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01B8(0x0018)()
};
static_assert(alignof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001D0, "Wrong size on NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_470) == 0x000004, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_470' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_471) == 0x000010, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_471' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_472) == 0x000020, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_472' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_473) == 0x000028, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_473' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_474) == 0x000030, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_474' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_475) == 0x000034, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_475' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_476) == 0x00003C, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_476' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_477) == 0x000040, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_477' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_478) == 0x000048, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_478' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_479) == 0x000050, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_479' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_480) == 0x000058, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_480' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_481) == 0x00005C, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_481' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_482) == 0x000060, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_482' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_483) == 0x000068, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_483' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_484) == 0x000078, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_484' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_485) == 0x0000A4, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_485' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_486) == 0x0000AC, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_486' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_487) == 0x0000B0, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_487' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_488) == 0x0000B4, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_488' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_489) == 0x0000B8, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_489' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_490) == 0x0000B9, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_490' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_491) == 0x0000BC, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_491' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_492) == 0x0000C4, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_492' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_493) == 0x0000C8, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_493' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_494) == 0x0000D0, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_494' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_495) == 0x0000D8, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_495' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_496) == 0x0000E0, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_496' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_497) == 0x0000F0, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_497' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_498) == 0x0000F8, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_498' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_499) == 0x000100, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_499' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_500) == 0x000101, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_500' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_501) == 0x000102, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_501' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_502) == 0x000108, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_502' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_503) == 0x000118, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_503' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000138, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001B8, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct NPC_Seer_AnimBP.NPC_Seer_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x004F (0x0050 - 0x0001)
struct NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_8;                                   // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_10;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_15;                                  // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_17;                                  // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_18;                                 // 0x004C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000050, "Wrong size on NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x000008, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x00000C, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000010, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000014, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x000018, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x00001C, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000020, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_8) == 0x000024, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_8' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_9) == 0x000028, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_9' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x00002C, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000030, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x000034, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_13) == 0x000038, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_13' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_14) == 0x00003C, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_14' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_15) == 0x000040, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_15' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_16) == 0x000044, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_16' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_17) == 0x000048, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_17' has a wrong offset!");
static_assert(offsetof(NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_18) == 0x00004C, "Member 'NPC_Seer_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_18' has a wrong offset!");

}

