#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_SkeletonWarrior_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NPC_SkeletonWarrior_AnimBP.NPC_SkeletonWarrior_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct NPC_SkeletonWarrior_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NPC_SkeletonWarrior_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on NPC_SkeletonWarrior_AnimBP_C_AnimGraph");
static_assert(sizeof(NPC_SkeletonWarrior_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on NPC_SkeletonWarrior_AnimBP_C_AnimGraph");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'NPC_SkeletonWarrior_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function NPC_SkeletonWarrior_AnimBP.NPC_SkeletonWarrior_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct NPC_SkeletonWarrior_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_SkeletonWarrior_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on NPC_SkeletonWarrior_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(NPC_SkeletonWarrior_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on NPC_SkeletonWarrior_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'NPC_SkeletonWarrior_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function NPC_SkeletonWarrior_AnimBP.NPC_SkeletonWarrior_AnimBP_C.ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP
// 0x0024 (0x0024 - 0x0000)
struct NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP) == 0x000004, "Wrong alignment on NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP");
static_assert(sizeof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP) == 0x000024, "Wrong size on NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, EntryPoint) == 0x000000, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_RandomInteger_ReturnValue) == 0x000010, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000014, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x000015, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x000016, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_Not_PreBool_ReturnValue_3) == 0x000017, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x000018, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_BooleanAND_ReturnValue_3) == 0x000019, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_BooleanAND_ReturnValue_4) == 0x00001A, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_Not_PreBool_ReturnValue_4) == 0x00001B, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_BooleanAND_ReturnValue_5) == 0x00001C, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_Not_PreBool_ReturnValue_5) == 0x00001D, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_Not_PreBool_ReturnValue_6) == 0x00001E, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_BooleanAND_ReturnValue_6) == 0x00001F, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_BooleanAND_ReturnValue_7) == 0x000020, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000021, "Member 'NPC_SkeletonWarrior_AnimBP_C_ExecuteUbergraph_NPC_SkeletonWarrior_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

