#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_BogBrute_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_BogBrute_AnimBP.NPC_BogBrute_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01DF (0x01E0 - 0x0001)
struct NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_503;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_504;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_505;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_506;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_507;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_508;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_509;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_510;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_511;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_512;                                 // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_513;                              // 0x0058(0x002C)(BlueprintVisible, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_514;                               // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_515;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_516;                                 // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_517;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_518;                                // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_519;                                 // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_520;                               // 0x00B8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_521;                               // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_522;                               // 0x00D8(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_523;                               // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_524;                                // 0x00EC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_525;                               // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_526;                                // 0x00F4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_527;                                // 0x00F5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_528;                                // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_529;                                // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_530;                                  // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_531;                                // 0x0110(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_532;                                // 0x0111(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_533;                                // 0x0112(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_534;                               // 0x0118(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_535;                              // 0x0128(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0148(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C8(0x0018)()
};
static_assert(alignof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001E0, "Wrong size on NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_503) == 0x000004, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_503' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_504) == 0x00000C, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_504' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_505) == 0x000018, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_505' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_506) == 0x000028, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_506' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_507) == 0x000030, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_507' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_508) == 0x000038, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_508' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_509) == 0x00003C, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_509' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_510) == 0x000044, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_510' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_511) == 0x00004C, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_511' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_512) == 0x000054, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_512' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_513) == 0x000058, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_513' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_514) == 0x000088, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_514' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_515) == 0x000098, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_515' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_516) == 0x0000A0, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_516' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_517) == 0x0000A4, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_517' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_518) == 0x0000AC, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_518' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_519) == 0x0000B4, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_519' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_520) == 0x0000B8, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_520' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_521) == 0x0000C8, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_521' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_522) == 0x0000D8, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_522' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_523) == 0x0000E8, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_523' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_524) == 0x0000EC, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_524' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_525) == 0x0000F0, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_525' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_526) == 0x0000F4, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_526' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_527) == 0x0000F5, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_527' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_528) == 0x0000F8, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_528' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_529) == 0x000100, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_529' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_530) == 0x000108, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_530' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_531) == 0x000110, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_531' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_532) == 0x000111, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_532' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_533) == 0x000112, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_533' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_534) == 0x000118, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_534' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_535) == 0x000128, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_535' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000148, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001C8, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct NPC_BogBrute_AnimBP.NPC_BogBrute_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x003F (0x0040 - 0x0001)
struct NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_6;                                   // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_8;                                   // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_10;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x003D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000040, "Wrong size on NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000004, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000008, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x00000C, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000010, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_6) == 0x000014, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_6' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x000018, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_8) == 0x00001C, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_8' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_9) == 0x000020, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_9' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000024, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000028, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x00002C, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_13) == 0x000030, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_13' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_14) == 0x000034, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_14' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_15) == 0x000038, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_15' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_16) == 0x00003C, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_16' has a wrong offset!");
static_assert(offsetof(NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_17) == 0x00003D, "Member 'NPC_BogBrute_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_17' has a wrong offset!");

}

