#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Deer_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NPC_Deer_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NPC_Deer_AnimBP.NPC_Deer_AnimBP_C
// 0x1B20 (0x3760 - 0x1C40)
class UNPC_Deer_AnimBP_C : public UAoCNPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1C40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct NPC_Deer_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;              // 0x1C48(0x0060)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1CA8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1CB0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1CB8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1CD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1D00(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x1D28(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x1D70(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x1DB8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x1E00(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x1E20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1E48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1E70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1E98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1EC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1EE8(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_2;          // 0x1F10(0x0118)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x2028(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2050(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2078(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x20A0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x20C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2110(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x2130(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x2178(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x2198(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x21B8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x2280(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x22A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x22E8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x2330(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2378(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x23C0(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x2408(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2520(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x2568(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x25B0(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x25D0(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x26E8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2758(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x2778(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2840(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2860(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2928(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x29A8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2AD0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2AF0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2B10(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x2C38(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x2C80(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2CA8(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x2D28(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x2D70(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x2DB8(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x2E00(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x2E48(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x2E90(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x2ED8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x2F20(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x2F68(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x2FB0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x2FF8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x3040(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x3088(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x30B0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x30D8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x3120(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x3148(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x3170(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x3198(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x31C0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x31E8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x3230(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3258(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x32D8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x33C8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x33F0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x34B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x34E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x3508(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x3530(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x3620(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x3648(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3710(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3738(0x0028)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_NPCNotAttacking();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_NPC_Deer_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Deer_AnimBP_C">();
	}
	static class UNPC_Deer_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_Deer_AnimBP_C>();
	}
};
static_assert(alignof(UNPC_Deer_AnimBP_C) == 0x000010, "Wrong alignment on UNPC_Deer_AnimBP_C");
static_assert(sizeof(UNPC_Deer_AnimBP_C) == 0x003760, "Wrong size on UNPC_Deer_AnimBP_C");
static_assert(offsetof(UNPC_Deer_AnimBP_C, UberGraphFrame) == 0x001C40, "Member 'UNPC_Deer_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, __AnimBlueprintMutables) == 0x001C48, "Member 'UNPC_Deer_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x001CA8, "Member 'UNPC_Deer_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimBlueprintExtension_Base) == 0x001CB0, "Member 'UNPC_Deer_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_Root) == 0x001CB8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TransitionResult_11) == 0x001CD8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TransitionResult_10) == 0x001D00, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x001D28, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x001D70, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x001DB8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_StateResult_7) == 0x001E00, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TransitionResult_9) == 0x001E20, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x001E48, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x001E70, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x001E98, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x001EC0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x001EE8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace_2) == 0x001F10, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace_2' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x002028, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x002050, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x002078, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TransitionResult) == 0x0020A0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x0020C8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_StateResult_6) == 0x002110, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x002130, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_StateResult_5) == 0x002178, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_StateResult_4) == 0x002198, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_StateMachine_2) == 0x0021B8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_StateResult_3) == 0x002280, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x0022A0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x0022E8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x002330, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x002378, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_BlendListByInt_2) == 0x0023C0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_BlendListByInt_2' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace_1) == 0x002408, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x002520, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x002568, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_StateResult_2) == 0x0025B0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x0025D0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x0026E8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_StateResult_1) == 0x002758, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x002778, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_StateResult) == 0x002840, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_StateMachine) == 0x002860, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_SaveCachedPose_2) == 0x002928, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0029A8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002AD0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002AF0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_ModifyBone) == 0x002B10, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_Slot_9) == 0x002C38, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_Slot_9' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_15) == 0x002C80, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_15' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x002CA8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_Slot_8) == 0x002D28, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_Slot_8' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x002D70, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_Slot_7) == 0x002DB8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_Slot_7' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_BlendListByInt_1) == 0x002E00, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_Slot_6) == 0x002E48, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_Slot_6' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_Slot_5) == 0x002E90, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x002ED8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_Slot_4) == 0x002F20, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_BlendListByInt) == 0x002F68, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_Slot_3) == 0x002FB0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_Slot_2) == 0x002FF8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_Slot_1) == 0x003040, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_14) == 0x003088, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_14' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_13) == 0x0030B0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_13' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_Slot) == 0x0030D8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_12) == 0x003120, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_12' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_11) == 0x003148, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_11' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_10) == 0x003170, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_9) == 0x003198, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_8) == 0x0031C0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x0031E8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_7) == 0x003230, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x003258, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_LayeredBoneBlend_1) == 0x0032D8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_6) == 0x0033C8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TwoWayBlend_1) == 0x0033F0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TwoWayBlend_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_5) == 0x0034B8, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_4) == 0x0034E0, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_3) == 0x003508, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x003530, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x003620, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_TwoWayBlend) == 0x003648, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x003710, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UNPC_Deer_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x003738, "Member 'UNPC_Deer_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

