#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Wolf_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function NPC_Wolf_AnimBP.NPC_Wolf_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct NPC_Wolf_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NPC_Wolf_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on NPC_Wolf_AnimBP_C_AnimGraph");
static_assert(sizeof(NPC_Wolf_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on NPC_Wolf_AnimBP_C_AnimGraph");
static_assert(offsetof(NPC_Wolf_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'NPC_Wolf_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function NPC_Wolf_AnimBP.NPC_Wolf_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct NPC_Wolf_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Wolf_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on NPC_Wolf_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(NPC_Wolf_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on NPC_Wolf_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(NPC_Wolf_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'NPC_Wolf_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function NPC_Wolf_AnimBP.NPC_Wolf_AnimBP_C.ExecuteUbergraph_NPC_Wolf_AnimBP
// 0x00A8 (0x00A8 - 0x0000)
struct NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_1;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ProjectAngleTo360_360Angle;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ProjectAngleTo360_360Angle_1;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ProjectAngleTo360_Angle_ImplicitCast;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ProjectAngleTo360_Angle_ImplicitCast_1;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP) == 0x000008, "Wrong alignment on NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP");
static_assert(sizeof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP) == 0x0000A8, "Wrong size on NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, EntryPoint) == 0x000000, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_FMax_ReturnValue) == 0x000010, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000018, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_BreakRotator_Roll) == 0x000030, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_BreakRotator_Pitch) == 0x000034, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_BreakRotator_Yaw) == 0x000038, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_GetOwningActor_ReturnValue_1) == 0x000040, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_GetOwningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_ProjectAngleTo360_360Angle) == 0x000048, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_ProjectAngleTo360_360Angle' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000050, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_BreakRotator_Roll_1) == 0x000068, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_BreakRotator_Pitch_1) == 0x00006C, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_BreakRotator_Yaw_1) == 0x000070, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_ProjectAngleTo360_360Angle_1) == 0x000078, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_ProjectAngleTo360_360Angle_1' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000080, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000088, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_FMax_A_ImplicitCast) == 0x000090, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_ProjectAngleTo360_Angle_ImplicitCast) == 0x000098, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_ProjectAngleTo360_Angle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP, CallFunc_ProjectAngleTo360_Angle_ImplicitCast_1) == 0x0000A0, "Member 'NPC_Wolf_AnimBP_C_ExecuteUbergraph_NPC_Wolf_AnimBP::CallFunc_ProjectAngleTo360_Angle_ImplicitCast_1' has a wrong offset!");

// Function NPC_Wolf_AnimBP.NPC_Wolf_AnimBP_C.ProjectAngleTo360
// 0x0020 (0x0020 - 0x0000)
struct NPC_Wolf_AnimBP_C_ProjectAngleTo360 final
{
public:
	double                                        Angle;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Three60Angle;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Wolf_AnimBP_C_ProjectAngleTo360) == 0x000008, "Wrong alignment on NPC_Wolf_AnimBP_C_ProjectAngleTo360");
static_assert(sizeof(NPC_Wolf_AnimBP_C_ProjectAngleTo360) == 0x000020, "Wrong size on NPC_Wolf_AnimBP_C_ProjectAngleTo360");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ProjectAngleTo360, Angle) == 0x000000, "Member 'NPC_Wolf_AnimBP_C_ProjectAngleTo360::Angle' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ProjectAngleTo360, Three60Angle) == 0x000008, "Member 'NPC_Wolf_AnimBP_C_ProjectAngleTo360::Three60Angle' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ProjectAngleTo360, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'NPC_Wolf_AnimBP_C_ProjectAngleTo360::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Wolf_AnimBP_C_ProjectAngleTo360, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000018, "Member 'NPC_Wolf_AnimBP_C_ProjectAngleTo360::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

}

