#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Raven_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_Raven_AnimBP.NPC_Raven_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x020F (0x0210 - 0x0001)
struct NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_511;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_512;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_513;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_514;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_515;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_516;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_517;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_518;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_519;                                // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_520;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_521;                               // 0x0060(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_522;                               // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_523;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_524;                                // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_525;                                 // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_526;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_527;                                 // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_528;                              // 0x00A0(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_529;                                // 0x00CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_530;                               // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_531;                                // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_532;                               // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_533;                                // 0x00E0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_534;                                // 0x00E1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_535;                                // 0x00E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_536;                                 // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_537;                                // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_538;                                // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_539;                                // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_540;                                 // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_541;                               // 0x0110(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_542;                               // 0x0120(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_543;                                // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_544;                                  // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_545;                                // 0x0140(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_546;                                // 0x0141(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_547;                                // 0x0142(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_548;                               // 0x0148(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_549;                              // 0x0158(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0178(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01F8(0x0018)()
};
static_assert(alignof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000210, "Wrong size on NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_511) == 0x000004, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_511' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_512) == 0x00000C, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_512' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_513) == 0x000018, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_513' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_514) == 0x000028, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_514' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_515) == 0x000030, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_515' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_516) == 0x000038, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_516' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_517) == 0x000040, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_517' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_518) == 0x000048, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_518' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_519) == 0x000050, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_519' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_520) == 0x000054, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_520' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_521) == 0x000060, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_521' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_522) == 0x000070, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_522' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_523) == 0x000080, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_523' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_524) == 0x000088, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_524' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_525) == 0x000090, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_525' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_526) == 0x000094, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_526' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_527) == 0x00009C, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_527' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_528) == 0x0000A0, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_528' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_529) == 0x0000CC, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_529' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_530) == 0x0000D4, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_530' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_531) == 0x0000D8, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_531' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_532) == 0x0000DC, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_532' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_533) == 0x0000E0, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_533' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_534) == 0x0000E1, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_534' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_535) == 0x0000E4, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_535' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_536) == 0x0000EC, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_536' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_537) == 0x0000F0, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_537' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_538) == 0x0000F8, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_538' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_539) == 0x000100, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_539' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_540) == 0x000108, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_540' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_541) == 0x000110, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_541' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_542) == 0x000120, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_542' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_543) == 0x000130, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_543' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_544) == 0x000138, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_544' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_545) == 0x000140, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_545' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_546) == 0x000141, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_546' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_547) == 0x000142, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_547' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_548) == 0x000148, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_548' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_549) == 0x000158, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_549' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000178, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001F8, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct NPC_Raven_AnimBP.NPC_Raven_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x004B (0x004C - 0x0001)
struct NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_6;                                   // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_13;                                  // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_15;                                  // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00004C, "Wrong size on NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x00000C, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x00001C, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_6) == 0x000020, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_6' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x000024, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000028, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x00002C, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000030, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000034, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_12) == 0x000038, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_12' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_13) == 0x00003C, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_13' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_14) == 0x000040, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_14' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_15) == 0x000044, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_15' has a wrong offset!");
static_assert(offsetof(NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_16) == 0x000048, "Member 'NPC_Raven_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_16' has a wrong offset!");

}

