#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Haunt_Knight_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_Haunt_Knight_AnimBP.NPC_Haunt_Knight_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01F7 (0x01F8 - 0x0001)
struct NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_440;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_441;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_442;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_443;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_444;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_445;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_446;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_447;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_448;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_449;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_450;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_451;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_452;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_453;                               // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          __StructProperty_454;                              // 0x0080(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_455;                                // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_456;                                 // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_457;                               // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_458;                                // 0x00BC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_459;                               // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_460;                                // 0x00C4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_461;                                // 0x00C5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_462;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_463;                                // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_464;                                // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_465;                                 // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_466;                               // 0x00E8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_467;                               // 0x00F8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_468;                               // 0x0108(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_469;                                // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_470;                                  // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_471;                                // 0x0128(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_472;                                // 0x0129(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_473;                                // 0x012A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_474;                               // 0x0130(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_475;                              // 0x0140(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0160(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01E0(0x0018)()
};
static_assert(alignof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001F8, "Wrong size on NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_440) == 0x000004, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_440' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_441) == 0x00000C, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_441' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_442) == 0x000018, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_442' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_443) == 0x000028, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_443' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_444) == 0x000030, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_444' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_445) == 0x000038, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_445' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_446) == 0x00003C, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_446' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_447) == 0x000044, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_447' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_448) == 0x00004C, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_448' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_449) == 0x000054, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_449' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_450) == 0x00005C, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_450' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_451) == 0x000060, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_451' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_452) == 0x000064, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_452' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_453) == 0x000070, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_453' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_454) == 0x000080, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_454' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_455) == 0x0000AC, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_455' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_456) == 0x0000B4, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_456' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_457) == 0x0000B8, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_457' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_458) == 0x0000BC, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_458' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_459) == 0x0000C0, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_459' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_460) == 0x0000C4, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_460' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_461) == 0x0000C5, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_461' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_462) == 0x0000C8, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_462' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_463) == 0x0000D0, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_463' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_464) == 0x0000D8, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_464' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_465) == 0x0000E0, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_465' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_466) == 0x0000E8, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_466' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_467) == 0x0000F8, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_467' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_468) == 0x000108, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_468' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_469) == 0x000118, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_469' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_470) == 0x000120, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_470' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_471) == 0x000128, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_471' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_472) == 0x000129, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_472' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_473) == 0x00012A, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_473' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_474) == 0x000130, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_474' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_475) == 0x000140, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_475' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000160, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001E0, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct NPC_Haunt_Knight_AnimBP.NPC_Haunt_Knight_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0037 (0x0038 - 0x0001)
struct NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_4;                                   // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_9;                                   // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_11;                                  // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0035(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000038, "Wrong size on NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x000008, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x00000C, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000010, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_4) == 0x000014, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_4' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000018, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x00001C, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000020, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_8) == 0x000024, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_8' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_9) == 0x000028, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_9' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_10) == 0x00002C, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_10' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_11) == 0x000030, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_11' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_12) == 0x000034, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_12' has a wrong offset!");
static_assert(offsetof(NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_13) == 0x000035, "Member 'NPC_Haunt_Knight_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_13' has a wrong offset!");

}

