#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_GraveyardGolem_Control_Rig_High

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "PBIK_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass NPC_GraveyardGolem_Control_Rig_High.NPC_GraveyardGolem_Control_Rig_High_C
// 0x0008 (0x0638 - 0x0630)
class UNPC_GraveyardGolem_Control_Rig_High_C final : public UControlRig
{
public:
	bool                                          Dead;                                              // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_GraveyardGolem_Control_Rig_High_C">();
	}
	static class UNPC_GraveyardGolem_Control_Rig_High_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_GraveyardGolem_Control_Rig_High_C>();
	}
};
static_assert(alignof(UNPC_GraveyardGolem_Control_Rig_High_C) == 0x000008, "Wrong alignment on UNPC_GraveyardGolem_Control_Rig_High_C");
static_assert(sizeof(UNPC_GraveyardGolem_Control_Rig_High_C) == 0x000638, "Wrong size on UNPC_GraveyardGolem_Control_Rig_High_C");
static_assert(offsetof(UNPC_GraveyardGolem_Control_Rig_High_C, Dead) == 0x000630, "Member 'UNPC_GraveyardGolem_Control_Rig_High_C::Dead' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass NPC_GraveyardGolem_Control_Rig_High.RigVMMemory_Literal
// 0x14D8 (0x1520 - 0x0048)
class NPC_GraveyardGolem_Control_Rig_High::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_1_1_1_Item__Const; // 0x0048(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_1_1_1_1_1_1_Space__Const; // 0x0054(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_1_1_1_1_1_1_bInitial__Const; // 0x0055(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_2_2_1_1_Item__Const;     // 0x0058(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_1_1_1_1_1_1_Weight__Const; // 0x0064(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_1_1_1_1_1_1_bPropagateToChildren__Const; // 0x0068(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_1_1_Item__Const;  // 0x006C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_2_1_Item__Const;       // 0x0078(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_1_Item__Const;    // 0x0084(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_2_Item__Const;         // 0x0090(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_Item__Const;      // 0x009C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_Item__Const;       // 0x00A8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_2_Item__Const;    // 0x00B4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_1_Item__Const;     // 0x00C0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ParentConstraint_Child__Const;        // 0x00CC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransformFilter                       RigVMModel___ParentConstraint_Filter__Const;       // 0x00D8(0x0009)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___ParentConstraint_Parents__Const;      // 0x00E8(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_ParentConstraint_AdvancedSettings RigVMModel___ParentConstraint_AdvancedSettings__Const; // 0x00F8(0x0002)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___trace_pelvis_z_1_Ray_Cast_Start__Const; // 0x0100(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___trace_pelvis_z_1_Ray_Cast_End__Const; // 0x0108(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__trace_pelvis_z_foot_normal_hit_L__Const; // 0x0110(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__trace_pelvis_z_foot_normal_hit_target__Const; // 0x0130(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__trace_pelvis_z_foot_normal_hit_r__Const; // 0x0150(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__trace_pelvis_z_foot_normal_hit_r_target__Const; // 0x0170(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_pelvis_z_1___trace_pelvis_z_Add_A__Const;    // 0x0190(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          trace_pelvis_z_1___trace_pelvis_z_GetTransform_Space__Const; // 0x01A8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          trace_pelvis_z_1___trace_pelvis_z_GetTransform_bInitial__Const; // 0x01A9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                trace_pelvis_z_1___trace_pelvis_z_Add_B__Const;    // 0x01B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_pelvis_z_1___trace_pelvis_z_Subtract_B__Const; // 0x01C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           trace_pelvis_z_1___trace_pelvis_z_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x01E0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         trace_pelvis_z_1___trace_pelvis_z_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x01F0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0xC];                                      // 0x01F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_pelvis_z_1___trace_pelvis_z_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0200(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          trace_pelvis_z_1___trace_pelvis_z_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0260(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                trace_pelvis_z_1___trace_pelvis_z_AimBoneMath_Primary__Const; // 0x0268(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	ETraceTypeQuery                               trace_pelvis_z_1___trace_pelvis_z_SphereTraceByTraceChannel_TraceChannel__Const; // 0x02B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         trace_pelvis_z_1___trace_pelvis_z_SphereTraceByTraceChannel_Radius__Const; // 0x02B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                trace_pelvis_z_1___trace_pelvis_z_AimBoneMath_Secondary__Const; // 0x02B8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         trace_pelvis_z_1___trace_pelvis_z_AimBoneMath_Weight__Const; // 0x0300(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0xC];                                      // 0x0304(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         trace_pelvis_z_1___trace_pelvis_z_AimBoneMath_DebugSettings__Const; // 0x0310(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathQuaternionToEuler_1_RotationOrder__Const; // 0x0380(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_ItemToModify__Const; // 0x0388(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0x0398(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DISPATCH_RigVMDispatch_If_5_False__Const; // 0x03B0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterpQuaternionV2_Strength__Const; // 0x03B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___SpringInterpQuaternionV2_Current__Const; // 0x03C0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigModifyBoneMode                     RigVMModel___ModifyTransforms_1_Mode__Const;       // 0x03E0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___traces_1_Ray_Cast_Start__Const;       // 0x03E8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const; // 0x03F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const; // 0x0410(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const; // 0x0430(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const; // 0x0450(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1___traces_Add_A__Const;                    // 0x0470(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_1___traces_GetTransform_Space__Const;       // 0x0488(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1___traces_GetTransform_bInitial__Const;    // 0x0489(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48A[0x6];                                      // 0x048A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_1___traces_Add_B__Const;                    // 0x0490(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1___traces_Subtract_B__Const;               // 0x04A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_1___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x04C0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_1___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x04D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0xC];                                      // 0x04D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x04E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0540(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0xF];                                      // 0x0541(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0550(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_1___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x05B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1___traces_SphereTraceByTraceChannel_Radius__Const; // 0x05B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x05B8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x3];                                      // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x05BC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_1___traces_AimBoneMath_Primary__Const;      // 0x05C0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_1___traces_AimBoneMath_Secondary__Const;    // 0x0608(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces_1___traces_AimBoneMath_Weight__Const;       // 0x0650(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_654[0xC];                                      // 0x0654(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces_1___traces_AimBoneMath_DebugSettings__Const; // 0x0660(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FInputRange                            RigVMModel___AlphaInterp_2_InRange__Const;         // 0x06D0(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         RigVMModel___AlphaInterp_2_InterpSpeedIncreasing__Const; // 0x06D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC[0x4];                                      // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_2_ItemToModify__Const; // 0x06E0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const_0; // 0x06F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const_0; // 0x0710(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const_0; // 0x0730(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const_0; // 0x0750(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_1___traces_Add_A__Const;                  // 0x0770(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_1_1___traces_GetTransform_Space__Const;     // 0x0788(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_1___traces_GetTransform_bInitial__Const;  // 0x0789(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78A[0x6];                                      // 0x078A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_1_1___traces_Add_B__Const;                  // 0x0790(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_1___traces_Subtract_B__Const;             // 0x07A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_1_1___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x07C0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_1_1___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x07D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D4[0xC];                                      // 0x07D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_1___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x07E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_1___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0840(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_841[0xF];                                      // 0x0841(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0850(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_1_1___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x08B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B1[0x3];                                      // 0x08B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_1___traces_SphereTraceByTraceChannel_Radius__Const; // 0x08B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x08B8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B9[0x3];                                      // 0x08B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_1___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x08BC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_1_1___traces_AimBoneMath_Primary__Const;    // 0x08C0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_1_1___traces_AimBoneMath_Secondary__Const;  // 0x0908(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces_1_1___traces_AimBoneMath_Weight__Const;     // 0x0950(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_954[0xC];                                      // 0x0954(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces_1_1___traces_AimBoneMath_DebugSettings__Const; // 0x0960(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_2_1_ItemToModify__Const; // 0x09D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const_1; // 0x09E0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const_1; // 0x0A00(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const_1; // 0x0A20(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const_1; // 0x0A40(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_2___traces_Add_A__Const;                  // 0x0A60(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_1_2___traces_GetTransform_Space__Const;     // 0x0A78(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_2___traces_GetTransform_bInitial__Const;  // 0x0A79(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A7A[0x6];                                      // 0x0A7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_1_2___traces_Add_B__Const;                  // 0x0A80(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_2___traces_Subtract_B__Const;             // 0x0A98(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_1_2___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0AB0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_1_2___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0AC0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC4[0xC];                                      // 0x0AC4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_2___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0AD0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_2___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0B30(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B31[0xF];                                      // 0x0B31(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_2___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0B40(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_1_2___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0BA0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA1[0x3];                                      // 0x0BA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_2___traces_SphereTraceByTraceChannel_Radius__Const; // 0x0BA4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_1_2___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0BA8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA9[0x3];                                      // 0x0BA9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_2___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0BAC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_1_2___traces_AimBoneMath_Primary__Const;    // 0x0BB0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_1_2___traces_AimBoneMath_Secondary__Const;  // 0x0BF8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces_1_2___traces_AimBoneMath_Weight__Const;     // 0x0C40(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C44[0xC];                                      // 0x0C44(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces_1_2___traces_AimBoneMath_DebugSettings__Const; // 0x0C50(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_2_2_ItemToModify__Const; // 0x0CC0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_L__Const_2; // 0x0CD0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_target__Const_2; // 0x0CF0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r__Const_2; // 0x0D10(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__traces_foot_normal_hit_r_target__Const_2; // 0x0D30(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_3___traces_Add_A__Const;                  // 0x0D50(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          traces_1_3___traces_GetTransform_Space__Const;     // 0x0D68(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_3___traces_GetTransform_bInitial__Const;  // 0x0D69(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6A[0x6];                                      // 0x0D6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                traces_1_3___traces_Add_B__Const;                  // 0x0D70(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                traces_1_3___traces_Subtract_B__Const;             // 0x0D88(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           traces_1_3___traces_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0DA0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         traces_1_3___traces_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0DB0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB4[0xC];                                      // 0x0DB4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_3___traces_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0DC0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          traces_1_3___traces_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0E20(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E21[0xF];                                      // 0x0E21(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             traces_1_3___traces_RigVMFunction_DebugTransformMutableNoSpace_Transform__Const; // 0x0E30(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               traces_1_3___traces_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0E90(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E91[0x3];                                      // 0x0E91(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_3___traces_SphereTraceByTraceChannel_Radius__Const; // 0x0E94(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    traces_1_3___traces_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0E98(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E99[0x3];                                      // 0x0E99(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         traces_1_3___traces_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0E9C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                traces_1_3___traces_AimBoneMath_Primary__Const;    // 0x0EA0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                traces_1_3___traces_AimBoneMath_Secondary__Const;  // 0x0EE8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         traces_1_3___traces_AimBoneMath_Weight__Const;     // 0x0F30(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F34[0xC];                                      // 0x0F34(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         traces_1_3___traces_AimBoneMath_DebugSettings__Const; // 0x0F40(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_2_3_ItemToModify__Const; // 0x0FB0(0x0010)(Edit, EditConst, NonTransactional)
	double                                        RigVMModel___Less_1_B__Const;                      // 0x0FC0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_3_SourceMaximum__Const;         // 0x0FC8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_3_TargetMaximum__Const;         // 0x0FD0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_1_2_SourceMaximum__Const;       // 0x0FD8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_1_2_TargetMaximum__Const;       // 0x0FE0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_2_TargetMaximum__Const;         // 0x0FE8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_1_TargetMaximum__Const;         // 0x0FF0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_Root__Const;                     // 0x0FF8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__Const;                // 0x1000(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_Curve__Const;     // 0x1010(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_3_Curve__Const;   // 0x1018(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_1_Curve__Const;   // 0x1020(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_1_1_Curve__Const; // 0x1028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_1_1_1_Curve__Const; // 0x1030(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_BoneSettings__Const;             // 0x1038(0x0010)(Edit, EditConst, NonTransactional)
	TArray<class FName>                           RigVMModel___PBIK_ExcludedBones__Const;            // 0x1048(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_Settings__Const;                 // 0x1058(0x003C)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_Debug__Const;                    // 0x1094(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_Item__Const;  // 0x109C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_Parent__Const; // 0x10A8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Item_1_Name__Const;  // 0x10B4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10BC[0x4];                                     // 0x10BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___Control_Stack_at_Item_1_Settings__Const; // 0x10C0(0x00D0)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___Control_Stack_at_Item_1_Control_Suffix__Const; // 0x1190(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Item_1_Null_Suffix__Const; // 0x1198(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Item_1___Control_Stack_at_Item_GetTransform_1_Space__Const; // 0x11A0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Item_1___Control_Stack_at_Item_GetTransform_1_bInitial__Const; // 0x11A1(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A2[0x2];                                     // 0x11A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Item_1___Control_Stack_at_Item_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x11A4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_control__Const; // 0x11AC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_null__Const; // 0x11B8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_secondary_ctrl__Const; // 0x11C4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_bottom_null__Const; // 0x11D0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_Parent__Const; // 0x11DC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_OffsetSpace__Const; // 0x11E8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E9[0x3];                                     // 0x11E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_2_B__Const; // 0x11EC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11F4[0xC];                                     // 0x11F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_1_OffsetTransform__Const; // 0x1200(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Add_Null_Above___Add_Null_Above_Replace_New__Const; // 0x1260(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Add_Null_Above___Add_Null_Above_GetTransform_1_Space__Const; // 0x1268(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Add_Null_Above___Add_Null_Above_GetTransform_1_bInitial__Const; // 0x1269(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126A[0x2];                                     // 0x126A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_Name__Const; // 0x126C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_Space__Const; // 0x1274(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_bInitial__Const; // 0x1275(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1276[0x2];                                     // 0x1276(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_Weight__Const; // 0x1278(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_1_1_B__Const; // 0x127C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_2_Name__Const; // 0x1284(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_1_Name__Const; // 0x128C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Item_1___Control_Stack_at_Item_DISPATCH_RigDispatch_SetMetadata_1_1_1_Name__Const; // 0x1294(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_1_Item__Const; // 0x129C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Item_1_1___Control_Stack_at_Item_GetTransform_1_Space__Const; // 0x12A8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Item_1_1___Control_Stack_at_Item_GetTransform_1_bInitial__Const; // 0x12A9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12AA[0x2];                                     // 0x12AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Item_1_1___Control_Stack_at_Item_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x12AC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_control__Const_0; // 0x12B4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_null__Const_0; // 0x12C0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_secondary_ctrl__Const_0; // 0x12CC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_bottom_null__Const_0; // 0x12D8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_Parent__Const_0; // 0x12E4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_OffsetSpace__Const_0; // 0x12F0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12F1[0x3];                                     // 0x12F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_2_B__Const_0; // 0x12F4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12FC[0x4];                                     // 0x12FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_1_OffsetTransform__Const_0; // 0x1300(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Add_Null_Above___Add_Null_Above_Replace_New__Const_0; // 0x1360(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Add_Null_Above___Add_Null_Above_GetTransform_1_Space__Const_0; // 0x1368(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Add_Null_Above___Add_Null_Above_GetTransform_1_bInitial__Const_0; // 0x1369(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_136A[0x2];                                     // 0x136A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_Name__Const_0; // 0x136C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_Space__Const_0; // 0x1374(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_bInitial__Const_0; // 0x1375(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1376[0x2];                                     // 0x1376(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_Weight__Const_0; // 0x1378(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_1_1_B__Const_0; // 0x137C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_2_Name__Const_0; // 0x1384(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_1_Name__Const_0; // 0x138C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Item_1_1___Control_Stack_at_Item_DISPATCH_RigDispatch_SetMetadata_1_1_1_Name__Const; // 0x1394(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_Name__Const;             // 0x139C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A4[0xC];                                     // 0x13A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___SpawnControl_OffsetTransform__Const;  // 0x13B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SpawnControl_OffsetSpace__Const;      // 0x1410(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1411[0x3];                                     // 0x1411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RigVMModel___Control_Stack_at_Item_Name__Const;    // 0x1414(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Item___Control_Stack_at_Item_GetTransform_1_Space__Const; // 0x141C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Item___Control_Stack_at_Item_GetTransform_1_bInitial__Const; // 0x141D(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141E[0x2];                                     // 0x141E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Item___Control_Stack_at_Item_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x1420(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_control__Const_1; // 0x1428(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_null__Const_1; // 0x1434(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_secondary_ctrl__Const_1; // 0x1440(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_bottom_null__Const_1; // 0x144C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_Parent__Const_1; // 0x1458(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_OffsetSpace__Const_1; // 0x1464(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1465[0x3];                                     // 0x1465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_2_B__Const_1; // 0x1468(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_1_OffsetTransform__Const_1; // 0x1470(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Add_Null_Above___Add_Null_Above_Replace_New__Const_1; // 0x14D0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Add_Null_Above___Add_Null_Above_GetTransform_1_Space__Const_1; // 0x14D8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Add_Null_Above___Add_Null_Above_GetTransform_1_bInitial__Const_1; // 0x14D9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
