#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_RockElemental_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_RockElemental_AnimBP.NPC_RockElemental_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01DF (0x01E0 - 0x0001)
struct NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_557;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_558;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_559;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_560;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_561;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_562;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_563;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_564;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_565;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_566;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_567;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_568;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_569;                                 // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_570;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_571;                                 // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_572;                              // 0x007C(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_573;                                // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_574;                                 // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_575;                                // 0x00B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_576;                               // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_577;                               // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_578;                                // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_579;                                // 0x00C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_580;                                // 0x00C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_581;                                // 0x00CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_582;                                // 0x00D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_583;                                 // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_584;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_585;                               // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_586;                              // 0x0100(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_587;                                // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_588;                                  // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_589;                                // 0x0130(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_590;                                // 0x0131(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_591;                                // 0x0132(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_592;                               // 0x0138(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0148(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C8(0x0018)()
};
static_assert(alignof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001E0, "Wrong size on NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_557) == 0x000004, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_557' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_558) == 0x00000C, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_558' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_559) == 0x000018, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_559' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_560) == 0x000028, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_560' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_561) == 0x000030, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_561' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_562) == 0x000038, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_562' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_563) == 0x00003C, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_563' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_564) == 0x000044, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_564' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_565) == 0x00004C, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_565' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_566) == 0x000054, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_566' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_567) == 0x00005C, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_567' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_568) == 0x000064, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_568' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_569) == 0x00006C, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_569' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_570) == 0x000070, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_570' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_571) == 0x000078, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_571' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_572) == 0x00007C, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_572' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_573) == 0x0000A8, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_573' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_574) == 0x0000B0, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_574' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_575) == 0x0000B4, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_575' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_576) == 0x0000B8, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_576' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_577) == 0x0000BC, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_577' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_578) == 0x0000C0, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_578' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_579) == 0x0000C1, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_579' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_580) == 0x0000C4, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_580' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_581) == 0x0000CC, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_581' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_582) == 0x0000D4, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_582' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_583) == 0x0000DC, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_583' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_584) == 0x0000E0, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_584' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_585) == 0x0000F0, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_585' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_586) == 0x000100, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_586' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_587) == 0x000120, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_587' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_588) == 0x000128, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_588' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_589) == 0x000130, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_589' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_590) == 0x000131, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_590' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_591) == 0x000132, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_591' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_592) == 0x000138, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_592' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000148, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001C8, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct NPC_RockElemental_AnimBP.NPC_RockElemental_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x002B (0x002C - 0x0001)
struct NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_8;                                   // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_9;                                   // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x002A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x002B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00002C, "Wrong size on NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x000004, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000008, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x00000C, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000010, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x000014, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000018, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x00001C, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_8) == 0x000020, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_8' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_9) == 0x000024, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_9' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_10) == 0x000028, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_10' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_11) == 0x000029, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_11' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_12) == 0x00002A, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_12' has a wrong offset!");
static_assert(offsetof(NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_13) == 0x00002B, "Member 'NPC_RockElemental_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_13' has a wrong offset!");

}

