#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Najash_Control_Rig_Medium

#include "Basic.hpp"

#include "AnimationCore_structs.hpp"
#include "ControlRigSpline_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// RigVMMemoryStorageGeneratorClass NPC_Najash_Control_Rig_Medium.RigVMMemory_Work
// 0x2378 (0x23C0 - 0x0048)
class NPC_Najash_Control_Rig_Medium::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_2_2_1_2_Transform;       // 0x0050(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_2_1_2_CachedIndex;     // 0x00B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_1_1_1_1_2_CachedIndex; // 0x00C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_2_1_1_Transform;       // 0x00D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_2_1_1_CachedIndex;     // 0x0130(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_1_1_1_1_1_CachedIndex; // 0x0140(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_2_1_1_1_1_Transform;   // 0x0150(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_2_1_1_1_1_CachedIndex; // 0x01B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_1_1_1_1_1_1_1_CachedIndex; // 0x01C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_2_1_1_1_1_1_1_Transform; // 0x01D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_2_1_1_1_1_1_1_CachedIndex; // 0x0230(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_1_1_1_1_1_1_1_1_1_CachedIndex; // 0x0240(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_2_1_1_1_1_1_1_1_1_Transform; // 0x0250(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_2_1_1_1_1_1_1_1_1_CachedIndex; // 0x02B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_1_1_1_1_1_1_1_1_1_1_1_CachedIndex; // 0x02C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_2_1_1_1_1_1_1_1_1_1_1_Transform; // 0x02D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_2_1_1_1_1_1_1_1_1_1_1_CachedIndex; // 0x0330(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_1_1_1_1_1_1_1_1_1_1_1_1_1_CachedIndex; // 0x0340(0x0010)(Edit, EditConst, NonTransactional)
	double                                        RigVMModel___Add_Result;                           // 0x0350(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_2_2_1_1_1_1_1_1_1_1_1_1_1_Transform; // 0x0360(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_2_1_1_1_1_1_1_1_1_1_1_1_CachedIndex; // 0x03C0(0x0010)(Edit, EditConst, NonTransactional)
	double                                        RigVMModel___Add_A;                                // 0x03D0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___Set_Transform_1_1_1_1_1_1_1_1_1_1_1_1_1_1_1_Value__IO; // 0x03E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_1_1_1_1_1_1_1_1_1_1_1_1_1_1_CachedIndex; // 0x0440(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  RigVMModel___trace_pelvis_z_Hit_Normal;            // 0x0450(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_pelvis_z___trace_pelvis_z_Add_Result;        // 0x0470(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_pelvis_z___trace_pelvis_z_GetTransform_Transform; // 0x0490(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              trace_pelvis_z___trace_pelvis_z_GetTransform_CachedIndex; // 0x04F0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                trace_pelvis_z___trace_pelvis_z_Add_A__IO;         // 0x0500(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_pelvis_z___trace_pelvis_z_Add_B__IO;         // 0x0518(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_pelvis_z___trace_pelvis_z_Subtract_Result;   // 0x0530(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_pelvis_z___trace_pelvis_z_Subtract_A__IO;    // 0x0548(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_pelvis_z___trace_pelvis_z_Subtract_B__IO;    // 0x0560(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_pelvis_z___trace_pelvis_z_AimBoneMath_Result; // 0x0580(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_pelvis_z___trace_pelvis_z_SphereTraceByTraceChannel_HitNormal; // 0x05E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          trace_pelvis_z___trace_pelvis_z_SphereTraceByTraceChannel_bHit; // 0x05F8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                trace_pelvis_z___trace_pelvis_z_SphereTraceByTraceChannel_HitLocation; // 0x0600(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                trace_pelvis_z___trace_pelvis_z_AimBoneMath_Primary__IO; // 0x0618(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              trace_pelvis_z___trace_pelvis_z_AimBoneMath_PrimaryCachedSpace; // 0x0660(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              trace_pelvis_z___trace_pelvis_z_AimBoneMath_SecondaryCachedSpace; // 0x0670(0x0010)(Edit, EditConst, NonTransactional)
	TArray<bool>                                  trace_pelvis_z___trace_pelvis_z_AimBoneMath_bIsInitialized; // 0x0680(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___RigVMFunction_MathQuaternionToEuler_Result; // 0x0690(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DISPATCH_RigVMDispatch_Print_1_Value; // 0x06A8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DISPATCH_RigVMDispatch_Print_2_Value; // 0x06AC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Degrees_1_Result;                     // 0x06B0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_MathQuaternionToAxisAndAngle_1_Angle; // 0x06B8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___RigVMFunction_MathQuaternionToAxisAndAngle_1_Axis; // 0x06C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Degrees_1_Value;                      // 0x06D8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DISPATCH_RigVMDispatch_Print_3_Value; // 0x06E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E4[0x4];                                      // 0x06E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___trace_z_3_Hit_Location;               // 0x06E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3___trace_z_Add_Result;                    // 0x0700(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_718[0x8];                                      // 0x0718(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z_3___trace_z_GetTransform_Transform;        // 0x0720(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              trace_z_3___trace_z_GetTransform_CachedIndex;      // 0x0780(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                trace_z_3___trace_z_Add_A__IO;                     // 0x0790(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3___trace_z_Add_B__IO;                     // 0x07A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3___trace_z_Subtract_Result;               // 0x07C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3___trace_z_Subtract_A__IO;                // 0x07D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3___trace_z_Subtract_B__IO;                // 0x07F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          trace_z_3___trace_z_SphereTraceByTraceChannel_bHit; // 0x0808(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_809[0x7];                                      // 0x0809(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                trace_z_3___trace_z_SphereTraceByTraceChannel_HitNormal; // 0x0810(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_828[0x8];                                      // 0x0828(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z_3___trace_z_RigVMFunction_DebugTransformMutableNoSpace_Transform__IO; // 0x0830(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_2_3_2_Result;             // 0x0890(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_2_3_2_Value;              // 0x0894(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_2_3_2_ScaleBiasClamp;     // 0x0898(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_2_ItemToModify__IO; // 0x08A8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_2_WorkData;    // 0x08B8(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___trace_z_3_1_1_Hit_Location;           // 0x08C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1___trace_z_Add_Result;                // 0x08E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F8[0x8];                                      // 0x08F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z_3_1_1___trace_z_GetTransform_Transform;    // 0x0900(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              trace_z_3_1_1___trace_z_GetTransform_CachedIndex;  // 0x0960(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                trace_z_3_1_1___trace_z_Add_A__IO;                 // 0x0970(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1___trace_z_Add_B__IO;                 // 0x0988(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1___trace_z_Subtract_Result;           // 0x09A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1___trace_z_Subtract_A__IO;            // 0x09B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1___trace_z_Subtract_B__IO;            // 0x09D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          trace_z_3_1_1___trace_z_SphereTraceByTraceChannel_bHit; // 0x09E8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E9[0x7];                                      // 0x09E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                trace_z_3_1_1___trace_z_SphereTraceByTraceChannel_HitNormal; // 0x09F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A08[0x8];                                      // 0x0A08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z_3_1_1___trace_z_RigVMFunction_DebugTransformMutableNoSpace_Transform__IO; // 0x0A10(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_2_3_2_1_1_Result;         // 0x0A70(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_2_3_2_1_1_Value;          // 0x0A74(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_2_3_2_1_1_ScaleBiasClamp; // 0x0A78(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_2_1_1_ItemToModify__IO; // 0x0A88(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_2_1_1_WorkData; // 0x0A98(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___trace_z_3_1_1_1_1_Hit_Location;       // 0x0AA8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1___trace_z_Add_Result;            // 0x0AC0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD8[0x8];                                      // 0x0AD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z_3_1_1_1_1___trace_z_GetTransform_Transform; // 0x0AE0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              trace_z_3_1_1_1_1___trace_z_GetTransform_CachedIndex; // 0x0B40(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                trace_z_3_1_1_1_1___trace_z_Add_A__IO;             // 0x0B50(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1___trace_z_Add_B__IO;             // 0x0B68(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1___trace_z_Subtract_Result;       // 0x0B80(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1___trace_z_Subtract_A__IO;        // 0x0B98(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1___trace_z_Subtract_B__IO;        // 0x0BB0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          trace_z_3_1_1_1_1___trace_z_SphereTraceByTraceChannel_bHit; // 0x0BC8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC9[0x7];                                      // 0x0BC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                trace_z_3_1_1_1_1___trace_z_SphereTraceByTraceChannel_HitNormal; // 0x0BD0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE8[0x8];                                      // 0x0BE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z_3_1_1_1_1___trace_z_RigVMFunction_DebugTransformMutableNoSpace_Transform__IO; // 0x0BF0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_2_3_2_1_3_Result;         // 0x0C50(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_2_3_2_1_3_Value;          // 0x0C54(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_2_3_2_1_3_ScaleBiasClamp; // 0x0C58(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_2_1_3_ItemToModify__IO; // 0x0C68(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_2_1_3_WorkData; // 0x0C78(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___trace_z_3_1_1_1_1_1_1_Hit_Location;   // 0x0C88(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1___trace_z_Add_Result;        // 0x0CA0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB8[0x8];                                      // 0x0CB8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z_3_1_1_1_1_1_1___trace_z_GetTransform_Transform; // 0x0CC0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              trace_z_3_1_1_1_1_1_1___trace_z_GetTransform_CachedIndex; // 0x0D20(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                trace_z_3_1_1_1_1_1_1___trace_z_Add_A__IO;         // 0x0D30(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1___trace_z_Add_B__IO;         // 0x0D48(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1___trace_z_Subtract_Result;   // 0x0D60(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1___trace_z_Subtract_A__IO;    // 0x0D78(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1___trace_z_Subtract_B__IO;    // 0x0D90(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          trace_z_3_1_1_1_1_1_1___trace_z_SphereTraceByTraceChannel_bHit; // 0x0DA8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA9[0x7];                                      // 0x0DA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                trace_z_3_1_1_1_1_1_1___trace_z_SphereTraceByTraceChannel_HitNormal; // 0x0DB0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC8[0x8];                                      // 0x0DC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z_3_1_1_1_1_1_1___trace_z_RigVMFunction_DebugTransformMutableNoSpace_Transform__IO; // 0x0DD0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_2_3_2_1_4_1_Result;       // 0x0E30(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_2_3_2_1_4_1_Value;        // 0x0E34(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_2_3_2_1_4_1_ScaleBiasClamp; // 0x0E38(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_2_1_4_1_ItemToModify__IO; // 0x0E48(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_2_1_4_1_WorkData; // 0x0E58(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___trace_z_3_1_1_1_1_1_1_1_1_Hit_Location; // 0x0E68(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1___trace_z_Add_Result;    // 0x0E80(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E98[0x8];                                      // 0x0E98(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z_3_1_1_1_1_1_1_1_1___trace_z_GetTransform_Transform; // 0x0EA0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              trace_z_3_1_1_1_1_1_1_1_1___trace_z_GetTransform_CachedIndex; // 0x0F00(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1___trace_z_Add_A__IO;     // 0x0F10(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1___trace_z_Add_B__IO;     // 0x0F28(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1___trace_z_Subtract_Result; // 0x0F40(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1___trace_z_Subtract_A__IO; // 0x0F58(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1___trace_z_Subtract_B__IO; // 0x0F70(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          trace_z_3_1_1_1_1_1_1_1_1___trace_z_SphereTraceByTraceChannel_bHit; // 0x0F88(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F89[0x7];                                      // 0x0F89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1___trace_z_SphereTraceByTraceChannel_HitNormal; // 0x0F90(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA8[0x8];                                      // 0x0FA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z_3_1_1_1_1_1_1_1_1___trace_z_RigVMFunction_DebugTransformMutableNoSpace_Transform__IO; // 0x0FB0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_2_3_2_1_4_1_2_Result;     // 0x1010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_2_3_2_1_4_1_2_Value;      // 0x1014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_2_3_2_1_4_1_2_ScaleBiasClamp; // 0x1018(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_2_1_4_1_2_ItemToModify__IO; // 0x1028(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_2_1_4_1_2_WorkData; // 0x1038(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___trace_z_3_1_1_1_1_1_1_1_1_1_1_Hit_Location; // 0x1048(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1_1_1___trace_z_Add_Result; // 0x1060(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1078[0x8];                                     // 0x1078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z_3_1_1_1_1_1_1_1_1_1_1___trace_z_GetTransform_Transform; // 0x1080(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              trace_z_3_1_1_1_1_1_1_1_1_1_1___trace_z_GetTransform_CachedIndex; // 0x10E0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1_1_1___trace_z_Add_A__IO; // 0x10F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1_1_1___trace_z_Add_B__IO; // 0x1108(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1_1_1___trace_z_Subtract_Result; // 0x1120(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1_1_1___trace_z_Subtract_A__IO; // 0x1138(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1_1_1___trace_z_Subtract_B__IO; // 0x1150(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          trace_z_3_1_1_1_1_1_1_1_1_1_1___trace_z_SphereTraceByTraceChannel_bHit; // 0x1168(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1169[0x7];                                     // 0x1169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                trace_z_3_1_1_1_1_1_1_1_1_1_1___trace_z_SphereTraceByTraceChannel_HitNormal; // 0x1170(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1188[0x8];                                     // 0x1188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z_3_1_1_1_1_1_1_1_1_1_1___trace_z_RigVMFunction_DebugTransformMutableNoSpace_Transform__IO; // 0x1190(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_1_Items__IO;        // 0x11F0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_2_Items__IO;        // 0x1200(0x0010)(Edit, EditConst, NonTransactional)
	struct FControlRigSpline                      RigVMModel___SplineIK_Output_Spline;               // 0x1210(0x0018)(Edit, EditConst, NonTransactional)
	bool                                          SplineIK___SplineIK_MathIntLess_Result;            // 0x1228(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1229[0x3];                                     // 0x1229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SplineIK___SplineIK_ArrayGetNum_Num;               // 0x122C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FControlRigSpline                      SplineIK___SplineIK_ControlRigSplineFromPoints_1_Spline; // 0x1230(0x0018)(Edit, EditConst, NonTransactional)
	TArray<struct FVector>                        SplineIK___SplineIK_RigVMFunction_MathTransformArrayToSRT_Translations; // 0x1248(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FTransform>                     SplineIK___SplineIK_GetTransformItemArray_Transforms; // 0x1258(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>      SplineIK___SplineIK_GetTransformItemArray_CachedIndex; // 0x1268(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FQuat>                          SplineIK___SplineIK_RigVMFunction_MathTransformArrayToSRT_Rotations; // 0x1278(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FVector>                        SplineIK___SplineIK_RigVMFunction_MathTransformArrayToSRT_Scales; // 0x1288(0x0010)(Edit, EditConst, NonTransactional)
	struct FControlRigSpline                      LocalVariable__SplineIK_template_spline;           // 0x1298(0x0018)(Edit, EditConst, NonTransactional)
	TArray<struct FTransform>                     LocalVariable__SplineIK_template_transforms;       // 0x12B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FVector>                        LocalVariable__SplineIK_offset_positions;          // 0x12C0(0x0010)(Edit, EditConst, NonTransactional)
	int32                                         SplineIK___SplineIK_DISPATCH_RigVMDispatch_ArrayGetNum_1_Num; // 0x12D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SplineIK___SplineIK_ArrayIterator_3_Index;         // 0x12D4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SplineIK___SplineIK_MathTransformTransformVector_1_Result; // 0x12D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             SplineIK___SplineIK_ArrayIterator_3_Element;       // 0x12F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SplineIK___SplineIK_ArrayIterator_3_Count;         // 0x1350(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SplineIK___SplineIK_ArrayIterator_3_Ratio;         // 0x1354(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   SplineIK___SplineIK_ArrayIterator_3_BlockToRun;    // 0x1358(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_FitChainToCurve_WorkData> SplineIK___SplineIK_FitChainToSplineCurveItemArray_1_WorkData; // 0x1360(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_FitChainToCurve_WorkData> SplineIK___SplineIK_FitChainToSplineCurveItemArray_WorkData; // 0x1370(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   SplineIK___SplineIK_Branch_RigVMUnitNode_BlockToRun; // 0x1380(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FControlRigSpline                      SplineIK___SplineIK_ControlRigSplineFromPoints_Spline; // 0x1388(0x0018)(Edit, EditConst, NonTransactional)
	class FName                                   SplineIK___SplineIK_BranchNode_2_RigVMUnitNode_BlockToRun; // 0x13A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        LocalVariable__SplineIK_aim_transforms;            // 0x13A8(0x0010)(Edit, EditConst, NonTransactional)
	int32                                         SplineIK___SplineIK_DISPATCH_RigVMDispatch_ArrayGetNum_Num; // 0x13B8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SplineIK___SplineIK_ArrayIterator_1_Index;         // 0x13BC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SplineIK___SplineIK_PositionFromControlRigSpline_Position; // 0x13C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SplineIK___SplineIK_ClosestParameterFromControlRigSpline_U; // 0x13D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13DC[0x4];                                     // 0x13DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SplineIK___SplineIK_GetTransform_Transform;        // 0x13E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         SplineIK___SplineIK_ArrayIterator_1_Element;       // 0x1440(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144C[0x4];                                     // 0x144C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              SplineIK___SplineIK_GetTransform_CachedIndex;      // 0x1450(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                SplineIK___SplineIK_ClosestParameterFromControlRigSpline_Position; // 0x1460(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SplineIK___SplineIK_ArrayIterator_1_Count;         // 0x1478(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SplineIK___SplineIK_ArrayIterator_1_Ratio;         // 0x147C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   SplineIK___SplineIK_ArrayIterator_1_BlockToRun;    // 0x1480(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1488[0x8];                                     // 0x1488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SplineIK___SplineIK_AimBoneMath_Result;            // 0x1490(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             SplineIK___SplineIK_GetTransform_1_Transform;      // 0x14F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         SplineIK___SplineIK_ArrayIterator_2_Element;       // 0x1550(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155C[0x4];                                     // 0x155C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              SplineIK___SplineIK_GetTransform_1_CachedIndex;    // 0x1560(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                SplineIK___SplineIK_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x1570(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SplineIK___SplineIK_ArrayIterator_2_Index;         // 0x1588(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_158C[0x4];                                     // 0x158C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                SplineIK___SplineIK_AimBoneMath_Primary__IO;       // 0x1590(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              SplineIK___SplineIK_AimBoneMath_PrimaryCachedSpace; // 0x15D8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              SplineIK___SplineIK_AimBoneMath_SecondaryCachedSpace; // 0x15E8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<bool>                                  SplineIK___SplineIK_AimBoneMath_bIsInitialized;    // 0x15F8(0x0010)(Edit, EditConst, NonTransactional)
	bool                                          SplineIK___SplineIK_MathIntEquals_Result;          // 0x1608(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1609[0x3];                                     // 0x1609(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SplineIK___SplineIK_MathIntSub_Result;             // 0x160C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SplineIK___SplineIK_ArrayIterator_2_Count;         // 0x1610(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1614[0x4];                                     // 0x1614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              SplineIK___SplineIK_SetTransform_CachedIndex;      // 0x1618(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   SplineIK___SplineIK_BranchNode_3_RigVMUnitNode_BlockToRun; // 0x1628(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SplineIK___SplineIK_ArrayIterator_2_Ratio;         // 0x1630(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   SplineIK___SplineIK_ArrayIterator_2_BlockToRun;    // 0x1634(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         SplineIK___SplineIK_ArrayGetAtIndex_2_Element;     // 0x163C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         SplineIK___SplineIK_ArrayGetAtIndex_1_Element;     // 0x1648(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1654[0x4];                                     // 0x1654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              SplineIK___SplineIK_ParentConstraint_Parents__IO;  // 0x1658(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              SplineIK___SplineIK_ParentConstraint_ChildCache;   // 0x1668(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>      SplineIK___SplineIK_ParentConstraint_ParentCaches; // 0x1678(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FConstraintParent>              SplineIK___SplineIK_ParentConstraint_1_Parents__IO; // 0x1688(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              SplineIK___SplineIK_ParentConstraint_1_ChildCache; // 0x1698(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>      SplineIK___SplineIK_ParentConstraint_1_ParentCaches; // 0x16A8(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   SplineIK___SplineIK_Branch_1_RigVMUnitNode_BlockToRun; // 0x16B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   SplineIK___SplineIK_BranchNode_4_RigVMUnitNode_BlockToRun; // 0x16C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_2_1_Element; // 0x16C8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D4[0xC];                                     // 0x16D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___RigVMFunction_MathQuaternionFromEuler_Result; // 0x16E0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___RigVMFunction_MathQuaternionToEuler_1_Result; // 0x1700(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1718[0x8];                                     // 0x1718(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___From_World_2_Global;                  // 0x1720(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___SpringInterpQuaternionV2_1_1_Result;  // 0x1740(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___To_World_2_World;                     // 0x1760(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___GetTransform_1_2_1_Transform;         // 0x1780(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_2_1_CachedIndex;       // 0x17E0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  RigVMModel___To_World_2_Value;                     // 0x17F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterpQuaternionV2_1_1_AngularVelocity; // 0x1810(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQuat>                          RigVMModel___SpringInterpQuaternionV2_1_1_SimulatedResult; // 0x1828(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FQuaternionSpringState>         RigVMModel___SpringInterpQuaternionV2_1_1_SpringState; // 0x1838(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___RigVMFunction_MathQuaternionToEuler_2_Result; // 0x1848(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___RigVMFunction_MathQuaternionFromEuler_Euler__IO; // 0x1860(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___From_World_1_1_Global;                // 0x1878(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterp_1_1_1_Result;            // 0x1890(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___To_World_1_1_World;                   // 0x18A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___To_World_1_1_Value;                   // 0x18C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterp_1_1_1_Velocity;          // 0x18D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        RigVMModel___SpringInterp_1_1_1_SimulatedResult;   // 0x18F0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FVectorSpringState>             RigVMModel___SpringInterp_1_1_1_SpringState;       // 0x1900(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___Set_Transform_1_1_2_Value__IO;        // 0x1910(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_1_2_CachedIndex;      // 0x1970(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_3_Items__IO;        // 0x1980(0x0010)(Edit, EditConst, NonTransactional)
	int32                                         RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_2_1_Index; // 0x1990(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_2_1_Count; // 0x1994(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_2_1_Ratio; // 0x1998(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_2_1_BlockToRun; // 0x199C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_Control;      // 0x19A4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_Null;         // 0x19B0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_Secondary;    // 0x19BC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_Bottom_Null;  // 0x19C8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D4[0xC];                                     // 0x19D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Item_1___Control_Stack_at_Item_GetTransform_1_Transform; // 0x19E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              Control_Stack_at_Item_1___Control_Stack_at_Item_GetTransform_1_CachedIndex; // 0x1A40(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   Control_Stack_at_Item_1___Control_Stack_at_Item_If_Result; // 0x1A50(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Item_1___Control_Stack_at_Item_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x1A58(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Item_1___Control_Stack_at_Item_If_Condition; // 0x1A59(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5A[0x2];                                     // 0x1A5A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Item_1___Control_Stack_at_Item_If_False; // 0x1A5C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_Result; // 0x1A64(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_Item; // 0x1A6C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A78[0x8];                                     // 0x1A78(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Position___Control_Stack_at_Position_Make_Relative_Local; // 0x1A80(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_2_1_Result; // 0x1AE0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_2_Result; // 0x1AE8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_1_Item; // 0x1AF0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_BranchNode_2_BlockToRun; // 0x1AFC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_Add_Null_Above_Null; // 0x1B04(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Add_Null_Above___Add_Null_Above_HierarchyGetParent_Parent; // 0x1B10(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1C[0x4];                                     // 0x1B1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              Add_Null_Above___Add_Null_Above_HierarchyGetParent_CachedChild; // 0x1B20(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              Add_Null_Above___Add_Null_Above_HierarchyGetParent_CachedParent; // 0x1B30(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   Add_Null_Above___Add_Null_Above_Concat_Result;     // 0x1B40(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Add_Null_Above___Add_Null_Above_Replace_Result;    // 0x1B48(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Add_Null_Above___Add_Null_Above_Replace_Name;      // 0x1B50(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
