#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCPropInteractionComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPCPropInteractionComponent.NPCPropInteractionComponent_C
// 0x00A0 (0x0390 - 0x02F0)
class UNPCPropInteractionComponent_C final : public USceneComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FTransform>                     InteractionTransforms;                             // 0x02F8(0x0010)(Edit, BlueprintVisible)
	double                                        SphereRadius;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       OverlapComponent;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        LastUseTime;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 InUseTransforms;                                   // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, double>                           InteractCooldowns;                                 // 0x0330(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          LookAtCenter;                                      // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInUse;                                           // 0x0381(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StartInteraction(int32 InteractIndex, double InteractionLengtrh);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnOverlapBegin(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void GetOpenInteractionPoint(class AActor* InteractingCharacter, bool* InteractPointFound, struct FTransform* InteractTransform, int32* InteractIndex);
	void FinishInteraction(int32 TransformIndex);
	void ExecuteUbergraph_NPCPropInteractionComponent(int32 EntryPoint);
	void CheckInteractPointCooldowns();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPCPropInteractionComponent_C">();
	}
	static class UNPCPropInteractionComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCPropInteractionComponent_C>();
	}
};
static_assert(alignof(UNPCPropInteractionComponent_C) == 0x000010, "Wrong alignment on UNPCPropInteractionComponent_C");
static_assert(sizeof(UNPCPropInteractionComponent_C) == 0x000390, "Wrong size on UNPCPropInteractionComponent_C");
static_assert(offsetof(UNPCPropInteractionComponent_C, UberGraphFrame) == 0x0002F0, "Member 'UNPCPropInteractionComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPCPropInteractionComponent_C, InteractionTransforms) == 0x0002F8, "Member 'UNPCPropInteractionComponent_C::InteractionTransforms' has a wrong offset!");
static_assert(offsetof(UNPCPropInteractionComponent_C, SphereRadius) == 0x000308, "Member 'UNPCPropInteractionComponent_C::SphereRadius' has a wrong offset!");
static_assert(offsetof(UNPCPropInteractionComponent_C, OverlapComponent) == 0x000310, "Member 'UNPCPropInteractionComponent_C::OverlapComponent' has a wrong offset!");
static_assert(offsetof(UNPCPropInteractionComponent_C, LastUseTime) == 0x000318, "Member 'UNPCPropInteractionComponent_C::LastUseTime' has a wrong offset!");
static_assert(offsetof(UNPCPropInteractionComponent_C, InUseTransforms) == 0x000320, "Member 'UNPCPropInteractionComponent_C::InUseTransforms' has a wrong offset!");
static_assert(offsetof(UNPCPropInteractionComponent_C, InteractCooldowns) == 0x000330, "Member 'UNPCPropInteractionComponent_C::InteractCooldowns' has a wrong offset!");
static_assert(offsetof(UNPCPropInteractionComponent_C, LookAtCenter) == 0x000380, "Member 'UNPCPropInteractionComponent_C::LookAtCenter' has a wrong offset!");
static_assert(offsetof(UNPCPropInteractionComponent_C, IsInUse) == 0x000381, "Member 'UNPCPropInteractionComponent_C::IsInUse' has a wrong offset!");

}

