#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCPawn

#include "Basic.hpp"


namespace SDK::Params
{

// Function NPCPawn.NPCPawn_C.ExecuteUbergraph_NPCPawn
// 0x0008 (0x0008 - 0x0000)
struct NPCPawn_C_ExecuteUbergraph_NPCPawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCPawn_C_ExecuteUbergraph_NPCPawn) == 0x000004, "Wrong alignment on NPCPawn_C_ExecuteUbergraph_NPCPawn");
static_assert(sizeof(NPCPawn_C_ExecuteUbergraph_NPCPawn) == 0x000008, "Wrong size on NPCPawn_C_ExecuteUbergraph_NPCPawn");
static_assert(offsetof(NPCPawn_C_ExecuteUbergraph_NPCPawn, EntryPoint) == 0x000000, "Member 'NPCPawn_C_ExecuteUbergraph_NPCPawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPCPawn_C_ExecuteUbergraph_NPCPawn, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'NPCPawn_C_ExecuteUbergraph_NPCPawn::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCPawn_C_ExecuteUbergraph_NPCPawn, CallFunc_IsServer_ReturnValue) == 0x000005, "Member 'NPCPawn_C_ExecuteUbergraph_NPCPawn::CallFunc_IsServer_ReturnValue' has a wrong offset!");

}

