#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParamSetClusters

#include "Basic.hpp"

#include "PCG_structs.hpp"


namespace SDK::Params
{

// Function ParamSetClusters.ParamSetClusters_C.ExecuteWithContext
// 0x0180 (0x0180 - 0x0000)
struct ParamSetClusters_C_ExecuteWithContext final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Input;                                             // 0x00B8(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Output;                                            // 0x00D8(0x0020)(Parm, OutParm)
	class UPCGComponent*                          CallFunc_GetComponent_ReturnValue;                 // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	TScriptInterface<class IBPI_PCGParamData_C>   UniqueObjectNameForCooking_AsBPI_PCGParam_Data;    // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueObjectNameForCooking_bSuccess;               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGParameterData*                      CallFunc_Get_PCG_Param_Data_Asset_PCG_Data;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPCGP_Clusters_C*                       K2Node_DynamicCast_AsPCGP_Clusters;                // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGParamData*                          CallFunc_SpawnObject_ReturnValue;                  // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPCGMetadata*                           CallFunc_MutableMetadata_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_AddEntry_ReturnValue;                     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatAttributeByMetadataKey_Value_ImplicitCast; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatAttributeByMetadataKey_Value_ImplicitCast_1; // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatAttributeByMetadataKey_Value_ImplicitCast_2; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParamSetClusters_C_ExecuteWithContext) == 0x000008, "Wrong alignment on ParamSetClusters_C_ExecuteWithContext");
static_assert(sizeof(ParamSetClusters_C_ExecuteWithContext) == 0x000180, "Wrong size on ParamSetClusters_C_ExecuteWithContext");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, InContext) == 0x000000, "Member 'ParamSetClusters_C_ExecuteWithContext::InContext' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, Input) == 0x0000B8, "Member 'ParamSetClusters_C_ExecuteWithContext::Input' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, Output) == 0x0000D8, "Member 'ParamSetClusters_C_ExecuteWithContext::Output' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, CallFunc_GetComponent_ReturnValue) == 0x0000F8, "Member 'ParamSetClusters_C_ExecuteWithContext::CallFunc_GetComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, CallFunc_GetOwner_ReturnValue) == 0x000100, "Member 'ParamSetClusters_C_ExecuteWithContext::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, K2Node_MakeArray_Array) == 0x000108, "Member 'ParamSetClusters_C_ExecuteWithContext::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, UniqueObjectNameForCooking_AsBPI_PCGParam_Data) == 0x000118, "Member 'ParamSetClusters_C_ExecuteWithContext::UniqueObjectNameForCooking_AsBPI_PCGParam_Data' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, UniqueObjectNameForCooking_bSuccess) == 0x000128, "Member 'ParamSetClusters_C_ExecuteWithContext::UniqueObjectNameForCooking_bSuccess' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, CallFunc_Get_PCG_Param_Data_Asset_PCG_Data) == 0x000130, "Member 'ParamSetClusters_C_ExecuteWithContext::CallFunc_Get_PCG_Param_Data_Asset_PCG_Data' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, K2Node_DynamicCast_AsPCGP_Clusters) == 0x000138, "Member 'ParamSetClusters_C_ExecuteWithContext::K2Node_DynamicCast_AsPCGP_Clusters' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'ParamSetClusters_C_ExecuteWithContext::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, CallFunc_SpawnObject_ReturnValue) == 0x000148, "Member 'ParamSetClusters_C_ExecuteWithContext::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000150, "Member 'ParamSetClusters_C_ExecuteWithContext::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, CallFunc_SelectFloat_ReturnValue) == 0x000158, "Member 'ParamSetClusters_C_ExecuteWithContext::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, CallFunc_MutableMetadata_ReturnValue) == 0x000160, "Member 'ParamSetClusters_C_ExecuteWithContext::CallFunc_MutableMetadata_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, CallFunc_AddEntry_ReturnValue) == 0x000168, "Member 'ParamSetClusters_C_ExecuteWithContext::CallFunc_AddEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, CallFunc_SetFloatAttributeByMetadataKey_Value_ImplicitCast) == 0x000170, "Member 'ParamSetClusters_C_ExecuteWithContext::CallFunc_SetFloatAttributeByMetadataKey_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, CallFunc_SetFloatAttributeByMetadataKey_Value_ImplicitCast_1) == 0x000174, "Member 'ParamSetClusters_C_ExecuteWithContext::CallFunc_SetFloatAttributeByMetadataKey_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ParamSetClusters_C_ExecuteWithContext, CallFunc_SetFloatAttributeByMetadataKey_Value_ImplicitCast_2) == 0x000178, "Member 'ParamSetClusters_C_ExecuteWithContext::CallFunc_SetFloatAttributeByMetadataKey_Value_ImplicitCast_2' has a wrong offset!");

}

