#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParamSetDense

#include "Basic.hpp"

#include "PCG_structs.hpp"
#include "PCG_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ParamSetDense.ParamSetDense_C
// 0x0030 (0x00B8 - 0x0088)
class UParamSetDense_C final : public UPCGBlueprintElement
{
public:
	struct FPCGDataCollection                     Out_Data_Collection;                               // 0x0088(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPCGPointData*                          OutPointData;                                      // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPCGParamData*                          AttributesData;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteWithContext(struct FPCGContext& InContext, const struct FPCGDataCollection& Input, struct FPCGDataCollection* Output);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ParamSetDense_C">();
	}
	static class UParamSetDense_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParamSetDense_C>();
	}
};
static_assert(alignof(UParamSetDense_C) == 0x000008, "Wrong alignment on UParamSetDense_C");
static_assert(sizeof(UParamSetDense_C) == 0x0000B8, "Wrong size on UParamSetDense_C");
static_assert(offsetof(UParamSetDense_C, Out_Data_Collection) == 0x000088, "Member 'UParamSetDense_C::Out_Data_Collection' has a wrong offset!");
static_assert(offsetof(UParamSetDense_C, OutPointData) == 0x0000A8, "Member 'UParamSetDense_C::OutPointData' has a wrong offset!");
static_assert(offsetof(UParamSetDense_C, AttributesData) == 0x0000B0, "Member 'UParamSetDense_C::AttributesData' has a wrong offset!");

}

