#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Ballista_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct PC_Ballista_AnimBP.PC_Ballista_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x013F (0x0140 - 0x0001)
struct PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_67;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_68;                               // 0x000C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_69;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_70;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_71;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_72;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_73;                                 // 0x0045(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_74;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_75;                               // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_76;                                 // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_77;                                   // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_78;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_79;                                 // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_80;                                 // 0x0082(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_81;                                // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_82;                                // 0x0098(0x0010)(BlueprintVisible)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0018)()
};
static_assert(alignof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000140, "Wrong size on PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_67) == 0x000004, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_67' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_68) == 0x00000C, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_68' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_69) == 0x000038, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_69' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_70) == 0x00003C, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_70' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_71) == 0x000040, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_71' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_72) == 0x000044, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_72' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_73) == 0x000045, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_73' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_74) == 0x000048, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_74' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_75) == 0x000050, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_75' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_76) == 0x000070, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_76' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_77) == 0x000078, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_77' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_78) == 0x000080, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_78' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_79) == 0x000081, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_79' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_80) == 0x000082, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_80' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_81) == 0x000088, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_81' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_82) == 0x000098, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_82' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct PC_Ballista_AnimBP.PC_Ballista_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x000F (0x0010 - 0x0001)
struct PC_Ballista_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on PC_Ballista_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000010, "Wrong size on PC_Ballista_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(PC_Ballista_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_1) == 0x00000C, "Member 'PC_Ballista_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_1' has a wrong offset!");

}

