#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Master_MountLizard_AnimBP_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct PC_Master_MountLizard_AnimBP_New.PC_Master_MountLizard_AnimBP_New_C.AnimBlueprintGeneratedMutableData
// 0x0073 (0x0074 - 0x0001)
struct PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_24;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_25;                                  // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_26;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_27;                                 // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_28;                                 // 0x0072(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_29;                                 // 0x0073(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData) == 0x000074, "Wrong size on PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x000014, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x00001C, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000020, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000024, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000028, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x00002C, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000030, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000034, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x000038, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_13) == 0x00003C, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_13' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_14) == 0x000040, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_14' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_15) == 0x000044, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_15' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_16) == 0x000048, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_16' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_17) == 0x00004C, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_17' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_18) == 0x000050, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_18' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_19) == 0x000054, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_19' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_20) == 0x000058, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_20' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_21) == 0x00005C, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_21' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_22) == 0x000060, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_22' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_23) == 0x000064, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_23' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __BoolProperty_24) == 0x000068, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__BoolProperty_24' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __IntProperty_25) == 0x00006C, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__IntProperty_25' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __ByteProperty_26) == 0x000070, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__ByteProperty_26' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __ByteProperty_27) == 0x000071, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__ByteProperty_27' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __ByteProperty_28) == 0x000072, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__ByteProperty_28' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData, __ByteProperty_29) == 0x000073, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedMutableData::__ByteProperty_29' has a wrong offset!");

// ScriptStruct PC_Master_MountLizard_AnimBP_New.PC_Master_MountLizard_AnimBP_New_C.AnimBlueprintGeneratedConstantData
// 0x02B7 (0x02B8 - 0x0001)
struct PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_965;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_966;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_967;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_968;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_969;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_970;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_971;                               // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_972;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_973;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_974;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_975;                                 // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_976;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_977;                                 // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_978;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_979;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_980;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_981;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_982;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_983;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_984;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_985;                                // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_986;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_987;                                 // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_988;                                // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_989;                               // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_990;                                // 0x00BC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_991;                                // 0x00BD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_992;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_993;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_994;                                // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_995;                                // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_996;                                // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_997;                                // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_998;                                 // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_999;                              // 0x00F4(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1000;                               // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1001;                               // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1002;                               // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1003;                               // 0x0138(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1004;                              // 0x0140(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1005;                               // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1006;                               // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1007;                                // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_1008;                              // 0x0168(0x0010)(BlueprintVisible)
	bool                                          __BoolProperty_1009;                               // 0x0178(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1010;                              // 0x017C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1011;                             // 0x0180(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1012;                              // 0x01AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1013;                               // 0x01B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1014;                               // 0x01B1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1015;                               // 0x01B4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1016;                               // 0x01BC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1017;                                // 0x01C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1018;                             // 0x01C8(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_1019;                               // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1020;                                 // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1021;                               // 0x01F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1022;                               // 0x01F9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1023;                               // 0x01FA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FB[0x5];                                      // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1024;                              // 0x0200(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1025;                              // 0x0210(0x0010)(BlueprintVisible)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0220(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02A0(0x0018)()
};
static_assert(alignof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedConstantData) == 0x0002B8, "Wrong size on PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_965) == 0x000004, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_965' has a wrong offset!");
static_assert(offsetof(PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_966) == 0x00000C, "Member 'PC_Master_MountLizard_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_966' has a wrong offset!");
