#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Master_CaravanRaft_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct PC_Master_CaravanRaft_AnimBP.PC_Master_CaravanRaft_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00E7 (0x00E8 - 0x0001)
struct PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_21;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_22;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_23;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_24;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_25;                                 // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_26;                                 // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_27;                                 // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_28;                                 // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_29;                                 // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_30;                                  // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_31;                               // 0x0030(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0050(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D0(0x0018)()
};
static_assert(alignof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000E8, "Wrong size on PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_21) == 0x000004, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_21' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_22) == 0x00000C, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_22' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_23) == 0x000010, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_23' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_24) == 0x000014, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_24' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_25) == 0x000018, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_25' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_26) == 0x000019, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_26' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_27) == 0x00001A, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_27' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_28) == 0x00001C, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_28' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_29) == 0x000024, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_29' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_30) == 0x00002C, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_30' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_31) == 0x000030, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_31' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000050, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000D0, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct PC_Master_CaravanRaft_AnimBP.PC_Master_CaravanRaft_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

