#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Master_CaravanRaft_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PC_Master_CaravanRaft_AnimBP.PC_Master_CaravanRaft_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct PC_Master_CaravanRaft_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PC_Master_CaravanRaft_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on PC_Master_CaravanRaft_AnimBP_C_AnimGraph");
static_assert(sizeof(PC_Master_CaravanRaft_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on PC_Master_CaravanRaft_AnimBP_C_AnimGraph");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'PC_Master_CaravanRaft_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function PC_Master_CaravanRaft_AnimBP.PC_Master_CaravanRaft_AnimBP_C.DamageFlinchBP
// 0x0008 (0x0008 - 0x0000)
struct PC_Master_CaravanRaft_AnimBP_C_DamageFlinchBP final
{
public:
	TSubclassOf<class UDamageType>                DamageType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(PC_Master_CaravanRaft_AnimBP_C_DamageFlinchBP) == 0x000008, "Wrong alignment on PC_Master_CaravanRaft_AnimBP_C_DamageFlinchBP");
static_assert(sizeof(PC_Master_CaravanRaft_AnimBP_C_DamageFlinchBP) == 0x000008, "Wrong size on PC_Master_CaravanRaft_AnimBP_C_DamageFlinchBP");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP_C_DamageFlinchBP, DamageType) == 0x000000, "Member 'PC_Master_CaravanRaft_AnimBP_C_DamageFlinchBP::DamageType' has a wrong offset!");

// Function PC_Master_CaravanRaft_AnimBP.PC_Master_CaravanRaft_AnimBP_C.ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP
// 0x0010 (0x0010 - 0x0000)
struct PC_Master_CaravanRaft_AnimBP_C_ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UDamageType>                K2Node_Event_DamageType;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(PC_Master_CaravanRaft_AnimBP_C_ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP) == 0x000008, "Wrong alignment on PC_Master_CaravanRaft_AnimBP_C_ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP");
static_assert(sizeof(PC_Master_CaravanRaft_AnimBP_C_ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP) == 0x000010, "Wrong size on PC_Master_CaravanRaft_AnimBP_C_ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP_C_ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP, EntryPoint) == 0x000000, "Member 'PC_Master_CaravanRaft_AnimBP_C_ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP_C_ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP, CallFunc_Montage_Play_ReturnValue) == 0x000004, "Member 'PC_Master_CaravanRaft_AnimBP_C_ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_CaravanRaft_AnimBP_C_ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP, K2Node_Event_DamageType) == 0x000008, "Member 'PC_Master_CaravanRaft_AnimBP_C_ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP::K2Node_Event_DamageType' has a wrong offset!");

}

