#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Master_MountGryphon_AnimBP_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct PC_Master_MountGryphon_AnimBP_New.PC_Master_MountGryphon_AnimBP_New_C.AnimBlueprintGeneratedConstantData
// 0x030F (0x0310 - 0x0001)
struct PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1267;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_1268;                              // 0x0010(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1269;                               // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1270;                               // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1271;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1272;                               // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1273;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1274;                               // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1275;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1276;                               // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1277;                               // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1278;                               // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1279;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1280;                              // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1281;                               // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1282;                               // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1283;                               // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1284;                               // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1285;                               // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1286;                               // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1287;                               // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1288;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1289;                               // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1290;                               // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1291;                               // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1292;                               // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1293;                              // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_1294;                              // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1295;                               // 0x00DC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1296;                               // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1297;                               // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1298;                               // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1299;                               // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1300;                               // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1301;                               // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1302;                               // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1303;                                // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1304;                               // 0x011C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1305;                               // 0x0124(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1306;                               // 0x0125(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1307;                               // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1308;                               // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1309;                               // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1310;                               // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1311;                               // 0x0148(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1312;                               // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1313;                               // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1314;                               // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1315;                                // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1316;                             // 0x016C(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1317;                               // 0x0198(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1318;                               // 0x01A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1319;                               // 0x01A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1320;                              // 0x01B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1321;                             // 0x01B4(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1322;                              // 0x01E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1323;                               // 0x01E4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1324;                               // 0x01E5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1325;                               // 0x01E6(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1326;                               // 0x01E7(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1327;                              // 0x01E8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1328;                               // 0x01F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1329;                               // 0x0200(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1330;                                // 0x0208(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1331;                               // 0x020C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1332;                               // 0x0214(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1333;                                // 0x021C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1334;                             // 0x0220(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_1335;                               // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1336;                                 // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1337;                               // 0x0250(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1338;                               // 0x0251(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1339;                               // 0x0252(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1340;                              // 0x0258(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1341;                              // 0x0268(0x0010)(BlueprintVisible)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0278(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02F8(0x0018)()
};
static_assert(alignof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData) == 0x000310, "Wrong size on PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1267) == 0x000004, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1267' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1268) == 0x000010, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1268' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1269) == 0x000020, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1269' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1270) == 0x000028, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1270' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1271) == 0x000030, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1271' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1272) == 0x000034, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1272' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1273) == 0x00003C, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1273' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1274) == 0x000040, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1274' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1275) == 0x000048, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1275' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1276) == 0x00004C, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1276' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1277) == 0x000054, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1277' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1278) == 0x00005C, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1278' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1279) == 0x000064, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1279' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __FloatProperty_1280) == 0x000068, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__FloatProperty_1280' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1281) == 0x00006C, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1281' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1282) == 0x000074, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1282' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1283) == 0x00007C, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1283' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1284) == 0x000084, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1284' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1285) == 0x00008C, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1285' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1286) == 0x000094, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1286' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1287) == 0x00009C, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1287' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1288) == 0x0000A4, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1288' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1289) == 0x0000A8, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1289' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1290) == 0x0000B0, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1290' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1291) == 0x0000B8, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1291' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1292) == 0x0000C0, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1292' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1293) == 0x0000C8, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1293' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __FloatProperty_1294) == 0x0000D8, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__FloatProperty_1294' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ByteProperty_1295) == 0x0000DC, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ByteProperty_1295' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1296) == 0x0000E0, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1296' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1297) == 0x0000E8, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1297' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1298) == 0x0000F0, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1298' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1299) == 0x0000F8, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1299' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1300) == 0x000100, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1300' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1301) == 0x000108, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1301' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1302) == 0x000110, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1302' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1303) == 0x000118, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1303' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1304) == 0x00011C, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1304' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __EnumProperty_1305) == 0x000124, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__EnumProperty_1305' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ByteProperty_1306) == 0x000125, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ByteProperty_1306' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1307) == 0x000128, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1307' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1308) == 0x000130, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1308' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1309) == 0x000138, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1309' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1310) == 0x000140, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1310' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1311) == 0x000148, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1311' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1312) == 0x000150, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1312' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1313) == 0x000158, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1313' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1314) == 0x000160, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1314' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1315) == 0x000168, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1315' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __StructProperty_1316) == 0x00016C, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__StructProperty_1316' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1317) == 0x000198, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1317' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1318) == 0x0001A0, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1318' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1319) == 0x0001A8, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1319' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __FloatProperty_1320) == 0x0001B0, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__FloatProperty_1320' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __StructProperty_1321) == 0x0001B4, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__StructProperty_1321' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __FloatProperty_1322) == 0x0001E0, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__FloatProperty_1322' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __EnumProperty_1323) == 0x0001E4, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__EnumProperty_1323' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ByteProperty_1324) == 0x0001E5, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ByteProperty_1324' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __BoolProperty_1325) == 0x0001E6, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__BoolProperty_1325' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __EnumProperty_1326) == 0x0001E7, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__EnumProperty_1326' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1327) == 0x0001E8, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1327' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1328) == 0x0001F8, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1328' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1329) == 0x000200, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1329' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1330) == 0x000208, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1330' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1331) == 0x00020C, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1331' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1332) == 0x000214, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1332' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __IntProperty_1333) == 0x00021C, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__IntProperty_1333' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __StructProperty_1334) == 0x000220, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__StructProperty_1334' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __BlendProfile_1335) == 0x000240, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__BlendProfile_1335' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __CurveFloat_1336) == 0x000248, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__CurveFloat_1336' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __BoolProperty_1337) == 0x000250, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__BoolProperty_1337' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __EnumProperty_1338) == 0x000251, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__EnumProperty_1338' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __EnumProperty_1339) == 0x000252, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__EnumProperty_1339' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1340) == 0x000258, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1340' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1341) == 0x000268, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1341' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000278, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0002F8, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct PC_Master_MountGryphon_AnimBP_New.PC_Master_MountGryphon_AnimBP_New_C.AnimBlueprintGeneratedMutableData
// 0x004F (0x0050 - 0x0001)
struct PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0006(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_5;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_21;                                  // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_22;                                 // 0x004C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData) == 0x000050, "Wrong size on PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData, __ByteProperty_0) == 0x000002, "Member 'PC_Master_MountGryphon_AnimBP_New::FAnimBlueprintGeneratedMutableData::__ByteProperty_0' has a wrong offset!");
