#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Master_CaravanRaft_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PC_Master_CaravanRaft_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PC_Master_CaravanRaft_AnimBP.PC_Master_CaravanRaft_AnimBP_C
// 0x01E0 (0x29E0 - 0x2800)
class UPC_Master_CaravanRaft_AnimBP_C final : public UAoCRiderAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2800(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct PC_Master_CaravanRaft_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x2808(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x2810(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x2818(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2820(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x2840(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x28B0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x28D0(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2998(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void DamageFlinchBP(TSubclassOf<class UDamageType> DamageType);
	void ExecuteUbergraph_PC_Master_CaravanRaft_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PC_Master_CaravanRaft_AnimBP_C">();
	}
	static class UPC_Master_CaravanRaft_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPC_Master_CaravanRaft_AnimBP_C>();
	}
};
static_assert(alignof(UPC_Master_CaravanRaft_AnimBP_C) == 0x000010, "Wrong alignment on UPC_Master_CaravanRaft_AnimBP_C");
static_assert(sizeof(UPC_Master_CaravanRaft_AnimBP_C) == 0x0029E0, "Wrong size on UPC_Master_CaravanRaft_AnimBP_C");
static_assert(offsetof(UPC_Master_CaravanRaft_AnimBP_C, UberGraphFrame) == 0x002800, "Member 'UPC_Master_CaravanRaft_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPC_Master_CaravanRaft_AnimBP_C, __AnimBlueprintMutables) == 0x002808, "Member 'UPC_Master_CaravanRaft_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UPC_Master_CaravanRaft_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x002810, "Member 'UPC_Master_CaravanRaft_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UPC_Master_CaravanRaft_AnimBP_C, AnimBlueprintExtension_Base) == 0x002818, "Member 'UPC_Master_CaravanRaft_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UPC_Master_CaravanRaft_AnimBP_C, AnimGraphNode_Root) == 0x002820, "Member 'UPC_Master_CaravanRaft_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPC_Master_CaravanRaft_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x002840, "Member 'UPC_Master_CaravanRaft_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UPC_Master_CaravanRaft_AnimBP_C, AnimGraphNode_StateResult) == 0x0028B0, "Member 'UPC_Master_CaravanRaft_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UPC_Master_CaravanRaft_AnimBP_C, AnimGraphNode_StateMachine) == 0x0028D0, "Member 'UPC_Master_CaravanRaft_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UPC_Master_CaravanRaft_AnimBP_C, AnimGraphNode_Slot) == 0x002998, "Member 'UPC_Master_CaravanRaft_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");

}

