#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Master_MountCursedCharger_AnimBP_New

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PC_Master_MountCursedCharger_AnimBP_New.PC_Master_MountCursedCharger_AnimBP_New_C.ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New
// 0x0020 (0x0020 - 0x0000)
struct PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UDamageType>                K2Node_Event_DamageType;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New) == 0x000008, "Wrong alignment on PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New");
static_assert(sizeof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New) == 0x000020, "Wrong size on PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, EntryPoint) == 0x000000, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, K2Node_Event_DamageType) == 0x000008, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, CallFunc_Montage_Play_ReturnValue) == 0x000010, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, CallFunc_BooleanAND_ReturnValue) == 0x000015, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, CallFunc_Not_PreBool_ReturnValue_1) == 0x000016, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, CallFunc_BooleanAND_ReturnValue_1) == 0x000017, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, CallFunc_Not_PreBool_ReturnValue_2) == 0x000018, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, CallFunc_BooleanAND_ReturnValue_2) == 0x000019, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, CallFunc_Not_PreBool_ReturnValue_3) == 0x00001A, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, CallFunc_BooleanOR_ReturnValue_1) == 0x00001C, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, CallFunc_Not_PreBool_ReturnValue_4) == 0x00001D, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New, CallFunc_BooleanAND_ReturnValue_3) == 0x00001E, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountCursedCharger_AnimBP_New::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

// Function PC_Master_MountCursedCharger_AnimBP_New.PC_Master_MountCursedCharger_AnimBP_New_C.DamageFlinchBP
// 0x0008 (0x0008 - 0x0000)
struct PC_Master_MountCursedCharger_AnimBP_New_C_DamageFlinchBP final
{
public:
	TSubclassOf<class UDamageType>                DamageType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(PC_Master_MountCursedCharger_AnimBP_New_C_DamageFlinchBP) == 0x000008, "Wrong alignment on PC_Master_MountCursedCharger_AnimBP_New_C_DamageFlinchBP");
static_assert(sizeof(PC_Master_MountCursedCharger_AnimBP_New_C_DamageFlinchBP) == 0x000008, "Wrong size on PC_Master_MountCursedCharger_AnimBP_New_C_DamageFlinchBP");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_DamageFlinchBP, DamageType) == 0x000000, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_DamageFlinchBP::DamageType' has a wrong offset!");

// Function PC_Master_MountCursedCharger_AnimBP_New.PC_Master_MountCursedCharger_AnimBP_New_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct PC_Master_MountCursedCharger_AnimBP_New_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Master_MountCursedCharger_AnimBP_New_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on PC_Master_MountCursedCharger_AnimBP_New_C_BlueprintUpdateAnimation");
static_assert(sizeof(PC_Master_MountCursedCharger_AnimBP_New_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on PC_Master_MountCursedCharger_AnimBP_New_C_BlueprintUpdateAnimation");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function PC_Master_MountCursedCharger_AnimBP_New.PC_Master_MountCursedCharger_AnimBP_New_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct PC_Master_MountCursedCharger_AnimBP_New_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PC_Master_MountCursedCharger_AnimBP_New_C_AnimGraph) == 0x000008, "Wrong alignment on PC_Master_MountCursedCharger_AnimBP_New_C_AnimGraph");
static_assert(sizeof(PC_Master_MountCursedCharger_AnimBP_New_C_AnimGraph) == 0x000010, "Wrong size on PC_Master_MountCursedCharger_AnimBP_New_C_AnimGraph");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'PC_Master_MountCursedCharger_AnimBP_New_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

