#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Master_MountGryphon_AnimBP_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PC_Master_MountGryphon_AnimBP_New.PC_Master_MountGryphon_AnimBP_New_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct PC_Master_MountGryphon_AnimBP_New_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PC_Master_MountGryphon_AnimBP_New_C_AnimGraph) == 0x000008, "Wrong alignment on PC_Master_MountGryphon_AnimBP_New_C_AnimGraph");
static_assert(sizeof(PC_Master_MountGryphon_AnimBP_New_C_AnimGraph) == 0x000010, "Wrong size on PC_Master_MountGryphon_AnimBP_New_C_AnimGraph");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'PC_Master_MountGryphon_AnimBP_New_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function PC_Master_MountGryphon_AnimBP_New.PC_Master_MountGryphon_AnimBP_New_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct PC_Master_MountGryphon_AnimBP_New_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Master_MountGryphon_AnimBP_New_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on PC_Master_MountGryphon_AnimBP_New_C_BlueprintUpdateAnimation");
static_assert(sizeof(PC_Master_MountGryphon_AnimBP_New_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on PC_Master_MountGryphon_AnimBP_New_C_BlueprintUpdateAnimation");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'PC_Master_MountGryphon_AnimBP_New_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function PC_Master_MountGryphon_AnimBP_New.PC_Master_MountGryphon_AnimBP_New_C.CalculateSpeed
// 0x0068 (0x0068 - 0x0000)
struct PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed final
{
public:
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_1;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed) == 0x000008, "Wrong alignment on PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed");
static_assert(sizeof(PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed) == 0x000068, "Wrong size on PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed, CallFunc_GetOwningActor_ReturnValue) == 0x000000, "Member 'PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed, CallFunc_GetOwningActor_ReturnValue_1) == 0x000008, "Member 'PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed::CallFunc_GetOwningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed, CallFunc_GetVelocity_ReturnValue) == 0x000010, "Member 'PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed, CallFunc_GetActorRightVector_ReturnValue) == 0x000028, "Member 'PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed, CallFunc_GetActorForwardVector_ReturnValue) == 0x000040, "Member 'PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed, CallFunc_Dot_VectorVector_ReturnValue) == 0x000058, "Member 'PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x000060, "Member 'PC_Master_MountGryphon_AnimBP_New_C_CalculateSpeed::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");

// Function PC_Master_MountGryphon_AnimBP_New.PC_Master_MountGryphon_AnimBP_New_C.ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New
// 0x0068 (0x0068 - 0x0000)
struct PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         CallFunc_GetMount_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New) == 0x000008, "Wrong alignment on PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New");
static_assert(sizeof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New) == 0x000068, "Wrong size on PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, EntryPoint) == 0x000000, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, K2Node_DynamicCast_AsBase_Character) == 0x000010, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000019, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, CallFunc_GetMount_ReturnValue) == 0x000020, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::CallFunc_GetMount_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, CallFunc_GetActorForwardVector_ReturnValue) == 0x000028, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, CallFunc_GetVelocity_ReturnValue) == 0x000040, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, CallFunc_Dot_VectorVector_ReturnValue) == 0x000058, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000060, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000061, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000062, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New, K2Node_Event_DeltaTimeX) == 0x000064, "Member 'PC_Master_MountGryphon_AnimBP_New_C_ExecuteUbergraph_PC_Master_MountGryphon_AnimBP_New::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

