#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Master_MountCursedCharger_AnimBP_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct PC_Master_MountCursedCharger_AnimBP_New.PC_Master_MountCursedCharger_AnimBP_New_C.AnimBlueprintGeneratedMutableData
// 0x007B (0x007C - 0x0001)
struct PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_24;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_26;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_27;                                  // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_28;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_29;                                 // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_30;                                 // 0x007A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_31;                                 // 0x007B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData) == 0x00007C, "Wrong size on PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000008, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000010, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x00001C, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000020, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000024, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000028, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x00002C, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000030, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000034, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x000038, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_13) == 0x00003C, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_13' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_14) == 0x000040, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_14' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_15) == 0x000044, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_15' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_16) == 0x000048, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_16' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_17) == 0x00004C, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_17' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_18) == 0x000050, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_18' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_19) == 0x000054, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_19' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_20) == 0x000058, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_20' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_21) == 0x00005C, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_21' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_22) == 0x000060, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_22' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_23) == 0x000064, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_23' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_24) == 0x000068, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_24' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __FloatProperty_25) == 0x00006C, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__FloatProperty_25' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __BoolProperty_26) == 0x000070, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__BoolProperty_26' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __IntProperty_27) == 0x000074, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__IntProperty_27' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __ByteProperty_28) == 0x000078, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__ByteProperty_28' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __ByteProperty_29) == 0x000079, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__ByteProperty_29' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __ByteProperty_30) == 0x00007A, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__ByteProperty_30' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData, __ByteProperty_31) == 0x00007B, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedMutableData::__ByteProperty_31' has a wrong offset!");

// ScriptStruct PC_Master_MountCursedCharger_AnimBP_New.PC_Master_MountCursedCharger_AnimBP_New_C.AnimBlueprintGeneratedConstantData
// 0x02BF (0x02C0 - 0x0001)
struct PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1028;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1029;                               // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1030;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1031;                               // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1032;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1033;                               // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1034;                              // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1035;                              // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1036;                               // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1037;                               // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1038;                               // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1039;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1040;                               // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1041;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1042;                               // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1043;                               // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1044;                              // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1045;                               // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1046;                               // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1047;                               // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1048;                               // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1049;                               // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1050;                               // 0x00B4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1051;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1052;                               // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1053;                               // 0x00C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1054;                               // 0x00C9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1055;                               // 0x00CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1056;                               // 0x00D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1057;                               // 0x00DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1058;                               // 0x00E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1059;                               // 0x00EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1060;                               // 0x00F4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1061;                                // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1062;                             // 0x0100(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1063;                               // 0x012C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1064;                               // 0x0134(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1065;                               // 0x013C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1066;                               // 0x0144(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1067;                              // 0x0148(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1068;                               // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1069;                               // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1070;                                // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_1071;                              // 0x0170(0x0010)(BlueprintVisible)
	bool                                          __BoolProperty_1072;                               // 0x0180(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1073;                              // 0x0184(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1074;                             // 0x0188(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1075;                              // 0x01B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1076;                               // 0x01B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1077;                               // 0x01B9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x2];                                      // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1078;                               // 0x01BC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1079;                               // 0x01C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1080;                                // 0x01CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1081;                             // 0x01D0(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_1082;                               // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1083;                                 // 0x01F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1084;                               // 0x0200(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1085;                               // 0x0201(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1086;                               // 0x0202(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x5];                                      // 0x0203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1087;                              // 0x0208(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1088;                              // 0x0218(0x0010)(BlueprintVisible)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0228(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02A8(0x0018)()
};
static_assert(alignof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedConstantData) == 0x0002C0, "Wrong size on PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1028) == 0x000004, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1028' has a wrong offset!");
static_assert(offsetof(PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedConstantData, __NameProperty_1029) == 0x00000C, "Member 'PC_Master_MountCursedCharger_AnimBP_New::FAnimBlueprintGeneratedConstantData::__NameProperty_1029' has a wrong offset!");
