#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Trebuchet_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct PC_Trebuchet_AnimBP.PC_Trebuchet_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x016F (0x0170 - 0x0001)
struct PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_181;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_182;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_183;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_184;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_185;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_186;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_187;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_188;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_189;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_190;                                // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_191;                               // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_192;                              // 0x0044(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_193;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_194;                                // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_195;                                // 0x0075(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_196;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_197;                              // 0x0080(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_198;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_199;                                  // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_200;                                // 0x00B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_201;                                // 0x00B1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_202;                                // 0x00B2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_203;                               // 0x00B8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_204;                               // 0x00C8(0x0010)(BlueprintVisible)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0158(0x0018)()
};
static_assert(alignof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000170, "Wrong size on PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_181) == 0x000004, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_181' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_182) == 0x00000C, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_182' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_183) == 0x000014, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_183' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_184) == 0x000018, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_184' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_185) == 0x000020, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_185' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_186) == 0x000024, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_186' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_187) == 0x00002C, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_187' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_188) == 0x000030, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_188' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_189) == 0x000038, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_189' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_190) == 0x00003C, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_190' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_191) == 0x000040, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_191' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_192) == 0x000044, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_192' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_193) == 0x000070, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_193' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_194) == 0x000074, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_194' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_195) == 0x000075, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_195' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_196) == 0x000078, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_196' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_197) == 0x000080, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_197' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_198) == 0x0000A0, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_198' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_199) == 0x0000A8, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_199' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_200) == 0x0000B0, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_200' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_201) == 0x0000B1, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_201' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_202) == 0x0000B2, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_202' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_203) == 0x0000B8, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_203' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_204) == 0x0000C8, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_204' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D8, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000158, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct PC_Trebuchet_AnimBP.PC_Trebuchet_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x000F (0x0010 - 0x0001)
struct PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_3;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000010, "Wrong size on PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x000008, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x00000C, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_3) == 0x00000D, "Member 'PC_Trebuchet_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_3' has a wrong offset!");

}

