#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCG_GetPrimaryLandscapeLayerDataTags

#include "Basic.hpp"

#include "PCG_structs.hpp"
#include "S_LandscapeLayerTagDef_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function PCG_GetPrimaryLandscapeLayerDataTags.PCG_GetPrimaryLandscapeLayerDataTags_C.ExecuteWithContext
// 0x03F0 (0x03F0 - 0x0000)
struct PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Input;                                             // 0x00B8(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Output;                                            // 0x00D8(0x0020)(Parm, OutParm)
	struct FPCGDataCollection                     Out_Data_Collection;                               // 0x00F8(0x0020)(Edit, BlueprintVisible)
	class UPCGParamData*                          Out_MetaData;                                      // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPCGPointData*                          OutPointData;                                      // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 IdentifiedLayers;                                  // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGPoint                              CurrentPoint;                                      // 0x0140(0x00D0)(Edit, BlueprintVisible, NoDestructor)
	TArray<class FName>                           PossibleLayers;                                    // 0x0210(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPCGPoint>                      OutPoints;                                         // 0x0220(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPCGPoint>                      InPoints;                                          // 0x0230(0x0010)(Edit, BlueprintVisible)
	class UPCGPointData*                          PointData;                                         // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGComponent*                          CallFunc_GetComponent_ReturnValue;                 // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_VFFoliage_C*                        K2Node_DynamicCast_AsBP_VFFoliage;                 // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPCGTaggedData>                 CallFunc_GetTypedInputsByPinLabel_OutTaggedData;   // 0x0278(0x0010)(ReferenceParm)
	TArray<class UPCGPointData*>                  CallFunc_GetTypedInputsByPinLabel_ReturnValue;     // 0x0288(0x0010)(ReferenceParm)
	class UPCGPointData*                          CallFunc_Array_Get_Item;                           // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGTaggedData                         CallFunc_Array_Get_Item_1;                         // 0x02A8(0x0068)()
	TArray<class FString>                         CallFunc_Set_ToArray_Result;                       // 0x0310(0x0010)(ReferenceParm)
	struct FPCGContext                            CallFunc_GetContext_ReturnValue;                   // 0x0320(0x00B8)()
	class UPCGPointData*                          CallFunc_SpawnObject_ReturnValue;                  // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPCGPointData*                          CallFunc_PointLoop_OutData;                        // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPCGMetadata*                           CallFunc_MutableMetadata_ReturnValue;              // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext) == 0x000010, "Wrong alignment on PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext");
static_assert(sizeof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext) == 0x0003F0, "Wrong size on PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, InContext) == 0x000000, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::InContext' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, Input) == 0x0000B8, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::Input' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, Output) == 0x0000D8, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::Output' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, Out_Data_Collection) == 0x0000F8, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::Out_Data_Collection' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, Out_MetaData) == 0x000118, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::Out_MetaData' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, OutPointData) == 0x000120, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::OutPointData' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, IdentifiedLayers) == 0x000128, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::IdentifiedLayers' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CurrentPoint) == 0x000140, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CurrentPoint' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, PossibleLayers) == 0x000210, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::PossibleLayers' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, OutPoints) == 0x000220, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::OutPoints' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, InPoints) == 0x000230, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::InPoints' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, PointData) == 0x000240, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::PointData' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, Temp_int_Loop_Counter_Variable) == 0x000248, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_GetComponent_ReturnValue) == 0x000250, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_GetComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_Add_IntInt_ReturnValue) == 0x000258, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_GetOwner_ReturnValue) == 0x000260, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, K2Node_DynamicCast_AsBP_VFFoliage) == 0x000268, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::K2Node_DynamicCast_AsBP_VFFoliage' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, K2Node_DynamicCast_bSuccess) == 0x000270, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, Temp_int_Array_Index_Variable) == 0x000274, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_GetTypedInputsByPinLabel_OutTaggedData) == 0x000278, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_GetTypedInputsByPinLabel_OutTaggedData' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_GetTypedInputsByPinLabel_ReturnValue) == 0x000288, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_GetTypedInputsByPinLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_Array_Get_Item) == 0x000298, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_Array_Length_ReturnValue) == 0x0002A0, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_Less_IntInt_ReturnValue) == 0x0002A4, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_Array_Get_Item_1) == 0x0002A8, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_Set_ToArray_Result) == 0x000310, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_GetContext_ReturnValue) == 0x000320, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_SpawnObject_ReturnValue) == 0x0003D8, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_PointLoop_OutData) == 0x0003E0, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_PointLoop_OutData' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext, CallFunc_MutableMetadata_ReturnValue) == 0x0003E8, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_ExecuteWithContext::CallFunc_MutableMetadata_ReturnValue' has a wrong offset!");

// Function PCG_GetPrimaryLandscapeLayerDataTags.PCG_GetPrimaryLandscapeLayerDataTags_C.PointLoopBody
// 0x06D0 (0x06D0 - 0x0000)
struct PCG_GetPrimaryLandscapeLayerDataTags_C_PointLoopBody final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UPCGPointData*                    InData;                                            // 0x00B8(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPCGPoint                              InPoint;                                           // 0x00C0(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FPCGPoint                              OutPoint;                                          // 0x0190(0x00D0)(Parm, OutParm, NoDestructor)
	class UPCGMetadata*                           OutMetadata;                                       // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0268(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_Tag_Container;                                // 0x0270(0x0020)(Edit, BlueprintVisible)
	double                                        Current_Attribute_Value;                           // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Current_Attribute_Name;                            // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         TempStringArray;                                   // 0x02A0(0x0010)(Edit, BlueprintVisible)
	int32                                         TempMax;                                           // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                DiscardedLayerWeightsArray;                        // 0x02B8(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         DiscardedLayersArray;                              // 0x02C8(0x0010)(Edit, BlueprintVisible)
	class FString                                 Out_LayerTags_String;                              // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Out_Layer_String;                                  // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         FilteredLayersArray;                               // 0x02F8(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         LayerTagsArray;                                    // 0x0308(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                IndentifiedLayerWeightsArray;                      // 0x0318(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         IdentifiedLayersArray;                             // 0x0328(0x0010)(Edit, BlueprintVisible)
	TMap<class FName, double>                     IdentifiedLayersMap;                               // 0x0338(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CE[0x2];                                      // 0x03CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x03D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E5[0x3];                                      // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE[0x2];                                      // 0x03EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_3;          // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetAttributes_AttributeNames;             // 0x0448(0x0010)(ReferenceParm)
	TArray<EPCGMetadataTypes>                     CallFunc_GetAttributes_AttributeTypes;             // 0x0458(0x0010)(ReferenceParm)
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPCGMetadataTypes                             CallFunc_Array_Get_Item;                           // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x046D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x046E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46F[0x1];                                      // 0x046F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesDataTableRowExist_ReturnValue;        // 0x047D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47E[0x2];                                      // 0x047E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x3];                                      // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MaxOfFloatArray_IndexOfMaxValue;          // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MaxOfFloatArray_MaxValue;                 // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CA[0x6];                                      // 0x04CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x04D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x04E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x04F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F3[0x5];                                      // 0x04F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_JoinStringArray_ReturnValue_1;            // 0x04F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue_2;            // 0x0508(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_4;                         // 0x0518(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x052C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0534(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_535[0x3];                                      // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_5;                         // 0x0548(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_6;                         // 0x0560(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_ConvertStringToGameplayTag_ReturnValue;   // 0x0570(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x057A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B[0x1];                                      // 0x057B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MaxOfFloatArray_IndexOfMaxValue_1;        // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MaxOfFloatArray_MaxValue_1;               // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0584(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0585(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_586[0x2];                                      // 0x0586(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MaxOfFloatArray_IndexOfMaxValue_2;        // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MaxOfFloatArray_MaxValue_2;               // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_7;                         // 0x0590(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x05A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LandscapeLayerTagDef                CallFunc_GetDataTableRowFromName_OutRow;           // 0x05B0(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LandscapeLayerTagDef                CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x05D8(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0600(0x0010)(ReferenceParm)
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags_1; // 0x0610(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item_8;                         // 0x0620(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item_9;                         // 0x0628(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue_1;                 // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_4;          // 0x0640(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_5;          // 0x0650(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0671(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_672[0x2];                                      // 0x0672(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679[0x7];                                      // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Add_Value_ImplicitCast;               // 0x0680(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 CallFunc_MaxOfFloatArray_FloatArray_ImplicitCast;  // 0x0690(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Array_Add_NewItem_ImplicitCast;           // 0x06A0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 CallFunc_MaxOfFloatArray_FloatArray_ImplicitCast_1; // 0x06A8(0x0010)(ConstParm, ReferenceParm)
	TArray<float>                                 CallFunc_MaxOfFloatArray_FloatArray_ImplicitCast_2; // 0x06B8(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(PCG_GetPrimaryLandscapeLayerDataTags_C_PointLoopBody) == 0x000010, "Wrong alignment on PCG_GetPrimaryLandscapeLayerDataTags_C_PointLoopBody");
static_assert(sizeof(PCG_GetPrimaryLandscapeLayerDataTags_C_PointLoopBody) == 0x0006D0, "Wrong size on PCG_GetPrimaryLandscapeLayerDataTags_C_PointLoopBody");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_PointLoopBody, InContext) == 0x000000, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_PointLoopBody::InContext' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_PointLoopBody, InData) == 0x0000B8, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_PointLoopBody::InData' has a wrong offset!");
static_assert(offsetof(PCG_GetPrimaryLandscapeLayerDataTags_C_PointLoopBody, InPoint) == 0x0000C0, "Member 'PCG_GetPrimaryLandscapeLayerDataTags_C_PointLoopBody::InPoint' has a wrong offset!");
