#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCG_GetPrimaryLandscapeLayerDataTags

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "PCG_structs.hpp"
#include "PCG_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PCG_GetPrimaryLandscapeLayerDataTags.PCG_GetPrimaryLandscapeLayerDataTags_C
// 0x0050 (0x00D8 - 0x0088)
class UPCG_GetPrimaryLandscapeLayerDataTags_C final : public UPCGBlueprintElement
{
public:
	bool                                          Only_List_Primary_Layer;                           // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Max_Listed_Layers;                                 // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Layer_Weight_Cutoff_Threshold;                     // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             LayerDataTable;                                    // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target_Actor;                                      // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Actor_Tag_Container;                               // 0x00A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_VFFoliage_C*                        VFFoliage_Owner;                                   // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Filter_Points;                                     // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteWithContext(struct FPCGContext& InContext, const struct FPCGDataCollection& Input, struct FPCGDataCollection* Output);

	bool PointLoopBody(const struct FPCGContext& InContext, const class UPCGPointData* InData, const struct FPCGPoint& InPoint, struct FPCGPoint* OutPoint, class UPCGMetadata* OutMetadata) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PCG_GetPrimaryLandscapeLayerDataTags_C">();
	}
	static class UPCG_GetPrimaryLandscapeLayerDataTags_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCG_GetPrimaryLandscapeLayerDataTags_C>();
	}
};
static_assert(alignof(UPCG_GetPrimaryLandscapeLayerDataTags_C) == 0x000008, "Wrong alignment on UPCG_GetPrimaryLandscapeLayerDataTags_C");
static_assert(sizeof(UPCG_GetPrimaryLandscapeLayerDataTags_C) == 0x0000D8, "Wrong size on UPCG_GetPrimaryLandscapeLayerDataTags_C");
static_assert(offsetof(UPCG_GetPrimaryLandscapeLayerDataTags_C, Only_List_Primary_Layer) == 0x000088, "Member 'UPCG_GetPrimaryLandscapeLayerDataTags_C::Only_List_Primary_Layer' has a wrong offset!");
static_assert(offsetof(UPCG_GetPrimaryLandscapeLayerDataTags_C, Max_Listed_Layers) == 0x00008C, "Member 'UPCG_GetPrimaryLandscapeLayerDataTags_C::Max_Listed_Layers' has a wrong offset!");
static_assert(offsetof(UPCG_GetPrimaryLandscapeLayerDataTags_C, Layer_Weight_Cutoff_Threshold) == 0x000090, "Member 'UPCG_GetPrimaryLandscapeLayerDataTags_C::Layer_Weight_Cutoff_Threshold' has a wrong offset!");
static_assert(offsetof(UPCG_GetPrimaryLandscapeLayerDataTags_C, LayerDataTable) == 0x000098, "Member 'UPCG_GetPrimaryLandscapeLayerDataTags_C::LayerDataTable' has a wrong offset!");
static_assert(offsetof(UPCG_GetPrimaryLandscapeLayerDataTags_C, Target_Actor) == 0x0000A0, "Member 'UPCG_GetPrimaryLandscapeLayerDataTags_C::Target_Actor' has a wrong offset!");
static_assert(offsetof(UPCG_GetPrimaryLandscapeLayerDataTags_C, Actor_Tag_Container) == 0x0000A8, "Member 'UPCG_GetPrimaryLandscapeLayerDataTags_C::Actor_Tag_Container' has a wrong offset!");
static_assert(offsetof(UPCG_GetPrimaryLandscapeLayerDataTags_C, VFFoliage_Owner) == 0x0000C8, "Member 'UPCG_GetPrimaryLandscapeLayerDataTags_C::VFFoliage_Owner' has a wrong offset!");
static_assert(offsetof(UPCG_GetPrimaryLandscapeLayerDataTags_C, Filter_Points) == 0x0000D0, "Member 'UPCG_GetPrimaryLandscapeLayerDataTags_C::Filter_Points' has a wrong offset!");

}

