#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCGGeometryScriptInterop

#include "Basic.hpp"

#include "PCGGeometryScriptInterop_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"
#include "PCG_classes.hpp"


namespace SDK
{

// Class PCGGeometryScriptInterop.PCGMeshSamplerSettings
// 0x0078 (0x01E8 - 0x0170)
class UPCGMeshSamplerSettings final : public UPCGSettings
{
public:
	EPCGMeshSamplingMethod                        SamplingMethod;                                    // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             StaticMesh;                                        // 0x0178(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRedAsDensity;                                  // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVoxelize;                                         // 0x01A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VoxelSize;                                         // 0x01A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveHiddenTriangles;                            // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometryScriptLODType                        RequestedLODType;                                  // 0x01A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RequestedLODIndex;                                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptMeshPointSamplingOptions SamplingOptions;                                  // 0x01B0(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FGeometryScriptNonUniformPointSamplingOptions NonUniformSamplingOptions;                  // 0x01C8(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         PointSteepness;                                    // 0x01E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGMeshSamplerSettings">();
	}
	static class UPCGMeshSamplerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMeshSamplerSettings>();
	}
};
static_assert(alignof(UPCGMeshSamplerSettings) == 0x000008, "Wrong alignment on UPCGMeshSamplerSettings");
static_assert(sizeof(UPCGMeshSamplerSettings) == 0x0001E8, "Wrong size on UPCGMeshSamplerSettings");
static_assert(offsetof(UPCGMeshSamplerSettings, SamplingMethod) == 0x000170, "Member 'UPCGMeshSamplerSettings::SamplingMethod' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, StaticMesh) == 0x000178, "Member 'UPCGMeshSamplerSettings::StaticMesh' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, bUseRedAsDensity) == 0x0001A0, "Member 'UPCGMeshSamplerSettings::bUseRedAsDensity' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, bVoxelize) == 0x0001A1, "Member 'UPCGMeshSamplerSettings::bVoxelize' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, VoxelSize) == 0x0001A4, "Member 'UPCGMeshSamplerSettings::VoxelSize' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, bRemoveHiddenTriangles) == 0x0001A8, "Member 'UPCGMeshSamplerSettings::bRemoveHiddenTriangles' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, RequestedLODType) == 0x0001A9, "Member 'UPCGMeshSamplerSettings::RequestedLODType' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, RequestedLODIndex) == 0x0001AC, "Member 'UPCGMeshSamplerSettings::RequestedLODIndex' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, SamplingOptions) == 0x0001B0, "Member 'UPCGMeshSamplerSettings::SamplingOptions' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, NonUniformSamplingOptions) == 0x0001C8, "Member 'UPCGMeshSamplerSettings::NonUniformSamplingOptions' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, PointSteepness) == 0x0001E0, "Member 'UPCGMeshSamplerSettings::PointSteepness' has a wrong offset!");

}

