#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ramekin_Healer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function Ramekin_Healer.Ramekin_Healer_C.HasHealingTarget
// 0x0098 (0x0098 - 0x0000)
struct Ramekin_Healer_C_HasHealingTarget final
{
public:
	bool                                          Valid;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGuid>                          CallFunc_GetPerceivedActorGuids_ReturnValue;       // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_Array_Get_Item;                           // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         CallFunc_FindCharacter_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthPercent_ReturnValue;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECombatRelationship                           CallFunc_GetCombatRelationship_ReturnValue;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ramekin_Healer_C_HasHealingTarget) == 0x000008, "Wrong alignment on Ramekin_Healer_C_HasHealingTarget");
static_assert(sizeof(Ramekin_Healer_C_HasHealingTarget) == 0x000098, "Wrong size on Ramekin_Healer_C_HasHealingTarget");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, Valid) == 0x000000, "Member 'Ramekin_Healer_C_HasHealingTarget::Valid' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Ramekin_Healer_C_HasHealingTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Ramekin_Healer_C_HasHealingTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_GetPerceivedActorGuids_ReturnValue) == 0x000028, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_GetPerceivedActorGuids_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_Array_Get_Item) == 0x00003C, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_FindCharacter_ReturnValue) == 0x000050, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_FindCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000058, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_GetHealthPercent_ReturnValue) == 0x00005C, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_GetHealthPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000078, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_Vector_Distance_ReturnValue) == 0x000080, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_GetCombatRelationship_ReturnValue) == 0x000088, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_GetCombatRelationship_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000089, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00008A, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_BooleanOR_ReturnValue) == 0x00008B, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_BooleanAND_ReturnValue) == 0x00008C, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_BooleanAND_ReturnValue_1) == 0x00008D, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ramekin_Healer_C_HasHealingTarget, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'Ramekin_Healer_C_HasHealingTarget::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

