#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ranger_TripTrap_Projectile_Bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Ranger_TripTrap_Projectile_Bp.Ranger_TripTrap_Projectile_Bp_C.ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp
// 0x0118 (0x0118 - 0x0000)
struct Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0028(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp) == 0x000008, "Wrong alignment on Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp");
static_assert(sizeof(Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp) == 0x000118, "Wrong size on Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp");
static_assert(offsetof(Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp, EntryPoint) == 0x000000, "Member 'Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp, K2Node_Event_EndPlayReason) == 0x000004, "Member 'Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp, CallFunc_IsServer_ReturnValue) == 0x00000C, "Member 'Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000010, "Member 'Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp, K2Node_Event_Hit) == 0x000028, "Member 'Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp, CallFunc_HasAuthority_ReturnValue) == 0x000110, "Member 'Ranger_TripTrap_Projectile_Bp_C_ExecuteUbergraph_Ranger_TripTrap_Projectile_Bp::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function Ranger_TripTrap_Projectile_Bp.Ranger_TripTrap_Projectile_Bp_C.ProjectileHit
// 0x00E8 (0x00E8 - 0x0000)
struct Ranger_TripTrap_Projectile_Bp_C_ProjectileHit final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Ranger_TripTrap_Projectile_Bp_C_ProjectileHit) == 0x000008, "Wrong alignment on Ranger_TripTrap_Projectile_Bp_C_ProjectileHit");
static_assert(sizeof(Ranger_TripTrap_Projectile_Bp_C_ProjectileHit) == 0x0000E8, "Wrong size on Ranger_TripTrap_Projectile_Bp_C_ProjectileHit");
static_assert(offsetof(Ranger_TripTrap_Projectile_Bp_C_ProjectileHit, Hit) == 0x000000, "Member 'Ranger_TripTrap_Projectile_Bp_C_ProjectileHit::Hit' has a wrong offset!");

// Function Ranger_TripTrap_Projectile_Bp.Ranger_TripTrap_Projectile_Bp_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Ranger_TripTrap_Projectile_Bp_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ranger_TripTrap_Projectile_Bp_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on Ranger_TripTrap_Projectile_Bp_C_ReceiveEndPlay");
static_assert(sizeof(Ranger_TripTrap_Projectile_Bp_C_ReceiveEndPlay) == 0x000001, "Wrong size on Ranger_TripTrap_Projectile_Bp_C_ReceiveEndPlay");
static_assert(offsetof(Ranger_TripTrap_Projectile_Bp_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'Ranger_TripTrap_Projectile_Bp_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function Ranger_TripTrap_Projectile_Bp.Ranger_TripTrap_Projectile_Bp_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ranger_TripTrap_Projectile_Bp_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ranger_TripTrap_Projectile_Bp_C_ReceiveTick) == 0x000004, "Wrong alignment on Ranger_TripTrap_Projectile_Bp_C_ReceiveTick");
static_assert(sizeof(Ranger_TripTrap_Projectile_Bp_C_ReceiveTick) == 0x000004, "Wrong size on Ranger_TripTrap_Projectile_Bp_C_ReceiveTick");
static_assert(offsetof(Ranger_TripTrap_Projectile_Bp_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ranger_TripTrap_Projectile_Bp_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

