#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoveDuplicates

#include "Basic.hpp"

#include "PCG_structs.hpp"
#include "PCG_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass RemoveDuplicates.RemoveDuplicates_C
// 0x0048 (0x00D0 - 0x0088)
class URemoveDuplicates_C final : public UPCGBlueprintElement
{
public:
	struct FPCGDataCollection                     Out_Data_Collection;                               // 0x0088(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPCGPointData*                          OutPointData;                                      // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPCGPoint>                      Out_Points;                                        // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTransform>                     Point_Transforms;                                  // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteWithContext(struct FPCGContext& InContext, const struct FPCGDataCollection& Input, struct FPCGDataCollection* Output);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RemoveDuplicates_C">();
	}
	static class URemoveDuplicates_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoveDuplicates_C>();
	}
};
static_assert(alignof(URemoveDuplicates_C) == 0x000008, "Wrong alignment on URemoveDuplicates_C");
static_assert(sizeof(URemoveDuplicates_C) == 0x0000D0, "Wrong size on URemoveDuplicates_C");
static_assert(offsetof(URemoveDuplicates_C, Out_Data_Collection) == 0x000088, "Member 'URemoveDuplicates_C::Out_Data_Collection' has a wrong offset!");
static_assert(offsetof(URemoveDuplicates_C, OutPointData) == 0x0000A8, "Member 'URemoveDuplicates_C::OutPointData' has a wrong offset!");
static_assert(offsetof(URemoveDuplicates_C, Out_Points) == 0x0000B0, "Member 'URemoveDuplicates_C::Out_Points' has a wrong offset!");
static_assert(offsetof(URemoveDuplicates_C, Point_Transforms) == 0x0000C0, "Member 'URemoveDuplicates_C::Point_Transforms' has a wrong offset!");

}

