#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoveDuplicates

#include "Basic.hpp"

#include "PCG_structs.hpp"


namespace SDK::Params
{

// Function RemoveDuplicates.RemoveDuplicates_C.ExecuteWithContext
// 0x02D0 (0x02D0 - 0x0000)
struct RemoveDuplicates_C_ExecuteWithContext final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Input;                                             // 0x00B8(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Output;                                            // 0x00D8(0x0020)(Parm, OutParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPCGTaggedData>                 CallFunc_GetTypedInputsByPinLabel_OutTaggedData;   // 0x0100(0x0010)(ReferenceParm)
	TArray<class UPCGPointData*>                  CallFunc_GetTypedInputsByPinLabel_ReturnValue;     // 0x0110(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPCGPointData*                          CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPCGTaggedData                         CallFunc_Array_Get_Item_1;                         // 0x0138(0x0068)()
	TArray<class FString>                         CallFunc_Set_ToArray_Result;                       // 0x01A0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UPCGPointData*                    CallFunc_ToPointDataWithContext_ReturnValue;       // 0x01B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPCGPoint>                      CallFunc_GetPoints_ReturnValue;                    // 0x01C0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGPoint                              CallFunc_Array_Get_Item_2;                         // 0x01E0(0x00D0)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGPointData*                          CallFunc_SpawnObject_ReturnValue;                  // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RemoveDuplicates_C_ExecuteWithContext) == 0x000010, "Wrong alignment on RemoveDuplicates_C_ExecuteWithContext");
static_assert(sizeof(RemoveDuplicates_C_ExecuteWithContext) == 0x0002D0, "Wrong size on RemoveDuplicates_C_ExecuteWithContext");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, InContext) == 0x000000, "Member 'RemoveDuplicates_C_ExecuteWithContext::InContext' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, Input) == 0x0000B8, "Member 'RemoveDuplicates_C_ExecuteWithContext::Input' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, Output) == 0x0000D8, "Member 'RemoveDuplicates_C_ExecuteWithContext::Output' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, Temp_int_Loop_Counter_Variable) == 0x0000F8, "Member 'RemoveDuplicates_C_ExecuteWithContext::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_GetTypedInputsByPinLabel_OutTaggedData) == 0x000100, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_GetTypedInputsByPinLabel_OutTaggedData' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_GetTypedInputsByPinLabel_ReturnValue) == 0x000110, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_GetTypedInputsByPinLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Add_IntInt_ReturnValue) == 0x000120, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Array_Length_ReturnValue) == 0x000124, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, Temp_int_Array_Index_Variable) == 0x00012C, "Member 'RemoveDuplicates_C_ExecuteWithContext::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Array_Get_Item) == 0x000130, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Array_Get_Item_1) == 0x000138, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Set_ToArray_Result) == 0x0001A0, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, Temp_int_Loop_Counter_Variable_1) == 0x0001B0, "Member 'RemoveDuplicates_C_ExecuteWithContext::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001B4, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_ToPointDataWithContext_ReturnValue) == 0x0001B8, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_ToPointDataWithContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_GetPoints_ReturnValue) == 0x0001C0, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_GetPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Array_Length_ReturnValue_1) == 0x0001D0, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, Temp_int_Array_Index_Variable_1) == 0x0001D4, "Member 'RemoveDuplicates_C_ExecuteWithContext::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001D8, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Array_Get_Item_2) == 0x0001E0, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Array_Add_ReturnValue) == 0x0002B0, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Array_Add_ReturnValue_1) == 0x0002B4, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_Array_Contains_ReturnValue) == 0x0002B8, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(RemoveDuplicates_C_ExecuteWithContext, CallFunc_SpawnObject_ReturnValue) == 0x0002C0, "Member 'RemoveDuplicates_C_ExecuteWithContext::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

}

