#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoveHideGrass

#include "Basic.hpp"

#include "PCG_structs.hpp"
#include "PCG_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RemoveHideGrass.RemoveHideGrass_C
// 0x0038 (0x00C0 - 0x0088)
class URemoveHideGrass_C final : public UPCGBlueprintElement
{
public:
	class UPCGSpatialData*                        Spatial_Data;                                      // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPCGPoint>                      All_Points;                                        // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         MeshPathArray;                                     // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   In_Mesh_Attribute_Name;                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPCGMetadata*                           MetaData;                                          // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteWithContext(struct FPCGContext& InContext, const struct FPCGDataCollection& Input, struct FPCGDataCollection* Output);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RemoveHideGrass_C">();
	}
	static class URemoveHideGrass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoveHideGrass_C>();
	}
};
static_assert(alignof(URemoveHideGrass_C) == 0x000008, "Wrong alignment on URemoveHideGrass_C");
static_assert(sizeof(URemoveHideGrass_C) == 0x0000C0, "Wrong size on URemoveHideGrass_C");
static_assert(offsetof(URemoveHideGrass_C, Spatial_Data) == 0x000088, "Member 'URemoveHideGrass_C::Spatial_Data' has a wrong offset!");
static_assert(offsetof(URemoveHideGrass_C, All_Points) == 0x000090, "Member 'URemoveHideGrass_C::All_Points' has a wrong offset!");
static_assert(offsetof(URemoveHideGrass_C, MeshPathArray) == 0x0000A0, "Member 'URemoveHideGrass_C::MeshPathArray' has a wrong offset!");
static_assert(offsetof(URemoveHideGrass_C, In_Mesh_Attribute_Name) == 0x0000B0, "Member 'URemoveHideGrass_C::In_Mesh_Attribute_Name' has a wrong offset!");
static_assert(offsetof(URemoveHideGrass_C, MetaData) == 0x0000B8, "Member 'URemoveHideGrass_C::MetaData' has a wrong offset!");

}

