#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RNG_SBOW_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass RNG_SBOW_AnimBP.RNG_SBOW_AnimBP_C
// 0x0080 (0x03F0 - 0x0370)
class URNG_SBOW_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03A8(0x0048)()

public:
	void ExecuteUbergraph_RNG_SBOW_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RNG_SBOW_AnimBP_C">();
	}
	static class URNG_SBOW_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URNG_SBOW_AnimBP_C>();
	}
};
static_assert(alignof(URNG_SBOW_AnimBP_C) == 0x000010, "Wrong alignment on URNG_SBOW_AnimBP_C");
static_assert(sizeof(URNG_SBOW_AnimBP_C) == 0x0003F0, "Wrong size on URNG_SBOW_AnimBP_C");
static_assert(offsetof(URNG_SBOW_AnimBP_C, UberGraphFrame) == 0x000370, "Member 'URNG_SBOW_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URNG_SBOW_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'URNG_SBOW_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(URNG_SBOW_AnimBP_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'URNG_SBOW_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(URNG_SBOW_AnimBP_C, AnimGraphNode_Root) == 0x000388, "Member 'URNG_SBOW_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(URNG_SBOW_AnimBP_C, AnimGraphNode_Slot) == 0x0003A8, "Member 'URNG_SBOW_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");

}

