#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RNG_SBOW_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RNG_SBOW_AnimBP.RNG_SBOW_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct RNG_SBOW_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(RNG_SBOW_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on RNG_SBOW_AnimBP_C_AnimGraph");
static_assert(sizeof(RNG_SBOW_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on RNG_SBOW_AnimBP_C_AnimGraph");
static_assert(offsetof(RNG_SBOW_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'RNG_SBOW_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function RNG_SBOW_AnimBP.RNG_SBOW_AnimBP_C.ExecuteUbergraph_RNG_SBOW_AnimBP
// 0x0004 (0x0004 - 0x0000)
struct RNG_SBOW_AnimBP_C_ExecuteUbergraph_RNG_SBOW_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RNG_SBOW_AnimBP_C_ExecuteUbergraph_RNG_SBOW_AnimBP) == 0x000004, "Wrong alignment on RNG_SBOW_AnimBP_C_ExecuteUbergraph_RNG_SBOW_AnimBP");
static_assert(sizeof(RNG_SBOW_AnimBP_C_ExecuteUbergraph_RNG_SBOW_AnimBP) == 0x000004, "Wrong size on RNG_SBOW_AnimBP_C_ExecuteUbergraph_RNG_SBOW_AnimBP");
static_assert(offsetof(RNG_SBOW_AnimBP_C_ExecuteUbergraph_RNG_SBOW_AnimBP, EntryPoint) == 0x000000, "Member 'RNG_SBOW_AnimBP_C_ExecuteUbergraph_RNG_SBOW_AnimBP::EntryPoint' has a wrong offset!");

}

