#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RNG_BOOK_2H_animBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct RNG_BOOK_2H_animBP.RNG_BOOK_2H_animBP_C.AnimBlueprintGeneratedConstantData
// 0x0167 (0x0168 - 0x0001)
struct RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_122;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_123;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_124;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_125;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_126;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_127;                              // 0x0024(0x002C)(BlueprintVisible, NoDestructor)
	EAnimSyncMethod                               __EnumProperty_128;                                // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_129;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_130;                                // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_131;                                  // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_132;                                // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_133;                                // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_134;                               // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_135;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_136;                                // 0x008C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_137;                               // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_138;                                // 0x0094(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_139;                                // 0x0095(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_140;                                // 0x0096(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_141;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_142;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_143;                                 // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_144;                              // 0x00B0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0150(0x0018)()
};
static_assert(alignof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData) == 0x000168, "Wrong size on RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __NameProperty_122) == 0x000004, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__NameProperty_122' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __NameProperty_123) == 0x00000C, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__NameProperty_123' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __IntProperty_124) == 0x000014, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__IntProperty_124' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __NameProperty_125) == 0x000018, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__NameProperty_125' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __IntProperty_126) == 0x000020, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__IntProperty_126' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __StructProperty_127) == 0x000024, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__StructProperty_127' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_128) == 0x000050, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_128' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __NameProperty_129) == 0x000054, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__NameProperty_129' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_130) == 0x000060, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_130' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_131) == 0x000068, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_131' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_132) == 0x000070, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_132' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_133) == 0x000071, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_133' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_134) == 0x000078, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_134' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_135) == 0x000088, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_135' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_136) == 0x00008C, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_136' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_137) == 0x000090, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_137' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_138) == 0x000094, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_138' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_139) == 0x000095, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_139' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_140) == 0x000096, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_140' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __NameProperty_141) == 0x000098, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__NameProperty_141' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __NameProperty_142) == 0x0000A0, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__NameProperty_142' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __IntProperty_143) == 0x0000A8, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__IntProperty_143' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, __StructProperty_144) == 0x0000B0, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::__StructProperty_144' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D0, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000150, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct RNG_BOOK_2H_animBP.RNG_BOOK_2H_animBP_C.AnimBlueprintGeneratedMutableData
// 0x0023 (0x0024 - 0x0001)
struct RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData) == 0x000024, "Wrong size on RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_4) == 0x000018, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_4' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x00001C, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000020, "Member 'RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");

}

