#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RNG_BOOK_2H_animBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "RNG_BOOK_2H_animBP_structs.hpp"
#include "ControlRig_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass RNG_BOOK_2H_animBP.RNG_BOOK_2H_animBP_C
// 0x0BC0 (0x2FF0 - 0x2430)
class URNG_BOOK_2H_animBP_C final : public UAoCPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct RNG_BOOK_2H_animBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x2438(0x0024)(HasGetValueTypeHash)
	uint8                                         Pad_245C[0x4];                                     // 0x245C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x2460(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x2468(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2470(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2490(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x24D8(0x0460)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2938(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2988(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x29B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x29F8(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_2;          // 0x2A18(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x2B30(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x2C48(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2CB8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2CD8(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x2D20(0x0118)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2E38(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x2E80(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2EF0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2F10(0x00C8)()
	double                                        __CustomProperty_SpeedRight_219FE6154D43254F178E04A6B0631BA1; // 0x2FD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Torque_X_219FE6154D43254F178E04A6B0631BA1; // 0x2FE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Speed_219FE6154D43254F178E04A6B0631BA1; // 0x2FE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_RNG_BOOK_2H_animBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RNG_BOOK_2H_animBP_C">();
	}
	static class URNG_BOOK_2H_animBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URNG_BOOK_2H_animBP_C>();
	}
};
static_assert(alignof(URNG_BOOK_2H_animBP_C) == 0x000010, "Wrong alignment on URNG_BOOK_2H_animBP_C");
static_assert(sizeof(URNG_BOOK_2H_animBP_C) == 0x002FF0, "Wrong size on URNG_BOOK_2H_animBP_C");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, UberGraphFrame) == 0x002430, "Member 'URNG_BOOK_2H_animBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, __AnimBlueprintMutables) == 0x002438, "Member 'URNG_BOOK_2H_animBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimBlueprintExtension_PropertyAccess) == 0x002460, "Member 'URNG_BOOK_2H_animBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimBlueprintExtension_Base) == 0x002468, "Member 'URNG_BOOK_2H_animBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_Root) == 0x002470, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_Slot) == 0x002490, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_ControlRig) == 0x0024D8, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_TransitionResult_2) == 0x002938, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_TransitionResult_1) == 0x002960, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_TransitionResult) == 0x002988, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_SequencePlayer_1) == 0x0029B0, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_StateResult_2) == 0x0029F8, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_RotationOffsetBlendSpace_2) == 0x002A18, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_RotationOffsetBlendSpace_2' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_RotationOffsetBlendSpace_1) == 0x002B30, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_RotationOffsetBlendSpace_1' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x002C48, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_StateResult_1) == 0x002CB8, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_SequencePlayer) == 0x002CD8, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x002D20, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_BlendListByBool) == 0x002E38, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_BlendSpacePlayer) == 0x002E80, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_StateResult) == 0x002EF0, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, AnimGraphNode_StateMachine) == 0x002F10, "Member 'URNG_BOOK_2H_animBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, __CustomProperty_SpeedRight_219FE6154D43254F178E04A6B0631BA1) == 0x002FD8, "Member 'URNG_BOOK_2H_animBP_C::__CustomProperty_SpeedRight_219FE6154D43254F178E04A6B0631BA1' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, __CustomProperty_Torque_X_219FE6154D43254F178E04A6B0631BA1) == 0x002FE0, "Member 'URNG_BOOK_2H_animBP_C::__CustomProperty_Torque_X_219FE6154D43254F178E04A6B0631BA1' has a wrong offset!");
static_assert(offsetof(URNG_BOOK_2H_animBP_C, __CustomProperty_Speed_219FE6154D43254F178E04A6B0631BA1) == 0x002FE8, "Member 'URNG_BOOK_2H_animBP_C::__CustomProperty_Speed_219FE6154D43254F178E04A6B0631BA1' has a wrong offset!");

}

