#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RockMonster_MetalStorm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RockMonster_MetalStorm.RockMonster_MetalStorm_C
// 0x0018 (0x0528 - 0x0510)
class ARockMonster_MetalStorm_C final : public AAoCAbilityLingeringEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Target;                                            // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RockMonster_MetalStorm(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RockMonster_MetalStorm_C">();
	}
	static class ARockMonster_MetalStorm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARockMonster_MetalStorm_C>();
	}
};
static_assert(alignof(ARockMonster_MetalStorm_C) == 0x000008, "Wrong alignment on ARockMonster_MetalStorm_C");
static_assert(sizeof(ARockMonster_MetalStorm_C) == 0x000528, "Wrong size on ARockMonster_MetalStorm_C");
static_assert(offsetof(ARockMonster_MetalStorm_C, UberGraphFrame) == 0x000510, "Member 'ARockMonster_MetalStorm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARockMonster_MetalStorm_C, Target) == 0x000518, "Member 'ARockMonster_MetalStorm_C::Target' has a wrong offset!");
static_assert(offsetof(ARockMonster_MetalStorm_C, Speed) == 0x000520, "Member 'ARockMonster_MetalStorm_C::Speed' has a wrong offset!");

}

