#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_BiomeSelection

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_BiomeSelection.S_BiomeSelection
// 0x0008 (0x0008 - 0x0000)
struct FS_BiomeSelection final
{
public:
	uint8                                         RedCategoryAmount_28_82AC9F254562A45823B2CC83F029390C; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         GreenCategoryAmount_29_CC29FA4D4EDD6659DD2CA7BD841EB70C; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         BlueCategoryAmount_30_C0564D6B482CAF3828957491CD5C448A; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         AlphaCategoryAmount_31_3D81297C4F89627DFC115C82FB3E4938; // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CategorySelections_37_C3264B7E4EB8BDCEEDD56EBC14188BE6; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_BiomeSelection) == 0x000004, "Wrong alignment on FS_BiomeSelection");
static_assert(sizeof(FS_BiomeSelection) == 0x000008, "Wrong size on FS_BiomeSelection");
static_assert(offsetof(FS_BiomeSelection, RedCategoryAmount_28_82AC9F254562A45823B2CC83F029390C) == 0x000000, "Member 'FS_BiomeSelection::RedCategoryAmount_28_82AC9F254562A45823B2CC83F029390C' has a wrong offset!");
static_assert(offsetof(FS_BiomeSelection, GreenCategoryAmount_29_CC29FA4D4EDD6659DD2CA7BD841EB70C) == 0x000001, "Member 'FS_BiomeSelection::GreenCategoryAmount_29_CC29FA4D4EDD6659DD2CA7BD841EB70C' has a wrong offset!");
static_assert(offsetof(FS_BiomeSelection, BlueCategoryAmount_30_C0564D6B482CAF3828957491CD5C448A) == 0x000002, "Member 'FS_BiomeSelection::BlueCategoryAmount_30_C0564D6B482CAF3828957491CD5C448A' has a wrong offset!");
static_assert(offsetof(FS_BiomeSelection, AlphaCategoryAmount_31_3D81297C4F89627DFC115C82FB3E4938) == 0x000003, "Member 'FS_BiomeSelection::AlphaCategoryAmount_31_3D81297C4F89627DFC115C82FB3E4938' has a wrong offset!");
static_assert(offsetof(FS_BiomeSelection, CategorySelections_37_C3264B7E4EB8BDCEEDD56EBC14188BE6) == 0x000004, "Member 'FS_BiomeSelection::CategorySelections_37_C3264B7E4EB8BDCEEDD56EBC14188BE6' has a wrong offset!");

}

