#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_ColorGradingSettings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_ColorGradingSettings.S_ColorGradingSettings
// 0x0290 (0x0290 - 0x0000)
struct FS_ColorGradingSettings final
{
public:
	struct FColorGradePerRangeSettings            Global_8_44BE38444494CF7BAEC5249520F729A6;         // 0x0000(0x00A0)(Edit, BlueprintVisible, NoDestructor)
	struct FColorGradePerRangeSettings            Shadows_9_4A9BE399455E7BDDE138D88677429CD3;        // 0x00A0(0x00A0)(Edit, BlueprintVisible, NoDestructor)
	struct FColorGradePerRangeSettings            Midtones_10_20ED71FF415B0A37D7900D9C14318522;      // 0x0140(0x00A0)(Edit, BlueprintVisible, NoDestructor)
	struct FColorGradePerRangeSettings            Highlights_12_13A48CBF455BACA450B0E69D38942B81;    // 0x01E0(0x00A0)(Edit, BlueprintVisible, NoDestructor)
	struct FLinearColor                           SceneColorTint_20_D9C216334D34CE42ACB648B215B31C62; // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_ColorGradingSettings) == 0x000010, "Wrong alignment on FS_ColorGradingSettings");
static_assert(sizeof(FS_ColorGradingSettings) == 0x000290, "Wrong size on FS_ColorGradingSettings");
static_assert(offsetof(FS_ColorGradingSettings, Global_8_44BE38444494CF7BAEC5249520F729A6) == 0x000000, "Member 'FS_ColorGradingSettings::Global_8_44BE38444494CF7BAEC5249520F729A6' has a wrong offset!");
static_assert(offsetof(FS_ColorGradingSettings, Shadows_9_4A9BE399455E7BDDE138D88677429CD3) == 0x0000A0, "Member 'FS_ColorGradingSettings::Shadows_9_4A9BE399455E7BDDE138D88677429CD3' has a wrong offset!");
static_assert(offsetof(FS_ColorGradingSettings, Midtones_10_20ED71FF415B0A37D7900D9C14318522) == 0x000140, "Member 'FS_ColorGradingSettings::Midtones_10_20ED71FF415B0A37D7900D9C14318522' has a wrong offset!");
static_assert(offsetof(FS_ColorGradingSettings, Highlights_12_13A48CBF455BACA450B0E69D38942B81) == 0x0001E0, "Member 'FS_ColorGradingSettings::Highlights_12_13A48CBF455BACA450B0E69D38942B81' has a wrong offset!");
static_assert(offsetof(FS_ColorGradingSettings, SceneColorTint_20_D9C216334D34CE42ACB648B215B31C62) == 0x000280, "Member 'FS_ColorGradingSettings::SceneColorTint_20_D9C216334D34CE42ACB648B215B31C62' has a wrong offset!");

}

