#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_EnvironmentSettingsSwitches

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_EnvironmentSettingsSwitches.S_EnvironmentSettingsSwitches
// 0x0013 (0x0013 - 0x0000)
struct FS_EnvironmentSettingsSwitches final
{
public:
	bool                                          FogDensity_23_4C3911C54F2F4C830479F189CE9591C3;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FogHeightFalloff_24_0AC989704E7AC93F45C5C28C1BD79FE3; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FogInscatteringColor_25_E4B619DE402435C55A550B8DB83DA43F; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FogAlbedo_26_0402C1D3463FEEAFE50D619A7E37044F;     // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FogStartDistance_57_883B1FDD44E3FE800610BE92C0899EFC; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChanceofPrecipitation_27_22F41A6D409955ABDD27058438BE0EA9; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AverageTemperature_33_1D345D2C4D77F564F2FA68BF6D9BF595; // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WindSpeedMultiplier_39_2508B70D4B88F2AF0AA91B82ACBC256B; // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WindSpeedOverride_41_B3E6392A46EC9A2E7585AC8FC424E28A; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WindDirectionOverride_35_6660E91C4E7710DC01D32C8A31F765D3; // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MieAbsorption_53_5386A5BC41FBF6BC45808F9E5906CD7B; // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkyAbsorption_49_0ED84AC04415ACB7F1F2918B2D831AF5; // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkyRayleighScattering_51_EFD6361B4988369D11C93AA28E160071; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LUT_44_5CD8B69F4261AE3C83E46DBFD2199544;           // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AudioEvents_55_CBDDABA3444375B484C9169AD8DFFD81;   // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ExposureCompensation_59_D963FFEE46BB1CA68A2B9191EA737739; // 0x000F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ColorGrading_61_CCC5369A4A2067FBD7173290AE5A978E;  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SunIntensityMultiplier_63_B0DC89594A9A6FD70922B3A75D9172E0; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SunColorOverride_65_05FBC4F844F75285680812B1419833A0; // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_EnvironmentSettingsSwitches) == 0x000001, "Wrong alignment on FS_EnvironmentSettingsSwitches");
static_assert(sizeof(FS_EnvironmentSettingsSwitches) == 0x000013, "Wrong size on FS_EnvironmentSettingsSwitches");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, FogDensity_23_4C3911C54F2F4C830479F189CE9591C3) == 0x000000, "Member 'FS_EnvironmentSettingsSwitches::FogDensity_23_4C3911C54F2F4C830479F189CE9591C3' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, FogHeightFalloff_24_0AC989704E7AC93F45C5C28C1BD79FE3) == 0x000001, "Member 'FS_EnvironmentSettingsSwitches::FogHeightFalloff_24_0AC989704E7AC93F45C5C28C1BD79FE3' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, FogInscatteringColor_25_E4B619DE402435C55A550B8DB83DA43F) == 0x000002, "Member 'FS_EnvironmentSettingsSwitches::FogInscatteringColor_25_E4B619DE402435C55A550B8DB83DA43F' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, FogAlbedo_26_0402C1D3463FEEAFE50D619A7E37044F) == 0x000003, "Member 'FS_EnvironmentSettingsSwitches::FogAlbedo_26_0402C1D3463FEEAFE50D619A7E37044F' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, FogStartDistance_57_883B1FDD44E3FE800610BE92C0899EFC) == 0x000004, "Member 'FS_EnvironmentSettingsSwitches::FogStartDistance_57_883B1FDD44E3FE800610BE92C0899EFC' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, ChanceofPrecipitation_27_22F41A6D409955ABDD27058438BE0EA9) == 0x000005, "Member 'FS_EnvironmentSettingsSwitches::ChanceofPrecipitation_27_22F41A6D409955ABDD27058438BE0EA9' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, AverageTemperature_33_1D345D2C4D77F564F2FA68BF6D9BF595) == 0x000006, "Member 'FS_EnvironmentSettingsSwitches::AverageTemperature_33_1D345D2C4D77F564F2FA68BF6D9BF595' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, WindSpeedMultiplier_39_2508B70D4B88F2AF0AA91B82ACBC256B) == 0x000007, "Member 'FS_EnvironmentSettingsSwitches::WindSpeedMultiplier_39_2508B70D4B88F2AF0AA91B82ACBC256B' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, WindSpeedOverride_41_B3E6392A46EC9A2E7585AC8FC424E28A) == 0x000008, "Member 'FS_EnvironmentSettingsSwitches::WindSpeedOverride_41_B3E6392A46EC9A2E7585AC8FC424E28A' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, WindDirectionOverride_35_6660E91C4E7710DC01D32C8A31F765D3) == 0x000009, "Member 'FS_EnvironmentSettingsSwitches::WindDirectionOverride_35_6660E91C4E7710DC01D32C8A31F765D3' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, MieAbsorption_53_5386A5BC41FBF6BC45808F9E5906CD7B) == 0x00000A, "Member 'FS_EnvironmentSettingsSwitches::MieAbsorption_53_5386A5BC41FBF6BC45808F9E5906CD7B' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, SkyAbsorption_49_0ED84AC04415ACB7F1F2918B2D831AF5) == 0x00000B, "Member 'FS_EnvironmentSettingsSwitches::SkyAbsorption_49_0ED84AC04415ACB7F1F2918B2D831AF5' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, SkyRayleighScattering_51_EFD6361B4988369D11C93AA28E160071) == 0x00000C, "Member 'FS_EnvironmentSettingsSwitches::SkyRayleighScattering_51_EFD6361B4988369D11C93AA28E160071' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, LUT_44_5CD8B69F4261AE3C83E46DBFD2199544) == 0x00000D, "Member 'FS_EnvironmentSettingsSwitches::LUT_44_5CD8B69F4261AE3C83E46DBFD2199544' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, AudioEvents_55_CBDDABA3444375B484C9169AD8DFFD81) == 0x00000E, "Member 'FS_EnvironmentSettingsSwitches::AudioEvents_55_CBDDABA3444375B484C9169AD8DFFD81' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, ExposureCompensation_59_D963FFEE46BB1CA68A2B9191EA737739) == 0x00000F, "Member 'FS_EnvironmentSettingsSwitches::ExposureCompensation_59_D963FFEE46BB1CA68A2B9191EA737739' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, ColorGrading_61_CCC5369A4A2067FBD7173290AE5A978E) == 0x000010, "Member 'FS_EnvironmentSettingsSwitches::ColorGrading_61_CCC5369A4A2067FBD7173290AE5A978E' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, SunIntensityMultiplier_63_B0DC89594A9A6FD70922B3A75D9172E0) == 0x000011, "Member 'FS_EnvironmentSettingsSwitches::SunIntensityMultiplier_63_B0DC89594A9A6FD70922B3A75D9172E0' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettingsSwitches, SunColorOverride_65_05FBC4F844F75285680812B1419833A0) == 0x000012, "Member 'FS_EnvironmentSettingsSwitches::SunColorOverride_65_05FBC4F844F75285680812B1419833A0' has a wrong offset!");

}

