#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_EnvironmentSettings

#include "Basic.hpp"

#include "SStartStopAudioEvents_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_ColorGradingSettings_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_EnvironmentSettings.S_EnvironmentSettings
// 0x0600 (0x0600 - 0x0000)
struct FS_EnvironmentSettings final
{
public:
	double                                        FogDensity_2_4C3911C54F2F4C830479F189CE9591C3;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FogHeightFalloff_4_0AC989704E7AC93F45C5C28C1BD79FE3; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FogInscatteringColor_14_E4B619DE402435C55A550B8DB83DA43F; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FogAlbedo_15_0402C1D3463FEEAFE50D619A7E37044F;     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FogStartDistance_66_CD78EF0C4FC4B0B65A75C4BA76759FB8; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChanceofPrecipitation_19_22F41A6D409955ABDD27058438BE0EA9; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AverageTemperature_28_1D345D2C4D77F564F2FA68BF6D9BF595; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindSpeedMultiplier_29_ECE27844405AFA52B54AFDA5C2A253A2; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindSpeedOverride_33_988BA21C4F4A1971E6ADDF919185A4F7; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindDirectionOverride_30_3DE8D59B4E5006A82DB5C59B6E0A123E; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MieAbsorption_51_1871C61943C28303E070C4A861B15362; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SkyAbsorption_44_A4BF2E8D431ADCD55AE63BBE1CB4A74B; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SkyRayleighScattering_48_021A62EF4F502FE534102397825BCBA2; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVolumeTexture*                         LUT_36_7A14C5B14ED62558889A7D96DAFF18E9;           // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSStartStopAudioEvents                 AudioEvents_63_35B4FB764D387AF351DAACB554496884;   // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ExposureCompensation_81_B6CD156948DBC422E041548C1A76BB4C; // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ExposureCompensationNight_79_213551AF4DBE43146CDC6C9628419461; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ColorGradingSettings                ColorGradingDay_73_50F8BC9C4C138936658A35B26465B9DA; // 0x00C0(0x0290)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_ColorGradingSettings                ColorGradingNight_76_397BB3B8434C2524028A32B177C5BA40; // 0x0350(0x0290)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	double                                        SunIntensityMultiplier_85_83D826964DC2566D5669DFA37631ECBD; // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SunColorOverride_88_5DCB69A646AADF66834648986A426DE4; // 0x05E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_EnvironmentSettings) == 0x000010, "Wrong alignment on FS_EnvironmentSettings");
static_assert(sizeof(FS_EnvironmentSettings) == 0x000600, "Wrong size on FS_EnvironmentSettings");
static_assert(offsetof(FS_EnvironmentSettings, FogDensity_2_4C3911C54F2F4C830479F189CE9591C3) == 0x000000, "Member 'FS_EnvironmentSettings::FogDensity_2_4C3911C54F2F4C830479F189CE9591C3' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, FogHeightFalloff_4_0AC989704E7AC93F45C5C28C1BD79FE3) == 0x000008, "Member 'FS_EnvironmentSettings::FogHeightFalloff_4_0AC989704E7AC93F45C5C28C1BD79FE3' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, FogInscatteringColor_14_E4B619DE402435C55A550B8DB83DA43F) == 0x000010, "Member 'FS_EnvironmentSettings::FogInscatteringColor_14_E4B619DE402435C55A550B8DB83DA43F' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, FogAlbedo_15_0402C1D3463FEEAFE50D619A7E37044F) == 0x000020, "Member 'FS_EnvironmentSettings::FogAlbedo_15_0402C1D3463FEEAFE50D619A7E37044F' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, FogStartDistance_66_CD78EF0C4FC4B0B65A75C4BA76759FB8) == 0x000030, "Member 'FS_EnvironmentSettings::FogStartDistance_66_CD78EF0C4FC4B0B65A75C4BA76759FB8' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, ChanceofPrecipitation_19_22F41A6D409955ABDD27058438BE0EA9) == 0x000038, "Member 'FS_EnvironmentSettings::ChanceofPrecipitation_19_22F41A6D409955ABDD27058438BE0EA9' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, AverageTemperature_28_1D345D2C4D77F564F2FA68BF6D9BF595) == 0x000040, "Member 'FS_EnvironmentSettings::AverageTemperature_28_1D345D2C4D77F564F2FA68BF6D9BF595' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, WindSpeedMultiplier_29_ECE27844405AFA52B54AFDA5C2A253A2) == 0x000048, "Member 'FS_EnvironmentSettings::WindSpeedMultiplier_29_ECE27844405AFA52B54AFDA5C2A253A2' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, WindSpeedOverride_33_988BA21C4F4A1971E6ADDF919185A4F7) == 0x000050, "Member 'FS_EnvironmentSettings::WindSpeedOverride_33_988BA21C4F4A1971E6ADDF919185A4F7' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, WindDirectionOverride_30_3DE8D59B4E5006A82DB5C59B6E0A123E) == 0x000058, "Member 'FS_EnvironmentSettings::WindDirectionOverride_30_3DE8D59B4E5006A82DB5C59B6E0A123E' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, MieAbsorption_51_1871C61943C28303E070C4A861B15362) == 0x000060, "Member 'FS_EnvironmentSettings::MieAbsorption_51_1871C61943C28303E070C4A861B15362' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, SkyAbsorption_44_A4BF2E8D431ADCD55AE63BBE1CB4A74B) == 0x000070, "Member 'FS_EnvironmentSettings::SkyAbsorption_44_A4BF2E8D431ADCD55AE63BBE1CB4A74B' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, SkyRayleighScattering_48_021A62EF4F502FE534102397825BCBA2) == 0x000080, "Member 'FS_EnvironmentSettings::SkyRayleighScattering_48_021A62EF4F502FE534102397825BCBA2' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, LUT_36_7A14C5B14ED62558889A7D96DAFF18E9) == 0x000090, "Member 'FS_EnvironmentSettings::LUT_36_7A14C5B14ED62558889A7D96DAFF18E9' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, AudioEvents_63_35B4FB764D387AF351DAACB554496884) == 0x000098, "Member 'FS_EnvironmentSettings::AudioEvents_63_35B4FB764D387AF351DAACB554496884' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, ExposureCompensation_81_B6CD156948DBC422E041548C1A76BB4C) == 0x0000A8, "Member 'FS_EnvironmentSettings::ExposureCompensation_81_B6CD156948DBC422E041548C1A76BB4C' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, ExposureCompensationNight_79_213551AF4DBE43146CDC6C9628419461) == 0x0000B0, "Member 'FS_EnvironmentSettings::ExposureCompensationNight_79_213551AF4DBE43146CDC6C9628419461' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, ColorGradingDay_73_50F8BC9C4C138936658A35B26465B9DA) == 0x0000C0, "Member 'FS_EnvironmentSettings::ColorGradingDay_73_50F8BC9C4C138936658A35B26465B9DA' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, ColorGradingNight_76_397BB3B8434C2524028A32B177C5BA40) == 0x000350, "Member 'FS_EnvironmentSettings::ColorGradingNight_76_397BB3B8434C2524028A32B177C5BA40' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, SunIntensityMultiplier_85_83D826964DC2566D5669DFA37631ECBD) == 0x0005E0, "Member 'FS_EnvironmentSettings::SunIntensityMultiplier_85_83D826964DC2566D5669DFA37631ECBD' has a wrong offset!");
static_assert(offsetof(FS_EnvironmentSettings, SunColorOverride_88_5DCB69A646AADF66834648986A426DE4) == 0x0005E8, "Member 'FS_EnvironmentSettings::SunColorOverride_88_5DCB69A646AADF66834648986A426DE4' has a wrong offset!");

}

