#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_FenceSetDressData

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"
#include "S_FenceDebrisData_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_FenceSetDressData.S_FenceSetDressData
// 0x0050 (0x0050 - 0x0000)
struct FS_FenceSetDressData final
{
public:
	TArray<struct FAoCSplineMeshEntry>            FenceObjects_44_F5CF02F44C2F402BDD51E49AB86F588C;  // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         RandomFenceSeed_49_8532FBFB4D4333965968A8A42994A6CC; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FenceRandom_45_0AC6BF9C49073A16EC2AD6B8C31EC8CE;   // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AffectedByExclusion_47_4F78E40445C930221421A4B80E0BDAB4; // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlipMeshes_51_1BE1CF8945C708B49E4DDDBFEB3463C5;    // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SnapToGround_52_E7CF61E34D4CB61AA401739946D033B3;  // 0x0017(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FenceDensity_76_04EA821F426087E1ED74F0AD07E7807A;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FenceDistancefromSpline_72_5F3F8D2C4FC76E0FEC34449B4BAF9B24; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FenceZOffset_53_5F26CE6043B1FE06D60BCF80AF8494C7;  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FenceDilapidation_75_D78C7D0C4F1081C322514E8AF214EFC3; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_FenceDebrisData                     Debris_70_9CAE021646CF1DBEEA7A7095B3B0E9D3;        // 0x0038(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FS_FenceSetDressData) == 0x000008, "Wrong alignment on FS_FenceSetDressData");
static_assert(sizeof(FS_FenceSetDressData) == 0x000050, "Wrong size on FS_FenceSetDressData");
static_assert(offsetof(FS_FenceSetDressData, FenceObjects_44_F5CF02F44C2F402BDD51E49AB86F588C) == 0x000000, "Member 'FS_FenceSetDressData::FenceObjects_44_F5CF02F44C2F402BDD51E49AB86F588C' has a wrong offset!");
static_assert(offsetof(FS_FenceSetDressData, RandomFenceSeed_49_8532FBFB4D4333965968A8A42994A6CC) == 0x000010, "Member 'FS_FenceSetDressData::RandomFenceSeed_49_8532FBFB4D4333965968A8A42994A6CC' has a wrong offset!");
static_assert(offsetof(FS_FenceSetDressData, FenceRandom_45_0AC6BF9C49073A16EC2AD6B8C31EC8CE) == 0x000014, "Member 'FS_FenceSetDressData::FenceRandom_45_0AC6BF9C49073A16EC2AD6B8C31EC8CE' has a wrong offset!");
static_assert(offsetof(FS_FenceSetDressData, AffectedByExclusion_47_4F78E40445C930221421A4B80E0BDAB4) == 0x000015, "Member 'FS_FenceSetDressData::AffectedByExclusion_47_4F78E40445C930221421A4B80E0BDAB4' has a wrong offset!");
static_assert(offsetof(FS_FenceSetDressData, FlipMeshes_51_1BE1CF8945C708B49E4DDDBFEB3463C5) == 0x000016, "Member 'FS_FenceSetDressData::FlipMeshes_51_1BE1CF8945C708B49E4DDDBFEB3463C5' has a wrong offset!");
static_assert(offsetof(FS_FenceSetDressData, SnapToGround_52_E7CF61E34D4CB61AA401739946D033B3) == 0x000017, "Member 'FS_FenceSetDressData::SnapToGround_52_E7CF61E34D4CB61AA401739946D033B3' has a wrong offset!");
static_assert(offsetof(FS_FenceSetDressData, FenceDensity_76_04EA821F426087E1ED74F0AD07E7807A) == 0x000018, "Member 'FS_FenceSetDressData::FenceDensity_76_04EA821F426087E1ED74F0AD07E7807A' has a wrong offset!");
static_assert(offsetof(FS_FenceSetDressData, FenceDistancefromSpline_72_5F3F8D2C4FC76E0FEC34449B4BAF9B24) == 0x000020, "Member 'FS_FenceSetDressData::FenceDistancefromSpline_72_5F3F8D2C4FC76E0FEC34449B4BAF9B24' has a wrong offset!");
static_assert(offsetof(FS_FenceSetDressData, FenceZOffset_53_5F26CE6043B1FE06D60BCF80AF8494C7) == 0x000028, "Member 'FS_FenceSetDressData::FenceZOffset_53_5F26CE6043B1FE06D60BCF80AF8494C7' has a wrong offset!");
static_assert(offsetof(FS_FenceSetDressData, FenceDilapidation_75_D78C7D0C4F1081C322514E8AF214EFC3) == 0x000030, "Member 'FS_FenceSetDressData::FenceDilapidation_75_D78C7D0C4F1081C322514E8AF214EFC3' has a wrong offset!");
static_assert(offsetof(FS_FenceSetDressData, Debris_70_9CAE021646CF1DBEEA7A7095B3B0E9D3) == 0x000038, "Member 'FS_FenceSetDressData::Debris_70_9CAE021646CF1DBEEA7A7095B3B0E9D3' has a wrong offset!");

}

