#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PCGParamSet_Dense

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_PCGParamSet_Dense.S_PCGParamSet_Dense
// 0x0018 (0x0018 - 0x0000)
struct FS_PCGParamSet_Dense final
{
public:
	int32                                         Seed_2_B5DAA0774D9624AA518BE3A88C56981F;           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Spacing_5_78E31ECD45A765B163D958BF12E2EB9D;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseInteriorPoints_8_3616172446CE627E53DE00B858D5E678; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PCGParamSet_Dense) == 0x000008, "Wrong alignment on FS_PCGParamSet_Dense");
static_assert(sizeof(FS_PCGParamSet_Dense) == 0x000018, "Wrong size on FS_PCGParamSet_Dense");
static_assert(offsetof(FS_PCGParamSet_Dense, Seed_2_B5DAA0774D9624AA518BE3A88C56981F) == 0x000000, "Member 'FS_PCGParamSet_Dense::Seed_2_B5DAA0774D9624AA518BE3A88C56981F' has a wrong offset!");
static_assert(offsetof(FS_PCGParamSet_Dense, Spacing_5_78E31ECD45A765B163D958BF12E2EB9D) == 0x000008, "Member 'FS_PCGParamSet_Dense::Spacing_5_78E31ECD45A765B163D958BF12E2EB9D' has a wrong offset!");
static_assert(offsetof(FS_PCGParamSet_Dense, UseInteriorPoints_8_3616172446CE627E53DE00B858D5E678) == 0x000010, "Member 'FS_PCGParamSet_Dense::UseInteriorPoints_8_3616172446CE627E53DE00B858D5E678' has a wrong offset!");

}

