#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PCGParamSet_Clusters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_PCGParamSet_Clusters.S_PCGParamSet_Clusters
// 0x0020 (0x0020 - 0x0000)
struct FS_PCGParamSet_Clusters final
{
public:
	int32                                         Seed_2_3D73E6B843A4C056E6D9079E0390AF6E;           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Spacing_5_D07835A54414B03DB1C79A82F6DD620A;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scarcity_7_225C566F4A4D4FD5251729BE34AF89F9;       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BoundsOverride_9_F0303A4F419FFDA05EAB5F81BA2BF940; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PCGParamSet_Clusters) == 0x000008, "Wrong alignment on FS_PCGParamSet_Clusters");
static_assert(sizeof(FS_PCGParamSet_Clusters) == 0x000020, "Wrong size on FS_PCGParamSet_Clusters");
static_assert(offsetof(FS_PCGParamSet_Clusters, Seed_2_3D73E6B843A4C056E6D9079E0390AF6E) == 0x000000, "Member 'FS_PCGParamSet_Clusters::Seed_2_3D73E6B843A4C056E6D9079E0390AF6E' has a wrong offset!");
static_assert(offsetof(FS_PCGParamSet_Clusters, Spacing_5_D07835A54414B03DB1C79A82F6DD620A) == 0x000008, "Member 'FS_PCGParamSet_Clusters::Spacing_5_D07835A54414B03DB1C79A82F6DD620A' has a wrong offset!");
static_assert(offsetof(FS_PCGParamSet_Clusters, Scarcity_7_225C566F4A4D4FD5251729BE34AF89F9) == 0x000010, "Member 'FS_PCGParamSet_Clusters::Scarcity_7_225C566F4A4D4FD5251729BE34AF89F9' has a wrong offset!");
static_assert(offsetof(FS_PCGParamSet_Clusters, BoundsOverride_9_F0303A4F419FFDA05EAB5F81BA2BF940) == 0x000018, "Member 'FS_PCGParamSet_Clusters::BoundsOverride_9_F0303A4F419FFDA05EAB5F81BA2BF940' has a wrong offset!");

}

