#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SetGrass

#include "Basic.hpp"

#include "PCG_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SetGrass.SetGrass_C.ExecuteWithContext
// 0x02E0 (0x02E0 - 0x0000)
struct SetGrass_C_ExecuteWithContext final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Input;                                             // 0x00B8(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Output;                                            // 0x00D8(0x0020)(Parm, OutParm)
	class UPCGMetadata*                           CallFunc_MutableMetadata_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPCGPointData*                    CallFunc_ToPointDataWithContext_ReturnValue;       // 0x0118(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPCGPoint>                      CallFunc_GetPoints_ReturnValue;                    // 0x0120(0x0010)(ConstParm, ReferenceParm)
	class UPCGComponent*                          CallFunc_GetComponent_ReturnValue;                 // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PCGRoadTerrain_C> UniqueObjectNameForCooking_AsBPI_PCGRoad_Terrain;  // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueObjectNameForCooking_bSuccess;               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPCGPointData*                    CallFunc_ToPointDataWithContext_ReturnValue_1;     // 0x0158(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAoCRoadTerrainEntry>           CallFunc_GetRoadTerrainData_Terrain_Objects;       // 0x0160(0x0010)(ReferenceParm)
	TArray<struct FAoCRoadTerrainEntry>           CallFunc_GetRoadTerrainData_Grass_Objects;         // 0x0170(0x0010)(ReferenceParm)
	class UPCGPointData*                          CallFunc_PointLoop_OutData;                        // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPCGTaggedData                         K2Node_MakeStruct_PCGTaggedData;                   // 0x0188(0x0068)()
	struct FAoCRoadTerrainEntry                   CallFunc_Array_RandomFromStream_OutItem;           // 0x01F0(0x0050)()
	int32                                         CallFunc_Array_RandomFromStream_OutIndex;          // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPCGTaggedData>                 K2Node_MakeArray_Array;                            // 0x0248(0x0010)(ReferenceParm)
	struct FPCGDataCollection                     K2Node_MakeStruct_PCGDataCollection;               // 0x0258(0x0020)()
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x028C(0x0008)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPCGTaggedData>                 CallFunc_GetInputs_ReturnValue;                    // 0x0298(0x0010)(ReferenceParm)
	struct FPCGDataCollection                     K2Node_MakeStruct_PCGDataCollection_1;             // 0x02A8(0x0020)()
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGSpatialData*                        K2Node_DynamicCast_AsPCGSpatial_Data;              // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SetGrass_C_ExecuteWithContext) == 0x000008, "Wrong alignment on SetGrass_C_ExecuteWithContext");
static_assert(sizeof(SetGrass_C_ExecuteWithContext) == 0x0002E0, "Wrong size on SetGrass_C_ExecuteWithContext");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, InContext) == 0x000000, "Member 'SetGrass_C_ExecuteWithContext::InContext' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, Input) == 0x0000B8, "Member 'SetGrass_C_ExecuteWithContext::Input' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, Output) == 0x0000D8, "Member 'SetGrass_C_ExecuteWithContext::Output' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_MutableMetadata_ReturnValue) == 0x0000F8, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_MutableMetadata_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, Temp_int_Array_Index_Variable) == 0x000100, "Member 'SetGrass_C_ExecuteWithContext::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, Temp_int_Loop_Counter_Variable) == 0x000104, "Member 'SetGrass_C_ExecuteWithContext::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_Add_IntInt_ReturnValue) == 0x00010C, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_ToPointDataWithContext_ReturnValue) == 0x000118, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_ToPointDataWithContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_GetPoints_ReturnValue) == 0x000120, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_GetPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_GetComponent_ReturnValue) == 0x000130, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_GetComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_GetOwner_ReturnValue) == 0x000138, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, UniqueObjectNameForCooking_AsBPI_PCGRoad_Terrain) == 0x000140, "Member 'SetGrass_C_ExecuteWithContext::UniqueObjectNameForCooking_AsBPI_PCGRoad_Terrain' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, UniqueObjectNameForCooking_bSuccess) == 0x000150, "Member 'SetGrass_C_ExecuteWithContext::UniqueObjectNameForCooking_bSuccess' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_ToPointDataWithContext_ReturnValue_1) == 0x000158, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_ToPointDataWithContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_GetRoadTerrainData_Terrain_Objects) == 0x000160, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_GetRoadTerrainData_Terrain_Objects' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_GetRoadTerrainData_Grass_Objects) == 0x000170, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_GetRoadTerrainData_Grass_Objects' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_PointLoop_OutData) == 0x000180, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_PointLoop_OutData' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, K2Node_MakeStruct_PCGTaggedData) == 0x000188, "Member 'SetGrass_C_ExecuteWithContext::K2Node_MakeStruct_PCGTaggedData' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_Array_RandomFromStream_OutItem) == 0x0001F0, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_Array_RandomFromStream_OutItem' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_Array_RandomFromStream_OutIndex) == 0x000240, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_Array_RandomFromStream_OutIndex' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, K2Node_MakeArray_Array) == 0x000248, "Member 'SetGrass_C_ExecuteWithContext::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, K2Node_MakeStruct_PCGDataCollection) == 0x000258, "Member 'SetGrass_C_ExecuteWithContext::K2Node_MakeStruct_PCGDataCollection' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000278, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_Array_Add_ReturnValue) == 0x000288, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_MakeRandomStream_ReturnValue) == 0x00028C, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_MakeRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_GetInputs_ReturnValue) == 0x000298, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_GetInputs_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, K2Node_MakeStruct_PCGDataCollection_1) == 0x0002A8, "Member 'SetGrass_C_ExecuteWithContext::K2Node_MakeStruct_PCGDataCollection_1' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0002C8, "Member 'SetGrass_C_ExecuteWithContext::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, K2Node_DynamicCast_AsPCGSpatial_Data) == 0x0002D0, "Member 'SetGrass_C_ExecuteWithContext::K2Node_DynamicCast_AsPCGSpatial_Data' has a wrong offset!");
static_assert(offsetof(SetGrass_C_ExecuteWithContext, K2Node_DynamicCast_bSuccess) == 0x0002D8, "Member 'SetGrass_C_ExecuteWithContext::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SetGrass.SetGrass_C.PointLoopBody
// 0x0270 (0x0270 - 0x0000)
struct SetGrass_C_PointLoopBody final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UPCGPointData*                    InData;                                            // 0x00B8(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPCGPoint                              InPoint;                                           // 0x00C0(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FPCGPoint                              OutPoint;                                          // 0x0190(0x00D0)(Parm, OutParm, NoDestructor)
	class UPCGMetadata*                           OutMetadata;                                       // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0268(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SetGrass_C_PointLoopBody) == 0x000010, "Wrong alignment on SetGrass_C_PointLoopBody");
static_assert(sizeof(SetGrass_C_PointLoopBody) == 0x000270, "Wrong size on SetGrass_C_PointLoopBody");
static_assert(offsetof(SetGrass_C_PointLoopBody, InContext) == 0x000000, "Member 'SetGrass_C_PointLoopBody::InContext' has a wrong offset!");
static_assert(offsetof(SetGrass_C_PointLoopBody, InData) == 0x0000B8, "Member 'SetGrass_C_PointLoopBody::InData' has a wrong offset!");
static_assert(offsetof(SetGrass_C_PointLoopBody, InPoint) == 0x0000C0, "Member 'SetGrass_C_PointLoopBody::InPoint' has a wrong offset!");
static_assert(offsetof(SetGrass_C_PointLoopBody, OutPoint) == 0x000190, "Member 'SetGrass_C_PointLoopBody::OutPoint' has a wrong offset!");
static_assert(offsetof(SetGrass_C_PointLoopBody, OutMetadata) == 0x000260, "Member 'SetGrass_C_PointLoopBody::OutMetadata' has a wrong offset!");
static_assert(offsetof(SetGrass_C_PointLoopBody, ReturnValue) == 0x000268, "Member 'SetGrass_C_PointLoopBody::ReturnValue' has a wrong offset!");
static_assert(offsetof(SetGrass_C_PointLoopBody, CallFunc_Array_Find_ReturnValue) == 0x00026C, "Member 'SetGrass_C_PointLoopBody::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

}

