#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleAnimInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SimpleAnimInstance.SimpleAnimInstance_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SimpleAnimInstance_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SimpleAnimInstance_C_AnimGraph) == 0x000008, "Wrong alignment on SimpleAnimInstance_C_AnimGraph");
static_assert(sizeof(SimpleAnimInstance_C_AnimGraph) == 0x000010, "Wrong size on SimpleAnimInstance_C_AnimGraph");
static_assert(offsetof(SimpleAnimInstance_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'SimpleAnimInstance_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function SimpleAnimInstance.SimpleAnimInstance_C.ExecuteUbergraph_SimpleAnimInstance
// 0x0004 (0x0004 - 0x0000)
struct SimpleAnimInstance_C_ExecuteUbergraph_SimpleAnimInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleAnimInstance_C_ExecuteUbergraph_SimpleAnimInstance) == 0x000004, "Wrong alignment on SimpleAnimInstance_C_ExecuteUbergraph_SimpleAnimInstance");
static_assert(sizeof(SimpleAnimInstance_C_ExecuteUbergraph_SimpleAnimInstance) == 0x000004, "Wrong size on SimpleAnimInstance_C_ExecuteUbergraph_SimpleAnimInstance");
static_assert(offsetof(SimpleAnimInstance_C_ExecuteUbergraph_SimpleAnimInstance, EntryPoint) == 0x000000, "Member 'SimpleAnimInstance_C_ExecuteUbergraph_SimpleAnimInstance::EntryPoint' has a wrong offset!");

}

