#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleAnimInstance

#include "Basic.hpp"

#include "SimpleAnimInstance_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SimpleAnimInstance.SimpleAnimInstance_C
// 0x15C0 (0x1930 - 0x0370)
class USimpleAnimInstance_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct SimpleAnimInstance::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x0378(0x0006)(HasGetValueTypeHash)
	uint8                                         Pad_37E[0x2];                                      // 0x037E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x0390(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x03D8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x0420(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x0468(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x0490(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x04B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x04E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x0508(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x0530(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0558(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x05A0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x05E8(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x06D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0720(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x0768(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0858(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x08A0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x08E8(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x09D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0A20(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x0A68(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0B58(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0BA0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x0BE8(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0CD8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0D20(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x0D68(0x00F0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0E58(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0E78(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0F40(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0F60(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x0FA8(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x1028(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x1118(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x1198(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x11C0(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x11E8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1310(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1330(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1458(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x1478(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x14F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x1520(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1548(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1590(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1680(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x16C8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1748(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1770(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1798(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x17C0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1840(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1868(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x1890(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x18D8(0x0048)()
	uint8                                         Gender;                                            // 0x1920(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Race;                                              // 0x1921(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SimpleAnimInstance(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SimpleAnimInstance_C">();
	}
	static class USimpleAnimInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleAnimInstance_C>();
	}
};
static_assert(alignof(USimpleAnimInstance_C) == 0x000010, "Wrong alignment on USimpleAnimInstance_C");
static_assert(sizeof(USimpleAnimInstance_C) == 0x001930, "Wrong size on USimpleAnimInstance_C");
static_assert(offsetof(USimpleAnimInstance_C, UberGraphFrame) == 0x000370, "Member 'USimpleAnimInstance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, __AnimBlueprintMutables) == 0x000378, "Member 'USimpleAnimInstance_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimBlueprintExtension_PropertyAccess) == 0x000380, "Member 'USimpleAnimInstance_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimBlueprintExtension_Base) == 0x000388, "Member 'USimpleAnimInstance_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_BlendListByEnum_4) == 0x000390, "Member 'USimpleAnimInstance_C::AnimGraphNode_BlendListByEnum_4' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_BlendListByEnum_3) == 0x0003D8, "Member 'USimpleAnimInstance_C::AnimGraphNode_BlendListByEnum_3' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_BlendListByEnum_2) == 0x000420, "Member 'USimpleAnimInstance_C::AnimGraphNode_BlendListByEnum_2' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_14) == 0x000468, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_14' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_13) == 0x000490, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_13' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_12) == 0x0004B8, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_12' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_11) == 0x0004E0, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_11' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_10) == 0x000508, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_9) == 0x000530, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer_12) == 0x000558, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer_11) == 0x0005A0, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_LayeredBoneBlend_7) == 0x0005E8, "Member 'USimpleAnimInstance_C::AnimGraphNode_LayeredBoneBlend_7' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer_10) == 0x0006D8, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer_9) == 0x000720, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_LayeredBoneBlend_6) == 0x000768, "Member 'USimpleAnimInstance_C::AnimGraphNode_LayeredBoneBlend_6' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer_8) == 0x000858, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer_7) == 0x0008A0, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_LayeredBoneBlend_5) == 0x0008E8, "Member 'USimpleAnimInstance_C::AnimGraphNode_LayeredBoneBlend_5' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer_6) == 0x0009D8, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer_5) == 0x000A20, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_LayeredBoneBlend_4) == 0x000A68, "Member 'USimpleAnimInstance_C::AnimGraphNode_LayeredBoneBlend_4' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer_4) == 0x000B58, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer_3) == 0x000BA0, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_LayeredBoneBlend_3) == 0x000BE8, "Member 'USimpleAnimInstance_C::AnimGraphNode_LayeredBoneBlend_3' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer_2) == 0x000CD8, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer_1) == 0x000D20, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_LayeredBoneBlend_2) == 0x000D68, "Member 'USimpleAnimInstance_C::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_StateResult) == 0x000E58, "Member 'USimpleAnimInstance_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_StateMachine) == 0x000E78, "Member 'USimpleAnimInstance_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_Root) == 0x000F40, "Member 'USimpleAnimInstance_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_Slot_1) == 0x000F60, "Member 'USimpleAnimInstance_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SaveCachedPose_4) == 0x000FA8, "Member 'USimpleAnimInstance_C::AnimGraphNode_SaveCachedPose_4' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_LayeredBoneBlend_1) == 0x001028, "Member 'USimpleAnimInstance_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SaveCachedPose_3) == 0x001118, "Member 'USimpleAnimInstance_C::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_8) == 0x001198, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_7) == 0x0011C0, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_ModifyBone_1) == 0x0011E8, "Member 'USimpleAnimInstance_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_LocalToComponentSpace) == 0x001310, "Member 'USimpleAnimInstance_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_ModifyBone) == 0x001330, "Member 'USimpleAnimInstance_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_ComponentToLocalSpace) == 0x001458, "Member 'USimpleAnimInstance_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SaveCachedPose_2) == 0x001478, "Member 'USimpleAnimInstance_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_6) == 0x0014F8, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_5) == 0x001520, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SequencePlayer) == 0x001548, "Member 'USimpleAnimInstance_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_LayeredBoneBlend) == 0x001590, "Member 'USimpleAnimInstance_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_Slot) == 0x001680, "Member 'USimpleAnimInstance_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SaveCachedPose_1) == 0x0016C8, "Member 'USimpleAnimInstance_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_4) == 0x001748, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_3) == 0x001770, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_2) == 0x001798, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_SaveCachedPose) == 0x0017C0, "Member 'USimpleAnimInstance_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose_1) == 0x001840, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_UseCachedPose) == 0x001868, "Member 'USimpleAnimInstance_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_BlendListByEnum_1) == 0x001890, "Member 'USimpleAnimInstance_C::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, AnimGraphNode_BlendListByEnum) == 0x0018D8, "Member 'USimpleAnimInstance_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, Gender) == 0x001920, "Member 'USimpleAnimInstance_C::Gender' has a wrong offset!");
static_assert(offsetof(USimpleAnimInstance_C, Race) == 0x001921, "Member 'USimpleAnimInstance_C::Race' has a wrong offset!");

}

