#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleAnimInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct SimpleAnimInstance.SimpleAnimInstance_C.AnimBlueprintGeneratedMutableData
// 0x0005 (0x0006 - 0x0001)
struct SimpleAnimInstance::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_3;                                  // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleAnimInstance::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on SimpleAnimInstance::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SimpleAnimInstance::FAnimBlueprintGeneratedMutableData) == 0x000006, "Wrong size on SimpleAnimInstance::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedMutableData, __ByteProperty_0) == 0x000002, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedMutableData::__ByteProperty_0' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedMutableData, __ByteProperty_1) == 0x000003, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedMutableData::__ByteProperty_1' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedMutableData, __ByteProperty_2) == 0x000004, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedMutableData::__ByteProperty_2' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedMutableData, __ByteProperty_3) == 0x000005, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedMutableData::__ByteProperty_3' has a wrong offset!");

// ScriptStruct SimpleAnimInstance.SimpleAnimInstance_C.AnimBlueprintGeneratedConstantData
// 0x017F (0x0180 - 0x0001)
struct SimpleAnimInstance::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_317;                               // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_318;                               // 0x0018(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_319;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_320;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_321;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_322;                                // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_323;                               // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_324;                              // 0x0044(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_325;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_326;                                // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_327;                                // 0x0075(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_328;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 __ArrayProperty_329;                               // 0x0080(0x0010)(BlueprintVisible)
	struct FAnimNodeFunctionRef                   __StructProperty_330;                              // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_331;                                // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_332;                                  // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_333;                                // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_334;                                // 0x00C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_335;                                // 0x00C2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_336;                               // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_337;                               // 0x00D8(0x0010)(BlueprintVisible)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00E8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0168(0x0018)()
};
static_assert(alignof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SimpleAnimInstance::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData) == 0x000180, "Wrong size on SimpleAnimInstance::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __ArrayProperty_317) == 0x000008, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__ArrayProperty_317' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __ArrayProperty_318) == 0x000018, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__ArrayProperty_318' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_319) == 0x000028, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_319' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __IntProperty_320) == 0x000030, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__IntProperty_320' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_321) == 0x000034, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_321' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __BoolProperty_322) == 0x00003C, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__BoolProperty_322' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __FloatProperty_323) == 0x000040, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__FloatProperty_323' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __StructProperty_324) == 0x000044, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__StructProperty_324' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __FloatProperty_325) == 0x000070, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__FloatProperty_325' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __EnumProperty_326) == 0x000074, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__EnumProperty_326' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __ByteProperty_327) == 0x000075, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__ByteProperty_327' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_328) == 0x000078, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_328' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __ArrayProperty_329) == 0x000080, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__ArrayProperty_329' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __StructProperty_330) == 0x000090, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__StructProperty_330' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __BlendProfile_331) == 0x0000B0, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__BlendProfile_331' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __CurveFloat_332) == 0x0000B8, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__CurveFloat_332' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __BoolProperty_333) == 0x0000C0, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__BoolProperty_333' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __EnumProperty_334) == 0x0000C1, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__EnumProperty_334' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __EnumProperty_335) == 0x0000C2, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__EnumProperty_335' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __ArrayProperty_336) == 0x0000C8, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__ArrayProperty_336' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, __ArrayProperty_337) == 0x0000D8, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::__ArrayProperty_337' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000E8, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SimpleAnimInstance::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000168, "Member 'SimpleAnimInstance::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

