#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Cyclops_Mushroom_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"
#include "SK_Cyclops_Mushroom_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_Cyclops_Mushroom_AnimBP.SK_Cyclops_Mushroom_AnimBP_C
// 0x0B60 (0x27B0 - 0x1C50)
class USK_Cyclops_Mushroom_AnimBP_C final : public UAoCNPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1C50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct SK_Cyclops_Mushroom_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;   // 0x1C58(0x0014)(HasGetValueTypeHash)
	uint8                                         Pad_1C6C[0x4];                                     // 0x1C6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1C70(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1C78(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1C80(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1CA0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1CC8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1D10(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1D58(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1DA0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1DE8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1E30(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x1E78(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1F90(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1FD8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1FF8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x2020(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2068(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2088(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x20D0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x20F0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x21B8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x21D8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x22A0(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x2320(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x2368(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x23B0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x23F8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x2440(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2488(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x2508(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x2530(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x2558(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x2580(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x25A8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x25F0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2638(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2660(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2688(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x26D0(0x00C8)()
	bool                                          SpawnComplete;                                     // 0x2798(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2799[0x7];                                     // 0x2799(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RateScale;                                         // 0x27A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEaten;                                           // 0x27A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_NPCNotAttacking();
	void AnimNotify_SpawnComplete();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_SK_Cyclops_Mushroom_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_Cyclops_Mushroom_AnimBP_C">();
	}
	static class USK_Cyclops_Mushroom_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_Cyclops_Mushroom_AnimBP_C>();
	}
};
static_assert(alignof(USK_Cyclops_Mushroom_AnimBP_C) == 0x000010, "Wrong alignment on USK_Cyclops_Mushroom_AnimBP_C");
static_assert(sizeof(USK_Cyclops_Mushroom_AnimBP_C) == 0x0027B0, "Wrong size on USK_Cyclops_Mushroom_AnimBP_C");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, UberGraphFrame) == 0x001C50, "Member 'USK_Cyclops_Mushroom_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, __AnimBlueprintMutables) == 0x001C58, "Member 'USK_Cyclops_Mushroom_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x001C70, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimBlueprintExtension_Base) == 0x001C78, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_Root) == 0x001C80, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x001CA0, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x001CC8, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x001D10, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x001D58, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x001DA0, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x001DE8, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x001E30, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x001E78, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x001F90, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_StateResult_3) == 0x001FD8, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_TransitionResult) == 0x001FF8, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x002020, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_StateResult_2) == 0x002068, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x002088, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_StateResult_1) == 0x0020D0, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x0020F0, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_StateResult) == 0x0021B8, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_StateMachine) == 0x0021D8, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x0022A0, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_Slot_5) == 0x002320, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_BlendListByInt) == 0x002368, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_Slot_4) == 0x0023B0, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_Slot_3) == 0x0023F8, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_Slot_2) == 0x002440, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002488, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_UseCachedPose_5) == 0x002508, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_UseCachedPose_4) == 0x002530, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_UseCachedPose_3) == 0x002558, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x002580, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_Slot_1) == 0x0025A8, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_Slot) == 0x0025F0, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x002638, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x002660, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x002688, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x0026D0, "Member 'USK_Cyclops_Mushroom_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, SpawnComplete) == 0x002798, "Member 'USK_Cyclops_Mushroom_AnimBP_C::SpawnComplete' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, RateScale) == 0x0027A0, "Member 'USK_Cyclops_Mushroom_AnimBP_C::RateScale' has a wrong offset!");
static_assert(offsetof(USK_Cyclops_Mushroom_AnimBP_C, IsEaten) == 0x0027A8, "Member 'USK_Cyclops_Mushroom_AnimBP_C::IsEaten' has a wrong offset!");

}

