#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SNodeRiverConnection

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SNodeRiverConnection.SNodeRiverConnection
// 0x0048 (0x0048 - 0x0000)
struct FSNodeRiverConnection final
{
public:
	struct FVector                                Position_2_15C1C8A346F0F54219FAE283B0196EE7;       // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_5_59E1988840A8BC30CCFB98B57714CF97;       // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        Speed_8_6307916D4189C609401143A1758DFA6C;          // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Width_10_DF24276D47854A754981168C5DBB1133;         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Depth_12_FDEB24994EEE217174A8F3847A0846DE;         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSNodeRiverConnection) == 0x000008, "Wrong alignment on FSNodeRiverConnection");
static_assert(sizeof(FSNodeRiverConnection) == 0x000048, "Wrong size on FSNodeRiverConnection");
static_assert(offsetof(FSNodeRiverConnection, Position_2_15C1C8A346F0F54219FAE283B0196EE7) == 0x000000, "Member 'FSNodeRiverConnection::Position_2_15C1C8A346F0F54219FAE283B0196EE7' has a wrong offset!");
static_assert(offsetof(FSNodeRiverConnection, Rotation_5_59E1988840A8BC30CCFB98B57714CF97) == 0x000018, "Member 'FSNodeRiverConnection::Rotation_5_59E1988840A8BC30CCFB98B57714CF97' has a wrong offset!");
static_assert(offsetof(FSNodeRiverConnection, Speed_8_6307916D4189C609401143A1758DFA6C) == 0x000030, "Member 'FSNodeRiverConnection::Speed_8_6307916D4189C609401143A1758DFA6C' has a wrong offset!");
static_assert(offsetof(FSNodeRiverConnection, Width_10_DF24276D47854A754981168C5DBB1133) == 0x000038, "Member 'FSNodeRiverConnection::Width_10_DF24276D47854A754981168C5DBB1133' has a wrong offset!");
static_assert(offsetof(FSNodeRiverConnection, Depth_12_FDEB24994EEE217174A8F3847A0846DE) == 0x000040, "Member 'FSNodeRiverConnection::Depth_12_FDEB24994EEE217174A8F3847A0846DE' has a wrong offset!");

}

