#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnerAnimInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct SpawnerAnimInfo.SpawnerAnimInfo
// 0x0018 (0x0018 - 0x0000)
struct FSpawnerAnimInfo final
{
public:
	bool                                          NoAnimations_1_A58011944140BE9054D05FBD9E0F7355;   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StanceOverrides_9_131A6A1143C29B292434D282881B419C; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           AnimationNames_8_480FDFD54FFD7D7128464A9365128FD2; // 0x0008(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FSpawnerAnimInfo) == 0x000008, "Wrong alignment on FSpawnerAnimInfo");
static_assert(sizeof(FSpawnerAnimInfo) == 0x000018, "Wrong size on FSpawnerAnimInfo");
static_assert(offsetof(FSpawnerAnimInfo, NoAnimations_1_A58011944140BE9054D05FBD9E0F7355) == 0x000000, "Member 'FSpawnerAnimInfo::NoAnimations_1_A58011944140BE9054D05FBD9E0F7355' has a wrong offset!");
static_assert(offsetof(FSpawnerAnimInfo, StanceOverrides_9_131A6A1143C29B292434D282881B419C) == 0x000004, "Member 'FSpawnerAnimInfo::StanceOverrides_9_131A6A1143C29B292434D282881B419C' has a wrong offset!");
static_assert(offsetof(FSpawnerAnimInfo, AnimationNames_8_480FDFD54FFD7D7128464A9365128FD2) == 0x000008, "Member 'FSpawnerAnimInfo::AnimationNames_8_480FDFD54FFD7D7128464A9365128FD2' has a wrong offset!");

}

