#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spirit_Wolf

#include "Basic.hpp"


namespace SDK::Params
{

// Function Spirit_Wolf.Spirit_Wolf_C.ExecuteUbergraph_Spirit_Wolf
// 0x0088 (0x0088 - 0x0000)
struct Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0020(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf) == 0x000008, "Wrong alignment on Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf");
static_assert(sizeof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf) == 0x000088, "Wrong size on Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, EntryPoint) == 0x000000, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::EntryPoint' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_GetMaterials_ReturnValue) == 0x000020, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_Array_Get_Item) == 0x000030, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00003C, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_IsValid_ReturnValue_1) == 0x00003D, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005C, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000060, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000068, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast) == 0x000078, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000080, "Member 'Spirit_Wolf_C_ExecuteUbergraph_Spirit_Wolf::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function Spirit_Wolf.Spirit_Wolf_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Spirit_Wolf_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spirit_Wolf_C_ReceiveTick) == 0x000004, "Wrong alignment on Spirit_Wolf_C_ReceiveTick");
static_assert(sizeof(Spirit_Wolf_C_ReceiveTick) == 0x000004, "Wrong size on Spirit_Wolf_C_ReceiveTick");
static_assert(offsetof(Spirit_Wolf_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Spirit_Wolf_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

