#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplineDebris

#include "Basic.hpp"

#include "PCG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function SplineDebris.SplineDebris_C.ExecuteWithContext
// 0x0A30 (0x0A30 - 0x0000)
struct SplineDebris_C_ExecuteWithContext final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Input;                                             // 0x00B8(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Output;                                            // 0x00D8(0x0020)(Parm, OutParm)
	struct FVector                                Temp_Position;                                     // 0x00F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Debris_Density;                                    // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempRandomDensity;                                 // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPCGComponent*                          CallFunc_GetComponent_ReturnValue;                 // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USplineComponent*>               CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0140(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_GetDistanceAlongSplineAtLocation_ReturnValue; // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue; // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                CallFunc_Map_Keys_Keys;                            // 0x01D0(0x0010)(ReferenceParm)
	double                                        CallFunc_Array_Get_Item_1;                         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAoCSplineDebrisEntry                  CallFunc_Map_Find_Value;                           // 0x0230(0x0058)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Origin;        // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_EditorGetBoundsFromUObject_Extents;       // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x0320(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin;              // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent;           // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius;        // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCSplineDebrisEntry                  CallFunc_Array_RandomFromStream_OutItem;           // 0x03C0(0x0058)()
	int32                                         CallFunc_Array_RandomFromStream_OutIndex;          // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D[0x3];                                      // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_2; // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x04E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAttribute_ReturnValue;                 // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPCGPointData*                    CallFunc_ToPointDataWithContext_ReturnValue;       // 0x0550(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPCGPoint>                      CallFunc_GetPoints_ReturnValue;                    // 0x0558(0x0010)(ConstParm, ReferenceParm)
	const class UPCGPointData*                    CallFunc_ToPointDataWithContext_ReturnValue_1;     // 0x0568(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPCGPointData*                          CallFunc_PointLoop_OutData;                        // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPCGTaggedData                         K2Node_MakeStruct_PCGTaggedData;                   // 0x0578(0x0068)()
	TArray<struct FPCGTaggedData>                 K2Node_MakeArray_Array;                            // 0x05E0(0x0010)(ReferenceParm)
	class UPCGComponent*                          CallFunc_GetComponent_ReturnValue_1;               // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FPCGDataCollection                     K2Node_MakeStruct_PCGDataCollection;               // 0x05F8(0x0020)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0618(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PCGSplineMesh_C>  UniqueObjectNameForCooking_AsBPI_PCGSpline_Mesh;   // 0x0620(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueObjectNameForCooking_bSuccess;               // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0xF];                                      // 0x0631(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCSplineMeshEntry                    CallFunc_Get_Mesh_List_First_Override_Beginning_Mesh; // 0x0640(0x00D0)()
	struct FAoCSplineMeshEntry                    CallFunc_Get_Mesh_List_First_Override_End_Mesh;    // 0x0710(0x00D0)()
	TArray<struct FAoCSplineMeshEntry>            CallFunc_Get_Mesh_List_First_Fence_Objects;        // 0x07E0(0x0010)(ReferenceParm)
	TArray<struct FAoCSplineDebrisEntry>          CallFunc_Get_Mesh_List_First_Debris_Objects;       // 0x07F0(0x0010)(ReferenceParm)
	struct FAoCSplineMeshEntry                    CallFunc_Get_Mesh_List_Second_Override_Beginning_Mesh; // 0x0800(0x00D0)()
	struct FAoCSplineMeshEntry                    CallFunc_Get_Mesh_List_Second_Override_End_Mesh;   // 0x08D0(0x00D0)()
	TArray<struct FAoCSplineMeshEntry>            CallFunc_Get_Mesh_List_Second_Fence_Objects;       // 0x09A0(0x0010)(ReferenceParm)
	TArray<struct FAoCSplineDebrisEntry>          CallFunc_Get_Mesh_List_Second_Debris_Objects;      // 0x09B0(0x0010)(ReferenceParm)
	class UPCGMetadata*                           CallFunc_MutableMetadata_ReturnValue;              // 0x09C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPCGTaggedData>                 CallFunc_GetInputs_ReturnValue;                    // 0x09C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x09D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D9[0x7];                                      // 0x09D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGSpatialData*                        K2Node_DynamicCast_AsPCGSpatial_Data;              // 0x09E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x09E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E9[0x7];                                      // 0x09E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x09F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x09F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast; // 0x0A00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast; // 0x0A04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1; // 0x0A08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A0C[0x4];                                      // 0x0A0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x0A10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Add_Key_ImplicitCast;                 // 0x0A18(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0A20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SplineDebris_C_ExecuteWithContext) == 0x000010, "Wrong alignment on SplineDebris_C_ExecuteWithContext");
static_assert(sizeof(SplineDebris_C_ExecuteWithContext) == 0x000A30, "Wrong size on SplineDebris_C_ExecuteWithContext");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, InContext) == 0x000000, "Member 'SplineDebris_C_ExecuteWithContext::InContext' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, Input) == 0x0000B8, "Member 'SplineDebris_C_ExecuteWithContext::Input' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, Output) == 0x0000D8, "Member 'SplineDebris_C_ExecuteWithContext::Output' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, Temp_Position) == 0x0000F8, "Member 'SplineDebris_C_ExecuteWithContext::Temp_Position' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, Debris_Density) == 0x000110, "Member 'SplineDebris_C_ExecuteWithContext::Debris_Density' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, TempRandomDensity) == 0x000114, "Member 'SplineDebris_C_ExecuteWithContext::TempRandomDensity' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, Temp_int_Loop_Counter_Variable) == 0x000118, "Member 'SplineDebris_C_ExecuteWithContext::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Add_IntInt_ReturnValue) == 0x00011C, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, Temp_int_Array_Index_Variable) == 0x000120, "Member 'SplineDebris_C_ExecuteWithContext::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, Temp_int_Loop_Counter_Variable_1) == 0x000124, "Member 'SplineDebris_C_ExecuteWithContext::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Add_IntInt_ReturnValue_1) == 0x000128, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, Temp_int_Array_Index_Variable_1) == 0x00012C, "Member 'SplineDebris_C_ExecuteWithContext::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_GetComponent_ReturnValue) == 0x000130, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_GetComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_GetOwner_ReturnValue) == 0x000138, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000140, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_GetDistanceAlongSplineAtLocation_ReturnValue) == 0x000150, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_GetDistanceAlongSplineAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Array_Get_Item) == 0x000158, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x000160, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue) == 0x000178, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000190, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Cross_VectorVector_ReturnValue) == 0x000198, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Normal_ReturnValue) == 0x0001B0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Array_IsNotEmpty_ReturnValue_1) == 0x0001C8, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Array_IsNotEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Map_Keys_Keys) == 0x0001D0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Array_Get_Item_1) == 0x0001E0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_BreakTransform_Location) == 0x0001E8, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_BreakTransform_Rotation) == 0x000200, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_BreakTransform_Scale) == 0x000218, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Map_Find_Value) == 0x000230, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Map_Find_ReturnValue) == 0x000288, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Array_Length_ReturnValue) == 0x00028C, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Less_IntInt_ReturnValue) == 0x000290, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000291, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_BreakVector2D_X) == 0x000298, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_BreakVector2D_Y) == 0x0002A0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_BreakVector2D_X_1) == 0x0002A8, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_BreakVector2D_Y_1) == 0x0002B0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Abs_ReturnValue) == 0x0002B8, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0002C0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x0002C8, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_EditorGetBoundsFromUObject_Origin) == 0x0002D0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_EditorGetBoundsFromUObject_Origin' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_EditorGetBoundsFromUObject_Extents) == 0x0002E8, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_EditorGetBoundsFromUObject_Extents' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000300, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, K2Node_DynamicCast_AsStatic_Mesh) == 0x000308, "Member 'SplineDebris_C_ExecuteWithContext::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, K2Node_DynamicCast_bSuccess) == 0x000310, "Member 'SplineDebris_C_ExecuteWithContext::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_FMax_ReturnValue) == 0x000318, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_GetBounds_ReturnValue) == 0x000320, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_MakeVector_ReturnValue) == 0x000358, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_BreakBoxSphereBounds_Origin) == 0x000370, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_BreakBoxSphereBounds_Origin' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_BreakBoxSphereBounds_BoxExtent) == 0x000388, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_BreakBoxSphereBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_BreakBoxSphereBounds_SphereRadius) == 0x0003A0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_BreakBoxSphereBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_IsValid_ReturnValue) == 0x0003A4, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x0003A8, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Array_Length_ReturnValue_1) == 0x0003B8, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Array_RandomFromStream_OutItem) == 0x0003C0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Array_RandomFromStream_OutItem' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Array_RandomFromStream_OutIndex) == 0x000418, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Array_RandomFromStream_OutIndex' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Less_IntInt_ReturnValue_1) == 0x00041C, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x000420, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_RandomFloatInRangeFromStream_ReturnValue_2) == 0x000424, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_RandomFloatInRangeFromStream_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, Temp_bool_Variable) == 0x000428, "Member 'SplineDebris_C_ExecuteWithContext::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000430, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_SelectVector_ReturnValue) == 0x000438, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000450, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_SelectVector_ReturnValue_1) == 0x000468, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000480, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000498, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Add_VectorVector_ReturnValue) == 0x0004B0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0004C8, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_MakeTransform_ReturnValue) == 0x0004E0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Array_Add_ReturnValue) == 0x000540, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_HasAttribute_ReturnValue) == 0x000544, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_HasAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Array_Add_ReturnValue_1) == 0x000548, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_ToPointDataWithContext_ReturnValue) == 0x000550, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_ToPointDataWithContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_GetPoints_ReturnValue) == 0x000558, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_GetPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_ToPointDataWithContext_ReturnValue_1) == 0x000568, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_ToPointDataWithContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_PointLoop_OutData) == 0x000570, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_PointLoop_OutData' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, K2Node_MakeStruct_PCGTaggedData) == 0x000578, "Member 'SplineDebris_C_ExecuteWithContext::K2Node_MakeStruct_PCGTaggedData' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, K2Node_MakeArray_Array) == 0x0005E0, "Member 'SplineDebris_C_ExecuteWithContext::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_GetComponent_ReturnValue_1) == 0x0005F0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_GetComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, K2Node_MakeStruct_PCGDataCollection) == 0x0005F8, "Member 'SplineDebris_C_ExecuteWithContext::K2Node_MakeStruct_PCGDataCollection' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_GetOwner_ReturnValue_1) == 0x000618, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, UniqueObjectNameForCooking_AsBPI_PCGSpline_Mesh) == 0x000620, "Member 'SplineDebris_C_ExecuteWithContext::UniqueObjectNameForCooking_AsBPI_PCGSpline_Mesh' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, UniqueObjectNameForCooking_bSuccess) == 0x000630, "Member 'SplineDebris_C_ExecuteWithContext::UniqueObjectNameForCooking_bSuccess' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Get_Mesh_List_First_Override_Beginning_Mesh) == 0x000640, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Get_Mesh_List_First_Override_Beginning_Mesh' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Get_Mesh_List_First_Override_End_Mesh) == 0x000710, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Get_Mesh_List_First_Override_End_Mesh' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Get_Mesh_List_First_Fence_Objects) == 0x0007E0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Get_Mesh_List_First_Fence_Objects' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Get_Mesh_List_First_Debris_Objects) == 0x0007F0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Get_Mesh_List_First_Debris_Objects' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Get_Mesh_List_Second_Override_Beginning_Mesh) == 0x000800, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Get_Mesh_List_Second_Override_Beginning_Mesh' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Get_Mesh_List_Second_Override_End_Mesh) == 0x0008D0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Get_Mesh_List_Second_Override_End_Mesh' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Get_Mesh_List_Second_Fence_Objects) == 0x0009A0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Get_Mesh_List_Second_Fence_Objects' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Get_Mesh_List_Second_Debris_Objects) == 0x0009B0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Get_Mesh_List_Second_Debris_Objects' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_MutableMetadata_ReturnValue) == 0x0009C0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_MutableMetadata_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_GetInputs_ReturnValue) == 0x0009C8, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_GetInputs_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_IsValid_ReturnValue_1) == 0x0009D8, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, K2Node_DynamicCast_AsPCGSpatial_Data) == 0x0009E0, "Member 'SplineDebris_C_ExecuteWithContext::K2Node_DynamicCast_AsPCGSpatial_Data' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, K2Node_DynamicCast_bSuccess_1) == 0x0009E8, "Member 'SplineDebris_C_ExecuteWithContext::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0009F0, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0009F8, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast) == 0x000A00, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast) == 0x000A04, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1) == 0x000A08, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x000A10, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Map_Add_Key_ImplicitCast) == 0x000A18, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Map_Add_Key_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_ExecuteWithContext, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000A20, "Member 'SplineDebris_C_ExecuteWithContext::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function SplineDebris.SplineDebris_C.NodeTitleOverride
// 0x0008 (0x0008 - 0x0000)
struct SplineDebris_C_NodeTitleOverride final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SplineDebris_C_NodeTitleOverride) == 0x000004, "Wrong alignment on SplineDebris_C_NodeTitleOverride");
static_assert(sizeof(SplineDebris_C_NodeTitleOverride) == 0x000008, "Wrong size on SplineDebris_C_NodeTitleOverride");
static_assert(offsetof(SplineDebris_C_NodeTitleOverride, ReturnValue) == 0x000000, "Member 'SplineDebris_C_NodeTitleOverride::ReturnValue' has a wrong offset!");

// Function SplineDebris.SplineDebris_C.PointLoopBody
// 0x0270 (0x0270 - 0x0000)
struct SplineDebris_C_PointLoopBody final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UPCGPointData*                    InData;                                            // 0x00B8(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPCGPoint                              InPoint;                                           // 0x00C0(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FPCGPoint                              OutPoint;                                          // 0x0190(0x00D0)(Parm, OutParm, NoDestructor)
	class UPCGMetadata*                           OutMetadata;                                       // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0268(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SplineDebris_C_PointLoopBody) == 0x000010, "Wrong alignment on SplineDebris_C_PointLoopBody");
static_assert(sizeof(SplineDebris_C_PointLoopBody) == 0x000270, "Wrong size on SplineDebris_C_PointLoopBody");
static_assert(offsetof(SplineDebris_C_PointLoopBody, InContext) == 0x000000, "Member 'SplineDebris_C_PointLoopBody::InContext' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_PointLoopBody, InData) == 0x0000B8, "Member 'SplineDebris_C_PointLoopBody::InData' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_PointLoopBody, InPoint) == 0x0000C0, "Member 'SplineDebris_C_PointLoopBody::InPoint' has a wrong offset!");
static_assert(offsetof(SplineDebris_C_PointLoopBody, OutPoint) == 0x000190, "Member 'SplineDebris_C_PointLoopBody::OutPoint' has a wrong offset!");
