#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQ_OBJ_RVR_Cutlist_Crate_prop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SQ_OBJ_RVR_Cutlist_Crate_prop.SQ_OBJ_RVR_Cutlist_Crate_prop_C
// 0x0018 (0x0360 - 0x0348)
class ASQ_OBJ_RVR_Cutlist_Crate_prop_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FireFX_;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OnInteractSuccess(class UInteractableComponent* Interactable, class ABaseCharacter* Interactee);
	void ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SQ_OBJ_RVR_Cutlist_Crate_prop_C">();
	}
	static class ASQ_OBJ_RVR_Cutlist_Crate_prop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASQ_OBJ_RVR_Cutlist_Crate_prop_C>();
	}
};
static_assert(alignof(ASQ_OBJ_RVR_Cutlist_Crate_prop_C) == 0x000008, "Wrong alignment on ASQ_OBJ_RVR_Cutlist_Crate_prop_C");
static_assert(sizeof(ASQ_OBJ_RVR_Cutlist_Crate_prop_C) == 0x000360, "Wrong size on ASQ_OBJ_RVR_Cutlist_Crate_prop_C");
static_assert(offsetof(ASQ_OBJ_RVR_Cutlist_Crate_prop_C, UberGraphFrame) == 0x000348, "Member 'ASQ_OBJ_RVR_Cutlist_Crate_prop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASQ_OBJ_RVR_Cutlist_Crate_prop_C, StaticMesh) == 0x000350, "Member 'ASQ_OBJ_RVR_Cutlist_Crate_prop_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ASQ_OBJ_RVR_Cutlist_Crate_prop_C, FireFX_) == 0x000358, "Member 'ASQ_OBJ_RVR_Cutlist_Crate_prop_C::FireFX_' has a wrong offset!");

}

