#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQ_OBJ_RVR_Cutlist_Crate_prop

#include "Basic.hpp"


namespace SDK::Params
{

// Function SQ_OBJ_RVR_Cutlist_Crate_prop.SQ_OBJ_RVR_Cutlist_Crate_prop_C.OnInteractSuccess
// 0x0010 (0x0010 - 0x0000)
struct SQ_OBJ_RVR_Cutlist_Crate_prop_C_OnInteractSuccess final
{
public:
	class UInteractableComponent*                 Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Interactee;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SQ_OBJ_RVR_Cutlist_Crate_prop_C_OnInteractSuccess) == 0x000008, "Wrong alignment on SQ_OBJ_RVR_Cutlist_Crate_prop_C_OnInteractSuccess");
static_assert(sizeof(SQ_OBJ_RVR_Cutlist_Crate_prop_C_OnInteractSuccess) == 0x000010, "Wrong size on SQ_OBJ_RVR_Cutlist_Crate_prop_C_OnInteractSuccess");
static_assert(offsetof(SQ_OBJ_RVR_Cutlist_Crate_prop_C_OnInteractSuccess, Interactable) == 0x000000, "Member 'SQ_OBJ_RVR_Cutlist_Crate_prop_C_OnInteractSuccess::Interactable' has a wrong offset!");
static_assert(offsetof(SQ_OBJ_RVR_Cutlist_Crate_prop_C_OnInteractSuccess, Interactee) == 0x000008, "Member 'SQ_OBJ_RVR_Cutlist_Crate_prop_C_OnInteractSuccess::Interactee' has a wrong offset!");

// Function SQ_OBJ_RVR_Cutlist_Crate_prop.SQ_OBJ_RVR_Cutlist_Crate_prop_C.ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop
// 0x0030 (0x0030 - 0x0000)
struct SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInteractableComponent* Interactable, class ABaseCharacter* Interactee)> UniqueObjectNameForCooking_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_CustomEvent_Interactable;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         K2Node_CustomEvent_Interactee;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop) == 0x000008, "Wrong alignment on SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop");
static_assert(sizeof(SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop) == 0x000030, "Wrong size on SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop");
static_assert(offsetof(SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop, EntryPoint) == 0x000000, "Member 'SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop::EntryPoint' has a wrong offset!");
static_assert(offsetof(SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop, UniqueObjectNameForCooking_OutputDelegate) == 0x000004, "Member 'SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop::UniqueObjectNameForCooking_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop, K2Node_CustomEvent_Interactable) == 0x000020, "Member 'SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop::K2Node_CustomEvent_Interactable' has a wrong offset!");
static_assert(offsetof(SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop, K2Node_CustomEvent_Interactee) == 0x000028, "Member 'SQ_OBJ_RVR_Cutlist_Crate_prop_C_ExecuteUbergraph_SQ_OBJ_RVR_Cutlist_Crate_prop::K2Node_CustomEvent_Interactee' has a wrong offset!");

}

