#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SRoadSplineMeshActorSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct SRoadSplineMeshActorSettings.SRoadSplineMeshActorSettings
// 0x0038 (0x0038 - 0x0000)
struct FSRoadSplineMeshActorSettings final
{
public:
	double                                        Frequency_2_95D2399C4E2377F036B8BCADACB78F73;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OffsetOnSpline_10_61FAC50342423F86A070E7A729314409; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OffsetOnSplineRandomize_12_A64550434A390563D40310996E0D03F9; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomSeed_15_616598A24B42CE79A768C495CB860EF2;    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RotationfromUp_4_A30B16C94FBE1E0237B5459A908DF872; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OffsetDistance_6_25FD0A444556B147CB1D71A08C774A5D; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ConformDistance_8_61AF07CD4A468A39BD981E9E2B642658; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSRoadSplineMeshActorSettings) == 0x000008, "Wrong alignment on FSRoadSplineMeshActorSettings");
static_assert(sizeof(FSRoadSplineMeshActorSettings) == 0x000038, "Wrong size on FSRoadSplineMeshActorSettings");
static_assert(offsetof(FSRoadSplineMeshActorSettings, Frequency_2_95D2399C4E2377F036B8BCADACB78F73) == 0x000000, "Member 'FSRoadSplineMeshActorSettings::Frequency_2_95D2399C4E2377F036B8BCADACB78F73' has a wrong offset!");
static_assert(offsetof(FSRoadSplineMeshActorSettings, OffsetOnSpline_10_61FAC50342423F86A070E7A729314409) == 0x000008, "Member 'FSRoadSplineMeshActorSettings::OffsetOnSpline_10_61FAC50342423F86A070E7A729314409' has a wrong offset!");
static_assert(offsetof(FSRoadSplineMeshActorSettings, OffsetOnSplineRandomize_12_A64550434A390563D40310996E0D03F9) == 0x000010, "Member 'FSRoadSplineMeshActorSettings::OffsetOnSplineRandomize_12_A64550434A390563D40310996E0D03F9' has a wrong offset!");
static_assert(offsetof(FSRoadSplineMeshActorSettings, RandomSeed_15_616598A24B42CE79A768C495CB860EF2) == 0x000018, "Member 'FSRoadSplineMeshActorSettings::RandomSeed_15_616598A24B42CE79A768C495CB860EF2' has a wrong offset!");
static_assert(offsetof(FSRoadSplineMeshActorSettings, RotationfromUp_4_A30B16C94FBE1E0237B5459A908DF872) == 0x000020, "Member 'FSRoadSplineMeshActorSettings::RotationfromUp_4_A30B16C94FBE1E0237B5459A908DF872' has a wrong offset!");
static_assert(offsetof(FSRoadSplineMeshActorSettings, OffsetDistance_6_25FD0A444556B147CB1D71A08C774A5D) == 0x000028, "Member 'FSRoadSplineMeshActorSettings::OffsetDistance_6_25FD0A444556B147CB1D71A08C774A5D' has a wrong offset!");
static_assert(offsetof(FSRoadSplineMeshActorSettings, ConformDistance_8_61AF07CD4A468A39BD981E9E2B642658) == 0x000030, "Member 'FSRoadSplineMeshActorSettings::ConformDistance_8_61AF07CD4A468A39BD981E9E2B642658' has a wrong offset!");

}

