#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_DamageMeterData

#include "Basic.hpp"

#include "ST_DamageMeterMapData_structs.hpp"
#include "ST_DamageMeterTimeData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_DamageMeterData.ST_DamageMeterData
// 0x0410 (0x0410 - 0x0000)
struct FST_DamageMeterData final
{
public:
	struct FST_DamageMeterMapData                 DamageMap_73_498FB9734772E5946D43898667FE35CC;     // 0x0000(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FST_DamageMeterMapData                 HealingMap_75_B32C1D1D4F8793534FB134BD5B3C19BE;    // 0x0060(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FST_DamageMeterMapData                 DamageTakenMap_71_571427D54B1CF66B386162AA2BBB0B80; // 0x00C0(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FST_DamageMeterMapData                 HealingTakenMap_77_662964A547E36420649F85A30D4F7BE0; // 0x0120(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FST_DamageMeterMapData                 ManaGainedMap_112_E73790844C301A66642430ACC988359D; // 0x0180(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        activityStart_16_F6A8B3254DC5EF7EFD7D02A008B62E43; // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        activityLast_18_4FF86226432DBADDF1D12897CCE7C167;  // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isEnemy_20_D0D628634CE1D8DCBB9CC0A7167AC6B0;       // 0x01F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InstigatorName_43_F4110922441E30284A2A2DB190796D84; // 0x01F4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterClass                               InstigatorClass_50_573721A749AE08E24DF5FFAF831FD97D; // 0x01FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         InstigatorCharacter_131_6F258E42483D0BC4F51E3BB6C0B22E70; // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           color_46_C02BA66A4701DEC6E81DEBA223363EDE;         // 0x0208(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGuid, int32>                     DamageTargetIndexMap_57_3F491E5D4E60BF4687E6EF9068C005A3; // 0x0218(0x0050)(Edit, BlueprintVisible)
	TArray<struct FST_DamageMeterMapData>         DamageTargetArray_117_2AB56A0A4B66FA7C28F256888A63E0F9; // 0x0268(0x0010)(Edit, BlueprintVisible)
	TMap<struct FGuid, int32>                     HealingTargetIndexMap_68_6E0D39E34AF1F3758A958893776092DB; // 0x0278(0x0050)(Edit, BlueprintVisible)
	TArray<struct FST_DamageMeterMapData>         HealingTargetArray_118_D41A9B0943F680E72FC8EDAC080DA307; // 0x02C8(0x0010)(Edit, BlueprintVisible)
	TMap<struct FGuid, int32>                     DamageTakenSourceIndexMap_95_7796DB4C4F99290A9EFF52AA58174954; // 0x02D8(0x0050)(Edit, BlueprintVisible)
	TArray<struct FST_DamageMeterMapData>         DamageTakenSourceArray_119_C8EA4DF14FE9B2BE1F1A498C9E411150; // 0x0328(0x0010)(Edit, BlueprintVisible)
	TMap<struct FGuid, int32>                     HealingTakenSourceIndexMap_96_B556ACB4421F10C070D3D7863D2B5DD5; // 0x0338(0x0050)(Edit, BlueprintVisible)
	TArray<struct FST_DamageMeterMapData>         HealingTakenSourceArray_120_29AADE214236C26024D77BA41741520E; // 0x0388(0x0010)(Edit, BlueprintVisible)
	TMap<struct FGuid, int32>                     ManaGainedTargetIndexMap_111_46298421440042338DAA059B880774EB; // 0x0398(0x0050)(Edit, BlueprintVisible)
	TArray<struct FST_DamageMeterMapData>         ManaGainedTargetArray_121_028F072E44F0334181E83493BBB2250C; // 0x03E8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FST_DamageMeterTimeData>        HealthHistory_125_550B603A44ECCCD62CB8778685B99002; // 0x03F8(0x0010)(Edit, BlueprintVisible)
	double                                        HealthBase_128_14812B854804E54BF28DE2A4B3D3D6C4;   // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_DamageMeterData) == 0x000008, "Wrong alignment on FST_DamageMeterData");
static_assert(sizeof(FST_DamageMeterData) == 0x000410, "Wrong size on FST_DamageMeterData");
static_assert(offsetof(FST_DamageMeterData, DamageMap_73_498FB9734772E5946D43898667FE35CC) == 0x000000, "Member 'FST_DamageMeterData::DamageMap_73_498FB9734772E5946D43898667FE35CC' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, HealingMap_75_B32C1D1D4F8793534FB134BD5B3C19BE) == 0x000060, "Member 'FST_DamageMeterData::HealingMap_75_B32C1D1D4F8793534FB134BD5B3C19BE' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, DamageTakenMap_71_571427D54B1CF66B386162AA2BBB0B80) == 0x0000C0, "Member 'FST_DamageMeterData::DamageTakenMap_71_571427D54B1CF66B386162AA2BBB0B80' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, HealingTakenMap_77_662964A547E36420649F85A30D4F7BE0) == 0x000120, "Member 'FST_DamageMeterData::HealingTakenMap_77_662964A547E36420649F85A30D4F7BE0' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, ManaGainedMap_112_E73790844C301A66642430ACC988359D) == 0x000180, "Member 'FST_DamageMeterData::ManaGainedMap_112_E73790844C301A66642430ACC988359D' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, activityStart_16_F6A8B3254DC5EF7EFD7D02A008B62E43) == 0x0001E0, "Member 'FST_DamageMeterData::activityStart_16_F6A8B3254DC5EF7EFD7D02A008B62E43' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, activityLast_18_4FF86226432DBADDF1D12897CCE7C167) == 0x0001E8, "Member 'FST_DamageMeterData::activityLast_18_4FF86226432DBADDF1D12897CCE7C167' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, isEnemy_20_D0D628634CE1D8DCBB9CC0A7167AC6B0) == 0x0001F0, "Member 'FST_DamageMeterData::isEnemy_20_D0D628634CE1D8DCBB9CC0A7167AC6B0' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, InstigatorName_43_F4110922441E30284A2A2DB190796D84) == 0x0001F4, "Member 'FST_DamageMeterData::InstigatorName_43_F4110922441E30284A2A2DB190796D84' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, InstigatorClass_50_573721A749AE08E24DF5FFAF831FD97D) == 0x0001FC, "Member 'FST_DamageMeterData::InstigatorClass_50_573721A749AE08E24DF5FFAF831FD97D' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, InstigatorCharacter_131_6F258E42483D0BC4F51E3BB6C0B22E70) == 0x000200, "Member 'FST_DamageMeterData::InstigatorCharacter_131_6F258E42483D0BC4F51E3BB6C0B22E70' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, color_46_C02BA66A4701DEC6E81DEBA223363EDE) == 0x000208, "Member 'FST_DamageMeterData::color_46_C02BA66A4701DEC6E81DEBA223363EDE' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, DamageTargetIndexMap_57_3F491E5D4E60BF4687E6EF9068C005A3) == 0x000218, "Member 'FST_DamageMeterData::DamageTargetIndexMap_57_3F491E5D4E60BF4687E6EF9068C005A3' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, DamageTargetArray_117_2AB56A0A4B66FA7C28F256888A63E0F9) == 0x000268, "Member 'FST_DamageMeterData::DamageTargetArray_117_2AB56A0A4B66FA7C28F256888A63E0F9' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, HealingTargetIndexMap_68_6E0D39E34AF1F3758A958893776092DB) == 0x000278, "Member 'FST_DamageMeterData::HealingTargetIndexMap_68_6E0D39E34AF1F3758A958893776092DB' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, HealingTargetArray_118_D41A9B0943F680E72FC8EDAC080DA307) == 0x0002C8, "Member 'FST_DamageMeterData::HealingTargetArray_118_D41A9B0943F680E72FC8EDAC080DA307' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, DamageTakenSourceIndexMap_95_7796DB4C4F99290A9EFF52AA58174954) == 0x0002D8, "Member 'FST_DamageMeterData::DamageTakenSourceIndexMap_95_7796DB4C4F99290A9EFF52AA58174954' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, DamageTakenSourceArray_119_C8EA4DF14FE9B2BE1F1A498C9E411150) == 0x000328, "Member 'FST_DamageMeterData::DamageTakenSourceArray_119_C8EA4DF14FE9B2BE1F1A498C9E411150' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, HealingTakenSourceIndexMap_96_B556ACB4421F10C070D3D7863D2B5DD5) == 0x000338, "Member 'FST_DamageMeterData::HealingTakenSourceIndexMap_96_B556ACB4421F10C070D3D7863D2B5DD5' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, HealingTakenSourceArray_120_29AADE214236C26024D77BA41741520E) == 0x000388, "Member 'FST_DamageMeterData::HealingTakenSourceArray_120_29AADE214236C26024D77BA41741520E' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, ManaGainedTargetIndexMap_111_46298421440042338DAA059B880774EB) == 0x000398, "Member 'FST_DamageMeterData::ManaGainedTargetIndexMap_111_46298421440042338DAA059B880774EB' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, ManaGainedTargetArray_121_028F072E44F0334181E83493BBB2250C) == 0x0003E8, "Member 'FST_DamageMeterData::ManaGainedTargetArray_121_028F072E44F0334181E83493BBB2250C' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, HealthHistory_125_550B603A44ECCCD62CB8778685B99002) == 0x0003F8, "Member 'FST_DamageMeterData::HealthHistory_125_550B603A44ECCCD62CB8778685B99002' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterData, HealthBase_128_14812B854804E54BF28DE2A4B3D3D6C4) == 0x000408, "Member 'FST_DamageMeterData::HealthBase_128_14812B854804E54BF28DE2A4B3D3D6C4' has a wrong offset!");

}

