#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_DamageMeterHitInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_DamageMeterHitInfo.ST_DamageMeterHitInfo
// 0x0038 (0x0038 - 0x0000)
struct FST_DamageMeterHitInfo final
{
public:
	class FName                                   name_23_2C75B8DC4A80B67F6D5604BCE7470F69;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           color_20_3A29219E4D7DAA522F8004894ADD1B40;         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        iconPath_29_B0E4C55F43A62802E92EFD9717EE1A54;      // 0x0018(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_DamageMeterHitInfo) == 0x000008, "Wrong alignment on FST_DamageMeterHitInfo");
static_assert(sizeof(FST_DamageMeterHitInfo) == 0x000038, "Wrong size on FST_DamageMeterHitInfo");
static_assert(offsetof(FST_DamageMeterHitInfo, name_23_2C75B8DC4A80B67F6D5604BCE7470F69) == 0x000000, "Member 'FST_DamageMeterHitInfo::name_23_2C75B8DC4A80B67F6D5604BCE7470F69' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterHitInfo, color_20_3A29219E4D7DAA522F8004894ADD1B40) == 0x000008, "Member 'FST_DamageMeterHitInfo::color_20_3A29219E4D7DAA522F8004894ADD1B40' has a wrong offset!");
static_assert(offsetof(FST_DamageMeterHitInfo, iconPath_29_B0E4C55F43A62802E92EFD9717EE1A54) == 0x000018, "Member 'FST_DamageMeterHitInfo::iconPath_29_B0E4C55F43A62802E92EFD9717EE1A54' has a wrong offset!");

}

