#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_Distance

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STC_Distance.STC_Distance_C.ReceiveTestCondition
// 0x0060 (0x0060 - 0x0000)
struct STC_Distance_C_ReceiveTestCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_Distance_C_ReceiveTestCondition) == 0x000008, "Wrong alignment on STC_Distance_C_ReceiveTestCondition");
static_assert(sizeof(STC_Distance_C_ReceiveTestCondition) == 0x000060, "Wrong size on STC_Distance_C_ReceiveTestCondition");
static_assert(offsetof(STC_Distance_C_ReceiveTestCondition, ReturnValue) == 0x000000, "Member 'STC_Distance_C_ReceiveTestCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_Distance_C_ReceiveTestCondition, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'STC_Distance_C_ReceiveTestCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_Distance_C_ReceiveTestCondition, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'STC_Distance_C_ReceiveTestCondition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_Distance_C_ReceiveTestCondition, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'STC_Distance_C_ReceiveTestCondition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_Distance_C_ReceiveTestCondition, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'STC_Distance_C_ReceiveTestCondition::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_Distance_C_ReceiveTestCondition, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000020, "Member 'STC_Distance_C_ReceiveTestCondition::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_Distance_C_ReceiveTestCondition, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000038, "Member 'STC_Distance_C_ReceiveTestCondition::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_Distance_C_ReceiveTestCondition, CallFunc_VSize_ReturnValue) == 0x000050, "Member 'STC_Distance_C_ReceiveTestCondition::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_Distance_C_ReceiveTestCondition, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000058, "Member 'STC_Distance_C_ReceiveTestCondition::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_Distance_C_ReceiveTestCondition, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'STC_Distance_C_ReceiveTestCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

