#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_ExpressionBool

#include "Basic.hpp"

#include "DesignDataPlugin_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STC_ExpressionBool.STC_ExpressionBool_C
// 0x0060 (0x00C8 - 0x0068)
class USTC_ExpressionBool_C final : public UStateTreeConditionBlueprintBase
{
public:
	class ABaseCharacter*                         Source;                                            // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Target;                                            // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FAoCExpression                         ExpressionValue;                                   // 0x0078(0x0050)(Edit, BlueprintVisible)

public:
	bool ReceiveTestCondition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STC_ExpressionBool_C">();
	}
	static class USTC_ExpressionBool_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTC_ExpressionBool_C>();
	}
};
static_assert(alignof(USTC_ExpressionBool_C) == 0x000008, "Wrong alignment on USTC_ExpressionBool_C");
static_assert(sizeof(USTC_ExpressionBool_C) == 0x0000C8, "Wrong size on USTC_ExpressionBool_C");
static_assert(offsetof(USTC_ExpressionBool_C, Source) == 0x000068, "Member 'USTC_ExpressionBool_C::Source' has a wrong offset!");
static_assert(offsetof(USTC_ExpressionBool_C, Target) == 0x000070, "Member 'USTC_ExpressionBool_C::Target' has a wrong offset!");
static_assert(offsetof(USTC_ExpressionBool_C, ExpressionValue) == 0x000078, "Member 'USTC_ExpressionBool_C::ExpressionValue' has a wrong offset!");

}

