#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_EffectCount

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function STC_EffectCount.STC_EffectCount_C.ReceiveTestCondition
// 0x07A0 (0x07A0 - 0x0000)
struct STC_EffectCount_C_ReceiveTestCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Stack_Number;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectRecord                          CallFunc_GetEffectRecordByGuid_ReturnValue;        // 0x0010(0x0788)(ConstParm)
	int32                                         CallFunc_GetNumEffectStacks_ReturnValue;           // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_EffectCount_C_ReceiveTestCondition) == 0x000008, "Wrong alignment on STC_EffectCount_C_ReceiveTestCondition");
static_assert(sizeof(STC_EffectCount_C_ReceiveTestCondition) == 0x0007A0, "Wrong size on STC_EffectCount_C_ReceiveTestCondition");
static_assert(offsetof(STC_EffectCount_C_ReceiveTestCondition, ReturnValue) == 0x000000, "Member 'STC_EffectCount_C_ReceiveTestCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_EffectCount_C_ReceiveTestCondition, Stack_Number) == 0x000004, "Member 'STC_EffectCount_C_ReceiveTestCondition::Stack_Number' has a wrong offset!");
static_assert(offsetof(STC_EffectCount_C_ReceiveTestCondition, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'STC_EffectCount_C_ReceiveTestCondition::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_EffectCount_C_ReceiveTestCondition, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'STC_EffectCount_C_ReceiveTestCondition::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(STC_EffectCount_C_ReceiveTestCondition, CallFunc_Greater_IntInt_ReturnValue) == 0x00000A, "Member 'STC_EffectCount_C_ReceiveTestCondition::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_EffectCount_C_ReceiveTestCondition, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000B, "Member 'STC_EffectCount_C_ReceiveTestCondition::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_EffectCount_C_ReceiveTestCondition, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'STC_EffectCount_C_ReceiveTestCondition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_EffectCount_C_ReceiveTestCondition, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000D, "Member 'STC_EffectCount_C_ReceiveTestCondition::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_EffectCount_C_ReceiveTestCondition, CallFunc_GetEffectRecordByGuid_ReturnValue) == 0x000010, "Member 'STC_EffectCount_C_ReceiveTestCondition::CallFunc_GetEffectRecordByGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_EffectCount_C_ReceiveTestCondition, CallFunc_GetNumEffectStacks_ReturnValue) == 0x000798, "Member 'STC_EffectCount_C_ReceiveTestCondition::CallFunc_GetNumEffectStacks_ReturnValue' has a wrong offset!");

}

