#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_EffectCount

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"
#include "GeometryCollectionNodes_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STC_EffectCount.STC_EffectCount_C
// 0x0028 (0x0090 - 0x0068)
class USTC_EffectCount_C final : public UStateTreeConditionBlueprintBase
{
public:
	class ABaseCharacter*                         Target;                                            // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FEffectId                              Effect;                                            // 0x0070(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         Compare_Value;                                     // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECompareOperationEnum                         CompareOperation;                                  // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool ReceiveTestCondition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STC_EffectCount_C">();
	}
	static class USTC_EffectCount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTC_EffectCount_C>();
	}
};
static_assert(alignof(USTC_EffectCount_C) == 0x000008, "Wrong alignment on USTC_EffectCount_C");
static_assert(sizeof(USTC_EffectCount_C) == 0x000090, "Wrong size on USTC_EffectCount_C");
static_assert(offsetof(USTC_EffectCount_C, Target) == 0x000068, "Member 'USTC_EffectCount_C::Target' has a wrong offset!");
static_assert(offsetof(USTC_EffectCount_C, Effect) == 0x000070, "Member 'USTC_EffectCount_C::Effect' has a wrong offset!");
static_assert(offsetof(USTC_EffectCount_C, Compare_Value) == 0x000088, "Member 'USTC_EffectCount_C::Compare_Value' has a wrong offset!");
static_assert(offsetof(USTC_EffectCount_C, CompareOperation) == 0x00008C, "Member 'USTC_EffectCount_C::CompareOperation' has a wrong offset!");

}

