#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_IncreasedRandomChanceForMissingHealth

#include "Basic.hpp"

#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STC_IncreasedRandomChanceForMissingHealth.STC_IncreasedRandomChanceForMissingHealth_C
// 0x0018 (0x0080 - 0x0068)
class USTC_IncreasedRandomChanceForMissingHealth_C final : public UStateTreeConditionBlueprintBase
{
public:
	class ABaseCharacter*                         Target;                                            // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            HealthCurve;                                       // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        HealthThresholdForMaxChance;                       // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool ReceiveTestCondition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STC_IncreasedRandomChanceForMissingHealth_C">();
	}
	static class USTC_IncreasedRandomChanceForMissingHealth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTC_IncreasedRandomChanceForMissingHealth_C>();
	}
};
static_assert(alignof(USTC_IncreasedRandomChanceForMissingHealth_C) == 0x000008, "Wrong alignment on USTC_IncreasedRandomChanceForMissingHealth_C");
static_assert(sizeof(USTC_IncreasedRandomChanceForMissingHealth_C) == 0x000080, "Wrong size on USTC_IncreasedRandomChanceForMissingHealth_C");
static_assert(offsetof(USTC_IncreasedRandomChanceForMissingHealth_C, Target) == 0x000068, "Member 'USTC_IncreasedRandomChanceForMissingHealth_C::Target' has a wrong offset!");
static_assert(offsetof(USTC_IncreasedRandomChanceForMissingHealth_C, HealthCurve) == 0x000070, "Member 'USTC_IncreasedRandomChanceForMissingHealth_C::HealthCurve' has a wrong offset!");
static_assert(offsetof(USTC_IncreasedRandomChanceForMissingHealth_C, HealthThresholdForMaxChance) == 0x000078, "Member 'USTC_IncreasedRandomChanceForMissingHealth_C::HealthThresholdForMaxChance' has a wrong offset!");

}

