#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_UtilityScoreTargetSelector

#include "Basic.hpp"

#include "EAIUtilityScoringScheme_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STC_UtilityScoreTargetSelector.STC_UtilityScoreTargetSelector_C.ExecuteUbergraph_STC_UtilityScoreTargetSelector
// 0x0004 (0x0004 - 0x0000)
struct STC_UtilityScoreTargetSelector_C_ExecuteUbergraph_STC_UtilityScoreTargetSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_UtilityScoreTargetSelector_C_ExecuteUbergraph_STC_UtilityScoreTargetSelector) == 0x000004, "Wrong alignment on STC_UtilityScoreTargetSelector_C_ExecuteUbergraph_STC_UtilityScoreTargetSelector");
static_assert(sizeof(STC_UtilityScoreTargetSelector_C_ExecuteUbergraph_STC_UtilityScoreTargetSelector) == 0x000004, "Wrong size on STC_UtilityScoreTargetSelector_C_ExecuteUbergraph_STC_UtilityScoreTargetSelector");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_ExecuteUbergraph_STC_UtilityScoreTargetSelector, EntryPoint) == 0x000000, "Member 'STC_UtilityScoreTargetSelector_C_ExecuteUbergraph_STC_UtilityScoreTargetSelector::EntryPoint' has a wrong offset!");

// Function STC_UtilityScoreTargetSelector.STC_UtilityScoreTargetSelector_C.CalculateScore
// 0x00F0 (0x00F0 - 0x0000)
struct STC_UtilityScoreTargetSelector_C_CalculateScore final
{
public:
	TArray<double>                                Values;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EAIUtilityScoringScheme                       Scheme;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Result;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Score;                                             // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_2;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_UtilityScoreTargetSelector_C_CalculateScore) == 0x000008, "Wrong alignment on STC_UtilityScoreTargetSelector_C_CalculateScore");
static_assert(sizeof(STC_UtilityScoreTargetSelector_C_CalculateScore) == 0x0000F0, "Wrong size on STC_UtilityScoreTargetSelector_C_CalculateScore");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, Values) == 0x000000, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::Values' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, Scheme) == 0x000010, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::Scheme' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, Result) == 0x000018, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::Result' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, Score) == 0x000020, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::Score' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, K2Node_SwitchEnum_CmpSuccess) == 0x00002C, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Array_Length_ReturnValue_2) == 0x00003C, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Array_Length_ReturnValue_3) == 0x000044, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000048, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Array_Length_ReturnValue_4) == 0x000050, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000058, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, Temp_int_Array_Index_Variable) == 0x000060, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Array_Get_Item) == 0x000070, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000078, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, Temp_int_Array_Index_Variable_1) == 0x000080, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, Temp_int_Loop_Counter_Variable_1) == 0x000090, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Less_IntInt_ReturnValue_1) == 0x000094, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Add_IntInt_ReturnValue_1) == 0x000098, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, Temp_int_Array_Index_Variable_2) == 0x00009C, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Array_Get_Item_2) == 0x0000A0, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000A8, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, Temp_int_Loop_Counter_Variable_2) == 0x0000D8, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000DC, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000DD, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000E0, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_CalculateScore, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000E8, "Member 'STC_UtilityScoreTargetSelector_C_CalculateScore::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");

// Function STC_UtilityScoreTargetSelector.STC_UtilityScoreTargetSelector_C.ReceiveTestCondition
// 0x02B0 (0x02B0 - 0x0000)
struct STC_UtilityScoreTargetSelector_C_ReceiveTestCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                Current_Values;                                    // 0x0008(0x0010)(Edit, BlueprintVisible)
	double                                        Best_Score;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Best_Target;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Current_Target;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExprValue                             CallFunc_EvaluateExpression_ReturnValue;           // 0x0080(0x00C8)()
	struct FGuid                                  CallFunc_Array_Get_Item;                           // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         CallFunc_FindCharacter_ReturnValue;                // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_CalculateScore_Result;                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x2];                                      // 0x0182(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0190(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0198(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         CallFunc_Array_Get_Item_1;                         // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FExprValue                             CallFunc_EvaluateExpression_ReturnValue_1;         // 0x01D0(0x00C8)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_UtilityScoreTargetSelector_C_ReceiveTestCondition) == 0x000008, "Wrong alignment on STC_UtilityScoreTargetSelector_C_ReceiveTestCondition");
static_assert(sizeof(STC_UtilityScoreTargetSelector_C_ReceiveTestCondition) == 0x0002B0, "Wrong size on STC_UtilityScoreTargetSelector_C_ReceiveTestCondition");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_ReceiveTestCondition, ReturnValue) == 0x000000, "Member 'STC_UtilityScoreTargetSelector_C_ReceiveTestCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_UtilityScoreTargetSelector_C_ReceiveTestCondition, Current_Values) == 0x000008, "Member 'STC_UtilityScoreTargetSelector_C_ReceiveTestCondition::Current_Values' has a wrong offset!");
