#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_ElderDragon_CheckFlamePatchesInProximity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STC_ElderDragon_CheckFlamePatchesInProximity.STC_ElderDragon_CheckFlamePatchesInProximity_C.ReceiveTestCondition
// 0x0098 (0x0098 - 0x0000)
struct STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAoCAbilityLingeringEffect*>     CallFunc_GetOwnedLingeringZones_ReturnValue;       // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAoCAbilityLingeringEffect*             CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AElderDragon_Fire_FlamePatch_C*         K2Node_DynamicCast_AsElder_Dragon_Fire_Flame_Patch; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition) == 0x000008, "Wrong alignment on STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition");
static_assert(sizeof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition) == 0x000098, "Wrong size on STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, ReturnValue) == 0x000000, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, Count) == 0x000004, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::Count' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, Temp_int_Array_Index_Variable) == 0x000010, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, Temp_int_Variable) == 0x000014, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, CallFunc_GetOwnedLingeringZones_ReturnValue) == 0x000038, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::CallFunc_GetOwnedLingeringZones_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, CallFunc_Array_Get_Item) == 0x000050, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, K2Node_DynamicCast_AsElder_Dragon_Fire_Flame_Patch) == 0x000060, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::K2Node_DynamicCast_AsElder_Dragon_Fire_Flame_Patch' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, CallFunc_Vector_Distance_ReturnValue) == 0x000088, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000090, "Member 'STC_ElderDragon_CheckFlamePatchesInProximity_C_ReceiveTestCondition::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

}

