#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_HasEffect

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function STC_HasEffect.STC_HasEffect_C.ReceiveTestCondition
// 0x0798 (0x0798 - 0x0000)
struct STC_HasEffect_C_ReceiveTestCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectRecord                          CallFunc_GetEffectRecordByGuid_ReturnValue;        // 0x0008(0x0788)(ConstParm)
	bool                                          CallFunc_HasEffect_ReturnValue;                    // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0791(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_HasEffect_C_ReceiveTestCondition) == 0x000008, "Wrong alignment on STC_HasEffect_C_ReceiveTestCondition");
static_assert(sizeof(STC_HasEffect_C_ReceiveTestCondition) == 0x000798, "Wrong size on STC_HasEffect_C_ReceiveTestCondition");
static_assert(offsetof(STC_HasEffect_C_ReceiveTestCondition, ReturnValue) == 0x000000, "Member 'STC_HasEffect_C_ReceiveTestCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_HasEffect_C_ReceiveTestCondition, CallFunc_GetEffectRecordByGuid_ReturnValue) == 0x000008, "Member 'STC_HasEffect_C_ReceiveTestCondition::CallFunc_GetEffectRecordByGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_HasEffect_C_ReceiveTestCondition, CallFunc_HasEffect_ReturnValue) == 0x000790, "Member 'STC_HasEffect_C_ReceiveTestCondition::CallFunc_HasEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_HasEffect_C_ReceiveTestCondition, CallFunc_Not_PreBool_ReturnValue) == 0x000791, "Member 'STC_HasEffect_C_ReceiveTestCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

