#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_ElderDragon_Fire_ConeAOETargetSelector

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function STC_ElderDragon_Fire_ConeAOETargetSelector.STC_ElderDragon_Fire_ConeAOETargetSelector_C.ReceiveTestCondition
// 0x00C8 (0x00C8 - 0x0000)
struct STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         Best_Target;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        Best_Score;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, struct FHateEntry>         CallFunc_GetHatedCharacters_ReturnValue;           // 0x0038(0x0050)()
	TArray<struct FHateEntry>                     CallFunc_Map_Values_Values;                        // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHateEntry                             CallFunc_Array_Get_Item;                           // 0x009C(0x0014)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Score_Target_Score;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition) == 0x000008, "Wrong alignment on STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition");
static_assert(sizeof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition) == 0x0000C8, "Wrong size on STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, ReturnValue) == 0x000000, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, Best_Target) == 0x000008, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::Best_Target' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, Best_Score) == 0x000010, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::Best_Score' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, Temp_int_Array_Index_Variable) == 0x000018, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, CallFunc_GetBlackboard_ReturnValue) == 0x000028, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, CallFunc_GetHatedCharacters_ReturnValue) == 0x000038, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::CallFunc_GetHatedCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, CallFunc_Map_Values_Values) == 0x000088, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, CallFunc_Array_Get_Item) == 0x00009C, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, CallFunc_Score_Target_Score) == 0x0000B8, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::CallFunc_Score_Target_Score' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_ReceiveTestCondition::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function STC_ElderDragon_Fire_ConeAOETargetSelector.STC_ElderDragon_Fire_ConeAOETargetSelector_C.Score Individual Target
// 0x0190 (0x0190 - 0x0000)
struct STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target final
{
public:
	class ABaseCharacter*                         Target_To_Score;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Breath_Dir;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Score;                                             // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_4;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_5;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target) == 0x000008, "Wrong alignment on STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target");
static_assert(sizeof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target) == 0x000190, "Wrong size on STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, Target_To_Score) == 0x000000, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::Target_To_Score' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, Breath_Dir) == 0x000008, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::Breath_Dir' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, Score) == 0x000020, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::Score' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, Distance) == 0x000028, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::Distance' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000060, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000078, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000080, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x000088, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_FMax_ReturnValue) == 0x000090, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Subtract_DoubleDouble_ReturnValue_4) == 0x000098, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Subtract_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Subtract_DoubleDouble_ReturnValue_5) == 0x0000A8, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Subtract_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_FMax_ReturnValue_1) == 0x0000B0, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x0000B9, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000C0, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000D8, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0000F0, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Normal_ReturnValue) == 0x0000F8, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_GetActorUpVector_ReturnValue) == 0x000110, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_ProjectVectorOnToPlane_ReturnValue) == 0x000128, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_ProjectVectorOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000140, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Normal_ReturnValue_1) == 0x000158, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Vector_Distance_ReturnValue) == 0x000170, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Dot_VectorVector_ReturnValue) == 0x000178, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_DegAcos_ReturnValue) == 0x000180, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000188, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000189, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_BooleanOR_ReturnValue) == 0x00018A, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target, CallFunc_BooleanOR_ReturnValue_1) == 0x00018B, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Individual_Target::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function STC_ElderDragon_Fire_ConeAOETargetSelector.STC_ElderDragon_Fire_ConeAOETargetSelector_C.Score Target
// 0x0158 (0x0158 - 0x0000)
struct STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Target final
{
public:
	class ABaseCharacter*                         Target_To_Score;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Score;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Target_Score;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pivot_Direction;                                   // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGuid, struct FHateEntry>         CallFunc_GetHatedCharacters_ReturnValue;           // 0x0070(0x0050)()
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHateEntry>                     CallFunc_Map_Values_Values;                        // 0x00D8(0x0010)(ReferenceParm)
	double                                        CallFunc_BreakVector_X;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHateEntry                             CallFunc_Array_Get_Item;                           // 0x0100(0x0014)(NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Score_Individual_Target_Score;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Score_Individual_Target_Score_1;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Target) == 0x000008, "Wrong alignment on STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Target");
static_assert(sizeof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Target) == 0x000158, "Wrong size on STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Target");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Target, Target_To_Score) == 0x000000, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Target::Target_To_Score' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Target, Score) == 0x000008, "Member 'STC_ElderDragon_Fire_ConeAOETargetSelector_C_Score_Target::Score' has a wrong offset!");
