#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_HealthPercentage

#include "Basic.hpp"

#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STC_HealthPercentage.STC_HealthPercentage_C
// 0x0018 (0x0080 - 0x0068)
class USTC_HealthPercentage_C final : public UStateTreeConditionBlueprintBase
{
public:
	class ABaseCharacter*                         Target;                                            // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        Threshold;                                         // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Inverse;                                           // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool ReceiveTestCondition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STC_HealthPercentage_C">();
	}
	static class USTC_HealthPercentage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTC_HealthPercentage_C>();
	}
};
static_assert(alignof(USTC_HealthPercentage_C) == 0x000008, "Wrong alignment on USTC_HealthPercentage_C");
static_assert(sizeof(USTC_HealthPercentage_C) == 0x000080, "Wrong size on USTC_HealthPercentage_C");
static_assert(offsetof(USTC_HealthPercentage_C, Target) == 0x000068, "Member 'USTC_HealthPercentage_C::Target' has a wrong offset!");
static_assert(offsetof(USTC_HealthPercentage_C, Threshold) == 0x000070, "Member 'USTC_HealthPercentage_C::Threshold' has a wrong offset!");
static_assert(offsetof(USTC_HealthPercentage_C, Inverse) == 0x000078, "Member 'USTC_HealthPercentage_C::Inverse' has a wrong offset!");

}

