#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_HealthPercentage

#include "Basic.hpp"


namespace SDK::Params
{

// Function STC_HealthPercentage.STC_HealthPercentage_C.ReceiveTestCondition
// 0x0020 (0x0020 - 0x0000)
struct STC_HealthPercentage_C_ReceiveTestCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthPercent_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_HealthPercentage_C_ReceiveTestCondition) == 0x000008, "Wrong alignment on STC_HealthPercentage_C_ReceiveTestCondition");
static_assert(sizeof(STC_HealthPercentage_C_ReceiveTestCondition) == 0x000020, "Wrong size on STC_HealthPercentage_C_ReceiveTestCondition");
static_assert(offsetof(STC_HealthPercentage_C_ReceiveTestCondition, ReturnValue) == 0x000000, "Member 'STC_HealthPercentage_C_ReceiveTestCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_HealthPercentage_C_ReceiveTestCondition, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'STC_HealthPercentage_C_ReceiveTestCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_HealthPercentage_C_ReceiveTestCondition, CallFunc_GetHealthPercent_ReturnValue) == 0x000004, "Member 'STC_HealthPercentage_C_ReceiveTestCondition::CallFunc_GetHealthPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_HealthPercentage_C_ReceiveTestCondition, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'STC_HealthPercentage_C_ReceiveTestCondition::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_HealthPercentage_C_ReceiveTestCondition, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'STC_HealthPercentage_C_ReceiveTestCondition::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_HealthPercentage_C_ReceiveTestCondition, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'STC_HealthPercentage_C_ReceiveTestCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_HealthPercentage_C_ReceiveTestCondition, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'STC_HealthPercentage_C_ReceiveTestCondition::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

