#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_ElapsedTime

#include "Basic.hpp"

#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STC_ElapsedTime.STC_ElapsedTime_C
// 0x0018 (0x0080 - 0x0068)
class USTC_ElapsedTime_C final : public UStateTreeConditionBlueprintBase
{
public:
	double                                        CurrentTime;                                       // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StateStartTime;                                    // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeToElapse;                                      // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool ReceiveTestCondition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STC_ElapsedTime_C">();
	}
	static class USTC_ElapsedTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTC_ElapsedTime_C>();
	}
};
static_assert(alignof(USTC_ElapsedTime_C) == 0x000008, "Wrong alignment on USTC_ElapsedTime_C");
static_assert(sizeof(USTC_ElapsedTime_C) == 0x000080, "Wrong size on USTC_ElapsedTime_C");
static_assert(offsetof(USTC_ElapsedTime_C, CurrentTime) == 0x000068, "Member 'USTC_ElapsedTime_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(USTC_ElapsedTime_C, StateStartTime) == 0x000070, "Member 'USTC_ElapsedTime_C::StateStartTime' has a wrong offset!");
static_assert(offsetof(USTC_ElapsedTime_C, TimeToElapse) == 0x000078, "Member 'USTC_ElapsedTime_C::TimeToElapse' has a wrong offset!");

}

