#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_ElderDragon_Fire_ConeAOETargetSelector

#include "Basic.hpp"

#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STC_ElderDragon_Fire_ConeAOETargetSelector.STC_ElderDragon_Fire_ConeAOETargetSelector_C
// 0x0040 (0x00A8 - 0x0068)
class USTC_ElderDragon_Fire_ConeAOETargetSelector_C final : public UStateTreeConditionBlueprintBase
{
public:
	class AElderDragon_Fire_C*                    Agent;                                             // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        Cone_Angle;                                        // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinTargetDis;                                      // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxTargetDis;                                      // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinOptimalTargetDis;                               // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxOptimalTargetDis;                               // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Single_Target_Min_Score;                           // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BB_Storage;                                        // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool ReceiveTestCondition() const;
	void Score_Individual_Target(class ABaseCharacter* Target_To_Score, const struct FVector& Breath_Dir, double* Score) const;
	void Score_Target(class ABaseCharacter* Target_To_Score, double* Score) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STC_ElderDragon_Fire_ConeAOETargetSelector_C">();
	}
	static class USTC_ElderDragon_Fire_ConeAOETargetSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTC_ElderDragon_Fire_ConeAOETargetSelector_C>();
	}
};
static_assert(alignof(USTC_ElderDragon_Fire_ConeAOETargetSelector_C) == 0x000008, "Wrong alignment on USTC_ElderDragon_Fire_ConeAOETargetSelector_C");
static_assert(sizeof(USTC_ElderDragon_Fire_ConeAOETargetSelector_C) == 0x0000A8, "Wrong size on USTC_ElderDragon_Fire_ConeAOETargetSelector_C");
static_assert(offsetof(USTC_ElderDragon_Fire_ConeAOETargetSelector_C, Agent) == 0x000068, "Member 'USTC_ElderDragon_Fire_ConeAOETargetSelector_C::Agent' has a wrong offset!");
static_assert(offsetof(USTC_ElderDragon_Fire_ConeAOETargetSelector_C, Cone_Angle) == 0x000070, "Member 'USTC_ElderDragon_Fire_ConeAOETargetSelector_C::Cone_Angle' has a wrong offset!");
static_assert(offsetof(USTC_ElderDragon_Fire_ConeAOETargetSelector_C, MinTargetDis) == 0x000078, "Member 'USTC_ElderDragon_Fire_ConeAOETargetSelector_C::MinTargetDis' has a wrong offset!");
static_assert(offsetof(USTC_ElderDragon_Fire_ConeAOETargetSelector_C, MaxTargetDis) == 0x000080, "Member 'USTC_ElderDragon_Fire_ConeAOETargetSelector_C::MaxTargetDis' has a wrong offset!");
static_assert(offsetof(USTC_ElderDragon_Fire_ConeAOETargetSelector_C, MinOptimalTargetDis) == 0x000088, "Member 'USTC_ElderDragon_Fire_ConeAOETargetSelector_C::MinOptimalTargetDis' has a wrong offset!");
static_assert(offsetof(USTC_ElderDragon_Fire_ConeAOETargetSelector_C, MaxOptimalTargetDis) == 0x000090, "Member 'USTC_ElderDragon_Fire_ConeAOETargetSelector_C::MaxOptimalTargetDis' has a wrong offset!");
static_assert(offsetof(USTC_ElderDragon_Fire_ConeAOETargetSelector_C, Single_Target_Min_Score) == 0x000098, "Member 'USTC_ElderDragon_Fire_ConeAOETargetSelector_C::Single_Target_Min_Score' has a wrong offset!");
static_assert(offsetof(USTC_ElderDragon_Fire_ConeAOETargetSelector_C, BB_Storage) == 0x0000A0, "Member 'USTC_ElderDragon_Fire_ConeAOETargetSelector_C::BB_Storage' has a wrong offset!");

}

