#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_ElderDragon_Fire_AirBreathStrategy

#include "Basic.hpp"

#include "StateTreeModule_classes.hpp"
#include "EElderDragon_Fire_AirBehaviorStrategy_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STC_ElderDragon_Fire_AirBreathStrategy.STC_ElderDragon_Fire_AirBreathStrategy_C
// 0x0018 (0x0080 - 0x0068)
class USTC_ElderDragon_Fire_AirBreathStrategy_C final : public UStateTreeConditionBlueprintBase
{
public:
	class ANPCPawn_C*                             Agent;                                             // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	EElderDragon_Fire_AirBehaviorStrategy         Strategy;                                          // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BB_Var;                                            // 0x0074(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool ReceiveTestCondition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STC_ElderDragon_Fire_AirBreathStrategy_C">();
	}
	static class USTC_ElderDragon_Fire_AirBreathStrategy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTC_ElderDragon_Fire_AirBreathStrategy_C>();
	}
};
static_assert(alignof(USTC_ElderDragon_Fire_AirBreathStrategy_C) == 0x000008, "Wrong alignment on USTC_ElderDragon_Fire_AirBreathStrategy_C");
static_assert(sizeof(USTC_ElderDragon_Fire_AirBreathStrategy_C) == 0x000080, "Wrong size on USTC_ElderDragon_Fire_AirBreathStrategy_C");
static_assert(offsetof(USTC_ElderDragon_Fire_AirBreathStrategy_C, Agent) == 0x000068, "Member 'USTC_ElderDragon_Fire_AirBreathStrategy_C::Agent' has a wrong offset!");
static_assert(offsetof(USTC_ElderDragon_Fire_AirBreathStrategy_C, Strategy) == 0x000070, "Member 'USTC_ElderDragon_Fire_AirBreathStrategy_C::Strategy' has a wrong offset!");
static_assert(offsetof(USTC_ElderDragon_Fire_AirBreathStrategy_C, BB_Var) == 0x000074, "Member 'USTC_ElderDragon_Fire_AirBreathStrategy_C::BB_Var' has a wrong offset!");

}

