#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_ElderDragon_Fire_FlameBarrageChance

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STC_ElderDragon_Fire_FlameBarrageChance.STC_ElderDragon_Fire_FlameBarrageChance_C.ReceiveTestCondition
// 0x00C8 (0x00C8 - 0x0000)
struct STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FlamePatchCount;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAoCAbilityLingeringEffect*>     CallFunc_GetOwnedLingeringZones_ReturnValue;       // 0x0038(0x0010)(ReferenceParm)
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAoCAbilityLingeringEffect*             CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition) == 0x000008, "Wrong alignment on STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition");
static_assert(sizeof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition) == 0x0000C8, "Wrong size on STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, ReturnValue) == 0x000000, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, FlamePatchCount) == 0x000004, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::FlamePatchCount' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, Temp_int_Array_Index_Variable) == 0x000010, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, Temp_int_Variable) == 0x000030, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_GetOwnedLingeringZones_ReturnValue) == 0x000038, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_GetOwnedLingeringZones_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_RandomFloat_ReturnValue) == 0x000048, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Array_Get_Item) == 0x000050, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Vector_Distance_ReturnValue) == 0x000080, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Subtract_IntInt_ReturnValue) == 0x000088, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000090, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Clamp_ReturnValue) == 0x000098, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00009C, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000A0, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A8, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x0000C1, "Member 'STC_ElderDragon_Fire_FlameBarrageChance_C_ReceiveTestCondition::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");

}

