#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_ElderDragon_Fire_AirBreathStrategy

#include "Basic.hpp"


namespace SDK::Params
{

// Function STC_ElderDragon_Fire_AirBreathStrategy.STC_ElderDragon_Fire_AirBreathStrategy_C.ReceiveTestCondition
// 0x0018 (0x0018 - 0x0000)
struct STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValueAsEnum_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition) == 0x000008, "Wrong alignment on STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition");
static_assert(sizeof(STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition) == 0x000018, "Wrong size on STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition");
static_assert(offsetof(STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition, ReturnValue) == 0x000000, "Member 'STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition, CallFunc_GetBlackboard_ReturnValue) == 0x000008, "Member 'STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition, CallFunc_GetValueAsEnum_ReturnValue) == 0x000011, "Member 'STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition::CallFunc_GetValueAsEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition, CallFunc_GetValidValue_ReturnValue) == 0x000012, "Member 'STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000013, "Member 'STC_ElderDragon_Fire_AirBreathStrategy_C_ReceiveTestCondition::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

