#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STC_StringCompare

#include "Basic.hpp"


namespace SDK::Params
{

// Function STC_StringCompare.STC_StringCompare_C.ReceiveTestCondition
// 0x0003 (0x0003 - 0x0000)
struct STC_StringCompare_C_ReceiveTestCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STC_StringCompare_C_ReceiveTestCondition) == 0x000001, "Wrong alignment on STC_StringCompare_C_ReceiveTestCondition");
static_assert(sizeof(STC_StringCompare_C_ReceiveTestCondition) == 0x000003, "Wrong size on STC_StringCompare_C_ReceiveTestCondition");
static_assert(offsetof(STC_StringCompare_C_ReceiveTestCondition, ReturnValue) == 0x000000, "Member 'STC_StringCompare_C_ReceiveTestCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_StringCompare_C_ReceiveTestCondition, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000001, "Member 'STC_StringCompare_C_ReceiveTestCondition::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(STC_StringCompare_C_ReceiveTestCondition, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'STC_StringCompare_C_ReceiveTestCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

