#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STE_UpdateMostHated

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STE_UpdateMostHated.STE_UpdateMostHated_C
// 0x0018 (0x0080 - 0x0068)
class USTE_UpdateMostHated_C final : public UStateTreeEvaluatorBlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABaseCharacter*                         PrimaryTarget;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ANPCCharacter*                          Agent;                                             // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STE_UpdateMostHated(int32 EntryPoint);
	void ReceiveTick(const float DeltaTime);
	void ReceiveTreeStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STE_UpdateMostHated_C">();
	}
	static class USTE_UpdateMostHated_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTE_UpdateMostHated_C>();
	}
};
static_assert(alignof(USTE_UpdateMostHated_C) == 0x000008, "Wrong alignment on USTE_UpdateMostHated_C");
static_assert(sizeof(USTE_UpdateMostHated_C) == 0x000080, "Wrong size on USTE_UpdateMostHated_C");
static_assert(offsetof(USTE_UpdateMostHated_C, UberGraphFrame) == 0x000068, "Member 'USTE_UpdateMostHated_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTE_UpdateMostHated_C, PrimaryTarget) == 0x000070, "Member 'USTE_UpdateMostHated_C::PrimaryTarget' has a wrong offset!");
static_assert(offsetof(USTE_UpdateMostHated_C, Agent) == 0x000078, "Member 'USTE_UpdateMostHated_C::Agent' has a wrong offset!");

}

