#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter.STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C
// 0x0030 (0x0098 - 0x0068)
class USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C final : public UStateTreeEvaluatorBlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AMagmaGolem_Bellowsmasher_C*            Agent;                                             // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABefallenForge_Bellow_C*                Bellow;                                            // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SmashBellowLocation;                               // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(const float DeltaTime);
	void ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C">();
	}
	static class USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C>();
	}
};
static_assert(alignof(USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C) == 0x000008, "Wrong alignment on USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C");
static_assert(sizeof(USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C) == 0x000098, "Wrong size on USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C");
static_assert(offsetof(USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C, UberGraphFrame) == 0x000068, "Member 'USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C, Agent) == 0x000070, "Member 'USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C::Agent' has a wrong offset!");
static_assert(offsetof(USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C, Bellow) == 0x000078, "Member 'USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C::Bellow' has a wrong offset!");
static_assert(offsetof(USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C, SmashBellowLocation) == 0x000080, "Member 'USTE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C::SmashBellowLocation' has a wrong offset!");

}

