#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter.STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ReceiveTick) == 0x000004, "Wrong alignment on STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ReceiveTick");
static_assert(sizeof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ReceiveTick) == 0x000004, "Wrong size on STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ReceiveTick");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ReceiveTick, DeltaTime) == 0x000000, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ReceiveTick::DeltaTime' has a wrong offset!");

// Function STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter.STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C.ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter
// 0x00E0 (0x00E0 - 0x0000)
struct STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0010(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGuid>                          CallFunc_GetPerceivedActorGuids_ReturnValue;       // 0x0048(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_Array_Get_Item;                           // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         CallFunc_FindCharacter_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABefallenForge_Bellow_C*                K2Node_DynamicCast_AsBefallen_Forge_Bellow;        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter) == 0x000008, "Wrong alignment on STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter");
static_assert(sizeof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter) == 0x0000E0, "Wrong size on STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, EntryPoint) == 0x000000, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::EntryPoint' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, Temp_int_Array_Index_Variable) == 0x000004, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, K2Node_Event_DeltaTime) == 0x000010, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000018, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, CallFunc_GetActorForwardVector_ReturnValue) == 0x000030, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, CallFunc_GetPerceivedActorGuids_ReturnValue) == 0x000048, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::CallFunc_GetPerceivedActorGuids_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000058, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, CallFunc_Array_Get_Item) == 0x000070, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, CallFunc_FindCharacter_ReturnValue) == 0x000088, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::CallFunc_FindCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, K2Node_DynamicCast_AsBefallen_Forge_Bellow) == 0x000098, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::K2Node_DynamicCast_AsBefallen_Forge_Bellow' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C0, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter_C_ExecuteUbergraph_STE_MagmaGolem_BellowSmasher_GetBellowAndForgeFireEmitter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

