#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STE_UpdateActorLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STE_UpdateActorLocation.STE_UpdateActorLocation_C.ExecuteUbergraph_STE_UpdateActorLocation
// 0x0048 (0x0048 - 0x0000)
struct STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation) == 0x000008, "Wrong alignment on STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation");
static_assert(sizeof(STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation) == 0x000048, "Wrong size on STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation");
static_assert(offsetof(STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation, EntryPoint) == 0x000000, "Member 'STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation, K2Node_Event_DeltaTime) == 0x000024, "Member 'STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation, CallFunc_HasAuthority_ReturnValue_1) == 0x000040, "Member 'STE_UpdateActorLocation_C_ExecuteUbergraph_STE_UpdateActorLocation::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");

// Function STE_UpdateActorLocation.STE_UpdateActorLocation_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct STE_UpdateActorLocation_C_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STE_UpdateActorLocation_C_ReceiveTick) == 0x000004, "Wrong alignment on STE_UpdateActorLocation_C_ReceiveTick");
static_assert(sizeof(STE_UpdateActorLocation_C_ReceiveTick) == 0x000004, "Wrong size on STE_UpdateActorLocation_C_ReceiveTick");
static_assert(offsetof(STE_UpdateActorLocation_C_ReceiveTick, DeltaTime) == 0x000000, "Member 'STE_UpdateActorLocation_C_ReceiveTick::DeltaTime' has a wrong offset!");

}

