#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STE_TunnelVisionTarget

#include "Basic.hpp"


namespace SDK::Params
{

// Function STE_TunnelVisionTarget.STE_TunnelVisionTarget_C.ExecuteUbergraph_STE_TunnelVisionTarget
// 0x0048 (0x0048 - 0x0000)
struct STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         CallFunc_GetMostHated_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0010(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasEffect_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         K2Node_CustomEvent_Target;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABaseCharacter* Target)> UniqueObjectNameForCooking_OutputDelegate;         // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         CallFunc_GetMostHated_ReturnValue_1;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget) == 0x000008, "Wrong alignment on STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget");
static_assert(sizeof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget) == 0x000048, "Wrong size on STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, EntryPoint) == 0x000000, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, CallFunc_IsValid_ReturnValue_1) == 0x000006, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, CallFunc_IsValid_ReturnValue_2) == 0x000007, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, CallFunc_GetMostHated_ReturnValue) == 0x000008, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::CallFunc_GetMostHated_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, K2Node_Event_DeltaTime) == 0x000010, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, CallFunc_HasAuthority_ReturnValue_1) == 0x000014, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, CallFunc_IsValid_ReturnValue_3) == 0x000015, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, CallFunc_IsValid_ReturnValue_4) == 0x000016, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, CallFunc_IsValid_ReturnValue_5) == 0x000017, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, CallFunc_HasEffect_ReturnValue) == 0x000020, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::CallFunc_HasEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, K2Node_CustomEvent_Target) == 0x000028, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, UniqueObjectNameForCooking_OutputDelegate) == 0x000030, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::UniqueObjectNameForCooking_OutputDelegate' has a wrong offset!");
static_assert(offsetof(STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget, CallFunc_GetMostHated_ReturnValue_1) == 0x000040, "Member 'STE_TunnelVisionTarget_C_ExecuteUbergraph_STE_TunnelVisionTarget::CallFunc_GetMostHated_ReturnValue_1' has a wrong offset!");

// Function STE_TunnelVisionTarget.STE_TunnelVisionTarget_C.On Hit Script
// 0x0008 (0x0008 - 0x0000)
struct STE_TunnelVisionTarget_C_On_Hit_Script final
{
public:
	class ABaseCharacter*                         Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STE_TunnelVisionTarget_C_On_Hit_Script) == 0x000008, "Wrong alignment on STE_TunnelVisionTarget_C_On_Hit_Script");
static_assert(sizeof(STE_TunnelVisionTarget_C_On_Hit_Script) == 0x000008, "Wrong size on STE_TunnelVisionTarget_C_On_Hit_Script");
static_assert(offsetof(STE_TunnelVisionTarget_C_On_Hit_Script, Target) == 0x000000, "Member 'STE_TunnelVisionTarget_C_On_Hit_Script::Target' has a wrong offset!");

// Function STE_TunnelVisionTarget.STE_TunnelVisionTarget_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct STE_TunnelVisionTarget_C_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STE_TunnelVisionTarget_C_ReceiveTick) == 0x000004, "Wrong alignment on STE_TunnelVisionTarget_C_ReceiveTick");
static_assert(sizeof(STE_TunnelVisionTarget_C_ReceiveTick) == 0x000004, "Wrong size on STE_TunnelVisionTarget_C_ReceiveTick");
static_assert(offsetof(STE_TunnelVisionTarget_C_ReceiveTick, DeltaTime) == 0x000000, "Member 'STE_TunnelVisionTarget_C_ReceiveTick::DeltaTime' has a wrong offset!");

}

