#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STE_TunnelVisionTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STE_TunnelVisionTarget.STE_TunnelVisionTarget_C
// 0x0038 (0x00A0 - 0x0068)
class USTE_TunnelVisionTarget_C final : public UStateTreeEvaluatorBlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABaseCharacter*                         HippoPrimaryTarget;                                // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHippo_C*                               Agent;                                             // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HippoChargeScriptReference;                        // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAoCCombatScript*                       HippoScriptCastReference;                          // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         ClosestPlayer;                                     // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AHippo_C*                               MaybeTheRightTarget_;                              // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STE_TunnelVisionTarget(int32 EntryPoint);
	void On_Hit_Script(class ABaseCharacter* Target);
	void ReceiveTick(const float DeltaTime);
	void ReceiveTreeStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STE_TunnelVisionTarget_C">();
	}
	static class USTE_TunnelVisionTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTE_TunnelVisionTarget_C>();
	}
};
static_assert(alignof(USTE_TunnelVisionTarget_C) == 0x000008, "Wrong alignment on USTE_TunnelVisionTarget_C");
static_assert(sizeof(USTE_TunnelVisionTarget_C) == 0x0000A0, "Wrong size on USTE_TunnelVisionTarget_C");
static_assert(offsetof(USTE_TunnelVisionTarget_C, UberGraphFrame) == 0x000068, "Member 'USTE_TunnelVisionTarget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTE_TunnelVisionTarget_C, HippoPrimaryTarget) == 0x000070, "Member 'USTE_TunnelVisionTarget_C::HippoPrimaryTarget' has a wrong offset!");
static_assert(offsetof(USTE_TunnelVisionTarget_C, Agent) == 0x000078, "Member 'USTE_TunnelVisionTarget_C::Agent' has a wrong offset!");
static_assert(offsetof(USTE_TunnelVisionTarget_C, HippoChargeScriptReference) == 0x000080, "Member 'USTE_TunnelVisionTarget_C::HippoChargeScriptReference' has a wrong offset!");
static_assert(offsetof(USTE_TunnelVisionTarget_C, HippoScriptCastReference) == 0x000088, "Member 'USTE_TunnelVisionTarget_C::HippoScriptCastReference' has a wrong offset!");
static_assert(offsetof(USTE_TunnelVisionTarget_C, ClosestPlayer) == 0x000090, "Member 'USTE_TunnelVisionTarget_C::ClosestPlayer' has a wrong offset!");
static_assert(offsetof(USTE_TunnelVisionTarget_C, MaybeTheRightTarget_) == 0x000098, "Member 'USTE_TunnelVisionTarget_C::MaybeTheRightTarget_' has a wrong offset!");

}

