#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STE_Gorilla_UpdateTarget

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function STE_Gorilla_UpdateTarget.STE_Gorilla_UpdateTarget_C.Set Target
// 0x0008 (0x0008 - 0x0000)
struct STE_Gorilla_UpdateTarget_C_Set_Target final
{
public:
	class ABaseCharacter*                         Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STE_Gorilla_UpdateTarget_C_Set_Target) == 0x000008, "Wrong alignment on STE_Gorilla_UpdateTarget_C_Set_Target");
static_assert(sizeof(STE_Gorilla_UpdateTarget_C_Set_Target) == 0x000008, "Wrong size on STE_Gorilla_UpdateTarget_C_Set_Target");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_Set_Target, Target) == 0x000000, "Member 'STE_Gorilla_UpdateTarget_C_Set_Target::Target' has a wrong offset!");

// Function STE_Gorilla_UpdateTarget.STE_Gorilla_UpdateTarget_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct STE_Gorilla_UpdateTarget_C_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STE_Gorilla_UpdateTarget_C_ReceiveTick) == 0x000004, "Wrong alignment on STE_Gorilla_UpdateTarget_C_ReceiveTick");
static_assert(sizeof(STE_Gorilla_UpdateTarget_C_ReceiveTick) == 0x000004, "Wrong size on STE_Gorilla_UpdateTarget_C_ReceiveTick");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_ReceiveTick, DeltaTime) == 0x000000, "Member 'STE_Gorilla_UpdateTarget_C_ReceiveTick::DeltaTime' has a wrong offset!");

// Function STE_Gorilla_UpdateTarget.STE_Gorilla_UpdateTarget_C.ExecuteUbergraph_STE_Gorilla_UpdateTarget
// 0x07D0 (0x07D0 - 0x0000)
struct STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABaseCharacter* Target)> UniqueObjectNameForCooking_OutputDelegate;         // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectRecord                          CallFunc_GetEffectRecordByGuid_ReturnValue;        // 0x0020(0x0788)(ConstParm)
	bool                                          CallFunc_HasEffect_ReturnValue;                    // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         K2Node_CustomEvent_Target;                         // 0x07B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x07B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         CallFunc_GetMostHated_ReturnValue;                 // 0x07C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x07C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget) == 0x000008, "Wrong alignment on STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget");
static_assert(sizeof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget) == 0x0007D0, "Wrong size on STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget, EntryPoint) == 0x000000, "Member 'STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget, UniqueObjectNameForCooking_OutputDelegate) == 0x000008, "Member 'STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget::UniqueObjectNameForCooking_OutputDelegate' has a wrong offset!");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget, CallFunc_GetEffectRecordByGuid_ReturnValue) == 0x000020, "Member 'STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget::CallFunc_GetEffectRecordByGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget, CallFunc_HasEffect_ReturnValue) == 0x0007A8, "Member 'STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget::CallFunc_HasEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget, K2Node_CustomEvent_Target) == 0x0007B0, "Member 'STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget, K2Node_Event_DeltaTime) == 0x0007B8, "Member 'STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget, CallFunc_GetMostHated_ReturnValue) == 0x0007C0, "Member 'STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget::CallFunc_GetMostHated_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget, CallFunc_IsDead_ReturnValue) == 0x0007C8, "Member 'STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget, CallFunc_BooleanOR_ReturnValue) == 0x0007C9, "Member 'STE_Gorilla_UpdateTarget_C_ExecuteUbergraph_STE_Gorilla_UpdateTarget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

