#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STE_UpdateMostHated

#include "Basic.hpp"


namespace SDK::Params
{

// Function STE_UpdateMostHated.STE_UpdateMostHated_C.ExecuteUbergraph_STE_UpdateMostHated
// 0x0028 (0x0028 - 0x0000)
struct STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         CallFunc_GetMostHated_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         CallFunc_GetMostHated_ReturnValue_1;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated) == 0x000008, "Wrong alignment on STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated");
static_assert(sizeof(STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated) == 0x000028, "Wrong size on STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated");
static_assert(offsetof(STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated, EntryPoint) == 0x000000, "Member 'STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated::EntryPoint' has a wrong offset!");
static_assert(offsetof(STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated, K2Node_Event_DeltaTime) == 0x000008, "Member 'STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated, CallFunc_IsValid_ReturnValue_1) == 0x00000D, "Member 'STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated, CallFunc_IsValid_ReturnValue_2) == 0x00000E, "Member 'STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated, CallFunc_IsValid_ReturnValue_3) == 0x00000F, "Member 'STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated, CallFunc_GetMostHated_ReturnValue) == 0x000010, "Member 'STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated::CallFunc_GetMostHated_ReturnValue' has a wrong offset!");
static_assert(offsetof(STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated, CallFunc_GetMostHated_ReturnValue_1) == 0x000018, "Member 'STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated::CallFunc_GetMostHated_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated, CallFunc_HasAuthority_ReturnValue_1) == 0x000020, "Member 'STE_UpdateMostHated_C_ExecuteUbergraph_STE_UpdateMostHated::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");

// Function STE_UpdateMostHated.STE_UpdateMostHated_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct STE_UpdateMostHated_C_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STE_UpdateMostHated_C_ReceiveTick) == 0x000004, "Wrong alignment on STE_UpdateMostHated_C_ReceiveTick");
static_assert(sizeof(STE_UpdateMostHated_C_ReceiveTick) == 0x000004, "Wrong size on STE_UpdateMostHated_C_ReceiveTick");
static_assert(offsetof(STE_UpdateMostHated_C_ReceiveTick, DeltaTime) == 0x000000, "Member 'STE_UpdateMostHated_C_ReceiveTick::DeltaTime' has a wrong offset!");

}

