#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StreamlineRHI

#include "Basic.hpp"

#include "StreamlineRHI_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class StreamlineRHI.StreamlineOverrideSettings
// 0x0008 (0x0050 - 0x0048)
class UStreamlineOverrideSettings final : public UObject
{
public:
	EStreamlineSettingOverride                    EnableDLSSFGInPlayInEditorViewportsOverride;       // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStreamlineSettingOverride                    LoadDebugOverlayOverride;                          // 0x0049(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StreamlineOverrideSettings">();
	}
	static class UStreamlineOverrideSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamlineOverrideSettings>();
	}
};
static_assert(alignof(UStreamlineOverrideSettings) == 0x000008, "Wrong alignment on UStreamlineOverrideSettings");
static_assert(sizeof(UStreamlineOverrideSettings) == 0x000050, "Wrong size on UStreamlineOverrideSettings");
static_assert(offsetof(UStreamlineOverrideSettings, EnableDLSSFGInPlayInEditorViewportsOverride) == 0x000048, "Member 'UStreamlineOverrideSettings::EnableDLSSFGInPlayInEditorViewportsOverride' has a wrong offset!");
static_assert(offsetof(UStreamlineOverrideSettings, LoadDebugOverlayOverride) == 0x000049, "Member 'UStreamlineOverrideSettings::LoadDebugOverlayOverride' has a wrong offset!");

// Class StreamlineRHI.StreamlineSettings
// 0x0010 (0x0058 - 0x0048)
class UStreamlineSettings final : public UObject
{
public:
	bool                                          bEnableStreamlineD3D12;                            // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStreamlineD3D11;                            // 0x0049(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDLSSFGInPlayInEditorViewports;              // 0x004A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadDebugOverlay;                                 // 0x004B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowOTAUpdate;                                   // 0x004C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NVIDIANGXApplicationId;                            // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StreamlineSettings">();
	}
	static class UStreamlineSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamlineSettings>();
	}
};
static_assert(alignof(UStreamlineSettings) == 0x000008, "Wrong alignment on UStreamlineSettings");
static_assert(sizeof(UStreamlineSettings) == 0x000058, "Wrong size on UStreamlineSettings");
static_assert(offsetof(UStreamlineSettings, bEnableStreamlineD3D12) == 0x000048, "Member 'UStreamlineSettings::bEnableStreamlineD3D12' has a wrong offset!");
static_assert(offsetof(UStreamlineSettings, bEnableStreamlineD3D11) == 0x000049, "Member 'UStreamlineSettings::bEnableStreamlineD3D11' has a wrong offset!");
static_assert(offsetof(UStreamlineSettings, bEnableDLSSFGInPlayInEditorViewports) == 0x00004A, "Member 'UStreamlineSettings::bEnableDLSSFGInPlayInEditorViewports' has a wrong offset!");
static_assert(offsetof(UStreamlineSettings, bLoadDebugOverlay) == 0x00004B, "Member 'UStreamlineSettings::bLoadDebugOverlay' has a wrong offset!");
static_assert(offsetof(UStreamlineSettings, bAllowOTAUpdate) == 0x00004C, "Member 'UStreamlineSettings::bAllowOTAUpdate' has a wrong offset!");
static_assert(offsetof(UStreamlineSettings, NVIDIANGXApplicationId) == 0x000050, "Member 'UStreamlineSettings::NVIDIANGXApplicationId' has a wrong offset!");

}

