#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_GlobalOverrideAndBool

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_GlobalOverrideAndBool.STRUCT_GlobalOverrideAndBool
// 0x0047 (0x0047 - 0x0000)
struct FSTRUCT_GlobalOverrideAndBool final
{
public:
	bool                                          SunIntensity_174_221C94954115BA8C969DCD8752AEF4D7; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SunColor_175_9B8860484B7682951A36EB8855770205;     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SunSourceAngle_176_E6F4DF634ACBF4D5428828A1B4990140; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SunSoftSourceAngle_177_0369C8C44D951C90AE37ACBC9390B572; // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SunTermperature_178_2110024E446030E5256AEEB67F330DB3; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SunVolumetricScattering_179_CFECC7F546C45FD2F1F8E69949CF4F13; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SunSpecularScale_180_17AB2E8746720D1205C87A8984DDD1E0; // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonIntensity_181_1C7BA60347DED02A50185DB2DBCD9C7A; // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonColor_182_026BAE314188C1FBCD7C498D9C3E7471;    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonSourceAngle_183_2D555B2743F6FCE56C192EA574236CD0; // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonTemperature_184_C9324874449CAB40F2C895810D4D1CE0; // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonVolumetricScattering_185_B20F3D7B42E740DBDCDB0DB4725D3EB1; // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonSpecularScale_186_1161A02F4F666A4006A01D9D080F6C8A; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonSoftSourceAngle_187_63AA3B5B4BE6AE88D0CDEFB84E5505DE; // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RayleighScatteringScale_188_9B74AAD84907807F161FF58676B27579; // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RayleighScatteringColor_189_CE6A709943AFC8FD8340149DDBCD1D85; // 0x000F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RayleighExponentialDistribution_190_C1DF1C1A453C961FF2F687881EA875F2; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MieScatteringScale_191_CBD9AAE744B14E3B0E69B19BB84B9790; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MieScatteringColor_192_EF3425CD4FD8C189946C009D884B4770; // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MieAbsorptionScale_193_25DC4E344534D7882360EEB535269DA2; // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MIeAnistropy_194_DA8942284185673CD2245E8D9AD007C4; // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MieExponentialDistribution_195_73A0825B4275FEF2DDFDBF82F0F588D8; // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbsorptionScale_196_FC71589B455D884B56660BADA2EAE4ED; // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbsorptionColor_197_9E9D4CE6488DC56042363F91BBCA134F; // 0x0017(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkyLuminanceFactor_198_2ED5A43146C72801CB7D3FB1DE89F809; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HeightFogContribution_199_790B4BB64ED3C7BED035C0B1E851FE72; // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FogDensity_200_9B286E5743EE7FB5B12C82AB7D1AD27F;   // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FogHeightFalloff_201_BE01DF5E40DAA06EECAF64B40F372073; // 0x001B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SecondFogDensity_202_4BD6681249B975791E4B688C8A4D9508; // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SecondFogHeightFalloff_203_2D768CFE409A5A6187ECD2BDF2FB67A3; // 0x001D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SecondFogHeightOffset_204_7296E01C412C0F33E84DE8A202A65BA6; // 0x001E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FogInscatteringColor_205_7BC3D770447CC1242735588A91FD6571; // 0x001F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkyAtmosphereAmbientContributionColorScale_206_AFCB1CDE43751213CEEC628FFBCD4197; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FogMaxOpacity_207_AF1AAABF49BF8D711912B69E3E24AF1A; // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartDistance_208_241488574C0042841E6ED5934B473FE8; // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FogCutoffDistance_209_34EAF5DA48E24AE2D1A998AAE7D44C08; // 0x0023(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InscatteringCubemapAngle_210_1FD6CA2347DA34A7302CD5ADEC7A367F; // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InscatteringTextureTint_211_E4F62A554A1CA8C1DCAC95937C9145AF; // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FullyDirectionalInscatteringColorDistance_212_944799B0419B056CE9722A83890D2376; // 0x0026(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NonDirectionalInscatteringColorDistance_213_0E59FA25420499130D0946A87506C217; // 0x0027(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DirectionalInscatteringExponent_214_5E3A65D243E2EC2C6E941A94FA853CB3; // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DirectionalInscatteringStartDistance_215_204B04F54C9162AE0ACDBAACBA16856F; // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DirectionalInscatterngColor_216_3C4CE7D748717D80A6C314B64D94C29F; // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VolumetricScatteringDistributions_217_009F60EB48D8E7ACB30A439B30795323; // 0x002B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VolumetricAlbedo_218_4C68AD5E4233375FBF322196F3D0A92B; // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VolumeticEmissive_219_5838411944B9EC61840533AF59A07A78; // 0x002D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VolumetricExtinctionScale_220_F3AD17734335540771FAAD93B847B941; // 0x002E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VolumetricViewDistance_221_7E59B7974A32BFE27C0B8F9862DB9098; // 0x002F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VolumetricStartDistance_222_8B1A8153464837CF06F86FACC8F4E9B2; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CubemapSourceAngle_223_098C3F4A40E2B394A560418328FE6B3C; // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkyDistanceThreshold_224_8C5AE7834814018CB212019F482C9118; // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkyIntensity_225_C395C69A44300E9367762D83C03FD48E; // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkyLightColor_226_2C6D9EDD4DEE5FB7CC3C9C833DA83207; // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IndirectLightingIntensity_227_C17BC73E4CB40E011C0D36ABA5415500; // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VolumetricScatteringIntensity_228_6E9BA41C4F5D82CAE26125919F2C44A7; // 0x0036(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableLightShaftOcclusion_230_D177E5C8439F076FB92774BCA5F14BC7; // 0x0037(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OcclusionDepthRange_232_47CF1C634BD7734A80FF669DAA151B32; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OcclusionMaskDarkness_234_42A9AE204F90B75190D4C98FD70F8A50; // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableLightShaftBloom_236_5C03CBB948EA83EF8C54429AE0DE6931; // 0x003A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BloomScale_238_864F3A9A4E14E094ADFBF1AC435B8D27;   // 0x003B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BloomThreshold_240_A261ADCC422E42324952E7868FEE90E2; // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BloomMaxBrightness_242_4C5C9FB74648E8881DAEFC97E4DA4DCC; // 0x003D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BloomTint_244_72950B4945487B12609F29BCED68799C;    // 0x003E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonEnableLightShaftOcclusion_246_80BF329F4D55FEC55A80D2B399C26A4C; // 0x003F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonOcclusionDepthRange_248_71F981A646AD8B279207BCA9056A88E5; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonOcclusionMaskDarkness_250_89EAE7004B8F327C45712DBB2950EFE4; // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonLightShaftBloom_252_714133ED42A42229785F6E8C2488AC55; // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonLightShaftBloomScale_254_007E08BA40903FE831E51488B1459A13; // 0x0043(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonBloomThreshold_256_3FB8A28943C9785F4BE0A089AA71C518; // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonBloomMaxBrightness_258_8717C267498C2A4D400CD3B305B5CE2F; // 0x0045(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonBloomTint_260_EE29A1C64AC80DD17E5C6494B4ABCC5B; // 0x0046(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_GlobalOverrideAndBool) == 0x000001, "Wrong alignment on FSTRUCT_GlobalOverrideAndBool");
static_assert(sizeof(FSTRUCT_GlobalOverrideAndBool) == 0x000047, "Wrong size on FSTRUCT_GlobalOverrideAndBool");
static_assert(offsetof(FSTRUCT_GlobalOverrideAndBool, SunIntensity_174_221C94954115BA8C969DCD8752AEF4D7) == 0x000000, "Member 'FSTRUCT_GlobalOverrideAndBool::SunIntensity_174_221C94954115BA8C969DCD8752AEF4D7' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalOverrideAndBool, SunColor_175_9B8860484B7682951A36EB8855770205) == 0x000001, "Member 'FSTRUCT_GlobalOverrideAndBool::SunColor_175_9B8860484B7682951A36EB8855770205' has a wrong offset!");
