#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_BiomeClimate

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_BiomeClimate.Struct_BiomeClimate
// 0x0070 (0x0070 - 0x0000)
struct FStruct_BiomeClimate final
{
public:
	TArray<double>                                DegreesDay_19_D7B15B9E476CD12447D4659F69107BEA;    // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                DegreesNight_20_CB54058E418126A3B9D97EA38EDF7129;  // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                Precipitation_21_4E0C3A1A4E99A7DB60CD0C90445CACB7; // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 SunshineHours_31_D12F438A42D858F91F95C3949C2362BB; // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 RainDays_32_F497ED95459E1D0D86B7EEAD60F7D0AD;      // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                ChanceofRain_24_801291D649B92E5E527DFEB363FFE912;  // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                Humidity_28_EBFA17DE4BCDE95A03364FB1ABB21C55;      // 0x0060(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FStruct_BiomeClimate) == 0x000008, "Wrong alignment on FStruct_BiomeClimate");
static_assert(sizeof(FStruct_BiomeClimate) == 0x000070, "Wrong size on FStruct_BiomeClimate");
static_assert(offsetof(FStruct_BiomeClimate, DegreesDay_19_D7B15B9E476CD12447D4659F69107BEA) == 0x000000, "Member 'FStruct_BiomeClimate::DegreesDay_19_D7B15B9E476CD12447D4659F69107BEA' has a wrong offset!");
static_assert(offsetof(FStruct_BiomeClimate, DegreesNight_20_CB54058E418126A3B9D97EA38EDF7129) == 0x000010, "Member 'FStruct_BiomeClimate::DegreesNight_20_CB54058E418126A3B9D97EA38EDF7129' has a wrong offset!");
static_assert(offsetof(FStruct_BiomeClimate, Precipitation_21_4E0C3A1A4E99A7DB60CD0C90445CACB7) == 0x000020, "Member 'FStruct_BiomeClimate::Precipitation_21_4E0C3A1A4E99A7DB60CD0C90445CACB7' has a wrong offset!");
static_assert(offsetof(FStruct_BiomeClimate, SunshineHours_31_D12F438A42D858F91F95C3949C2362BB) == 0x000030, "Member 'FStruct_BiomeClimate::SunshineHours_31_D12F438A42D858F91F95C3949C2362BB' has a wrong offset!");
static_assert(offsetof(FStruct_BiomeClimate, RainDays_32_F497ED95459E1D0D86B7EEAD60F7D0AD) == 0x000040, "Member 'FStruct_BiomeClimate::RainDays_32_F497ED95459E1D0D86B7EEAD60F7D0AD' has a wrong offset!");
static_assert(offsetof(FStruct_BiomeClimate, ChanceofRain_24_801291D649B92E5E527DFEB363FFE912) == 0x000050, "Member 'FStruct_BiomeClimate::ChanceofRain_24_801291D649B92E5E527DFEB363FFE912' has a wrong offset!");
static_assert(offsetof(FStruct_BiomeClimate, Humidity_28_EBFA17DE4BCDE95A03364FB1ABB21C55) == 0x000060, "Member 'FStruct_BiomeClimate::Humidity_28_EBFA17DE4BCDE95A03364FB1ABB21C55' has a wrong offset!");

}

