#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_GlobalAtmosphereOutput_Skylight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_GlobalAtmosphereOutput_Skylight.STRUCT_GlobalAtmosphereOutput_Skylight
// 0x0048 (0x0048 - 0x0000)
struct FSTRUCT_GlobalAtmosphereOutput_Skylight final
{
public:
	bool                                          RealTimeCapture_41_8B8A589D4724C5178AA4BA8E1AE3D89F; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureCube*                           Cubemap_47_5784191E4550DAC2FEE227937E29A5B5;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        SourceCubemapAngle_50_F2C6EFB0483D01EB1AB75CA0FFF475CC; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SkyDistanceThreshold_54_88C2405442D250BAA6C56CBB85B4BCBF; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SkyIntensity_64_9FDEA5DE4FDC025A50EFC6A6F2275879;  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SkyLightColor_66_B0BDD0954D1F73860A0E7C989170C048; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IndirectLightingIntensity_61_909B870349B29217F9E0E6A7FC85AB2B; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VolumetricScatteringIntensity_63_6D8653F6422F545FA23D33AFA9F2C965; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_GlobalAtmosphereOutput_Skylight) == 0x000008, "Wrong alignment on FSTRUCT_GlobalAtmosphereOutput_Skylight");
static_assert(sizeof(FSTRUCT_GlobalAtmosphereOutput_Skylight) == 0x000048, "Wrong size on FSTRUCT_GlobalAtmosphereOutput_Skylight");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Skylight, RealTimeCapture_41_8B8A589D4724C5178AA4BA8E1AE3D89F) == 0x000000, "Member 'FSTRUCT_GlobalAtmosphereOutput_Skylight::RealTimeCapture_41_8B8A589D4724C5178AA4BA8E1AE3D89F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Skylight, Cubemap_47_5784191E4550DAC2FEE227937E29A5B5) == 0x000008, "Member 'FSTRUCT_GlobalAtmosphereOutput_Skylight::Cubemap_47_5784191E4550DAC2FEE227937E29A5B5' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Skylight, SourceCubemapAngle_50_F2C6EFB0483D01EB1AB75CA0FFF475CC) == 0x000010, "Member 'FSTRUCT_GlobalAtmosphereOutput_Skylight::SourceCubemapAngle_50_F2C6EFB0483D01EB1AB75CA0FFF475CC' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Skylight, SkyDistanceThreshold_54_88C2405442D250BAA6C56CBB85B4BCBF) == 0x000018, "Member 'FSTRUCT_GlobalAtmosphereOutput_Skylight::SkyDistanceThreshold_54_88C2405442D250BAA6C56CBB85B4BCBF' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Skylight, SkyIntensity_64_9FDEA5DE4FDC025A50EFC6A6F2275879) == 0x000020, "Member 'FSTRUCT_GlobalAtmosphereOutput_Skylight::SkyIntensity_64_9FDEA5DE4FDC025A50EFC6A6F2275879' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Skylight, SkyLightColor_66_B0BDD0954D1F73860A0E7C989170C048) == 0x000028, "Member 'FSTRUCT_GlobalAtmosphereOutput_Skylight::SkyLightColor_66_B0BDD0954D1F73860A0E7C989170C048' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Skylight, IndirectLightingIntensity_61_909B870349B29217F9E0E6A7FC85AB2B) == 0x000038, "Member 'FSTRUCT_GlobalAtmosphereOutput_Skylight::IndirectLightingIntensity_61_909B870349B29217F9E0E6A7FC85AB2B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Skylight, VolumetricScatteringIntensity_63_6D8653F6422F545FA23D33AFA9F2C965) == 0x000040, "Member 'FSTRUCT_GlobalAtmosphereOutput_Skylight::VolumetricScatteringIntensity_63_6D8653F6422F545FA23D33AFA9F2C965' has a wrong offset!");

}

