#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_GlobalAtmosphereOutput_ExponentialHeightFog

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_GlobalAtmosphereOutput_ExponentialHeightFog.STRUCT_GlobalAtmosphereOutput_ExponentialHeightFog
// 0x00F8 (0x00F8 - 0x0000)
struct FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog final
{
public:
	double                                        FogDensity_66_6D8653F6422F545FA23D33AFA9F2C965;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FogHeightFalloff_69_3492E155449A7F02EFFBE6B260007129; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SecondFogDensity_71_BBF0C34F49AC61126FEFAE95A41CCCE8; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SecondFogHeightFalloff_73_877C1B53482C4965001F7AB643270293; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SecondFogHeightOffset_77_FB8D625F42DC444A9DF199B90D4EE20F; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FogInscatteringColor_130_52B08CE347852E13D2DE29A8DFB39168; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SkyAtmosphereAmbientContributionColorScale_124_5979034C4086DC33D980F7803C633378; // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FogMaxOpacity_82_FC4873B54FD3AB750836FD9D6F5C9990; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartDistance_84_652BDDF24B840F5A2636CDA8CA4EA6A7; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FogCutoffDistance_86_14F95A4A47196A891421AF9DA1881BF5; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InscatteringColorCubemapAngle_90_7A995C9A41C146E3284E75A58A9CB024; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InscatteringTextureTint_126_852DED374BE7A3A4A3DF24A21206B0D1; // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FullyDirectionalInscatteringColorDistance_94_057202624513843994118AAAC1AD1269; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NonDirectionalInscatteringColorDistance_96_209665CB4F01248D95887D9AADC2E3AD; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirectionalInscatteringExponent_98_E19F455F417C98FC4C7473942582EFF8; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirectionalInscatteringStartDistance_100_788535774F5CDD1B4214D1B3B39218B1; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DirectionalInscatteringColor_127_370DCBF348BFE8466C62C7868B57EC70; // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VolumetricScatteringDistribution_108_872257F64ADBC9F73925F5991E6481A0; // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VolumetricAlbedo_128_CA61D7BD48292B31308C10ACE077E5CE; // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VolumetricEmissive_129_09844BE54CCF296DF8CC64ADACBF25C4; // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VolumetricExtinctionScale_113_E1152C1549FC48BAF613A2BCF0C404AE; // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VolumetricViewDistance_115_9109C1E04A9E98C6E1C3E2AD66EC7F35; // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VolumetricStartDistance_118_ADD8FEE24F6F312AF76780889F7A9C67; // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NearFadeInDistance_119_185D574D49572A51A022E68E1EF70515; // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StaticLightingScatteringIntensity_123_B6E8B69E4C400B0A53A01FB846492E34; // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog) == 0x000008, "Wrong alignment on FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog");
static_assert(sizeof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog) == 0x0000F8, "Wrong size on FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, FogDensity_66_6D8653F6422F545FA23D33AFA9F2C965) == 0x000000, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::FogDensity_66_6D8653F6422F545FA23D33AFA9F2C965' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, FogHeightFalloff_69_3492E155449A7F02EFFBE6B260007129) == 0x000008, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::FogHeightFalloff_69_3492E155449A7F02EFFBE6B260007129' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, SecondFogDensity_71_BBF0C34F49AC61126FEFAE95A41CCCE8) == 0x000010, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::SecondFogDensity_71_BBF0C34F49AC61126FEFAE95A41CCCE8' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, SecondFogHeightFalloff_73_877C1B53482C4965001F7AB643270293) == 0x000018, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::SecondFogHeightFalloff_73_877C1B53482C4965001F7AB643270293' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, SecondFogHeightOffset_77_FB8D625F42DC444A9DF199B90D4EE20F) == 0x000020, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::SecondFogHeightOffset_77_FB8D625F42DC444A9DF199B90D4EE20F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, FogInscatteringColor_130_52B08CE347852E13D2DE29A8DFB39168) == 0x000028, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::FogInscatteringColor_130_52B08CE347852E13D2DE29A8DFB39168' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, SkyAtmosphereAmbientContributionColorScale_124_5979034C4086DC33D980F7803C633378) == 0x000038, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::SkyAtmosphereAmbientContributionColorScale_124_5979034C4086DC33D980F7803C633378' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, FogMaxOpacity_82_FC4873B54FD3AB750836FD9D6F5C9990) == 0x000048, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::FogMaxOpacity_82_FC4873B54FD3AB750836FD9D6F5C9990' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, StartDistance_84_652BDDF24B840F5A2636CDA8CA4EA6A7) == 0x000050, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::StartDistance_84_652BDDF24B840F5A2636CDA8CA4EA6A7' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, FogCutoffDistance_86_14F95A4A47196A891421AF9DA1881BF5) == 0x000058, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::FogCutoffDistance_86_14F95A4A47196A891421AF9DA1881BF5' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, InscatteringColorCubemapAngle_90_7A995C9A41C146E3284E75A58A9CB024) == 0x000060, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::InscatteringColorCubemapAngle_90_7A995C9A41C146E3284E75A58A9CB024' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, InscatteringTextureTint_126_852DED374BE7A3A4A3DF24A21206B0D1) == 0x000068, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::InscatteringTextureTint_126_852DED374BE7A3A4A3DF24A21206B0D1' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, FullyDirectionalInscatteringColorDistance_94_057202624513843994118AAAC1AD1269) == 0x000078, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::FullyDirectionalInscatteringColorDistance_94_057202624513843994118AAAC1AD1269' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, NonDirectionalInscatteringColorDistance_96_209665CB4F01248D95887D9AADC2E3AD) == 0x000080, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::NonDirectionalInscatteringColorDistance_96_209665CB4F01248D95887D9AADC2E3AD' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, DirectionalInscatteringExponent_98_E19F455F417C98FC4C7473942582EFF8) == 0x000088, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::DirectionalInscatteringExponent_98_E19F455F417C98FC4C7473942582EFF8' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, DirectionalInscatteringStartDistance_100_788535774F5CDD1B4214D1B3B39218B1) == 0x000090, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::DirectionalInscatteringStartDistance_100_788535774F5CDD1B4214D1B3B39218B1' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, DirectionalInscatteringColor_127_370DCBF348BFE8466C62C7868B57EC70) == 0x000098, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::DirectionalInscatteringColor_127_370DCBF348BFE8466C62C7868B57EC70' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, VolumetricScatteringDistribution_108_872257F64ADBC9F73925F5991E6481A0) == 0x0000A8, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::VolumetricScatteringDistribution_108_872257F64ADBC9F73925F5991E6481A0' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, VolumetricAlbedo_128_CA61D7BD48292B31308C10ACE077E5CE) == 0x0000B0, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::VolumetricAlbedo_128_CA61D7BD48292B31308C10ACE077E5CE' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, VolumetricEmissive_129_09844BE54CCF296DF8CC64ADACBF25C4) == 0x0000C0, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::VolumetricEmissive_129_09844BE54CCF296DF8CC64ADACBF25C4' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, VolumetricExtinctionScale_113_E1152C1549FC48BAF613A2BCF0C404AE) == 0x0000D0, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::VolumetricExtinctionScale_113_E1152C1549FC48BAF613A2BCF0C404AE' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, VolumetricViewDistance_115_9109C1E04A9E98C6E1C3E2AD66EC7F35) == 0x0000D8, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::VolumetricViewDistance_115_9109C1E04A9E98C6E1C3E2AD66EC7F35' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, VolumetricStartDistance_118_ADD8FEE24F6F312AF76780889F7A9C67) == 0x0000E0, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::VolumetricStartDistance_118_ADD8FEE24F6F312AF76780889F7A9C67' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, NearFadeInDistance_119_185D574D49572A51A022E68E1EF70515) == 0x0000E8, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::NearFadeInDistance_119_185D574D49572A51A022E68E1EF70515' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog, StaticLightingScatteringIntensity_123_B6E8B69E4C400B0A53A01FB846492E34) == 0x0000F0, "Member 'FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog::StaticLightingScatteringIntensity_123_B6E8B69E4C400B0A53A01FB846492E34' has a wrong offset!");

}

