#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_GlobalAtmosphereOutput_Moon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_GlobalAtmosphereOutput_Moon.STRUCT_GlobalAtmosphereOutput_Moon
// 0x0088 (0x0088 - 0x0000)
struct FSTRUCT_GlobalAtmosphereOutput_Moon final
{
public:
	double                                        MoonIntensity_17_2F5BD1C34E3CECF851C4438FCB5B951B; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MoonLightColor_30_052850EE45E49E0D8A1A4D83AE2110AA; // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MoonSourceAngle_21_1FC79C60412EE66FAE772C86A86A3B73; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MoonTemperature_23_04F0B1D54079C51188B813A102551F1B; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MoonVolumetricScattering_25_9AA8C5B44F9CC89383E8F991D818160E; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MoonSpecularScale_27_296D4DD14A72626793E5BF8CA0C8EE85; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MoonSoftSourceAngle_33_1D7394494826148691AF528D1FB07C38; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonEnableLightShaftOcclusion_43_E99362104FD8D5A06ADCE18BCC6F21F5; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MoonOcclusionDepthRange_57_1261928246EDF1014157BB83804A965D; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MoonOcclusionMaskDarkness_56_0A0C0D3C4695ECA0EA5168B074EAE704; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoonLightShaftBloom_46_D5FB0B734C3E49A9F137388B3E219BD9; // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MoonLightShaftBloomScale_55_1875A718403C5F761867889862F1A2D8; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MoonBloomThreshold_54_3C027A7A41CE051872FE17B0E2B5BAC8; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MoonBloomMaxBrightness_53_01C2ED744088DB4EFFD53E8005AC16A8; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MoonBloomTint_52_AF94C17C4E23A507697AA0AC44EA83EB; // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_GlobalAtmosphereOutput_Moon) == 0x000008, "Wrong alignment on FSTRUCT_GlobalAtmosphereOutput_Moon");
static_assert(sizeof(FSTRUCT_GlobalAtmosphereOutput_Moon) == 0x000088, "Wrong size on FSTRUCT_GlobalAtmosphereOutput_Moon");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonIntensity_17_2F5BD1C34E3CECF851C4438FCB5B951B) == 0x000000, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonIntensity_17_2F5BD1C34E3CECF851C4438FCB5B951B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonLightColor_30_052850EE45E49E0D8A1A4D83AE2110AA) == 0x000008, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonLightColor_30_052850EE45E49E0D8A1A4D83AE2110AA' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonSourceAngle_21_1FC79C60412EE66FAE772C86A86A3B73) == 0x000018, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonSourceAngle_21_1FC79C60412EE66FAE772C86A86A3B73' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonTemperature_23_04F0B1D54079C51188B813A102551F1B) == 0x000020, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonTemperature_23_04F0B1D54079C51188B813A102551F1B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonVolumetricScattering_25_9AA8C5B44F9CC89383E8F991D818160E) == 0x000028, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonVolumetricScattering_25_9AA8C5B44F9CC89383E8F991D818160E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonSpecularScale_27_296D4DD14A72626793E5BF8CA0C8EE85) == 0x000030, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonSpecularScale_27_296D4DD14A72626793E5BF8CA0C8EE85' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonSoftSourceAngle_33_1D7394494826148691AF528D1FB07C38) == 0x000038, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonSoftSourceAngle_33_1D7394494826148691AF528D1FB07C38' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonEnableLightShaftOcclusion_43_E99362104FD8D5A06ADCE18BCC6F21F5) == 0x000040, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonEnableLightShaftOcclusion_43_E99362104FD8D5A06ADCE18BCC6F21F5' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonOcclusionDepthRange_57_1261928246EDF1014157BB83804A965D) == 0x000048, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonOcclusionDepthRange_57_1261928246EDF1014157BB83804A965D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonOcclusionMaskDarkness_56_0A0C0D3C4695ECA0EA5168B074EAE704) == 0x000050, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonOcclusionMaskDarkness_56_0A0C0D3C4695ECA0EA5168B074EAE704' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonLightShaftBloom_46_D5FB0B734C3E49A9F137388B3E219BD9) == 0x000058, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonLightShaftBloom_46_D5FB0B734C3E49A9F137388B3E219BD9' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonLightShaftBloomScale_55_1875A718403C5F761867889862F1A2D8) == 0x000060, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonLightShaftBloomScale_55_1875A718403C5F761867889862F1A2D8' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonBloomThreshold_54_3C027A7A41CE051872FE17B0E2B5BAC8) == 0x000068, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonBloomThreshold_54_3C027A7A41CE051872FE17B0E2B5BAC8' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonBloomMaxBrightness_53_01C2ED744088DB4EFFD53E8005AC16A8) == 0x000070, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonBloomMaxBrightness_53_01C2ED744088DB4EFFD53E8005AC16A8' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_Moon, MoonBloomTint_52_AF94C17C4E23A507697AA0AC44EA83EB) == 0x000078, "Member 'FSTRUCT_GlobalAtmosphereOutput_Moon::MoonBloomTint_52_AF94C17C4E23A507697AA0AC44EA83EB' has a wrong offset!");

}

