#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_GlobalAtmosphereOutput_SkyAtmosphere

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_GlobalAtmosphereOutput_SkyAtmosphere.STRUCT_GlobalAtmosphereOutput_SkyAtmosphere
// 0x0090 (0x0090 - 0x0000)
struct FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere final
{
public:
	double                                        RayleighScatteringScale_34_6F6B915842C1CBB13028DCBD307E9F37; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RayleighScatteringColor_35_5C63A4424DC686D3950409A4A512EF71; // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RayleighExponentialDistribution_37_8672401542559E62E15947B3D37DACDF; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MieScatteringScale_38_A56CDAE74014094917C2C6B7FCEC38E2; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MieScatteringColor_54_610A082D4D1996BE5C78A3A19FEBDCB0; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MieAbsorptionScale_40_D90F093847D2E141CC5E7B9701AA394E; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MieAbsorptionColor_62_7F3FF0A049D0D04E2ED4069AC0B6260F; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MieAnisotropy_41_29847E5B417DCBEC22E7E89FC3B839C5; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MieExponentialDistribution_56_567DEFDE499E47DB4ED7FE8722B770EE; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AbsorptionScale_57_8E08B4534CE8B40D28DB15854EB5A290; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AbsorptionColor_53_41A3DF2E44D3BAF93BCBAC811F199666; // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SkyLuminanceFactor_55_C3BE65FA4F3B37AED337638BEEC45552; // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HeightFogContribution_58_7C25C7964E6597013CFFBEA07133EC0D; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere) == 0x000008, "Wrong alignment on FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere");
static_assert(sizeof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere) == 0x000090, "Wrong size on FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, RayleighScatteringScale_34_6F6B915842C1CBB13028DCBD307E9F37) == 0x000000, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::RayleighScatteringScale_34_6F6B915842C1CBB13028DCBD307E9F37' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, RayleighScatteringColor_35_5C63A4424DC686D3950409A4A512EF71) == 0x000008, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::RayleighScatteringColor_35_5C63A4424DC686D3950409A4A512EF71' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, RayleighExponentialDistribution_37_8672401542559E62E15947B3D37DACDF) == 0x000018, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::RayleighExponentialDistribution_37_8672401542559E62E15947B3D37DACDF' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, MieScatteringScale_38_A56CDAE74014094917C2C6B7FCEC38E2) == 0x000020, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::MieScatteringScale_38_A56CDAE74014094917C2C6B7FCEC38E2' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, MieScatteringColor_54_610A082D4D1996BE5C78A3A19FEBDCB0) == 0x000028, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::MieScatteringColor_54_610A082D4D1996BE5C78A3A19FEBDCB0' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, MieAbsorptionScale_40_D90F093847D2E141CC5E7B9701AA394E) == 0x000038, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::MieAbsorptionScale_40_D90F093847D2E141CC5E7B9701AA394E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, MieAbsorptionColor_62_7F3FF0A049D0D04E2ED4069AC0B6260F) == 0x000040, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::MieAbsorptionColor_62_7F3FF0A049D0D04E2ED4069AC0B6260F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, MieAnisotropy_41_29847E5B417DCBEC22E7E89FC3B839C5) == 0x000050, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::MieAnisotropy_41_29847E5B417DCBEC22E7E89FC3B839C5' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, MieExponentialDistribution_56_567DEFDE499E47DB4ED7FE8722B770EE) == 0x000058, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::MieExponentialDistribution_56_567DEFDE499E47DB4ED7FE8722B770EE' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, AbsorptionScale_57_8E08B4534CE8B40D28DB15854EB5A290) == 0x000060, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::AbsorptionScale_57_8E08B4534CE8B40D28DB15854EB5A290' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, AbsorptionColor_53_41A3DF2E44D3BAF93BCBAC811F199666) == 0x000068, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::AbsorptionColor_53_41A3DF2E44D3BAF93BCBAC811F199666' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, SkyLuminanceFactor_55_C3BE65FA4F3B37AED337638BEEC45552) == 0x000078, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::SkyLuminanceFactor_55_C3BE65FA4F3B37AED337638BEEC45552' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere, HeightFogContribution_58_7C25C7964E6597013CFFBEA07133EC0D) == 0x000088, "Member 'FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere::HeightFogContribution_58_7C25C7964E6597013CFFBEA07133EC0D' has a wrong offset!");

}

