#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_GlobalAtmosphereOutput

#include "Basic.hpp"

#include "STRUCT_GlobalAtmosphereOutput_Sun_structs.hpp"
#include "STRUCT_GlobalAtmosphereOutput_Moon_structs.hpp"
#include "STRUCT_GlobalAtmosphereOutput_Skylight_structs.hpp"
#include "STRUCT_GlobalAtmosphereOutput_SkyAtmosphere_structs.hpp"
#include "STRUCT_GlobalAtmosphereOutput_ExponentialHeightFog_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_GlobalAtmosphereOutput.STRUCT_GlobalAtmosphereOutput
// 0x02E0 (0x02E0 - 0x0000)
struct FSTRUCT_GlobalAtmosphereOutput final
{
public:
	struct FSTRUCT_GlobalAtmosphereOutput_Sun     SunStructure_33_6F6B915842C1CBB13028DCBD307E9F37;  // 0x0000(0x0088)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalAtmosphereOutput_Moon    MoonStructure_34_296D4DD14A72626793E5BF8CA0C8EE85; // 0x0088(0x0088)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalAtmosphereOutput_Skylight SkylightStructure_37_4D94141E410853A1589F449B91D1F0AD; // 0x0110(0x0048)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalAtmosphereOutput_SkyAtmosphere SkyAtmosphere_42_042A095645A8FF309F188EB7DA7F607C; // 0x0158(0x0090)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_GlobalAtmosphereOutput_ExponentialHeightFog ExponentialHeightFogStructure_46_E9D8E63444465AD3FE693B9D328E7A63; // 0x01E8(0x00F8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_GlobalAtmosphereOutput) == 0x000008, "Wrong alignment on FSTRUCT_GlobalAtmosphereOutput");
static_assert(sizeof(FSTRUCT_GlobalAtmosphereOutput) == 0x0002E0, "Wrong size on FSTRUCT_GlobalAtmosphereOutput");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput, SunStructure_33_6F6B915842C1CBB13028DCBD307E9F37) == 0x000000, "Member 'FSTRUCT_GlobalAtmosphereOutput::SunStructure_33_6F6B915842C1CBB13028DCBD307E9F37' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput, MoonStructure_34_296D4DD14A72626793E5BF8CA0C8EE85) == 0x000088, "Member 'FSTRUCT_GlobalAtmosphereOutput::MoonStructure_34_296D4DD14A72626793E5BF8CA0C8EE85' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput, SkylightStructure_37_4D94141E410853A1589F449B91D1F0AD) == 0x000110, "Member 'FSTRUCT_GlobalAtmosphereOutput::SkylightStructure_37_4D94141E410853A1589F449B91D1F0AD' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput, SkyAtmosphere_42_042A095645A8FF309F188EB7DA7F607C) == 0x000158, "Member 'FSTRUCT_GlobalAtmosphereOutput::SkyAtmosphere_42_042A095645A8FF309F188EB7DA7F607C' has a wrong offset!");
static_assert(offsetof(FSTRUCT_GlobalAtmosphereOutput, ExponentialHeightFogStructure_46_E9D8E63444465AD3FE693B9D328E7A63) == 0x0001E8, "Member 'FSTRUCT_GlobalAtmosphereOutput::ExponentialHeightFogStructure_46_E9D8E63444465AD3FE693B9D328E7A63' has a wrong offset!");

}

