#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_SingularClimateData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_SingularClimateData.STRUCT_SingularClimateData
// 0x0030 (0x0030 - 0x0000)
struct FSTRUCT_SingularClimateData final
{
public:
	double                                        DegreesHigh_4_7F6758CA46FA570E1B9659B2F4991825;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DegreesLow_5_B7EEB5D14AC145EA04E4EBA518410B98;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Precipitation_7_F8324633470113F78AD6A89BEED4BA28;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SunshineHours_10_209A69224B88416726E664AB4035659D; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RainDays_12_E5FA16CA4A32435E93207A9AB7DB588F;      // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChanceOfRain_15_AE3F9A3A4C46C605CC6F63B592EE2600;  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Humidity_18_236CE0E74D8A0EBFA1315C9DCDC32556;      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_SingularClimateData) == 0x000008, "Wrong alignment on FSTRUCT_SingularClimateData");
static_assert(sizeof(FSTRUCT_SingularClimateData) == 0x000030, "Wrong size on FSTRUCT_SingularClimateData");
static_assert(offsetof(FSTRUCT_SingularClimateData, DegreesHigh_4_7F6758CA46FA570E1B9659B2F4991825) == 0x000000, "Member 'FSTRUCT_SingularClimateData::DegreesHigh_4_7F6758CA46FA570E1B9659B2F4991825' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SingularClimateData, DegreesLow_5_B7EEB5D14AC145EA04E4EBA518410B98) == 0x000008, "Member 'FSTRUCT_SingularClimateData::DegreesLow_5_B7EEB5D14AC145EA04E4EBA518410B98' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SingularClimateData, Precipitation_7_F8324633470113F78AD6A89BEED4BA28) == 0x000010, "Member 'FSTRUCT_SingularClimateData::Precipitation_7_F8324633470113F78AD6A89BEED4BA28' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SingularClimateData, SunshineHours_10_209A69224B88416726E664AB4035659D) == 0x000018, "Member 'FSTRUCT_SingularClimateData::SunshineHours_10_209A69224B88416726E664AB4035659D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SingularClimateData, RainDays_12_E5FA16CA4A32435E93207A9AB7DB588F) == 0x00001C, "Member 'FSTRUCT_SingularClimateData::RainDays_12_E5FA16CA4A32435E93207A9AB7DB588F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SingularClimateData, ChanceOfRain_15_AE3F9A3A4C46C605CC6F63B592EE2600) == 0x000020, "Member 'FSTRUCT_SingularClimateData::ChanceOfRain_15_AE3F9A3A4C46C605CC6F63B592EE2600' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SingularClimateData, Humidity_18_236CE0E74D8A0EBFA1315C9DCDC32556) == 0x000028, "Member 'FSTRUCT_SingularClimateData::Humidity_18_236CE0E74D8A0EBFA1315C9DCDC32556' has a wrong offset!");

}

