#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_ColorGrade

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_ColorGrade.STRUCT_ColorGrade
// 0x02A0 (0x02A0 - 0x0000)
struct FSTRUCT_ColorGrade final
{
public:
	struct FColorGradingSettings                  ColorGrading_13_544C1D9549FCA0526737BCB411FDAB80;  // 0x0000(0x0290)(Edit, BlueprintVisible, NoDestructor)
	double                                        ExposureComp_22_D3B0ED7F42BA0AF667E945993C3530B1;  // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_25_D1A9A08A4B9FB36A057235B48BACED17;          // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_ColorGrade) == 0x000010, "Wrong alignment on FSTRUCT_ColorGrade");
static_assert(sizeof(FSTRUCT_ColorGrade) == 0x0002A0, "Wrong size on FSTRUCT_ColorGrade");
static_assert(offsetof(FSTRUCT_ColorGrade, ColorGrading_13_544C1D9549FCA0526737BCB411FDAB80) == 0x000000, "Member 'FSTRUCT_ColorGrade::ColorGrading_13_544C1D9549FCA0526737BCB411FDAB80' has a wrong offset!");
static_assert(offsetof(FSTRUCT_ColorGrade, ExposureComp_22_D3B0ED7F42BA0AF667E945993C3530B1) == 0x000290, "Member 'FSTRUCT_ColorGrade::ExposureComp_22_D3B0ED7F42BA0AF667E945993C3530B1' has a wrong offset!");
static_assert(offsetof(FSTRUCT_ColorGrade, Temp_25_D1A9A08A4B9FB36A057235B48BACED17) == 0x000298, "Member 'FSTRUCT_ColorGrade::Temp_25_D1A9A08A4B9FB36A057235B48BACED17' has a wrong offset!");

}

