#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GenerateFloat

#include "Basic.hpp"

#include "STT_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "DesignDataPlugin_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_GenerateFloat.STT_GenerateFloat_C
// 0x0068 (0x00E0 - 0x0078)
class USTT_GenerateFloat_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABaseCharacter*                         Context;                                           // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FAoCExpression                         Value_Expr;                                        // 0x0088(0x0050)(Edit, BlueprintVisible)
	double                                        Value;                                             // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_GenerateFloat(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_GenerateFloat_C">();
	}
	static class USTT_GenerateFloat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_GenerateFloat_C>();
	}
};
static_assert(alignof(USTT_GenerateFloat_C) == 0x000008, "Wrong alignment on USTT_GenerateFloat_C");
static_assert(sizeof(USTT_GenerateFloat_C) == 0x0000E0, "Wrong size on USTT_GenerateFloat_C");
static_assert(offsetof(USTT_GenerateFloat_C, UberGraphFrame) == 0x000078, "Member 'USTT_GenerateFloat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_GenerateFloat_C, Context) == 0x000080, "Member 'USTT_GenerateFloat_C::Context' has a wrong offset!");
static_assert(offsetof(USTT_GenerateFloat_C, Value_Expr) == 0x000088, "Member 'USTT_GenerateFloat_C::Value_Expr' has a wrong offset!");
static_assert(offsetof(USTT_GenerateFloat_C, Value) == 0x0000D8, "Member 'USTT_GenerateFloat_C::Value' has a wrong offset!");

}

