#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_MoveForward

#include "Basic.hpp"

#include "DesignDataPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "STT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_MoveForward.STT_MoveForward_C
// 0x0118 (0x0190 - 0x0078)
class USTT_MoveForward_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAoCExpression                         Speed_Multiplier;                                  // 0x0080(0x0050)(Edit, BlueprintVisible)
	double                                        Deviation_Angle_Limit;                             // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAoCExpression                         Duration;                                          // 0x00D8(0x0050)(Edit, BlueprintVisible)
	double                                        BlockFailureTime;                                  // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPCPawn_C*                             Agent;                                             // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Speed_Multiplier_Value;                            // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OriginalSpeed;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MoveVector;                                        // 0x0148(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AdjustedMoveVector;                                // 0x0160(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Duration_Value;                                    // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Timer;                                             // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlockFailureTimer;                                 // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AdjustDirectionByNav(const struct FVector& Original_Direction, double Length, struct FVector* AdjustedDirection, bool* Valid, struct FVector* ProjectedLocation);
	void ExecuteUbergraph_STT_MoveForward(int32 EntryPoint);
	void Get_Character_Closest_Nav_Location(class ABaseCharacter* Agent_0, struct FVector* Location);
	void GetAngleBetweenVectors(const struct FVector& v1, const struct FVector& v2, double* Angle);
	void ReceiveExitState(const struct FStateTreeTransitionResult& Transition);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);
	void ReceiveLatentTick(const float DeltaTime);
	void RotateToTarget(const struct FVector& TargetVec, class AActor* Source, double YawDelta);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_MoveForward_C">();
	}
	static class USTT_MoveForward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_MoveForward_C>();
	}
};
static_assert(alignof(USTT_MoveForward_C) == 0x000008, "Wrong alignment on USTT_MoveForward_C");
static_assert(sizeof(USTT_MoveForward_C) == 0x000190, "Wrong size on USTT_MoveForward_C");
static_assert(offsetof(USTT_MoveForward_C, UberGraphFrame) == 0x000078, "Member 'USTT_MoveForward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_MoveForward_C, Speed_Multiplier) == 0x000080, "Member 'USTT_MoveForward_C::Speed_Multiplier' has a wrong offset!");
static_assert(offsetof(USTT_MoveForward_C, Deviation_Angle_Limit) == 0x0000D0, "Member 'USTT_MoveForward_C::Deviation_Angle_Limit' has a wrong offset!");
static_assert(offsetof(USTT_MoveForward_C, Duration) == 0x0000D8, "Member 'USTT_MoveForward_C::Duration' has a wrong offset!");
static_assert(offsetof(USTT_MoveForward_C, BlockFailureTime) == 0x000128, "Member 'USTT_MoveForward_C::BlockFailureTime' has a wrong offset!");
static_assert(offsetof(USTT_MoveForward_C, Agent) == 0x000130, "Member 'USTT_MoveForward_C::Agent' has a wrong offset!");
static_assert(offsetof(USTT_MoveForward_C, Speed_Multiplier_Value) == 0x000138, "Member 'USTT_MoveForward_C::Speed_Multiplier_Value' has a wrong offset!");
static_assert(offsetof(USTT_MoveForward_C, OriginalSpeed) == 0x000140, "Member 'USTT_MoveForward_C::OriginalSpeed' has a wrong offset!");
static_assert(offsetof(USTT_MoveForward_C, MoveVector) == 0x000148, "Member 'USTT_MoveForward_C::MoveVector' has a wrong offset!");
static_assert(offsetof(USTT_MoveForward_C, AdjustedMoveVector) == 0x000160, "Member 'USTT_MoveForward_C::AdjustedMoveVector' has a wrong offset!");
static_assert(offsetof(USTT_MoveForward_C, Duration_Value) == 0x000178, "Member 'USTT_MoveForward_C::Duration_Value' has a wrong offset!");
static_assert(offsetof(USTT_MoveForward_C, Timer) == 0x000180, "Member 'USTT_MoveForward_C::Timer' has a wrong offset!");
static_assert(offsetof(USTT_MoveForward_C, BlockFailureTimer) == 0x000188, "Member 'USTT_MoveForward_C::BlockFailureTimer' has a wrong offset!");

}

