#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_FindAmbientAnimMontageByString

#include "Basic.hpp"

#include "STT_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_FindAmbientAnimMontageByString.STT_FindAmbientAnimMontageByString_C
// 0x0028 (0x00A0 - 0x0078)
class USTT_FindAmbientAnimMontageByString_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          FoundMontage;                                      // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ChosenAnimTag;                                     // 0x0084(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StringTag;                                         // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_FindAmbientAnimMontageByString(int32 EntryPoint);
	void HasValidAmbientAnimation(bool* FoundMontage_0);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_FindAmbientAnimMontageByString_C">();
	}
	static class USTT_FindAmbientAnimMontageByString_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_FindAmbientAnimMontageByString_C>();
	}
};
static_assert(alignof(USTT_FindAmbientAnimMontageByString_C) == 0x000008, "Wrong alignment on USTT_FindAmbientAnimMontageByString_C");
static_assert(sizeof(USTT_FindAmbientAnimMontageByString_C) == 0x0000A0, "Wrong size on USTT_FindAmbientAnimMontageByString_C");
static_assert(offsetof(USTT_FindAmbientAnimMontageByString_C, UberGraphFrame) == 0x000078, "Member 'USTT_FindAmbientAnimMontageByString_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_FindAmbientAnimMontageByString_C, FoundMontage) == 0x000080, "Member 'USTT_FindAmbientAnimMontageByString_C::FoundMontage' has a wrong offset!");
static_assert(offsetof(USTT_FindAmbientAnimMontageByString_C, ChosenAnimTag) == 0x000084, "Member 'USTT_FindAmbientAnimMontageByString_C::ChosenAnimTag' has a wrong offset!");
static_assert(offsetof(USTT_FindAmbientAnimMontageByString_C, StringTag) == 0x000090, "Member 'USTT_FindAmbientAnimMontageByString_C::StringTag' has a wrong offset!");

}

