#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_ReleaseInteractableObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_ReleaseInteractableObject.STT_ReleaseInteractableObject_C
// 0x0018 (0x0090 - 0x0078)
class USTT_ReleaseInteractableObject_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 InteractableActor;                                 // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractionPointIndex;                             // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);
	void ExecuteUbergraph_STT_ReleaseInteractableObject(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_ReleaseInteractableObject_C">();
	}
	static class USTT_ReleaseInteractableObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_ReleaseInteractableObject_C>();
	}
};
static_assert(alignof(USTT_ReleaseInteractableObject_C) == 0x000008, "Wrong alignment on USTT_ReleaseInteractableObject_C");
static_assert(sizeof(USTT_ReleaseInteractableObject_C) == 0x000090, "Wrong size on USTT_ReleaseInteractableObject_C");
static_assert(offsetof(USTT_ReleaseInteractableObject_C, UberGraphFrame) == 0x000078, "Member 'USTT_ReleaseInteractableObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_ReleaseInteractableObject_C, InteractableActor) == 0x000080, "Member 'USTT_ReleaseInteractableObject_C::InteractableActor' has a wrong offset!");
static_assert(offsetof(USTT_ReleaseInteractableObject_C, InteractionPointIndex) == 0x000088, "Member 'USTT_ReleaseInteractableObject_C::InteractionPointIndex' has a wrong offset!");

}

