#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_SetNPCLifespan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_SetNPCLifespan.STT_SetNPCLifespan_C
// 0x0018 (0x0090 - 0x0078)
class USTT_SetNPCLifespan_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANPCCharacter*                          Target;                                            // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        LifespanRemaining;                                 // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_SetNPCLifespan(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_SetNPCLifespan_C">();
	}
	static class USTT_SetNPCLifespan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_SetNPCLifespan_C>();
	}
};
static_assert(alignof(USTT_SetNPCLifespan_C) == 0x000008, "Wrong alignment on USTT_SetNPCLifespan_C");
static_assert(sizeof(USTT_SetNPCLifespan_C) == 0x000090, "Wrong size on USTT_SetNPCLifespan_C");
static_assert(offsetof(USTT_SetNPCLifespan_C, UberGraphFrame) == 0x000078, "Member 'USTT_SetNPCLifespan_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_SetNPCLifespan_C, Target) == 0x000080, "Member 'USTT_SetNPCLifespan_C::Target' has a wrong offset!");
static_assert(offsetof(USTT_SetNPCLifespan_C, LifespanRemaining) == 0x000088, "Member 'USTT_SetNPCLifespan_C::LifespanRemaining' has a wrong offset!");

}

