#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GetRandomLocationInRadius

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STT_GetRandomLocationInRadius.STT_GetRandomLocationInRadius_C.ExecuteUbergraph_STT_GetRandomLocationInRadius
// 0x0068 (0x0068 - 0x0000)
struct STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius) == 0x000008, "Wrong alignment on STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius");
static_assert(sizeof(STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius) == 0x000068, "Wrong size on STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius");
static_assert(offsetof(STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius, EntryPoint) == 0x000000, "Member 'STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius, K2Node_Event_Transition) == 0x000004, "Member 'STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x000050, "Member 'STT_GetRandomLocationInRadius_C_ExecuteUbergraph_STT_GetRandomLocationInRadius::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");

// Function STT_GetRandomLocationInRadius.STT_GetRandomLocationInRadius_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_GetRandomLocationInRadius_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_GetRandomLocationInRadius_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_GetRandomLocationInRadius_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_GetRandomLocationInRadius_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_GetRandomLocationInRadius_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_GetRandomLocationInRadius_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_GetRandomLocationInRadius_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

