#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GetRandomLocationAroundTarget

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STT_GetRandomLocationAroundTarget.STT_GetRandomLocationAroundTarget_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_GetRandomLocationAroundTarget_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_GetRandomLocationAroundTarget_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_GetRandomLocationAroundTarget_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_GetRandomLocationAroundTarget_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_GetRandomLocationAroundTarget_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_GetRandomLocationAroundTarget_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

// Function STT_GetRandomLocationAroundTarget.STT_GetRandomLocationAroundTarget_C.ExecuteUbergraph_STT_GetRandomLocationAroundTarget
// 0x0138 (0x0138 - 0x0000)
struct STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0010(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget) == 0x000008, "Wrong alignment on STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget");
static_assert(sizeof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget) == 0x000138, "Wrong size on STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, EntryPoint) == 0x000000, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, K2Node_Event_Transition) == 0x000010, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000040, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_GetBlackboard_ReturnValue) == 0x000058, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_RandomRotator_ReturnValue) == 0x000060, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_GetValueAsObject_ReturnValue) == 0x000078, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_BreakRotator_Roll) == 0x000080, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_BreakRotator_Pitch) == 0x000084, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_BreakRotator_Yaw) == 0x000088, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, K2Node_DynamicCast_AsActor) == 0x000090, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_MakeRotator_ReturnValue) == 0x0000A0, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0000B8, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000D0, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E8, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_Add_VectorVector_ReturnValue) == 0x000100, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000118, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x000130, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget, CallFunc_IsValid_ReturnValue) == 0x000131, "Member 'STT_GetRandomLocationAroundTarget_C_ExecuteUbergraph_STT_GetRandomLocationAroundTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

