#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GetPerceivedCharacterByActorTag

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function STT_GetPerceivedCharacterByActorTag.STT_GetPerceivedCharacterByActorTag_C.ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag
// 0x0034 (0x0034 - 0x0000)
struct STT_GetPerceivedCharacterByActorTag_C_ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x1];                                        // 0x0005(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0006(0x002E)(ConstParm, NoDestructor)
};
static_assert(alignof(STT_GetPerceivedCharacterByActorTag_C_ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag) == 0x000004, "Wrong alignment on STT_GetPerceivedCharacterByActorTag_C_ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag");
static_assert(sizeof(STT_GetPerceivedCharacterByActorTag_C_ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag) == 0x000034, "Wrong size on STT_GetPerceivedCharacterByActorTag_C_ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag, EntryPoint) == 0x000000, "Member 'STT_GetPerceivedCharacterByActorTag_C_ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'STT_GetPerceivedCharacterByActorTag_C_ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag, K2Node_Event_Transition) == 0x000006, "Member 'STT_GetPerceivedCharacterByActorTag_C_ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag::K2Node_Event_Transition' has a wrong offset!");

// Function STT_GetPerceivedCharacterByActorTag.STT_GetPerceivedCharacterByActorTag_C.FindCharacterWithActorTag
// 0x00E0 (0x00E0 - 0x0000)
struct STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag final
{
public:
	float                                         TempDist;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ClosestDistance;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         ClosestCharacter;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class ABaseCharacter*>                 PotentialCharacters;                               // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class UAIIntelligenceComponent*               IntComponent;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIIntelligenceComponent*               CallFunc_GetIntelligenceComponent_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGuid>                          CallFunc_GetPerceivedActorGuids_ReturnValue;       // 0x0058(0x0010)(ReferenceParm)
	struct FGuid                                  CallFunc_Array_Get_Item;                           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPCCharacter*                          K2Node_DynamicCast_AsNPCCharacter;                 // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         CallFunc_GetBaseCharacterFromGuid_ReturnValue;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_ClosestDistance_ImplicitCast;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag) == 0x000008, "Wrong alignment on STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag");
static_assert(sizeof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag) == 0x0000E0, "Wrong size on STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, TempDist) == 0x000000, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::TempDist' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, ClosestDistance) == 0x000008, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::ClosestDistance' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, ClosestCharacter) == 0x000010, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::ClosestCharacter' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, PotentialCharacters) == 0x000018, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::PotentialCharacters' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, IntComponent) == 0x000028, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::IntComponent' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, Temp_int_Array_Index_Variable) == 0x000038, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, Temp_int_Array_Index_Variable_1) == 0x00003C, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_GetIntelligenceComponent_ReturnValue) == 0x000048, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_GetIntelligenceComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000050, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000051, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_BooleanOR_ReturnValue) == 0x000052, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_GetPerceivedActorGuids_ReturnValue) == 0x000058, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_GetPerceivedActorGuids_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Array_Get_Item) == 0x000068, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_GetOuterObject_ReturnValue) == 0x000078, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, Temp_int_Loop_Counter_Variable_1) == 0x000094, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, K2Node_DynamicCast_AsNPCCharacter) == 0x000098, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::K2Node_DynamicCast_AsNPCCharacter' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A1, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A4, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x0000A8, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000A9, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_BooleanOR_ReturnValue_1) == 0x0000AA, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_GetDistanceTo_ReturnValue) == 0x0000AC, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_GetBaseCharacterFromGuid_ReturnValue) == 0x0000B0, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_GetBaseCharacterFromGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000B8, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Array_Length_ReturnValue_2) == 0x0000BC, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Array_AddUnique_ReturnValue) == 0x0000C0, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C4, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_BooleanAND_ReturnValue) == 0x0000C5, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Array_Contains_ReturnValue) == 0x0000C6, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_IsValid_ReturnValue_1) == 0x0000C7, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x0000C8, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000D0, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag, K2Node_VariableSet_ClosestDistance_ImplicitCast) == 0x0000D8, "Member 'STT_GetPerceivedCharacterByActorTag_C_FindCharacterWithActorTag::K2Node_VariableSet_ClosestDistance_ImplicitCast' has a wrong offset!");

// Function STT_GetPerceivedCharacterByActorTag.STT_GetPerceivedCharacterByActorTag_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_GetPerceivedCharacterByActorTag_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_GetPerceivedCharacterByActorTag_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_GetPerceivedCharacterByActorTag_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_GetPerceivedCharacterByActorTag_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_GetPerceivedCharacterByActorTag_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_GetPerceivedCharacterByActorTag_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_GetPerceivedCharacterByActorTag_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

