#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_TraceForWallOrCliff

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function STT_TraceForWallOrCliff.STT_TraceForWallOrCliff_C.ExecuteUbergraph_STT_TraceForWallOrCliff
// 0x0308 (0x0308 - 0x0000)
struct STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0048(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0134(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0150(0x0010)(ConstParm, ReferenceParm)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0160(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x0210(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff) == 0x000008, "Wrong alignment on STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff");
static_assert(sizeof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff) == 0x000308, "Wrong size on STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, EntryPoint) == 0x000000, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, Temp_object_Variable) == 0x000008, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000030, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000048, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000130, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_Not_PreBool_ReturnValue) == 0x000131, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, K2Node_Event_DeltaTime) == 0x000134, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000138, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000140, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_BooleanAND_ReturnValue) == 0x000148, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, Temp_object_Variable_1) == 0x000150, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, K2Node_Event_Transition) == 0x000160, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000190, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_GetActorForwardVector_ReturnValue) == 0x000198, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_MakeVector_ReturnValue_1) == 0x0001B0, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001C8, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0001E0, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_Add_VectorVector_ReturnValue) == 0x0001F8, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_LineTraceSingleForObjects_OutHit_1) == 0x000210, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_LineTraceSingleForObjects_OutHit_1' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_LineTraceSingleForObjects_ReturnValue_1) == 0x0002F8, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_LineTraceSingleForObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000300, "Member 'STT_TraceForWallOrCliff_C_ExecuteUbergraph_STT_TraceForWallOrCliff::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function STT_TraceForWallOrCliff.STT_TraceForWallOrCliff_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_TraceForWallOrCliff_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_TraceForWallOrCliff_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_TraceForWallOrCliff_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_TraceForWallOrCliff_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_TraceForWallOrCliff_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_TraceForWallOrCliff_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

// Function STT_TraceForWallOrCliff.STT_TraceForWallOrCliff_C.ReceiveLatentTick
// 0x0004 (0x0004 - 0x0000)
struct STT_TraceForWallOrCliff_C_ReceiveLatentTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_TraceForWallOrCliff_C_ReceiveLatentTick) == 0x000004, "Wrong alignment on STT_TraceForWallOrCliff_C_ReceiveLatentTick");
static_assert(sizeof(STT_TraceForWallOrCliff_C_ReceiveLatentTick) == 0x000004, "Wrong size on STT_TraceForWallOrCliff_C_ReceiveLatentTick");
static_assert(offsetof(STT_TraceForWallOrCliff_C_ReceiveLatentTick, DeltaTime) == 0x000000, "Member 'STT_TraceForWallOrCliff_C_ReceiveLatentTick::DeltaTime' has a wrong offset!");

}

