#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_SetCharacterInteracting

#include "Basic.hpp"

#include "STT_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_SetCharacterInteracting.STT_SetCharacterInteracting_C
// 0x0018 (0x0090 - 0x0078)
class USTT_SetCharacterInteracting_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABaseCharacter*                         Agent;                                             // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInteract;                                       // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInteracting;                                     // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_SetCharacterInteracting(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_SetCharacterInteracting_C">();
	}
	static class USTT_SetCharacterInteracting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_SetCharacterInteracting_C>();
	}
};
static_assert(alignof(USTT_SetCharacterInteracting_C) == 0x000008, "Wrong alignment on USTT_SetCharacterInteracting_C");
static_assert(sizeof(USTT_SetCharacterInteracting_C) == 0x000090, "Wrong size on USTT_SetCharacterInteracting_C");
static_assert(offsetof(USTT_SetCharacterInteracting_C, UberGraphFrame) == 0x000078, "Member 'USTT_SetCharacterInteracting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_SetCharacterInteracting_C, Agent) == 0x000080, "Member 'USTT_SetCharacterInteracting_C::Agent' has a wrong offset!");
static_assert(offsetof(USTT_SetCharacterInteracting_C, CanInteract) == 0x000088, "Member 'USTT_SetCharacterInteracting_C::CanInteract' has a wrong offset!");
static_assert(offsetof(USTT_SetCharacterInteracting_C, IsInteracting) == 0x000089, "Member 'USTT_SetCharacterInteracting_C::IsInteracting' has a wrong offset!");

}

