#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GetBBBool

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_GetBBBool.STT_GetBBBool_C
// 0x0020 (0x0098 - 0x0078)
class USTT_GetBBBool_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Target;                                            // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FName                                   Variable_Name;                                     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Output;                                            // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_GetBBBool(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_GetBBBool_C">();
	}
	static class USTT_GetBBBool_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_GetBBBool_C>();
	}
};
static_assert(alignof(USTT_GetBBBool_C) == 0x000008, "Wrong alignment on USTT_GetBBBool_C");
static_assert(sizeof(USTT_GetBBBool_C) == 0x000098, "Wrong size on USTT_GetBBBool_C");
static_assert(offsetof(USTT_GetBBBool_C, UberGraphFrame) == 0x000078, "Member 'USTT_GetBBBool_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_GetBBBool_C, Target) == 0x000080, "Member 'USTT_GetBBBool_C::Target' has a wrong offset!");
static_assert(offsetof(USTT_GetBBBool_C, Variable_Name) == 0x000088, "Member 'USTT_GetBBBool_C::Variable_Name' has a wrong offset!");
static_assert(offsetof(USTT_GetBBBool_C, Output) == 0x000090, "Member 'USTT_GetBBBool_C::Output' has a wrong offset!");

}

