#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_FindInteractableObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_FindInteractableObject.STT_FindInteractableObject_C
// 0x0098 (0x0110 - 0x0078)
class USTT_FindInteractableObject_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTransform                             OutputTransform;                                   // 0x0080(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundInteractable;                                 // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InteractionPointIndex;                             // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Tags;                                              // 0x00E8(0x0010)(Edit, BlueprintVisible)
	bool                                          LookAtObject;                                      // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 FoundInteractableActor;                            // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   ChosenActorTag;                                    // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveLatentTick(const float DeltaTime);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);
	void ExecuteUbergraph_STT_FindInteractableObject(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_FindInteractableObject_C">();
	}
	static class USTT_FindInteractableObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_FindInteractableObject_C>();
	}
};
static_assert(alignof(USTT_FindInteractableObject_C) == 0x000010, "Wrong alignment on USTT_FindInteractableObject_C");
static_assert(sizeof(USTT_FindInteractableObject_C) == 0x000110, "Wrong size on USTT_FindInteractableObject_C");
static_assert(offsetof(USTT_FindInteractableObject_C, UberGraphFrame) == 0x000078, "Member 'USTT_FindInteractableObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_FindInteractableObject_C, OutputTransform) == 0x000080, "Member 'USTT_FindInteractableObject_C::OutputTransform' has a wrong offset!");
static_assert(offsetof(USTT_FindInteractableObject_C, FoundInteractable) == 0x0000E0, "Member 'USTT_FindInteractableObject_C::FoundInteractable' has a wrong offset!");
static_assert(offsetof(USTT_FindInteractableObject_C, InteractionPointIndex) == 0x0000E4, "Member 'USTT_FindInteractableObject_C::InteractionPointIndex' has a wrong offset!");
static_assert(offsetof(USTT_FindInteractableObject_C, Tags) == 0x0000E8, "Member 'USTT_FindInteractableObject_C::Tags' has a wrong offset!");
static_assert(offsetof(USTT_FindInteractableObject_C, LookAtObject) == 0x0000F8, "Member 'USTT_FindInteractableObject_C::LookAtObject' has a wrong offset!");
static_assert(offsetof(USTT_FindInteractableObject_C, FoundInteractableActor) == 0x000100, "Member 'USTT_FindInteractableObject_C::FoundInteractableActor' has a wrong offset!");
static_assert(offsetof(USTT_FindInteractableObject_C, ChosenActorTag) == 0x000108, "Member 'USTT_FindInteractableObject_C::ChosenActorTag' has a wrong offset!");

}

