#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GenerateRandomFloatInRange

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function STT_GenerateRandomFloatInRange.STT_GenerateRandomFloatInRange_C.ExecuteUbergraph_STT_GenerateRandomFloatInRange
// 0x0040 (0x0040 - 0x0000)
struct STT_GenerateRandomFloatInRange_C_ExecuteUbergraph_STT_GenerateRandomFloatInRange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_GenerateRandomFloatInRange_C_ExecuteUbergraph_STT_GenerateRandomFloatInRange) == 0x000008, "Wrong alignment on STT_GenerateRandomFloatInRange_C_ExecuteUbergraph_STT_GenerateRandomFloatInRange");
static_assert(sizeof(STT_GenerateRandomFloatInRange_C_ExecuteUbergraph_STT_GenerateRandomFloatInRange) == 0x000040, "Wrong size on STT_GenerateRandomFloatInRange_C_ExecuteUbergraph_STT_GenerateRandomFloatInRange");
static_assert(offsetof(STT_GenerateRandomFloatInRange_C_ExecuteUbergraph_STT_GenerateRandomFloatInRange, EntryPoint) == 0x000000, "Member 'STT_GenerateRandomFloatInRange_C_ExecuteUbergraph_STT_GenerateRandomFloatInRange::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_GenerateRandomFloatInRange_C_ExecuteUbergraph_STT_GenerateRandomFloatInRange, K2Node_Event_Transition) == 0x000004, "Member 'STT_GenerateRandomFloatInRange_C_ExecuteUbergraph_STT_GenerateRandomFloatInRange::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_GenerateRandomFloatInRange_C_ExecuteUbergraph_STT_GenerateRandomFloatInRange, CallFunc_RandomFloatInRange_ReturnValue) == 0x000038, "Member 'STT_GenerateRandomFloatInRange_C_ExecuteUbergraph_STT_GenerateRandomFloatInRange::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

// Function STT_GenerateRandomFloatInRange.STT_GenerateRandomFloatInRange_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_GenerateRandomFloatInRange_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_GenerateRandomFloatInRange_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_GenerateRandomFloatInRange_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_GenerateRandomFloatInRange_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_GenerateRandomFloatInRange_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_GenerateRandomFloatInRange_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_GenerateRandomFloatInRange_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

