#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_FindAmbientAnimMontageByString

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function STT_FindAmbientAnimMontageByString.STT_FindAmbientAnimMontageByString_C.ExecuteUbergraph_STT_FindAmbientAnimMontageByString
// 0x0038 (0x0038 - 0x0000)
struct STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidAmbientAnimation_FoundMontage;    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString) == 0x000004, "Wrong alignment on STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString");
static_assert(sizeof(STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString) == 0x000038, "Wrong size on STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString, EntryPoint) == 0x000000, "Member 'STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString, K2Node_Event_Transition) == 0x000004, "Member 'STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString, CallFunc_IsEmpty_ReturnValue) == 0x000032, "Member 'STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString, CallFunc_Not_PreBool_ReturnValue) == 0x000033, "Member 'STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString, CallFunc_HasValidAmbientAnimation_FoundMontage) == 0x000034, "Member 'STT_FindAmbientAnimMontageByString_C_ExecuteUbergraph_STT_FindAmbientAnimMontageByString::CallFunc_HasValidAmbientAnimation_FoundMontage' has a wrong offset!");

// Function STT_FindAmbientAnimMontageByString.STT_FindAmbientAnimMontageByString_C.HasValidAmbientAnimation
// 0x0088 (0x0088 - 0x0000)
struct STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation final
{
public:
	bool                                          FoundMontage_0;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           FoundAnims;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANPCCharacter*                          K2Node_DynamicCast_AsNPCCharacter;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation) == 0x000008, "Wrong alignment on STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation");
static_assert(sizeof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation) == 0x000088, "Wrong size on STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, FoundMontage_0) == 0x000000, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::FoundMontage_0' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, FoundAnims) == 0x000008, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::FoundAnims' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, Temp_int_Array_Index_Variable) == 0x000018, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_RandomInteger_ReturnValue) == 0x00002C, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_GetOuterObject_ReturnValue) == 0x000030, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, K2Node_DynamicCast_AsNPCCharacter) == 0x000038, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::K2Node_DynamicCast_AsNPCCharacter' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_Map_Keys_Keys) == 0x000048, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_Array_Get_Item) == 0x00005C, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_Array_AddUnique_ReturnValue) == 0x000068, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_Conv_NameToString_ReturnValue) == 0x000070, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_FindSubstring_ReturnValue) == 0x000080, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000084, "Member 'STT_FindAmbientAnimMontageByString_C_HasValidAmbientAnimation::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function STT_FindAmbientAnimMontageByString.STT_FindAmbientAnimMontageByString_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_FindAmbientAnimMontageByString_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_FindAmbientAnimMontageByString_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_FindAmbientAnimMontageByString_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_FindAmbientAnimMontageByString_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_FindAmbientAnimMontageByString_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_FindAmbientAnimMontageByString_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_FindAmbientAnimMontageByString_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

