#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_MoveToLocation

#include "Basic.hpp"

#include "STT_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "EAIMovementOrientation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DesignDataPlugin_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_MoveToLocation.STT_MoveToLocation_C
// 0x0120 (0x0198 - 0x0078)
class USTT_MoveToLocation_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAoCExpression                         Location_Expression;                               // 0x0080(0x0050)(Edit, BlueprintVisible)
	struct FVector                                Location;                                          // 0x00D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAoCExpression                         Speed_Multiplier;                                  // 0x00E8(0x0050)(Edit, BlueprintVisible)
	EAIMovementOrientation                        OrientationScheme;                                 // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Arrival_Distance;                                  // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Consider_Pawn_Radius;                              // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FailTime;                                          // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPCPawn_C*                             Agent;                                             // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Speed_Multiplier_Value;                            // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RealArrivalDistance;                               // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OriginalSpeed;                                     // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Stored_Location;                                   // 0x0178(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Failure_Timer;                                     // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_MoveToLocation(int32 EntryPoint);
	void ReceiveExitState(const struct FStateTreeTransitionResult& Transition);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);
	void ReceiveLatentTick(const float DeltaTime);
	void RotateToTarget(const struct FVector& TargetVec, class AActor* Source, double YawDelta);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_MoveToLocation_C">();
	}
	static class USTT_MoveToLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_MoveToLocation_C>();
	}
};
static_assert(alignof(USTT_MoveToLocation_C) == 0x000008, "Wrong alignment on USTT_MoveToLocation_C");
static_assert(sizeof(USTT_MoveToLocation_C) == 0x000198, "Wrong size on USTT_MoveToLocation_C");
static_assert(offsetof(USTT_MoveToLocation_C, UberGraphFrame) == 0x000078, "Member 'USTT_MoveToLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, Location_Expression) == 0x000080, "Member 'USTT_MoveToLocation_C::Location_Expression' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, Location) == 0x0000D0, "Member 'USTT_MoveToLocation_C::Location' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, Speed_Multiplier) == 0x0000E8, "Member 'USTT_MoveToLocation_C::Speed_Multiplier' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, OrientationScheme) == 0x000138, "Member 'USTT_MoveToLocation_C::OrientationScheme' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, Arrival_Distance) == 0x000140, "Member 'USTT_MoveToLocation_C::Arrival_Distance' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, Consider_Pawn_Radius) == 0x000148, "Member 'USTT_MoveToLocation_C::Consider_Pawn_Radius' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, FailTime) == 0x000150, "Member 'USTT_MoveToLocation_C::FailTime' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, Agent) == 0x000158, "Member 'USTT_MoveToLocation_C::Agent' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, Speed_Multiplier_Value) == 0x000160, "Member 'USTT_MoveToLocation_C::Speed_Multiplier_Value' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, RealArrivalDistance) == 0x000168, "Member 'USTT_MoveToLocation_C::RealArrivalDistance' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, OriginalSpeed) == 0x000170, "Member 'USTT_MoveToLocation_C::OriginalSpeed' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, Stored_Location) == 0x000178, "Member 'USTT_MoveToLocation_C::Stored_Location' has a wrong offset!");
static_assert(offsetof(USTT_MoveToLocation_C, Failure_Timer) == 0x000190, "Member 'USTT_MoveToLocation_C::Failure_Timer' has a wrong offset!");

}

