#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GenerateFloat

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function STT_GenerateFloat.STT_GenerateFloat_C.ExecuteUbergraph_STT_GenerateFloat
// 0x0108 (0x0108 - 0x0000)
struct STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExprValue                             CallFunc_EvaluateExpression_ReturnValue;           // 0x0038(0x00C8)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat) == 0x000008, "Wrong alignment on STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat");
static_assert(sizeof(STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat) == 0x000108, "Wrong size on STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat");
static_assert(offsetof(STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat, EntryPoint) == 0x000000, "Member 'STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat, K2Node_Event_Transition) == 0x000004, "Member 'STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat, CallFunc_EvaluateExpression_ReturnValue) == 0x000038, "Member 'STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat::CallFunc_EvaluateExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000100, "Member 'STT_GenerateFloat_C_ExecuteUbergraph_STT_GenerateFloat::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function STT_GenerateFloat.STT_GenerateFloat_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_GenerateFloat_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_GenerateFloat_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_GenerateFloat_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_GenerateFloat_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_GenerateFloat_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_GenerateFloat_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_GenerateFloat_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

