#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_ReleaseInteractableObject

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function STT_ReleaseInteractableObject.STT_ReleaseInteractableObject_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_ReleaseInteractableObject_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_ReleaseInteractableObject_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_ReleaseInteractableObject_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_ReleaseInteractableObject_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_ReleaseInteractableObject_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_ReleaseInteractableObject_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_ReleaseInteractableObject_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

// Function STT_ReleaseInteractableObject.STT_ReleaseInteractableObject_C.ExecuteUbergraph_STT_ReleaseInteractableObject
// 0x0048 (0x0048 - 0x0000)
struct STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNPCPropInteractionComponent_C*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject) == 0x000008, "Wrong alignment on STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject");
static_assert(sizeof(STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject) == 0x000048, "Wrong size on STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject");
static_assert(offsetof(STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject, EntryPoint) == 0x000000, "Member 'STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject, K2Node_Event_Transition) == 0x000004, "Member 'STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject, CallFunc_IsValid_ReturnValue) == 0x000032, "Member 'STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'STT_ReleaseInteractableObject_C_ExecuteUbergraph_STT_ReleaseInteractableObject::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

