#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_HideCharacterMesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_HideCharacterMesh.STT_HideCharacterMesh_C
// 0x0020 (0x0098 - 0x0078)
class USTT_HideCharacterMesh_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Agent;                                             // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          bHide;                                             // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);
	void ExecuteUbergraph_STT_HideCharacterMesh(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_HideCharacterMesh_C">();
	}
	static class USTT_HideCharacterMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_HideCharacterMesh_C>();
	}
};
static_assert(alignof(USTT_HideCharacterMesh_C) == 0x000008, "Wrong alignment on USTT_HideCharacterMesh_C");
static_assert(sizeof(USTT_HideCharacterMesh_C) == 0x000098, "Wrong size on USTT_HideCharacterMesh_C");
static_assert(offsetof(USTT_HideCharacterMesh_C, UberGraphFrame) == 0x000078, "Member 'USTT_HideCharacterMesh_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_HideCharacterMesh_C, Agent) == 0x000080, "Member 'USTT_HideCharacterMesh_C::Agent' has a wrong offset!");
static_assert(offsetof(USTT_HideCharacterMesh_C, bHide) == 0x000088, "Member 'USTT_HideCharacterMesh_C::bHide' has a wrong offset!");
static_assert(offsetof(USTT_HideCharacterMesh_C, Mesh) == 0x000090, "Member 'USTT_HideCharacterMesh_C::Mesh' has a wrong offset!");

}

