#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_MoveForward

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function STT_MoveForward.STT_MoveForward_C.AdjustDirectionByNav
// 0x0170 (0x0170 - 0x0000)
struct STT_MoveForward_C_AdjustDirectionByNav final
{
public:
	struct FVector                                Original_Direction;                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Length;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AdjustedDirection;                                 // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ProjectedLocation;                                 // 0x0040(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetNavAgentLocation_ReturnValue;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARecastNavMesh*                         CallFunc_GetActorOfClass_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetNavAgentLocation_ReturnValue_1;        // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_MoveForward_C_AdjustDirectionByNav) == 0x000008, "Wrong alignment on STT_MoveForward_C_AdjustDirectionByNav");
static_assert(sizeof(STT_MoveForward_C_AdjustDirectionByNav) == 0x000170, "Wrong size on STT_MoveForward_C_AdjustDirectionByNav");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, Original_Direction) == 0x000000, "Member 'STT_MoveForward_C_AdjustDirectionByNav::Original_Direction' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, Length) == 0x000018, "Member 'STT_MoveForward_C_AdjustDirectionByNav::Length' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, AdjustedDirection) == 0x000020, "Member 'STT_MoveForward_C_AdjustDirectionByNav::AdjustedDirection' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, Valid) == 0x000038, "Member 'STT_MoveForward_C_AdjustDirectionByNav::Valid' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, ProjectedLocation) == 0x000040, "Member 'STT_MoveForward_C_AdjustDirectionByNav::ProjectedLocation' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000070, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_Normal_ReturnValue) == 0x000088, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000A0, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_GetNavAgentLocation_ReturnValue) == 0x0000B8, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_GetNavAgentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_GetActorOfClass_ReturnValue) == 0x0000D0, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_GetNavAgentLocation_ReturnValue_1) == 0x0000D8, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_GetNavAgentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_Add_VectorVector_ReturnValue) == 0x0000F0, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000108, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x000120, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000128, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_BreakVector_X) == 0x000140, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_BreakVector_Y) == 0x000148, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_BreakVector_Z) == 0x000150, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_AdjustDirectionByNav, CallFunc_MakeVector_ReturnValue_1) == 0x000158, "Member 'STT_MoveForward_C_AdjustDirectionByNav::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

// Function STT_MoveForward.STT_MoveForward_C.ExecuteUbergraph_STT_MoveForward
// 0x0368 (0x0368 - 0x0000)
struct STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition_1;                         // 0x0004(0x002E)(ConstParm, NoDestructor)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0032(0x002E)(ConstParm, NoDestructor)
	struct FExprValue                             CallFunc_EvaluateExpression_Source_ReturnValue;    // 0x0060(0x00C8)()
	struct FExprValue                             CallFunc_EvaluateExpression_Source_ReturnValue_1;  // 0x0128(0x00C8)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0204(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANPCPawn_C*                             K2Node_DynamicCast_AsNPCPawn;                      // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_AdjustDirectionByNav_AdjustedDirection;   // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AdjustDirectionByNav_Valid;               // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_AdjustDirectionByNav_ProjectedLocation;   // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Character_Closest_Nav_Location_Location; // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAngleBetweenVectors_Angle;             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_MaxWalkSpeed_ImplicitCast;      // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_OriginalSpeed_ImplicitCast;     // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxWalkSpeed_ImplicitCast_1;    // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward) == 0x000008, "Wrong alignment on STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward");
static_assert(sizeof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward) == 0x000368, "Wrong size on STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, EntryPoint) == 0x000000, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, K2Node_Event_Transition_1) == 0x000004, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::K2Node_Event_Transition_1' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, K2Node_Event_Transition) == 0x000032, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_EvaluateExpression_Source_ReturnValue) == 0x000060, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_EvaluateExpression_Source_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_EvaluateExpression_Source_ReturnValue_1) == 0x000128, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_EvaluateExpression_Source_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_IsValid_ReturnValue) == 0x0001F0, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0001F8, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, K2Node_SwitchEnum_CmpSuccess) == 0x000200, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, K2Node_Event_DeltaTime) == 0x000204, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_GetOuterObject_ReturnValue) == 0x000208, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, K2Node_DynamicCast_AsNPCPawn) == 0x000210, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::K2Node_DynamicCast_AsNPCPawn' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, K2Node_DynamicCast_bSuccess) == 0x000218, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000220, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000228, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Normal_ReturnValue) == 0x000230, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000248, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000249, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000250, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_BooleanAND_ReturnValue) == 0x000258, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_AdjustDirectionByNav_AdjustedDirection) == 0x000260, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_AdjustDirectionByNav_AdjustedDirection' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_AdjustDirectionByNav_Valid) == 0x000278, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_AdjustDirectionByNav_Valid' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_AdjustDirectionByNav_ProjectedLocation) == 0x000280, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_AdjustDirectionByNav_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Get_Character_Closest_Nav_Location_Location) == 0x000298, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Get_Character_Closest_Nav_Location_Location' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002B0, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0002C8, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_BreakVector_X) == 0x0002D0, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_BreakVector_Y) == 0x0002D8, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_BreakVector_Z) == 0x0002E0, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_MakeVector_ReturnValue) == 0x0002E8, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_GetAngleBetweenVectors_Angle) == 0x000300, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_GetAngleBetweenVectors_Angle' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000308, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000310, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000311, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_GetActorForwardVector_ReturnValue) == 0x000318, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_IsValid_ReturnValue_1) == 0x000330, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, K2Node_VariableSet_MaxWalkSpeed_ImplicitCast) == 0x000334, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::K2Node_VariableSet_MaxWalkSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, K2Node_VariableSet_OriginalSpeed_ImplicitCast) == 0x000338, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::K2Node_VariableSet_OriginalSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000340, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x000348, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000350, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1) == 0x000358, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward, K2Node_VariableSet_MaxWalkSpeed_ImplicitCast_1) == 0x000360, "Member 'STT_MoveForward_C_ExecuteUbergraph_STT_MoveForward::K2Node_VariableSet_MaxWalkSpeed_ImplicitCast_1' has a wrong offset!");

// Function STT_MoveForward.STT_MoveForward_C.Get Character Closest Nav Location
// 0x0078 (0x0078 - 0x0000)
struct STT_MoveForward_C_Get_Character_Closest_Nav_Location final
{
public:
	class ABaseCharacter*                         Agent_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetNavAgentLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARecastNavMesh*                         CallFunc_GetActorOfClass_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_MoveForward_C_Get_Character_Closest_Nav_Location) == 0x000008, "Wrong alignment on STT_MoveForward_C_Get_Character_Closest_Nav_Location");
static_assert(sizeof(STT_MoveForward_C_Get_Character_Closest_Nav_Location) == 0x000078, "Wrong size on STT_MoveForward_C_Get_Character_Closest_Nav_Location");
static_assert(offsetof(STT_MoveForward_C_Get_Character_Closest_Nav_Location, Agent_0) == 0x000000, "Member 'STT_MoveForward_C_Get_Character_Closest_Nav_Location::Agent_0' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_Get_Character_Closest_Nav_Location, Location) == 0x000008, "Member 'STT_MoveForward_C_Get_Character_Closest_Nav_Location::Location' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_Get_Character_Closest_Nav_Location, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'STT_MoveForward_C_Get_Character_Closest_Nav_Location::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_Get_Character_Closest_Nav_Location, CallFunc_GetNavAgentLocation_ReturnValue) == 0x000038, "Member 'STT_MoveForward_C_Get_Character_Closest_Nav_Location::CallFunc_GetNavAgentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_Get_Character_Closest_Nav_Location, CallFunc_GetActorOfClass_ReturnValue) == 0x000050, "Member 'STT_MoveForward_C_Get_Character_Closest_Nav_Location::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_Get_Character_Closest_Nav_Location, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000058, "Member 'STT_MoveForward_C_Get_Character_Closest_Nav_Location::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_Get_Character_Closest_Nav_Location, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x000070, "Member 'STT_MoveForward_C_Get_Character_Closest_Nav_Location::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");

// Function STT_MoveForward.STT_MoveForward_C.GetAngleBetweenVectors
// 0x0078 (0x0078 - 0x0000)
struct STT_MoveForward_C_GetAngleBetweenVectors final
{
public:
	struct FVector                                v1;                                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                v2;                                                // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Angle;                                             // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_MoveForward_C_GetAngleBetweenVectors) == 0x000008, "Wrong alignment on STT_MoveForward_C_GetAngleBetweenVectors");
static_assert(sizeof(STT_MoveForward_C_GetAngleBetweenVectors) == 0x000078, "Wrong size on STT_MoveForward_C_GetAngleBetweenVectors");
static_assert(offsetof(STT_MoveForward_C_GetAngleBetweenVectors, v1) == 0x000000, "Member 'STT_MoveForward_C_GetAngleBetweenVectors::v1' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_GetAngleBetweenVectors, v2) == 0x000018, "Member 'STT_MoveForward_C_GetAngleBetweenVectors::v2' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_GetAngleBetweenVectors, Angle) == 0x000030, "Member 'STT_MoveForward_C_GetAngleBetweenVectors::Angle' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_GetAngleBetweenVectors, CallFunc_Normal_ReturnValue) == 0x000038, "Member 'STT_MoveForward_C_GetAngleBetweenVectors::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_GetAngleBetweenVectors, CallFunc_Normal_ReturnValue_1) == 0x000050, "Member 'STT_MoveForward_C_GetAngleBetweenVectors::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_GetAngleBetweenVectors, CallFunc_Dot_VectorVector_ReturnValue) == 0x000068, "Member 'STT_MoveForward_C_GetAngleBetweenVectors::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_GetAngleBetweenVectors, CallFunc_DegAcos_ReturnValue) == 0x000070, "Member 'STT_MoveForward_C_GetAngleBetweenVectors::CallFunc_DegAcos_ReturnValue' has a wrong offset!");

// Function STT_MoveForward.STT_MoveForward_C.ReceiveExitState
// 0x002E (0x002E - 0x0000)
struct STT_MoveForward_C_ReceiveExitState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_MoveForward_C_ReceiveExitState) == 0x000002, "Wrong alignment on STT_MoveForward_C_ReceiveExitState");
static_assert(sizeof(STT_MoveForward_C_ReceiveExitState) == 0x00002E, "Wrong size on STT_MoveForward_C_ReceiveExitState");
static_assert(offsetof(STT_MoveForward_C_ReceiveExitState, Transition) == 0x000000, "Member 'STT_MoveForward_C_ReceiveExitState::Transition' has a wrong offset!");

// Function STT_MoveForward.STT_MoveForward_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_MoveForward_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_MoveForward_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_MoveForward_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_MoveForward_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_MoveForward_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_MoveForward_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_MoveForward_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

// Function STT_MoveForward.STT_MoveForward_C.ReceiveLatentTick
// 0x0004 (0x0004 - 0x0000)
struct STT_MoveForward_C_ReceiveLatentTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_MoveForward_C_ReceiveLatentTick) == 0x000004, "Wrong alignment on STT_MoveForward_C_ReceiveLatentTick");
static_assert(sizeof(STT_MoveForward_C_ReceiveLatentTick) == 0x000004, "Wrong size on STT_MoveForward_C_ReceiveLatentTick");
static_assert(offsetof(STT_MoveForward_C_ReceiveLatentTick, DeltaTime) == 0x000000, "Member 'STT_MoveForward_C_ReceiveLatentTick::DeltaTime' has a wrong offset!");

// Function STT_MoveForward.STT_MoveForward_C.RotateToTarget
// 0x0190 (0x0190 - 0x0000)
struct STT_MoveForward_C_RotateToTarget final
{
public:
	struct FVector                                TargetVec;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Source;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        YawDelta;                                          // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RealYawDelta;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        YawDiff;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector_X;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_MoveForward_C_RotateToTarget) == 0x000008, "Wrong alignment on STT_MoveForward_C_RotateToTarget");
static_assert(sizeof(STT_MoveForward_C_RotateToTarget) == 0x000190, "Wrong size on STT_MoveForward_C_RotateToTarget");
static_assert(offsetof(STT_MoveForward_C_RotateToTarget, TargetVec) == 0x000000, "Member 'STT_MoveForward_C_RotateToTarget::TargetVec' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_RotateToTarget, Source) == 0x000018, "Member 'STT_MoveForward_C_RotateToTarget::Source' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_RotateToTarget, YawDelta) == 0x000020, "Member 'STT_MoveForward_C_RotateToTarget::YawDelta' has a wrong offset!");
static_assert(offsetof(STT_MoveForward_C_RotateToTarget, RealYawDelta) == 0x000028, "Member 'STT_MoveForward_C_RotateToTarget::RealYawDelta' has a wrong offset!");
