#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GetIncreasingIntValueFromMissingHealth

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_GetIncreasingIntValueFromMissingHealth.STT_GetIncreasingIntValueFromMissingHealth_C
// 0x0018 (0x0090 - 0x0078)
class USTT_GetIncreasingIntValueFromMissingHealth_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABaseCharacter*                         Target;                                            // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         ValueMax;                                          // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);
	void ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_GetIncreasingIntValueFromMissingHealth_C">();
	}
	static class USTT_GetIncreasingIntValueFromMissingHealth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_GetIncreasingIntValueFromMissingHealth_C>();
	}
};
static_assert(alignof(USTT_GetIncreasingIntValueFromMissingHealth_C) == 0x000008, "Wrong alignment on USTT_GetIncreasingIntValueFromMissingHealth_C");
static_assert(sizeof(USTT_GetIncreasingIntValueFromMissingHealth_C) == 0x000090, "Wrong size on USTT_GetIncreasingIntValueFromMissingHealth_C");
static_assert(offsetof(USTT_GetIncreasingIntValueFromMissingHealth_C, UberGraphFrame) == 0x000078, "Member 'USTT_GetIncreasingIntValueFromMissingHealth_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_GetIncreasingIntValueFromMissingHealth_C, Target) == 0x000080, "Member 'USTT_GetIncreasingIntValueFromMissingHealth_C::Target' has a wrong offset!");
static_assert(offsetof(USTT_GetIncreasingIntValueFromMissingHealth_C, ValueMax) == 0x000088, "Member 'USTT_GetIncreasingIntValueFromMissingHealth_C::ValueMax' has a wrong offset!");
static_assert(offsetof(USTT_GetIncreasingIntValueFromMissingHealth_C, ReturnValue) == 0x00008C, "Member 'USTT_GetIncreasingIntValueFromMissingHealth_C::ReturnValue' has a wrong offset!");

}

