#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_RemoveLingeringZone

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function STT_RemoveLingeringZone.STT_RemoveLingeringZone_C.ExecuteUbergraph_STT_RemoveLingeringZone
// 0x03F8 (0x03F8 - 0x0000)
struct STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIIntelligenceComponent*               CallFunc_GetIntelligenceComponent_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLingeringEffectRecord                 CallFunc_GetLingeringEffectRecordById_ReturnValue; // 0x0040(0x03B8)(ConstParm)
};
static_assert(alignof(STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone) == 0x000008, "Wrong alignment on STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone");
static_assert(sizeof(STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone) == 0x0003F8, "Wrong size on STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone");
static_assert(offsetof(STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone, EntryPoint) == 0x000000, "Member 'STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone, K2Node_Event_Transition) == 0x000004, "Member 'STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone, CallFunc_IsValid_ReturnValue) == 0x000032, "Member 'STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone, CallFunc_GetIntelligenceComponent_ReturnValue) == 0x000038, "Member 'STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone::CallFunc_GetIntelligenceComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone, CallFunc_GetLingeringEffectRecordById_ReturnValue) == 0x000040, "Member 'STT_RemoveLingeringZone_C_ExecuteUbergraph_STT_RemoveLingeringZone::CallFunc_GetLingeringEffectRecordById_ReturnValue' has a wrong offset!");

// Function STT_RemoveLingeringZone.STT_RemoveLingeringZone_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_RemoveLingeringZone_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_RemoveLingeringZone_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_RemoveLingeringZone_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_RemoveLingeringZone_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_RemoveLingeringZone_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_RemoveLingeringZone_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_RemoveLingeringZone_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

