#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GenerateRandomFloatInRange

#include "Basic.hpp"

#include "STT_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_GenerateRandomFloatInRange.STT_GenerateRandomFloatInRange_C
// 0x0020 (0x0098 - 0x0078)
class USTT_GenerateRandomFloatInRange_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Min;                                               // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max;                                               // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Output;                                            // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_GenerateRandomFloatInRange(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_GenerateRandomFloatInRange_C">();
	}
	static class USTT_GenerateRandomFloatInRange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_GenerateRandomFloatInRange_C>();
	}
};
static_assert(alignof(USTT_GenerateRandomFloatInRange_C) == 0x000008, "Wrong alignment on USTT_GenerateRandomFloatInRange_C");
static_assert(sizeof(USTT_GenerateRandomFloatInRange_C) == 0x000098, "Wrong size on USTT_GenerateRandomFloatInRange_C");
static_assert(offsetof(USTT_GenerateRandomFloatInRange_C, UberGraphFrame) == 0x000078, "Member 'USTT_GenerateRandomFloatInRange_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_GenerateRandomFloatInRange_C, Min) == 0x000080, "Member 'USTT_GenerateRandomFloatInRange_C::Min' has a wrong offset!");
static_assert(offsetof(USTT_GenerateRandomFloatInRange_C, Max) == 0x000088, "Member 'USTT_GenerateRandomFloatInRange_C::Max' has a wrong offset!");
static_assert(offsetof(USTT_GenerateRandomFloatInRange_C, Output) == 0x000090, "Member 'USTT_GenerateRandomFloatInRange_C::Output' has a wrong offset!");

}

