#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_SetBBVector

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function STT_SetBBVector.STT_SetBBVector_C.ExecuteUbergraph_STT_SetBBVector
// 0x0130 (0x0130 - 0x0000)
struct STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExprValue                             CallFunc_EvaluateExpression_SourceTarget_ReturnValue; // 0x0050(0x00C8)()
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_2;              // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector) == 0x000008, "Wrong alignment on STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector");
static_assert(sizeof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector) == 0x000130, "Wrong size on STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector");
static_assert(offsetof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector, EntryPoint) == 0x000000, "Member 'STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector, K2Node_Event_Transition) == 0x000004, "Member 'STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector, CallFunc_GetBlackboard_ReturnValue) == 0x000038, "Member 'STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector, CallFunc_MakeLiteralByte_ReturnValue) == 0x000041, "Member 'STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000044, "Member 'STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector, CallFunc_Conv_IntToByte_ReturnValue) == 0x000048, "Member 'STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector, CallFunc_EvaluateExpression_SourceTarget_ReturnValue) == 0x000050, "Member 'STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector::CallFunc_EvaluateExpression_SourceTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector, CallFunc_GetBlackboard_ReturnValue_1) == 0x000118, "Member 'STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000120, "Member 'STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector, CallFunc_GetBlackboard_ReturnValue_2) == 0x000128, "Member 'STT_SetBBVector_C_ExecuteUbergraph_STT_SetBBVector::CallFunc_GetBlackboard_ReturnValue_2' has a wrong offset!");

// Function STT_SetBBVector.STT_SetBBVector_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_SetBBVector_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_SetBBVector_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_SetBBVector_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_SetBBVector_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_SetBBVector_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_SetBBVector_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_SetBBVector_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

