#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GetIncreasingIntValueFromMissingHealth

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function STT_GetIncreasingIntValueFromMissingHealth.STT_GetIncreasingIntValueFromMissingHealth_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_GetIncreasingIntValueFromMissingHealth_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_GetIncreasingIntValueFromMissingHealth_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_GetIncreasingIntValueFromMissingHealth_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_GetIncreasingIntValueFromMissingHealth_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_GetIncreasingIntValueFromMissingHealth_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_GetIncreasingIntValueFromMissingHealth_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_GetIncreasingIntValueFromMissingHealth_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

// Function STT_GetIncreasingIntValueFromMissingHealth.STT_GetIncreasingIntValueFromMissingHealth_C.ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth
// 0x0060 (0x0060 - 0x0000)
struct STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthPercent_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth) == 0x000008, "Wrong alignment on STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth");
static_assert(sizeof(STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth) == 0x000060, "Wrong size on STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth");
static_assert(offsetof(STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth, EntryPoint) == 0x000000, "Member 'STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth, K2Node_Event_Transition) == 0x000004, "Member 'STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth, CallFunc_GetHealthPercent_ReturnValue) == 0x000034, "Member 'STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth::CallFunc_GetHealthPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth, CallFunc_FTrunc_ReturnValue) == 0x000050, "Member 'STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'STT_GetIncreasingIntValueFromMissingHealth_C_ExecuteUbergraph_STT_GetIncreasingIntValueFromMissingHealth::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

