#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_FindPairedInteractNPC

#include "Basic.hpp"

#include "STT_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_FindPairedInteractNPC.STT_FindPairedInteractNPC_C
// 0x0020 (0x0098 - 0x0078)
class USTT_FindPairedInteractNPC_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABaseCharacter*                         Agent;                                             // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ANPCCharacter*                          FoundCharacter;                                    // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   PairedInteractionTag;                              // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_FindPairedInteractNPC(int32 EntryPoint);
	void FindInteractableCharacterWithTag();
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_FindPairedInteractNPC_C">();
	}
	static class USTT_FindPairedInteractNPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_FindPairedInteractNPC_C>();
	}
};
static_assert(alignof(USTT_FindPairedInteractNPC_C) == 0x000008, "Wrong alignment on USTT_FindPairedInteractNPC_C");
static_assert(sizeof(USTT_FindPairedInteractNPC_C) == 0x000098, "Wrong size on USTT_FindPairedInteractNPC_C");
static_assert(offsetof(USTT_FindPairedInteractNPC_C, UberGraphFrame) == 0x000078, "Member 'USTT_FindPairedInteractNPC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_FindPairedInteractNPC_C, Agent) == 0x000080, "Member 'USTT_FindPairedInteractNPC_C::Agent' has a wrong offset!");
static_assert(offsetof(USTT_FindPairedInteractNPC_C, FoundCharacter) == 0x000088, "Member 'USTT_FindPairedInteractNPC_C::FoundCharacter' has a wrong offset!");
static_assert(offsetof(USTT_FindPairedInteractNPC_C, PairedInteractionTag) == 0x000090, "Member 'USTT_FindPairedInteractNPC_C::PairedInteractionTag' has a wrong offset!");

}

