#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_ElderDragon_Fire_SetAirBreathStrategy

#include "Basic.hpp"

#include "STT_Base_classes.hpp"
#include "EElderDragon_Fire_AirBehaviorStrategy_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_ElderDragon_Fire_SetAirBreathStrategy.STT_ElderDragon_Fire_SetAirBreathStrategy_C
// 0x0020 (0x0098 - 0x0078)
class USTT_ElderDragon_Fire_SetAirBreathStrategy_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AElderDragon_Fire_C*                    Agent;                                             // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	EElderDragon_Fire_AirBehaviorStrategy         Strategy;                                          // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BB_Storage;                                        // 0x008C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_ElderDragon_Fire_SetAirBreathStrategy(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_ElderDragon_Fire_SetAirBreathStrategy_C">();
	}
	static class USTT_ElderDragon_Fire_SetAirBreathStrategy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_ElderDragon_Fire_SetAirBreathStrategy_C>();
	}
};
static_assert(alignof(USTT_ElderDragon_Fire_SetAirBreathStrategy_C) == 0x000008, "Wrong alignment on USTT_ElderDragon_Fire_SetAirBreathStrategy_C");
static_assert(sizeof(USTT_ElderDragon_Fire_SetAirBreathStrategy_C) == 0x000098, "Wrong size on USTT_ElderDragon_Fire_SetAirBreathStrategy_C");
static_assert(offsetof(USTT_ElderDragon_Fire_SetAirBreathStrategy_C, UberGraphFrame) == 0x000078, "Member 'USTT_ElderDragon_Fire_SetAirBreathStrategy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_ElderDragon_Fire_SetAirBreathStrategy_C, Agent) == 0x000080, "Member 'USTT_ElderDragon_Fire_SetAirBreathStrategy_C::Agent' has a wrong offset!");
static_assert(offsetof(USTT_ElderDragon_Fire_SetAirBreathStrategy_C, Strategy) == 0x000088, "Member 'USTT_ElderDragon_Fire_SetAirBreathStrategy_C::Strategy' has a wrong offset!");
static_assert(offsetof(USTT_ElderDragon_Fire_SetAirBreathStrategy_C, BB_Storage) == 0x00008C, "Member 'USTT_ElderDragon_Fire_SetAirBreathStrategy_C::BB_Storage' has a wrong offset!");

}

