#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GetPerceivedCharacterByActorTag

#include "Basic.hpp"

#include "STT_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_GetPerceivedCharacterByActorTag.STT_GetPerceivedCharacterByActorTag_C
// 0x0028 (0x00A0 - 0x0078)
class USTT_GetPerceivedCharacterByActorTag_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABaseCharacter*                         Agent;                                             // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ANPCCharacter*                          FoundCharacter;                                    // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   TargetActorTag;                                    // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OptionalDistance;                                  // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_GetPerceivedCharacterByActorTag(int32 EntryPoint);
	void FindCharacterWithActorTag();
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_GetPerceivedCharacterByActorTag_C">();
	}
	static class USTT_GetPerceivedCharacterByActorTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_GetPerceivedCharacterByActorTag_C>();
	}
};
static_assert(alignof(USTT_GetPerceivedCharacterByActorTag_C) == 0x000008, "Wrong alignment on USTT_GetPerceivedCharacterByActorTag_C");
static_assert(sizeof(USTT_GetPerceivedCharacterByActorTag_C) == 0x0000A0, "Wrong size on USTT_GetPerceivedCharacterByActorTag_C");
static_assert(offsetof(USTT_GetPerceivedCharacterByActorTag_C, UberGraphFrame) == 0x000078, "Member 'USTT_GetPerceivedCharacterByActorTag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_GetPerceivedCharacterByActorTag_C, Agent) == 0x000080, "Member 'USTT_GetPerceivedCharacterByActorTag_C::Agent' has a wrong offset!");
static_assert(offsetof(USTT_GetPerceivedCharacterByActorTag_C, FoundCharacter) == 0x000088, "Member 'USTT_GetPerceivedCharacterByActorTag_C::FoundCharacter' has a wrong offset!");
static_assert(offsetof(USTT_GetPerceivedCharacterByActorTag_C, TargetActorTag) == 0x000090, "Member 'USTT_GetPerceivedCharacterByActorTag_C::TargetActorTag' has a wrong offset!");
static_assert(offsetof(USTT_GetPerceivedCharacterByActorTag_C, OptionalDistance) == 0x000098, "Member 'USTT_GetPerceivedCharacterByActorTag_C::OptionalDistance' has a wrong offset!");

}

