#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_ToggleNameplate

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function STT_ToggleNameplate.STT_ToggleNameplate_C.ExecuteUbergraph_STT_ToggleNameplate
// 0x0034 (0x0034 - 0x0000)
struct STT_ToggleNameplate_C_ExecuteUbergraph_STT_ToggleNameplate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_ToggleNameplate_C_ExecuteUbergraph_STT_ToggleNameplate) == 0x000004, "Wrong alignment on STT_ToggleNameplate_C_ExecuteUbergraph_STT_ToggleNameplate");
static_assert(sizeof(STT_ToggleNameplate_C_ExecuteUbergraph_STT_ToggleNameplate) == 0x000034, "Wrong size on STT_ToggleNameplate_C_ExecuteUbergraph_STT_ToggleNameplate");
static_assert(offsetof(STT_ToggleNameplate_C_ExecuteUbergraph_STT_ToggleNameplate, EntryPoint) == 0x000000, "Member 'STT_ToggleNameplate_C_ExecuteUbergraph_STT_ToggleNameplate::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_ToggleNameplate_C_ExecuteUbergraph_STT_ToggleNameplate, K2Node_Event_Transition) == 0x000004, "Member 'STT_ToggleNameplate_C_ExecuteUbergraph_STT_ToggleNameplate::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_ToggleNameplate_C_ExecuteUbergraph_STT_ToggleNameplate, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'STT_ToggleNameplate_C_ExecuteUbergraph_STT_ToggleNameplate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function STT_ToggleNameplate.STT_ToggleNameplate_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_ToggleNameplate_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_ToggleNameplate_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_ToggleNameplate_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_ToggleNameplate_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_ToggleNameplate_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_ToggleNameplate_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_ToggleNameplate_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

