#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_Accumulator

#include "Basic.hpp"

#include "STT_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "DesignDataPlugin_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_Accumulator.STT_Accumulator_C
// 0x0080 (0x00F8 - 0x0078)
class USTT_Accumulator_C : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        CurrentValue;                                      // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetValue;                                       // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPCPawn_C*                             Agent;                                             // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FName                                   Identifier;                                        // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAoCExpression                         TargetValueExpr;                                   // 0x00A0(0x0050)(Edit, BlueprintVisible)
	bool                                          DefaultToTargetValue;                              // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReRollOnReset;                                     // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetTargetValue();
	void Reset(class FName Identifier_0);
	void ReceiveLatentTick(const float DeltaTime);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);
	void ReceiveExitState(const struct FStateTreeTransitionResult& Transition);
	void ExecuteUbergraph_STT_Accumulator(int32 EntryPoint);
	void Accumulate(double DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_Accumulator_C">();
	}
	static class USTT_Accumulator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_Accumulator_C>();
	}
};
static_assert(alignof(USTT_Accumulator_C) == 0x000008, "Wrong alignment on USTT_Accumulator_C");
static_assert(sizeof(USTT_Accumulator_C) == 0x0000F8, "Wrong size on USTT_Accumulator_C");
static_assert(offsetof(USTT_Accumulator_C, UberGraphFrame) == 0x000078, "Member 'USTT_Accumulator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_Accumulator_C, CurrentValue) == 0x000080, "Member 'USTT_Accumulator_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(USTT_Accumulator_C, TargetValue) == 0x000088, "Member 'USTT_Accumulator_C::TargetValue' has a wrong offset!");
static_assert(offsetof(USTT_Accumulator_C, Agent) == 0x000090, "Member 'USTT_Accumulator_C::Agent' has a wrong offset!");
static_assert(offsetof(USTT_Accumulator_C, Identifier) == 0x000098, "Member 'USTT_Accumulator_C::Identifier' has a wrong offset!");
static_assert(offsetof(USTT_Accumulator_C, TargetValueExpr) == 0x0000A0, "Member 'USTT_Accumulator_C::TargetValueExpr' has a wrong offset!");
static_assert(offsetof(USTT_Accumulator_C, DefaultToTargetValue) == 0x0000F0, "Member 'USTT_Accumulator_C::DefaultToTargetValue' has a wrong offset!");
static_assert(offsetof(USTT_Accumulator_C, ReRollOnReset) == 0x0000F1, "Member 'USTT_Accumulator_C::ReRollOnReset' has a wrong offset!");

}

