#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_MoveToTarget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function STT_MoveToTarget.STT_MoveToTarget_C.ExecuteUbergraph_STT_MoveToTarget
// 0x02A8 (0x02A8 - 0x0000)
struct STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition_1;                         // 0x0004(0x002E)(ConstParm, NoDestructor)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0032(0x002E)(ConstParm, NoDestructor)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingRequestResult                   CallFunc_MoveToActor_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExprValue                             CallFunc_EvaluateExpression_Source_ReturnValue;    // 0x0070(0x00C8)()
	struct FExprValue                             CallFunc_EvaluateExpression_Source_ReturnValue_1;  // 0x0138(0x00C8)()
	class ABaseCharacter*                         CallFunc_FindCharacter_ReturnValue;                // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A[0x2];                                      // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x020C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue_1;            // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingRequestResult                   CallFunc_MoveToActor_ReturnValue_1;                // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxWalkSpeed_ImplicitCast;      // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MoveToActor_AcceptanceRadius_ImplicitCast; // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_OriginalSpeed_ImplicitCast;     // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MoveToActor_AcceptanceRadius_ImplicitCast_1; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxWalkSpeed_ImplicitCast_1;    // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget) == 0x000008, "Wrong alignment on STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget");
static_assert(sizeof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget) == 0x0002A8, "Wrong size on STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, EntryPoint) == 0x000000, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, K2Node_Event_Transition_1) == 0x000004, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::K2Node_Event_Transition_1' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, K2Node_Event_Transition) == 0x000032, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_GetAIController_ReturnValue) == 0x000060, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_MoveToActor_ReturnValue) == 0x000069, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_MoveToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, K2Node_SwitchEnum_CmpSuccess) == 0x00006A, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, K2Node_SwitchEnum_CmpSuccess_1) == 0x00006B, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_EvaluateExpression_Source_ReturnValue) == 0x000070, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_EvaluateExpression_Source_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_EvaluateExpression_Source_ReturnValue_1) == 0x000138, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_EvaluateExpression_Source_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_FindCharacter_ReturnValue) == 0x000200, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_FindCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_IsValid_ReturnValue_1) == 0x000208, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_IsValid_ReturnValue_2) == 0x000209, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, K2Node_Event_DeltaTime) == 0x00020C, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_GetAIController_ReturnValue_1) == 0x000210, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_GetAIController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000218, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_MakeLiteralByte_ReturnValue) == 0x000220, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000224, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_Conv_IntToByte_ReturnValue) == 0x000228, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000229, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_IsValid_ReturnValue_3) == 0x00022A, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_IsValid_ReturnValue_4) == 0x00022B, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_BooleanAND_ReturnValue) == 0x00022C, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_MoveToActor_ReturnValue_1) == 0x00022D, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_MoveToActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000230, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, K2Node_SwitchEnum_CmpSuccess_2) == 0x000248, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000250, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000258, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, K2Node_SwitchEnum_CmpSuccess_3) == 0x000270, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000278, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, K2Node_VariableSet_MaxWalkSpeed_ImplicitCast) == 0x000280, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::K2Node_VariableSet_MaxWalkSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_MoveToActor_AcceptanceRadius_ImplicitCast) == 0x000284, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_MoveToActor_AcceptanceRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, K2Node_VariableSet_OriginalSpeed_ImplicitCast) == 0x000288, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::K2Node_VariableSet_OriginalSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000290, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1) == 0x000298, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, CallFunc_MoveToActor_AcceptanceRadius_ImplicitCast_1) == 0x0002A0, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::CallFunc_MoveToActor_AcceptanceRadius_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget, K2Node_VariableSet_MaxWalkSpeed_ImplicitCast_1) == 0x0002A4, "Member 'STT_MoveToTarget_C_ExecuteUbergraph_STT_MoveToTarget::K2Node_VariableSet_MaxWalkSpeed_ImplicitCast_1' has a wrong offset!");

// Function STT_MoveToTarget.STT_MoveToTarget_C.ReceiveExitState
// 0x002E (0x002E - 0x0000)
struct STT_MoveToTarget_C_ReceiveExitState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_MoveToTarget_C_ReceiveExitState) == 0x000002, "Wrong alignment on STT_MoveToTarget_C_ReceiveExitState");
static_assert(sizeof(STT_MoveToTarget_C_ReceiveExitState) == 0x00002E, "Wrong size on STT_MoveToTarget_C_ReceiveExitState");
static_assert(offsetof(STT_MoveToTarget_C_ReceiveExitState, Transition) == 0x000000, "Member 'STT_MoveToTarget_C_ReceiveExitState::Transition' has a wrong offset!");

// Function STT_MoveToTarget.STT_MoveToTarget_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_MoveToTarget_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_MoveToTarget_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_MoveToTarget_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_MoveToTarget_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_MoveToTarget_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_MoveToTarget_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_MoveToTarget_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

// Function STT_MoveToTarget.STT_MoveToTarget_C.ReceiveLatentTick
// 0x0004 (0x0004 - 0x0000)
struct STT_MoveToTarget_C_ReceiveLatentTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_MoveToTarget_C_ReceiveLatentTick) == 0x000004, "Wrong alignment on STT_MoveToTarget_C_ReceiveLatentTick");
static_assert(sizeof(STT_MoveToTarget_C_ReceiveLatentTick) == 0x000004, "Wrong size on STT_MoveToTarget_C_ReceiveLatentTick");
static_assert(offsetof(STT_MoveToTarget_C_ReceiveLatentTick, DeltaTime) == 0x000000, "Member 'STT_MoveToTarget_C_ReceiveLatentTick::DeltaTime' has a wrong offset!");

// Function STT_MoveToTarget.STT_MoveToTarget_C.RotateToTarget
// 0x0190 (0x0190 - 0x0000)
struct STT_MoveToTarget_C_RotateToTarget final
{
public:
	struct FVector                                TargetVec;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Source;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        YawDelta;                                          // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RealYawDelta;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        YawDiff;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector_X;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_MoveToTarget_C_RotateToTarget) == 0x000008, "Wrong alignment on STT_MoveToTarget_C_RotateToTarget");
static_assert(sizeof(STT_MoveToTarget_C_RotateToTarget) == 0x000190, "Wrong size on STT_MoveToTarget_C_RotateToTarget");
static_assert(offsetof(STT_MoveToTarget_C_RotateToTarget, TargetVec) == 0x000000, "Member 'STT_MoveToTarget_C_RotateToTarget::TargetVec' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_RotateToTarget, Source) == 0x000018, "Member 'STT_MoveToTarget_C_RotateToTarget::Source' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_RotateToTarget, YawDelta) == 0x000020, "Member 'STT_MoveToTarget_C_RotateToTarget::YawDelta' has a wrong offset!");
static_assert(offsetof(STT_MoveToTarget_C_RotateToTarget, RealYawDelta) == 0x000028, "Member 'STT_MoveToTarget_C_RotateToTarget::RealYawDelta' has a wrong offset!");
