#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_Base

#include "Basic.hpp"

#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_Base.STT_Base_C
// 0x0008 (0x0078 - 0x0070)
class USTT_Base_C : public UStateTreeTaskBlueprintBase
{
public:
	bool                                          CanSucceed;                                        // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanFail;                                           // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Completed;                                         // 0x0072(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_Base_C">();
	}
	static class USTT_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_Base_C>();
	}
};
static_assert(alignof(USTT_Base_C) == 0x000008, "Wrong alignment on USTT_Base_C");
static_assert(sizeof(USTT_Base_C) == 0x000078, "Wrong size on USTT_Base_C");
static_assert(offsetof(USTT_Base_C, CanSucceed) == 0x000070, "Member 'USTT_Base_C::CanSucceed' has a wrong offset!");
static_assert(offsetof(USTT_Base_C, CanFail) == 0x000071, "Member 'USTT_Base_C::CanFail' has a wrong offset!");
static_assert(offsetof(USTT_Base_C, Completed) == 0x000072, "Member 'USTT_Base_C::Completed' has a wrong offset!");

}

