#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_ClearThreatTable

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function STT_ClearThreatTable.STT_ClearThreatTable_C.ExecuteUbergraph_STT_ClearThreatTable
// 0x0034 (0x0034 - 0x0000)
struct STT_ClearThreatTable_C_ExecuteUbergraph_STT_ClearThreatTable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
};
static_assert(alignof(STT_ClearThreatTable_C_ExecuteUbergraph_STT_ClearThreatTable) == 0x000004, "Wrong alignment on STT_ClearThreatTable_C_ExecuteUbergraph_STT_ClearThreatTable");
static_assert(sizeof(STT_ClearThreatTable_C_ExecuteUbergraph_STT_ClearThreatTable) == 0x000034, "Wrong size on STT_ClearThreatTable_C_ExecuteUbergraph_STT_ClearThreatTable");
static_assert(offsetof(STT_ClearThreatTable_C_ExecuteUbergraph_STT_ClearThreatTable, EntryPoint) == 0x000000, "Member 'STT_ClearThreatTable_C_ExecuteUbergraph_STT_ClearThreatTable::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_ClearThreatTable_C_ExecuteUbergraph_STT_ClearThreatTable, K2Node_Event_Transition) == 0x000004, "Member 'STT_ClearThreatTable_C_ExecuteUbergraph_STT_ClearThreatTable::K2Node_Event_Transition' has a wrong offset!");

// Function STT_ClearThreatTable.STT_ClearThreatTable_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_ClearThreatTable_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_ClearThreatTable_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_ClearThreatTable_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_ClearThreatTable_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_ClearThreatTable_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_ClearThreatTable_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_ClearThreatTable_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

