#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GetActorLocation

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STT_GetActorLocation.STT_GetActorLocation_C.ExecuteUbergraph_STT_GetActorLocation
// 0x0058 (0x0058 - 0x0000)
struct STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation) == 0x000008, "Wrong alignment on STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation");
static_assert(sizeof(STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation) == 0x000058, "Wrong size on STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation");
static_assert(offsetof(STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation, EntryPoint) == 0x000000, "Member 'STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation, K2Node_Event_Transition) == 0x000004, "Member 'STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'STT_GetActorLocation_C_ExecuteUbergraph_STT_GetActorLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function STT_GetActorLocation.STT_GetActorLocation_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_GetActorLocation_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_GetActorLocation_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_GetActorLocation_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_GetActorLocation_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_GetActorLocation_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_GetActorLocation_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_GetActorLocation_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

