#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_Wait

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_Wait.STT_Wait_C
// 0x0018 (0x0090 - 0x0078)
class USTT_Wait_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Duration;                                          // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Timer;                                             // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_Wait(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);
	void ReceiveLatentTick(const float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_Wait_C">();
	}
	static class USTT_Wait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_Wait_C>();
	}
};
static_assert(alignof(USTT_Wait_C) == 0x000008, "Wrong alignment on USTT_Wait_C");
static_assert(sizeof(USTT_Wait_C) == 0x000090, "Wrong size on USTT_Wait_C");
static_assert(offsetof(USTT_Wait_C, UberGraphFrame) == 0x000078, "Member 'USTT_Wait_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_Wait_C, Duration) == 0x000080, "Member 'USTT_Wait_C::Duration' has a wrong offset!");
static_assert(offsetof(USTT_Wait_C, Timer) == 0x000088, "Member 'USTT_Wait_C::Timer' has a wrong offset!");

}

