#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_RemoveEffect

#include "Basic.hpp"

#include "STT_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_RemoveEffect.STT_RemoveEffect_C
// 0x0030 (0x00A8 - 0x0078)
class USTT_RemoveEffect_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABaseCharacter*                         Target;                                            // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FEffectId                              EffectRecord;                                      // 0x0088(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         NumStacks;                                         // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_RemoveEffect(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_RemoveEffect_C">();
	}
	static class USTT_RemoveEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_RemoveEffect_C>();
	}
};
static_assert(alignof(USTT_RemoveEffect_C) == 0x000008, "Wrong alignment on USTT_RemoveEffect_C");
static_assert(sizeof(USTT_RemoveEffect_C) == 0x0000A8, "Wrong size on USTT_RemoveEffect_C");
static_assert(offsetof(USTT_RemoveEffect_C, UberGraphFrame) == 0x000078, "Member 'USTT_RemoveEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_RemoveEffect_C, Target) == 0x000080, "Member 'USTT_RemoveEffect_C::Target' has a wrong offset!");
static_assert(offsetof(USTT_RemoveEffect_C, EffectRecord) == 0x000088, "Member 'USTT_RemoveEffect_C::EffectRecord' has a wrong offset!");
static_assert(offsetof(USTT_RemoveEffect_C, NumStacks) == 0x0000A0, "Member 'USTT_RemoveEffect_C::NumStacks' has a wrong offset!");

}

