#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_FindAmbientAnimMontage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_FindAmbientAnimMontage.STT_FindAmbientAnimMontage_C
// 0x0028 (0x00A0 - 0x0078)
class USTT_FindAmbientAnimMontage_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          FoundMontage;                                      // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Tags;                                              // 0x0088(0x0010)(Edit, BlueprintVisible)
	class FName                                   ChosenAnimTag;                                     // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_FindAmbientAnimMontage(int32 EntryPoint);
	void HasValidAmbientAnimation();
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);
	void ReceiveLatentTick(const float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_FindAmbientAnimMontage_C">();
	}
	static class USTT_FindAmbientAnimMontage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_FindAmbientAnimMontage_C>();
	}
};
static_assert(alignof(USTT_FindAmbientAnimMontage_C) == 0x000008, "Wrong alignment on USTT_FindAmbientAnimMontage_C");
static_assert(sizeof(USTT_FindAmbientAnimMontage_C) == 0x0000A0, "Wrong size on USTT_FindAmbientAnimMontage_C");
static_assert(offsetof(USTT_FindAmbientAnimMontage_C, UberGraphFrame) == 0x000078, "Member 'USTT_FindAmbientAnimMontage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_FindAmbientAnimMontage_C, FoundMontage) == 0x000080, "Member 'USTT_FindAmbientAnimMontage_C::FoundMontage' has a wrong offset!");
static_assert(offsetof(USTT_FindAmbientAnimMontage_C, Tags) == 0x000088, "Member 'USTT_FindAmbientAnimMontage_C::Tags' has a wrong offset!");
static_assert(offsetof(USTT_FindAmbientAnimMontage_C, ChosenAnimTag) == 0x000098, "Member 'USTT_FindAmbientAnimMontage_C::ChosenAnimTag' has a wrong offset!");

}

