#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_ApplyEffect

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function STT_ApplyEffect.STT_ApplyEffect_C.ExecuteUbergraph_STT_ApplyEffect
// 0x07D8 (0x07D8 - 0x0000)
struct STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectRecord                          CallFunc_GetEffectRecordById_ReturnValue;          // 0x0038(0x0788)(ConstParm)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x07C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character;               // 0x07C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryApplyEffect_ReturnValue;               // 0x07D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect) == 0x000008, "Wrong alignment on STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect");
static_assert(sizeof(STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect) == 0x0007D8, "Wrong size on STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect");
static_assert(offsetof(STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect, EntryPoint) == 0x000000, "Member 'STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect, K2Node_Event_Transition) == 0x000004, "Member 'STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect, CallFunc_IsValid_ReturnValue) == 0x000032, "Member 'STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect, CallFunc_GetEffectRecordById_ReturnValue) == 0x000038, "Member 'STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect::CallFunc_GetEffectRecordById_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect, CallFunc_GetOuterObject_ReturnValue) == 0x0007C0, "Member 'STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect, K2Node_DynamicCast_AsBase_Character) == 0x0007C8, "Member 'STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect, K2Node_DynamicCast_bSuccess) == 0x0007D0, "Member 'STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect, CallFunc_TryApplyEffect_ReturnValue) == 0x0007D1, "Member 'STT_ApplyEffect_C_ExecuteUbergraph_STT_ApplyEffect::CallFunc_TryApplyEffect_ReturnValue' has a wrong offset!");

// Function STT_ApplyEffect.STT_ApplyEffect_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_ApplyEffect_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_ApplyEffect_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_ApplyEffect_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_ApplyEffect_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_ApplyEffect_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_ApplyEffect_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_ApplyEffect_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

