#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GetCeilDistance

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STT_GetCeilDistance.STT_GetCeilDistance_C.ExecuteUbergraph_STT_GetCeilDistance
// 0x0258 (0x0258 - 0x0000)
struct STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0018(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0078(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance) == 0x000008, "Wrong alignment on STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance");
static_assert(sizeof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance) == 0x000258, "Wrong size on STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, EntryPoint) == 0x000000, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, Temp_object_Variable) == 0x000008, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, K2Node_Event_Transition) == 0x000018, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_Add_VectorVector_ReturnValue) == 0x000060, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_LineTraceSingle_OutHit) == 0x000078, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_LineTraceSingle_ReturnValue) == 0x000160, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_bBlockingHit) == 0x000161, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_bInitialOverlap) == 0x000162, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_Time) == 0x000164, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_Distance) == 0x000168, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_Location) == 0x000170, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_ImpactPoint) == 0x000188, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_Normal) == 0x0001A0, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_ImpactNormal) == 0x0001B8, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_PhysMat) == 0x0001D0, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_HitActor) == 0x0001D8, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_HitComponent) == 0x0001E0, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_HitBoneName) == 0x0001E8, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_BoneName) == 0x0001F0, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_HitItem) == 0x0001F8, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_ElementIndex) == 0x0001FC, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_FaceIndex) == 0x000200, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_TraceStart) == 0x000208, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_BreakHitResult_TraceEnd) == 0x000220, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000238, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000240, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000248, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000250, "Member 'STT_GetCeilDistance_C_ExecuteUbergraph_STT_GetCeilDistance::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function STT_GetCeilDistance.STT_GetCeilDistance_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_GetCeilDistance_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_GetCeilDistance_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_GetCeilDistance_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_GetCeilDistance_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_GetCeilDistance_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_GetCeilDistance_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_GetCeilDistance_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

