#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GetRandomLocationInRadius

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_GetRandomLocationInRadius.STT_GetRandomLocationInRadius_C
// 0x0040 (0x00B8 - 0x0078)
class USTT_GetRandomLocationInRadius_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                OriginLocation;                                    // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutRandomLocation;                                 // 0x00A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_GetRandomLocationInRadius(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_GetRandomLocationInRadius_C">();
	}
	static class USTT_GetRandomLocationInRadius_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_GetRandomLocationInRadius_C>();
	}
};
static_assert(alignof(USTT_GetRandomLocationInRadius_C) == 0x000008, "Wrong alignment on USTT_GetRandomLocationInRadius_C");
static_assert(sizeof(USTT_GetRandomLocationInRadius_C) == 0x0000B8, "Wrong size on USTT_GetRandomLocationInRadius_C");
static_assert(offsetof(USTT_GetRandomLocationInRadius_C, UberGraphFrame) == 0x000078, "Member 'USTT_GetRandomLocationInRadius_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_GetRandomLocationInRadius_C, OriginLocation) == 0x000080, "Member 'USTT_GetRandomLocationInRadius_C::OriginLocation' has a wrong offset!");
static_assert(offsetof(USTT_GetRandomLocationInRadius_C, Radius) == 0x000098, "Member 'USTT_GetRandomLocationInRadius_C::Radius' has a wrong offset!");
static_assert(offsetof(USTT_GetRandomLocationInRadius_C, OutRandomLocation) == 0x0000A0, "Member 'USTT_GetRandomLocationInRadius_C::OutRandomLocation' has a wrong offset!");

}

