#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GetAmbientMontageSoftObjectPath

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STT_GetAmbientMontageSoftObjectPath.STT_GetAmbientMontageSoftObjectPath_C.ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath
// 0x0080 (0x0080 - 0x0000)
struct STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPCCharacter*                          K2Node_DynamicCast_AsNPCCharacter;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0018(0x0010)(ReferenceParm)
	class FName                                   CallFunc_KeyNameContainsMatch_SelectedName;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_Map_Find_Value;                           // 0x0030(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x1];                                       // 0x0051(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0052(0x002E)(ConstParm, NoDestructor)
};
static_assert(alignof(STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath) == 0x000008, "Wrong alignment on STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath");
static_assert(sizeof(STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath) == 0x000080, "Wrong size on STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath, EntryPoint) == 0x000000, "Member 'STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath, K2Node_DynamicCast_AsNPCCharacter) == 0x000008, "Member 'STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath::K2Node_DynamicCast_AsNPCCharacter' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath, CallFunc_Map_Keys_Keys) == 0x000018, "Member 'STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath, CallFunc_KeyNameContainsMatch_SelectedName) == 0x000028, "Member 'STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath::CallFunc_KeyNameContainsMatch_SelectedName' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath, CallFunc_Map_Find_Value) == 0x000030, "Member 'STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath, CallFunc_Map_Find_ReturnValue) == 0x000050, "Member 'STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath, K2Node_Event_Transition) == 0x000052, "Member 'STT_GetAmbientMontageSoftObjectPath_C_ExecuteUbergraph_STT_GetAmbientMontageSoftObjectPath::K2Node_Event_Transition' has a wrong offset!");

// Function STT_GetAmbientMontageSoftObjectPath.STT_GetAmbientMontageSoftObjectPath_C.KeyNameContainsMatch
// 0x0088 (0x0088 - 0x0000)
struct STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch final
{
public:
	TArray<class FName>                           NameArray;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FName                                   SelectedName;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           MatchingNameIndexes;                               // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch) == 0x000008, "Wrong alignment on STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch");
static_assert(sizeof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch) == 0x000088, "Wrong size on STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, NameArray) == 0x000000, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::NameArray' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, SelectedName) == 0x000010, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::SelectedName' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, MatchingNameIndexes) == 0x000018, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::MatchingNameIndexes' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, CallFunc_Array_Get_Item) == 0x000034, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, CallFunc_Conv_NameToString_ReturnValue) == 0x000040, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, CallFunc_Array_AddUnique_ReturnValue) == 0x00005C, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, CallFunc_RandomInteger_ReturnValue) == 0x000060, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, CallFunc_Array_Get_Item_1) == 0x000064, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000070, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch, CallFunc_Contains_ReturnValue) == 0x000080, "Member 'STT_GetAmbientMontageSoftObjectPath_C_KeyNameContainsMatch::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function STT_GetAmbientMontageSoftObjectPath.STT_GetAmbientMontageSoftObjectPath_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_GetAmbientMontageSoftObjectPath_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_GetAmbientMontageSoftObjectPath_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_GetAmbientMontageSoftObjectPath_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_GetAmbientMontageSoftObjectPath_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_GetAmbientMontageSoftObjectPath_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_GetAmbientMontageSoftObjectPath_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_GetAmbientMontageSoftObjectPath_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

