#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_FindInteractableObject

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STT_FindInteractableObject.STT_FindInteractableObject_C.ReceiveLatentTick
// 0x0004 (0x0004 - 0x0000)
struct STT_FindInteractableObject_C_ReceiveLatentTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_FindInteractableObject_C_ReceiveLatentTick) == 0x000004, "Wrong alignment on STT_FindInteractableObject_C_ReceiveLatentTick");
static_assert(sizeof(STT_FindInteractableObject_C_ReceiveLatentTick) == 0x000004, "Wrong size on STT_FindInteractableObject_C_ReceiveLatentTick");
static_assert(offsetof(STT_FindInteractableObject_C_ReceiveLatentTick, DeltaTime) == 0x000000, "Member 'STT_FindInteractableObject_C_ReceiveLatentTick::DeltaTime' has a wrong offset!");

// Function STT_FindInteractableObject.STT_FindInteractableObject_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_FindInteractableObject_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_FindInteractableObject_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_FindInteractableObject_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_FindInteractableObject_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_FindInteractableObject_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_FindInteractableObject_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_FindInteractableObject_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

// Function STT_FindInteractableObject.STT_FindInteractableObject_C.ExecuteUbergraph_STT_FindInteractableObject
// 0x0130 (0x0130 - 0x0000)
struct STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0010(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0020(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPCPawn_C*                             K2Node_DynamicCast_AsNPCPawn;                      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNPCPropInteractionComponent_C*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOpenInteractionPoint_InteractPointFound; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetOpenInteractionPoint_InteractTransform; // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOpenInteractionPoint_InteractIndex;    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x1];                                      // 0x0113(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject) == 0x000010, "Wrong alignment on STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject");
static_assert(sizeof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject) == 0x000130, "Wrong size on STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, EntryPoint) == 0x000000, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, Temp_int_Array_Index_Variable) == 0x000004, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, K2Node_Event_DeltaTime) == 0x000010, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_GetOuterObject_ReturnValue) == 0x000018, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, K2Node_Event_Transition) == 0x000020, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, K2Node_DynamicCast_AsNPCPawn) == 0x000050, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::K2Node_DynamicCast_AsNPCPawn' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Array_IsEmpty_ReturnValue) == 0x000059, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Array_Get_Item) == 0x000060, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_GetComponentByClass_ReturnValue) == 0x000068, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_GetOpenInteractionPoint_InteractPointFound) == 0x000070, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_GetOpenInteractionPoint_InteractPointFound' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_GetOpenInteractionPoint_InteractTransform) == 0x000080, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_GetOpenInteractionPoint_InteractTransform' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_GetOpenInteractionPoint_InteractIndex) == 0x0000E0, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_GetOpenInteractionPoint_InteractIndex' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_IsValid_ReturnValue) == 0x0000E4, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Array_Length_ReturnValue_1) == 0x0000EC, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Greater_IntInt_ReturnValue) == 0x0000F0, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Array_Get_Item_1) == 0x0000F4, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Array_Contains_ReturnValue) == 0x0000FC, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Array_Length_ReturnValue_2) == 0x000100, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, Temp_int_Loop_Counter_Variable) == 0x000104, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Add_IntInt_ReturnValue) == 0x00010C, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_BooleanAND_ReturnValue) == 0x000110, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000111, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Not_PreBool_ReturnValue_1) == 0x000112, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, Temp_int_Loop_Counter_Variable_1) == 0x000114, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Less_IntInt_ReturnValue_1) == 0x000118, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_Add_IntInt_ReturnValue_1) == 0x00011C, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject, CallFunc_BooleanAND_ReturnValue_1) == 0x000120, "Member 'STT_FindInteractableObject_C_ExecuteUbergraph_STT_FindInteractableObject::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

