#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_ResetAccumulator

#include "Basic.hpp"

#include "STT_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_ResetAccumulator.STT_ResetAccumulator_C
// 0x0018 (0x0090 - 0x0078)
class USTT_ResetAccumulator_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANPCPawn_C*                             Agent;                                             // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FName                                   Identifier;                                        // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);
	void ExecuteUbergraph_STT_ResetAccumulator(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_ResetAccumulator_C">();
	}
	static class USTT_ResetAccumulator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_ResetAccumulator_C>();
	}
};
static_assert(alignof(USTT_ResetAccumulator_C) == 0x000008, "Wrong alignment on USTT_ResetAccumulator_C");
static_assert(sizeof(USTT_ResetAccumulator_C) == 0x000090, "Wrong size on USTT_ResetAccumulator_C");
static_assert(offsetof(USTT_ResetAccumulator_C, UberGraphFrame) == 0x000078, "Member 'USTT_ResetAccumulator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_ResetAccumulator_C, Agent) == 0x000080, "Member 'USTT_ResetAccumulator_C::Agent' has a wrong offset!");
static_assert(offsetof(USTT_ResetAccumulator_C, Identifier) == 0x000088, "Member 'USTT_ResetAccumulator_C::Identifier' has a wrong offset!");

}

