#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_DespawnNPC

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function STT_DespawnNPC.STT_DespawnNPC_C.ExecuteUbergraph_STT_DespawnNPC
// 0x0038 (0x0038 - 0x0000)
struct STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x1];                                        // 0x0005(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0006(0x002E)(ConstParm, NoDestructor)
	float                                         CallFunc_DespawnCharacter_InRemainingLifespan_ImplicitCast; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC) == 0x000004, "Wrong alignment on STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC");
static_assert(sizeof(STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC) == 0x000038, "Wrong size on STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC");
static_assert(offsetof(STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC, EntryPoint) == 0x000000, "Member 'STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC, K2Node_Event_Transition) == 0x000006, "Member 'STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC, CallFunc_DespawnCharacter_InRemainingLifespan_ImplicitCast) == 0x000034, "Member 'STT_DespawnNPC_C_ExecuteUbergraph_STT_DespawnNPC::CallFunc_DespawnCharacter_InRemainingLifespan_ImplicitCast' has a wrong offset!");

// Function STT_DespawnNPC.STT_DespawnNPC_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_DespawnNPC_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_DespawnNPC_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_DespawnNPC_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_DespawnNPC_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_DespawnNPC_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_DespawnNPC_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_DespawnNPC_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

