#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_RotateToInteractionRotation

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function STT_RotateToInteractionRotation.STT_RotateToInteractionRotation_C.ReceiveLatentTick
// 0x0004 (0x0004 - 0x0000)
struct STT_RotateToInteractionRotation_C_ReceiveLatentTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_RotateToInteractionRotation_C_ReceiveLatentTick) == 0x000004, "Wrong alignment on STT_RotateToInteractionRotation_C_ReceiveLatentTick");
static_assert(sizeof(STT_RotateToInteractionRotation_C_ReceiveLatentTick) == 0x000004, "Wrong size on STT_RotateToInteractionRotation_C_ReceiveLatentTick");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ReceiveLatentTick, DeltaTime) == 0x000000, "Member 'STT_RotateToInteractionRotation_C_ReceiveLatentTick::DeltaTime' has a wrong offset!");

// Function STT_RotateToInteractionRotation.STT_RotateToInteractionRotation_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_RotateToInteractionRotation_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_RotateToInteractionRotation_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_RotateToInteractionRotation_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_RotateToInteractionRotation_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_RotateToInteractionRotation_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_RotateToInteractionRotation_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

// Function STT_RotateToInteractionRotation.STT_RotateToInteractionRotation_C.ExecuteUbergraph_STT_RotateToInteractionRotation
// 0x01C0 (0x01C0 - 0x0000)
struct STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0034(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FQuat                                  CallFunc_Conv_RotatorToQuaternion_ReturnValue;     // 0x0080(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  CallFunc_Conv_RotatorToQuaternion_ReturnValue_1;   // 0x00F0(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_QuatQuat_ReturnValue;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RInterpTo_InterpSpeed_ImplicitCast;       // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation) == 0x000010, "Wrong alignment on STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation");
static_assert(sizeof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation) == 0x0001C0, "Wrong size on STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, EntryPoint) == 0x000000, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, K2Node_Event_Transition) == 0x000004, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, K2Node_Event_DeltaTime) == 0x000034, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000038, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_RInterpTo_ReturnValue) == 0x000050, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000068, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_Conv_RotatorToQuaternion_ReturnValue) == 0x000080, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_Conv_RotatorToQuaternion_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000A0, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_IsValid_ReturnValue) == 0x0000A1, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_BreakTransform_Location) == 0x0000A8, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_BreakTransform_Rotation) == 0x0000C0, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_BreakTransform_Scale) == 0x0000D8, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_Conv_RotatorToQuaternion_ReturnValue_1) == 0x0000F0, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_Conv_RotatorToQuaternion_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_EqualEqual_QuatQuat_ReturnValue) == 0x000110, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_EqualEqual_QuatQuat_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_BreakTransform_Location_1) == 0x000118, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_BreakTransform_Rotation_1) == 0x000130, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_BreakTransform_Scale_1) == 0x000148, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000160, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_FindLookAtRotation_ReturnValue) == 0x000178, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_BreakRotator_Roll) == 0x000190, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_BreakRotator_Pitch) == 0x000194, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_BreakRotator_Yaw) == 0x000198, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_MakeRotator_ReturnValue) == 0x0001A0, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation, CallFunc_RInterpTo_InterpSpeed_ImplicitCast) == 0x0001B8, "Member 'STT_RotateToInteractionRotation_C_ExecuteUbergraph_STT_RotateToInteractionRotation::CallFunc_RInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");

}

