#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_AlphaWolf_ClearNonDamageHates

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function STT_AlphaWolf_ClearNonDamageHates.STT_AlphaWolf_ClearNonDamageHates_C.ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates
// 0x00F0 (0x00F0 - 0x0000)
struct STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGuid, struct FHateEntry>         CallFunc_GetHatedCharacters_ReturnValue;           // 0x0010(0x0050)()
	TArray<struct FHateEntry>                     CallFunc_Map_Values_Values;                        // 0x0060(0x0010)(ReferenceParm)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0070(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHateEntry                             CallFunc_Array_Get_Item;                           // 0x00A0(0x0014)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetCharacterGuid_ReturnValue;             // 0x00BC(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANPCPawn_C*                             K2Node_DynamicCast_AsNPCPawn;                      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetHateEntryOfCharacter_Healing_ImplicitCast; // 0x00EC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates) == 0x000008, "Wrong alignment on STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates");
static_assert(sizeof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates) == 0x0000F0, "Wrong size on STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, EntryPoint) == 0x000000, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, Temp_int_Array_Index_Variable) == 0x000004, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, CallFunc_GetHatedCharacters_ReturnValue) == 0x000010, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::CallFunc_GetHatedCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, CallFunc_Map_Values_Values) == 0x000060, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, K2Node_Event_Transition) == 0x000070, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, CallFunc_GetCharacterGuid_ReturnValue) == 0x0000BC, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::CallFunc_GetCharacterGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, CallFunc_MakeLiteralDouble_ReturnValue) == 0x0000D0, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, CallFunc_GetOuterObject_ReturnValue) == 0x0000D8, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, K2Node_DynamicCast_AsNPCPawn) == 0x0000E0, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::K2Node_DynamicCast_AsNPCPawn' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates, CallFunc_SetHateEntryOfCharacter_Healing_ImplicitCast) == 0x0000EC, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ExecuteUbergraph_STT_AlphaWolf_ClearNonDamageHates::CallFunc_SetHateEntryOfCharacter_Healing_ImplicitCast' has a wrong offset!");

// Function STT_AlphaWolf_ClearNonDamageHates.STT_AlphaWolf_ClearNonDamageHates_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_AlphaWolf_ClearNonDamageHates_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_AlphaWolf_ClearNonDamageHates_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_AlphaWolf_ClearNonDamageHates_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_AlphaWolf_ClearNonDamageHates_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_AlphaWolf_ClearNonDamageHates_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_AlphaWolf_ClearNonDamageHates_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_AlphaWolf_ClearNonDamageHates_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

