#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_GetRandomLocationAroundTarget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "STT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_GetRandomLocationAroundTarget.STT_GetRandomLocationAroundTarget_C
// 0x0060 (0x00D8 - 0x0078)
class USTT_GetRandomLocationAroundTarget_C final : public USTT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Agent;                                             // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FName                                   TargetBBKey;                                       // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinRadius;                                         // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxRadius;                                         // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutRandomLocation;                                 // 0x00A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RawLocation;                                       // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);
	void ExecuteUbergraph_STT_GetRandomLocationAroundTarget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"STT_GetRandomLocationAroundTarget_C">();
	}
	static class USTT_GetRandomLocationAroundTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_GetRandomLocationAroundTarget_C>();
	}
};
static_assert(alignof(USTT_GetRandomLocationAroundTarget_C) == 0x000008, "Wrong alignment on USTT_GetRandomLocationAroundTarget_C");
static_assert(sizeof(USTT_GetRandomLocationAroundTarget_C) == 0x0000D8, "Wrong size on USTT_GetRandomLocationAroundTarget_C");
static_assert(offsetof(USTT_GetRandomLocationAroundTarget_C, UberGraphFrame) == 0x000078, "Member 'USTT_GetRandomLocationAroundTarget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USTT_GetRandomLocationAroundTarget_C, Agent) == 0x000080, "Member 'USTT_GetRandomLocationAroundTarget_C::Agent' has a wrong offset!");
static_assert(offsetof(USTT_GetRandomLocationAroundTarget_C, Target) == 0x000088, "Member 'USTT_GetRandomLocationAroundTarget_C::Target' has a wrong offset!");
static_assert(offsetof(USTT_GetRandomLocationAroundTarget_C, TargetBBKey) == 0x000090, "Member 'USTT_GetRandomLocationAroundTarget_C::TargetBBKey' has a wrong offset!");
static_assert(offsetof(USTT_GetRandomLocationAroundTarget_C, MinRadius) == 0x000098, "Member 'USTT_GetRandomLocationAroundTarget_C::MinRadius' has a wrong offset!");
static_assert(offsetof(USTT_GetRandomLocationAroundTarget_C, MaxRadius) == 0x0000A0, "Member 'USTT_GetRandomLocationAroundTarget_C::MaxRadius' has a wrong offset!");
static_assert(offsetof(USTT_GetRandomLocationAroundTarget_C, OutRandomLocation) == 0x0000A8, "Member 'USTT_GetRandomLocationAroundTarget_C::OutRandomLocation' has a wrong offset!");
static_assert(offsetof(USTT_GetRandomLocationAroundTarget_C, RawLocation) == 0x0000C0, "Member 'USTT_GetRandomLocationAroundTarget_C::RawLocation' has a wrong offset!");

}

