#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_SetCharacterInteracting

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function STT_SetCharacterInteracting.STT_SetCharacterInteracting_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_SetCharacterInteracting_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_SetCharacterInteracting_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_SetCharacterInteracting_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_SetCharacterInteracting_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_SetCharacterInteracting_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_SetCharacterInteracting_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_SetCharacterInteracting_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

// Function STT_SetCharacterInteracting.STT_SetCharacterInteracting_C.ExecuteUbergraph_STT_SetCharacterInteracting
// 0x0040 (0x0040 - 0x0000)
struct STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPCCharacter*                          K2Node_DynamicCast_AsNPCCharacter;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x1];                                       // 0x0011(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0012(0x002E)(ConstParm, NoDestructor)
};
static_assert(alignof(STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting) == 0x000008, "Wrong alignment on STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting");
static_assert(sizeof(STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting) == 0x000040, "Wrong size on STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting");
static_assert(offsetof(STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting, EntryPoint) == 0x000000, "Member 'STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting, K2Node_DynamicCast_AsNPCCharacter) == 0x000008, "Member 'STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting::K2Node_DynamicCast_AsNPCCharacter' has a wrong offset!");
static_assert(offsetof(STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting, K2Node_Event_Transition) == 0x000012, "Member 'STT_SetCharacterInteracting_C_ExecuteUbergraph_STT_SetCharacterInteracting::K2Node_Event_Transition' has a wrong offset!");

}

