#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_RemoveEffect

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


namespace SDK::Params
{

// Function STT_RemoveEffect.STT_RemoveEffect_C.ExecuteUbergraph_STT_RemoveEffect
// 0x07C8 (0x07C8 - 0x0000)
struct STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectRecord                          CallFunc_GetEffectRecordById_ReturnValue;          // 0x0038(0x0788)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect) == 0x000008, "Wrong alignment on STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect");
static_assert(sizeof(STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect) == 0x0007C8, "Wrong size on STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect");
static_assert(offsetof(STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect, EntryPoint) == 0x000000, "Member 'STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect, K2Node_Event_Transition) == 0x000004, "Member 'STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect::K2Node_Event_Transition' has a wrong offset!");
static_assert(offsetof(STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect, CallFunc_GetEffectRecordById_ReturnValue) == 0x000038, "Member 'STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect::CallFunc_GetEffectRecordById_ReturnValue' has a wrong offset!");
static_assert(offsetof(STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect, CallFunc_IsValid_ReturnValue) == 0x0007C0, "Member 'STT_RemoveEffect_C_ExecuteUbergraph_STT_RemoveEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function STT_RemoveEffect.STT_RemoveEffect_C.ReceiveLatentEnterState
// 0x002E (0x002E - 0x0000)
struct STT_RemoveEffect_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STT_RemoveEffect_C_ReceiveLatentEnterState) == 0x000002, "Wrong alignment on STT_RemoveEffect_C_ReceiveLatentEnterState");
static_assert(sizeof(STT_RemoveEffect_C_ReceiveLatentEnterState) == 0x00002E, "Wrong size on STT_RemoveEffect_C_ReceiveLatentEnterState");
static_assert(offsetof(STT_RemoveEffect_C_ReceiveLatentEnterState, Transition) == 0x000000, "Member 'STT_RemoveEffect_C_ReceiveLatentEnterState::Transition' has a wrong offset!");

}

