#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Test_NPC_SummonerPet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NPCPawn_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Test_NPC_SummonerPet.Test_NPC_SummonerPet_C
// 0x0020 (0x1D70 - 0x1D50)
class ATest_NPC_SummonerPet_C final : public ANPCPawn_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Test_NPC_SummonerPet_C;             // 0x1D50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Shield;                                            // 0x1D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Axe;                                               // 0x1D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Test_NPC_SummonerPet(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Test_NPC_SummonerPet_C">();
	}
	static class ATest_NPC_SummonerPet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATest_NPC_SummonerPet_C>();
	}
};
static_assert(alignof(ATest_NPC_SummonerPet_C) == 0x000010, "Wrong alignment on ATest_NPC_SummonerPet_C");
static_assert(sizeof(ATest_NPC_SummonerPet_C) == 0x001D70, "Wrong size on ATest_NPC_SummonerPet_C");
static_assert(offsetof(ATest_NPC_SummonerPet_C, UberGraphFrame_Test_NPC_SummonerPet_C) == 0x001D50, "Member 'ATest_NPC_SummonerPet_C::UberGraphFrame_Test_NPC_SummonerPet_C' has a wrong offset!");
static_assert(offsetof(ATest_NPC_SummonerPet_C, Shield) == 0x001D58, "Member 'ATest_NPC_SummonerPet_C::Shield' has a wrong offset!");
static_assert(offsetof(ATest_NPC_SummonerPet_C, Axe) == 0x001D60, "Member 'ATest_NPC_SummonerPet_C::Axe' has a wrong offset!");

}

