#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Test_Pet_RegenerateEvent

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Test_Pet_RegenerateEvent.Test_Pet_RegenerateEvent_C.RunScript
// 0x00A8 (0x00A8 - 0x0000)
struct Test_Pet_RegenerateEvent_C_RunScript final
{
public:
	struct FScriptActorInfo                       Target;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FScriptActorInfo                       Instigator;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FScriptActorInfo                       Source;                                            // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FVector                                AttackOrigin;                                      // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScriptTriggerInfo                     TriggerInfo;                                       // 0x0048(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         latestIndex;                                       // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        latestStart;                                       // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         noteCount;                                         // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeEvent                        K2Node_MakeStruct_StateTreeEvent;                  // 0x0078(0x0020)()
	class ATest_NPC_SummonerPet_C*                K2Node_DynamicCast_AsTest_NPC_Summoner_Pet;        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Test_Pet_RegenerateEvent_C_RunScript) == 0x000008, "Wrong alignment on Test_Pet_RegenerateEvent_C_RunScript");
static_assert(sizeof(Test_Pet_RegenerateEvent_C_RunScript) == 0x0000A8, "Wrong size on Test_Pet_RegenerateEvent_C_RunScript");
static_assert(offsetof(Test_Pet_RegenerateEvent_C_RunScript, Target) == 0x000000, "Member 'Test_Pet_RegenerateEvent_C_RunScript::Target' has a wrong offset!");
static_assert(offsetof(Test_Pet_RegenerateEvent_C_RunScript, Instigator) == 0x000010, "Member 'Test_Pet_RegenerateEvent_C_RunScript::Instigator' has a wrong offset!");
static_assert(offsetof(Test_Pet_RegenerateEvent_C_RunScript, Source) == 0x000020, "Member 'Test_Pet_RegenerateEvent_C_RunScript::Source' has a wrong offset!");
static_assert(offsetof(Test_Pet_RegenerateEvent_C_RunScript, AttackOrigin) == 0x000030, "Member 'Test_Pet_RegenerateEvent_C_RunScript::AttackOrigin' has a wrong offset!");
static_assert(offsetof(Test_Pet_RegenerateEvent_C_RunScript, TriggerInfo) == 0x000048, "Member 'Test_Pet_RegenerateEvent_C_RunScript::TriggerInfo' has a wrong offset!");
static_assert(offsetof(Test_Pet_RegenerateEvent_C_RunScript, ReturnValue) == 0x000060, "Member 'Test_Pet_RegenerateEvent_C_RunScript::ReturnValue' has a wrong offset!");
static_assert(offsetof(Test_Pet_RegenerateEvent_C_RunScript, latestIndex) == 0x000064, "Member 'Test_Pet_RegenerateEvent_C_RunScript::latestIndex' has a wrong offset!");
static_assert(offsetof(Test_Pet_RegenerateEvent_C_RunScript, latestStart) == 0x000068, "Member 'Test_Pet_RegenerateEvent_C_RunScript::latestStart' has a wrong offset!");
static_assert(offsetof(Test_Pet_RegenerateEvent_C_RunScript, noteCount) == 0x000070, "Member 'Test_Pet_RegenerateEvent_C_RunScript::noteCount' has a wrong offset!");
static_assert(offsetof(Test_Pet_RegenerateEvent_C_RunScript, K2Node_MakeStruct_StateTreeEvent) == 0x000078, "Member 'Test_Pet_RegenerateEvent_C_RunScript::K2Node_MakeStruct_StateTreeEvent' has a wrong offset!");
static_assert(offsetof(Test_Pet_RegenerateEvent_C_RunScript, K2Node_DynamicCast_AsTest_NPC_Summoner_Pet) == 0x000098, "Member 'Test_Pet_RegenerateEvent_C_RunScript::K2Node_DynamicCast_AsTest_NPC_Summoner_Pet' has a wrong offset!");
static_assert(offsetof(Test_Pet_RegenerateEvent_C_RunScript, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'Test_Pet_RegenerateEvent_C_RunScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

