#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "DesignDataPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "E_FencePosition_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_13f89dfc15381aad
// 0x00C8 (0x00C8 - 0x0000)
struct FPropertyBag_13f89dfc15381aad final
{
public:
	int32                                         RandomStreamSeed;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DistanceThreshold;                                 // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AverageAngleThreshold;                             // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlipMeshes;                                        // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PointIncrement;                                    // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PrioritizeSmallerAroundCurves;                     // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomizeOrder;                                    // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CloseLoop;                                         // 0x002A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLandscape;                                      // 0x002B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSecondMeshList;                                 // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SplineOffset;                                      // 0x0030(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DebrisOffset;                                      // 0x0048(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AffectedByExclusion;                               // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        One;                                               // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Zero;                                              // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SnapToGround;                                      // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FenceZOffset;                                      // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FenceNoiseDensityThreshold;                        // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stacks;                                            // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        StackSpacing;                                      // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PruneOverlappingDebris;                            // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Dilapidation;                                      // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlternateRowOffset;                                // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_FencePosition                               SplinePosition;                                    // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DebrisSeed;                                        // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FenceIndex;                                        // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSurfaceRotations;                               // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_13f89dfc15381aad) == 0x000008, "Wrong alignment on FPropertyBag_13f89dfc15381aad");
static_assert(sizeof(FPropertyBag_13f89dfc15381aad) == 0x0000C8, "Wrong size on FPropertyBag_13f89dfc15381aad");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, RandomStreamSeed) == 0x000000, "Member 'FPropertyBag_13f89dfc15381aad::RandomStreamSeed' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, DistanceThreshold) == 0x000008, "Member 'FPropertyBag_13f89dfc15381aad::DistanceThreshold' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, AverageAngleThreshold) == 0x000010, "Member 'FPropertyBag_13f89dfc15381aad::AverageAngleThreshold' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, FlipMeshes) == 0x000018, "Member 'FPropertyBag_13f89dfc15381aad::FlipMeshes' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, PointIncrement) == 0x000020, "Member 'FPropertyBag_13f89dfc15381aad::PointIncrement' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, PrioritizeSmallerAroundCurves) == 0x000028, "Member 'FPropertyBag_13f89dfc15381aad::PrioritizeSmallerAroundCurves' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, RandomizeOrder) == 0x000029, "Member 'FPropertyBag_13f89dfc15381aad::RandomizeOrder' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, CloseLoop) == 0x00002A, "Member 'FPropertyBag_13f89dfc15381aad::CloseLoop' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, UseLandscape) == 0x00002B, "Member 'FPropertyBag_13f89dfc15381aad::UseLandscape' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, UseSecondMeshList) == 0x00002C, "Member 'FPropertyBag_13f89dfc15381aad::UseSecondMeshList' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, SplineOffset) == 0x000030, "Member 'FPropertyBag_13f89dfc15381aad::SplineOffset' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, DebrisOffset) == 0x000048, "Member 'FPropertyBag_13f89dfc15381aad::DebrisOffset' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, AffectedByExclusion) == 0x000060, "Member 'FPropertyBag_13f89dfc15381aad::AffectedByExclusion' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, One) == 0x000068, "Member 'FPropertyBag_13f89dfc15381aad::One' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, Zero) == 0x000070, "Member 'FPropertyBag_13f89dfc15381aad::Zero' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, SnapToGround) == 0x000078, "Member 'FPropertyBag_13f89dfc15381aad::SnapToGround' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, FenceZOffset) == 0x000080, "Member 'FPropertyBag_13f89dfc15381aad::FenceZOffset' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, FenceNoiseDensityThreshold) == 0x000088, "Member 'FPropertyBag_13f89dfc15381aad::FenceNoiseDensityThreshold' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, Stacks) == 0x000090, "Member 'FPropertyBag_13f89dfc15381aad::Stacks' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, StackSpacing) == 0x000098, "Member 'FPropertyBag_13f89dfc15381aad::StackSpacing' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, PruneOverlappingDebris) == 0x0000A0, "Member 'FPropertyBag_13f89dfc15381aad::PruneOverlappingDebris' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, Dilapidation) == 0x0000A8, "Member 'FPropertyBag_13f89dfc15381aad::Dilapidation' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, AlternateRowOffset) == 0x0000B0, "Member 'FPropertyBag_13f89dfc15381aad::AlternateRowOffset' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, SplinePosition) == 0x0000B4, "Member 'FPropertyBag_13f89dfc15381aad::SplinePosition' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, DebrisSeed) == 0x0000B8, "Member 'FPropertyBag_13f89dfc15381aad::DebrisSeed' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, FenceIndex) == 0x0000BC, "Member 'FPropertyBag_13f89dfc15381aad::FenceIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_13f89dfc15381aad, UseSurfaceRotations) == 0x0000C0, "Member 'FPropertyBag_13f89dfc15381aad::UseSurfaceRotations' has a wrong offset!");

// PropertyBag Transient.PropertyBag_ec866a9abcf8171c
// 0x00D0 (0x00D0 - 0x0000)
struct FPropertyBag_ec866a9abcf8171c final
{
public:
	double                                        Wander_RadiusMax;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_RadiusMin;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_Delay;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_DelayDeviation;                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENpcAIPatrolRouteStrategy                     Patrol_RouteStrategy;                              // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCExpression                         Patrol_PathingSpeedMultiplier;                     // 0x0028(0x0050)(Edit)
	struct FAoCExpression                         Wander_SpeedMultiplier;                            // 0x0078(0x0050)(Edit)
	bool                                          HasDeathRoll;                                      // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasThrash;                                         // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_ec866a9abcf8171c) == 0x000008, "Wrong alignment on FPropertyBag_ec866a9abcf8171c");
static_assert(sizeof(FPropertyBag_ec866a9abcf8171c) == 0x0000D0, "Wrong size on FPropertyBag_ec866a9abcf8171c");
static_assert(offsetof(FPropertyBag_ec866a9abcf8171c, Wander_RadiusMax) == 0x000000, "Member 'FPropertyBag_ec866a9abcf8171c::Wander_RadiusMax' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ec866a9abcf8171c, Wander_RadiusMin) == 0x000008, "Member 'FPropertyBag_ec866a9abcf8171c::Wander_RadiusMin' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ec866a9abcf8171c, Wander_Delay) == 0x000010, "Member 'FPropertyBag_ec866a9abcf8171c::Wander_Delay' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ec866a9abcf8171c, Wander_DelayDeviation) == 0x000018, "Member 'FPropertyBag_ec866a9abcf8171c::Wander_DelayDeviation' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ec866a9abcf8171c, Patrol_RouteStrategy) == 0x000020, "Member 'FPropertyBag_ec866a9abcf8171c::Patrol_RouteStrategy' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ec866a9abcf8171c, Patrol_PathingSpeedMultiplier) == 0x000028, "Member 'FPropertyBag_ec866a9abcf8171c::Patrol_PathingSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ec866a9abcf8171c, Wander_SpeedMultiplier) == 0x000078, "Member 'FPropertyBag_ec866a9abcf8171c::Wander_SpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ec866a9abcf8171c, HasDeathRoll) == 0x0000C8, "Member 'FPropertyBag_ec866a9abcf8171c::HasDeathRoll' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ec866a9abcf8171c, HasThrash) == 0x0000C9, "Member 'FPropertyBag_ec866a9abcf8171c::HasThrash' has a wrong offset!");

// PropertyBag Transient.PropertyBag_72ba434b60548c8e
// 0x0020 (0x0020 - 0x0000)
struct FPropertyBag_72ba434b60548c8e final
{
public:
	double                                        Wander_RadiusMax;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_RadiusMin;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_Delay;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_DelayDeviation;                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_72ba434b60548c8e) == 0x000008, "Wrong alignment on FPropertyBag_72ba434b60548c8e");
static_assert(sizeof(FPropertyBag_72ba434b60548c8e) == 0x000020, "Wrong size on FPropertyBag_72ba434b60548c8e");
static_assert(offsetof(FPropertyBag_72ba434b60548c8e, Wander_RadiusMax) == 0x000000, "Member 'FPropertyBag_72ba434b60548c8e::Wander_RadiusMax' has a wrong offset!");
static_assert(offsetof(FPropertyBag_72ba434b60548c8e, Wander_RadiusMin) == 0x000008, "Member 'FPropertyBag_72ba434b60548c8e::Wander_RadiusMin' has a wrong offset!");
static_assert(offsetof(FPropertyBag_72ba434b60548c8e, Wander_Delay) == 0x000010, "Member 'FPropertyBag_72ba434b60548c8e::Wander_Delay' has a wrong offset!");
static_assert(offsetof(FPropertyBag_72ba434b60548c8e, Wander_DelayDeviation) == 0x000018, "Member 'FPropertyBag_72ba434b60548c8e::Wander_DelayDeviation' has a wrong offset!");

// PropertyBag Transient.PropertyBag_0
// 0x0000 (0x0000 - 0x0000)
struct FPropertyBag_0 final
{
};
static_assert(alignof(FPropertyBag_0) == 0x000001, "Wrong alignment on FPropertyBag_0");
static_assert(sizeof(FPropertyBag_0) == 0x000001, "Wrong size on FPropertyBag_0");

// PropertyBag Transient.PropertyBag_5f677c06d1da8b7a
// 0x00D0 (0x00D0 - 0x0000)
struct FPropertyBag_5f677c06d1da8b7a final
{
public:
	double                                        Wander_RadiusMax;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_RadiusMin;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_Delay;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_DelayDeviation;                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENpcAIPatrolRouteStrategy                     Patrol_RouteStrategy;                              // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCExpression                         Patrol_PathingSpeedMultiplier;                     // 0x0028(0x0050)(Edit)
	struct FAoCExpression                         Wander_SpeedMultiplier;                            // 0x0078(0x0050)(Edit)
	bool                                          HasGuillotine;                                     // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RefreshRetract01;                                  // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RefreshRetract02;                                  // 0x00CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_5f677c06d1da8b7a) == 0x000008, "Wrong alignment on FPropertyBag_5f677c06d1da8b7a");
static_assert(sizeof(FPropertyBag_5f677c06d1da8b7a) == 0x0000D0, "Wrong size on FPropertyBag_5f677c06d1da8b7a");
static_assert(offsetof(FPropertyBag_5f677c06d1da8b7a, Wander_RadiusMax) == 0x000000, "Member 'FPropertyBag_5f677c06d1da8b7a::Wander_RadiusMax' has a wrong offset!");
static_assert(offsetof(FPropertyBag_5f677c06d1da8b7a, Wander_RadiusMin) == 0x000008, "Member 'FPropertyBag_5f677c06d1da8b7a::Wander_RadiusMin' has a wrong offset!");
static_assert(offsetof(FPropertyBag_5f677c06d1da8b7a, Wander_Delay) == 0x000010, "Member 'FPropertyBag_5f677c06d1da8b7a::Wander_Delay' has a wrong offset!");
static_assert(offsetof(FPropertyBag_5f677c06d1da8b7a, Wander_DelayDeviation) == 0x000018, "Member 'FPropertyBag_5f677c06d1da8b7a::Wander_DelayDeviation' has a wrong offset!");
static_assert(offsetof(FPropertyBag_5f677c06d1da8b7a, Patrol_RouteStrategy) == 0x000020, "Member 'FPropertyBag_5f677c06d1da8b7a::Patrol_RouteStrategy' has a wrong offset!");
static_assert(offsetof(FPropertyBag_5f677c06d1da8b7a, Patrol_PathingSpeedMultiplier) == 0x000028, "Member 'FPropertyBag_5f677c06d1da8b7a::Patrol_PathingSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_5f677c06d1da8b7a, Wander_SpeedMultiplier) == 0x000078, "Member 'FPropertyBag_5f677c06d1da8b7a::Wander_SpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_5f677c06d1da8b7a, HasGuillotine) == 0x0000C8, "Member 'FPropertyBag_5f677c06d1da8b7a::HasGuillotine' has a wrong offset!");
static_assert(offsetof(FPropertyBag_5f677c06d1da8b7a, RefreshRetract01) == 0x0000C9, "Member 'FPropertyBag_5f677c06d1da8b7a::RefreshRetract01' has a wrong offset!");
static_assert(offsetof(FPropertyBag_5f677c06d1da8b7a, RefreshRetract02) == 0x0000CA, "Member 'FPropertyBag_5f677c06d1da8b7a::RefreshRetract02' has a wrong offset!");

// PropertyBag Transient.PropertyBag_527011c645635f49
// 0x0168 (0x0168 - 0x0000)
struct FPropertyBag_527011c645635f49 final
{
public:
	double                                        Wander_RadiusMax;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_RadiusMin;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_Delay;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_DelayDeviation;                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENpcAIPatrolRouteStrategy                     Patrol_RouteStrategy;                              // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCExpression                         Patrol_PathingSpeedMultiplier;                     // 0x0028(0x0050)(Edit)
	struct FAoCExpression                         Wander_SpeedMultiplier;                            // 0x0078(0x0050)(Edit)
	double                                        OrbitDistance;                                     // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           AmbientAnimationTags;                              // 0x00D0(0x0010)(Edit)
	double                                        Idle_AmbientAnimDelay;                             // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Idle_AmbientAnimDelayDeviation;                    // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Idle_AmbientAnimCooldown;                          // 0x00F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BiteRange;                                         // 0x00F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PounceRange;                                       // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PounceSequenceMinRange;                            // 0x0108(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PounceSequenceMaxRange;                            // 0x0110(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanPounce;                                         // 0x0118(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanHowl;                                           // 0x0119(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanRageHowl;                                       // 0x011A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanGrowl;                                          // 0x011B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanArrowDash;                                      // 0x011C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanSpiritAid;                                      // 0x011D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCAbilityId                          Bite;                                              // 0x0120(0x0018)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FAoCAbilityId                          Pounce;                                            // 0x0138(0x0018)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FAoCAbilityId                          ArrowDash;                                         // 0x0150(0x0018)(Edit, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_527011c645635f49) == 0x000008, "Wrong alignment on FPropertyBag_527011c645635f49");
static_assert(sizeof(FPropertyBag_527011c645635f49) == 0x000168, "Wrong size on FPropertyBag_527011c645635f49");
static_assert(offsetof(FPropertyBag_527011c645635f49, Wander_RadiusMax) == 0x000000, "Member 'FPropertyBag_527011c645635f49::Wander_RadiusMax' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, Wander_RadiusMin) == 0x000008, "Member 'FPropertyBag_527011c645635f49::Wander_RadiusMin' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, Wander_Delay) == 0x000010, "Member 'FPropertyBag_527011c645635f49::Wander_Delay' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, Wander_DelayDeviation) == 0x000018, "Member 'FPropertyBag_527011c645635f49::Wander_DelayDeviation' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, Patrol_RouteStrategy) == 0x000020, "Member 'FPropertyBag_527011c645635f49::Patrol_RouteStrategy' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, Patrol_PathingSpeedMultiplier) == 0x000028, "Member 'FPropertyBag_527011c645635f49::Patrol_PathingSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, Wander_SpeedMultiplier) == 0x000078, "Member 'FPropertyBag_527011c645635f49::Wander_SpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, OrbitDistance) == 0x0000C8, "Member 'FPropertyBag_527011c645635f49::OrbitDistance' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, AmbientAnimationTags) == 0x0000D0, "Member 'FPropertyBag_527011c645635f49::AmbientAnimationTags' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, Idle_AmbientAnimDelay) == 0x0000E0, "Member 'FPropertyBag_527011c645635f49::Idle_AmbientAnimDelay' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, Idle_AmbientAnimDelayDeviation) == 0x0000E8, "Member 'FPropertyBag_527011c645635f49::Idle_AmbientAnimDelayDeviation' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, Idle_AmbientAnimCooldown) == 0x0000F0, "Member 'FPropertyBag_527011c645635f49::Idle_AmbientAnimCooldown' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, BiteRange) == 0x0000F8, "Member 'FPropertyBag_527011c645635f49::BiteRange' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, PounceRange) == 0x000100, "Member 'FPropertyBag_527011c645635f49::PounceRange' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, PounceSequenceMinRange) == 0x000108, "Member 'FPropertyBag_527011c645635f49::PounceSequenceMinRange' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, PounceSequenceMaxRange) == 0x000110, "Member 'FPropertyBag_527011c645635f49::PounceSequenceMaxRange' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, CanPounce) == 0x000118, "Member 'FPropertyBag_527011c645635f49::CanPounce' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, CanHowl) == 0x000119, "Member 'FPropertyBag_527011c645635f49::CanHowl' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, CanRageHowl) == 0x00011A, "Member 'FPropertyBag_527011c645635f49::CanRageHowl' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, CanGrowl) == 0x00011B, "Member 'FPropertyBag_527011c645635f49::CanGrowl' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, CanArrowDash) == 0x00011C, "Member 'FPropertyBag_527011c645635f49::CanArrowDash' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, CanSpiritAid) == 0x00011D, "Member 'FPropertyBag_527011c645635f49::CanSpiritAid' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, Bite) == 0x000120, "Member 'FPropertyBag_527011c645635f49::Bite' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, Pounce) == 0x000138, "Member 'FPropertyBag_527011c645635f49::Pounce' has a wrong offset!");
static_assert(offsetof(FPropertyBag_527011c645635f49, ArrowDash) == 0x000150, "Member 'FPropertyBag_527011c645635f49::ArrowDash' has a wrong offset!");

// PropertyBag Transient.PropertyBag_3aeea5b17ee55e23
// 0x00E8 (0x00E8 - 0x0000)
struct FPropertyBag_3aeea5b17ee55e23 final
{
public:
	double                                        Wander_RadiusMax;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_RadiusMin;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_Delay;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_DelayDeviation;                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENpcAIPatrolRouteStrategy                     Patrol_RouteStrategy;                              // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCExpression                         Patrol_PathingSpeedMultiplier;                     // 0x0028(0x0050)(Edit)
	bool                                          CanSpawnKids;                                      // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ArrivalDistance;                                   // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanMushroomMissile;                                // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCExpression                         Wander_SpeedMultiplier;                            // 0x0090(0x0050)(Edit)
	bool                                          UseBlindSpores;                                    // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseParalyzeSpores;                                 // 0x00E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsePoisonSpores;                                   // 0x00E2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ambush;                                            // 0x00E3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_3aeea5b17ee55e23) == 0x000008, "Wrong alignment on FPropertyBag_3aeea5b17ee55e23");
static_assert(sizeof(FPropertyBag_3aeea5b17ee55e23) == 0x0000E8, "Wrong size on FPropertyBag_3aeea5b17ee55e23");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, Wander_RadiusMax) == 0x000000, "Member 'FPropertyBag_3aeea5b17ee55e23::Wander_RadiusMax' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, Wander_RadiusMin) == 0x000008, "Member 'FPropertyBag_3aeea5b17ee55e23::Wander_RadiusMin' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, Wander_Delay) == 0x000010, "Member 'FPropertyBag_3aeea5b17ee55e23::Wander_Delay' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, Wander_DelayDeviation) == 0x000018, "Member 'FPropertyBag_3aeea5b17ee55e23::Wander_DelayDeviation' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, Patrol_RouteStrategy) == 0x000020, "Member 'FPropertyBag_3aeea5b17ee55e23::Patrol_RouteStrategy' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, Patrol_PathingSpeedMultiplier) == 0x000028, "Member 'FPropertyBag_3aeea5b17ee55e23::Patrol_PathingSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, CanSpawnKids) == 0x000078, "Member 'FPropertyBag_3aeea5b17ee55e23::CanSpawnKids' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, ArrivalDistance) == 0x000080, "Member 'FPropertyBag_3aeea5b17ee55e23::ArrivalDistance' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, CanMushroomMissile) == 0x000088, "Member 'FPropertyBag_3aeea5b17ee55e23::CanMushroomMissile' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, Wander_SpeedMultiplier) == 0x000090, "Member 'FPropertyBag_3aeea5b17ee55e23::Wander_SpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, UseBlindSpores) == 0x0000E0, "Member 'FPropertyBag_3aeea5b17ee55e23::UseBlindSpores' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, UseParalyzeSpores) == 0x0000E1, "Member 'FPropertyBag_3aeea5b17ee55e23::UseParalyzeSpores' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, UsePoisonSpores) == 0x0000E2, "Member 'FPropertyBag_3aeea5b17ee55e23::UsePoisonSpores' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3aeea5b17ee55e23, Ambush) == 0x0000E3, "Member 'FPropertyBag_3aeea5b17ee55e23::Ambush' has a wrong offset!");

// PropertyBag Transient.PropertyBag_4b0a544341f1f1e2
// 0x00C8 (0x00C8 - 0x0000)
struct FPropertyBag_4b0a544341f1f1e2 final
{
public:
	double                                        Wander_RadiusMax;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_RadiusMin;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_Delay;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_DelayDeviation;                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENpcAIPatrolRouteStrategy                     Patrol_RouteStrategy;                              // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCExpression                         Patrol_PathingSpeedMultiplier;                     // 0x0028(0x0050)(Edit)
	struct FAoCExpression                         Wander_SpeedMultiplier;                            // 0x0078(0x0050)(Edit)
};
static_assert(alignof(FPropertyBag_4b0a544341f1f1e2) == 0x000008, "Wrong alignment on FPropertyBag_4b0a544341f1f1e2");
static_assert(sizeof(FPropertyBag_4b0a544341f1f1e2) == 0x0000C8, "Wrong size on FPropertyBag_4b0a544341f1f1e2");
static_assert(offsetof(FPropertyBag_4b0a544341f1f1e2, Wander_RadiusMax) == 0x000000, "Member 'FPropertyBag_4b0a544341f1f1e2::Wander_RadiusMax' has a wrong offset!");
static_assert(offsetof(FPropertyBag_4b0a544341f1f1e2, Wander_RadiusMin) == 0x000008, "Member 'FPropertyBag_4b0a544341f1f1e2::Wander_RadiusMin' has a wrong offset!");
static_assert(offsetof(FPropertyBag_4b0a544341f1f1e2, Wander_Delay) == 0x000010, "Member 'FPropertyBag_4b0a544341f1f1e2::Wander_Delay' has a wrong offset!");
static_assert(offsetof(FPropertyBag_4b0a544341f1f1e2, Wander_DelayDeviation) == 0x000018, "Member 'FPropertyBag_4b0a544341f1f1e2::Wander_DelayDeviation' has a wrong offset!");
static_assert(offsetof(FPropertyBag_4b0a544341f1f1e2, Patrol_RouteStrategy) == 0x000020, "Member 'FPropertyBag_4b0a544341f1f1e2::Patrol_RouteStrategy' has a wrong offset!");
static_assert(offsetof(FPropertyBag_4b0a544341f1f1e2, Patrol_PathingSpeedMultiplier) == 0x000028, "Member 'FPropertyBag_4b0a544341f1f1e2::Patrol_PathingSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_4b0a544341f1f1e2, Wander_SpeedMultiplier) == 0x000078, "Member 'FPropertyBag_4b0a544341f1f1e2::Wander_SpeedMultiplier' has a wrong offset!");

// ScriptStruct Transient.HoudiniEvent_SWC
// 0x0048 (0x0048 - 0x0000)
struct FHoudiniEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Impulse;                                           // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Velocity;                                          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         POINTID;                                           // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LIFE;                                              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHoudiniEvent_SWC) == 0x000004, "Wrong alignment on FHoudiniEvent_SWC");
static_assert(sizeof(FHoudiniEvent_SWC) == 0x000048, "Wrong size on FHoudiniEvent_SWC");
static_assert(offsetof(FHoudiniEvent_SWC, Position) == 0x000000, "Member 'FHoudiniEvent_SWC::Position' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, Normal) == 0x00000C, "Member 'FHoudiniEvent_SWC::Normal' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, Impulse) == 0x000018, "Member 'FHoudiniEvent_SWC::Impulse' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, Velocity) == 0x00001C, "Member 'FHoudiniEvent_SWC::Velocity' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, POINTID) == 0x000028, "Member 'FHoudiniEvent_SWC::POINTID' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, Time) == 0x00002C, "Member 'FHoudiniEvent_SWC::Time' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, LIFE) == 0x000030, "Member 'FHoudiniEvent_SWC::LIFE' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, Color) == 0x000034, "Member 'FHoudiniEvent_SWC::Color' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, Type) == 0x000044, "Member 'FHoudiniEvent_SWC::Type' has a wrong offset!");

// PropertyBag Transient.PropertyBag_aa493a5d0cd2da6a
// 0x00D0 (0x00D0 - 0x0000)
struct FPropertyBag_aa493a5d0cd2da6a final
{
public:
	double                                        Wander_RadiusMax;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_RadiusMin;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_Delay;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_DelayDeviation;                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENpcAIPatrolRouteStrategy                     Patrol_RouteStrategy;                              // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCExpression                         Patrol_PathingSpeedMultiplier;                     // 0x0028(0x0050)(Edit)
	struct FAoCExpression                         Wander_SpeedMultiplier;                            // 0x0078(0x0050)(Edit)
	bool                                          CanSmellofBlood;                                   // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanRepeatCourage;                                  // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_aa493a5d0cd2da6a) == 0x000008, "Wrong alignment on FPropertyBag_aa493a5d0cd2da6a");
static_assert(sizeof(FPropertyBag_aa493a5d0cd2da6a) == 0x0000D0, "Wrong size on FPropertyBag_aa493a5d0cd2da6a");
static_assert(offsetof(FPropertyBag_aa493a5d0cd2da6a, Wander_RadiusMax) == 0x000000, "Member 'FPropertyBag_aa493a5d0cd2da6a::Wander_RadiusMax' has a wrong offset!");
static_assert(offsetof(FPropertyBag_aa493a5d0cd2da6a, Wander_RadiusMin) == 0x000008, "Member 'FPropertyBag_aa493a5d0cd2da6a::Wander_RadiusMin' has a wrong offset!");
static_assert(offsetof(FPropertyBag_aa493a5d0cd2da6a, Wander_Delay) == 0x000010, "Member 'FPropertyBag_aa493a5d0cd2da6a::Wander_Delay' has a wrong offset!");
static_assert(offsetof(FPropertyBag_aa493a5d0cd2da6a, Wander_DelayDeviation) == 0x000018, "Member 'FPropertyBag_aa493a5d0cd2da6a::Wander_DelayDeviation' has a wrong offset!");
static_assert(offsetof(FPropertyBag_aa493a5d0cd2da6a, Patrol_RouteStrategy) == 0x000020, "Member 'FPropertyBag_aa493a5d0cd2da6a::Patrol_RouteStrategy' has a wrong offset!");
static_assert(offsetof(FPropertyBag_aa493a5d0cd2da6a, Patrol_PathingSpeedMultiplier) == 0x000028, "Member 'FPropertyBag_aa493a5d0cd2da6a::Patrol_PathingSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_aa493a5d0cd2da6a, Wander_SpeedMultiplier) == 0x000078, "Member 'FPropertyBag_aa493a5d0cd2da6a::Wander_SpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_aa493a5d0cd2da6a, CanSmellofBlood) == 0x0000C8, "Member 'FPropertyBag_aa493a5d0cd2da6a::CanSmellofBlood' has a wrong offset!");
static_assert(offsetof(FPropertyBag_aa493a5d0cd2da6a, CanRepeatCourage) == 0x0000C9, "Member 'FPropertyBag_aa493a5d0cd2da6a::CanRepeatCourage' has a wrong offset!");

// PropertyBag Transient.PropertyBag_de055f17aada576b
// 0x00D0 (0x00D0 - 0x0000)
struct FPropertyBag_de055f17aada576b final
{
public:
	double                                        Wander_RadiusMax;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_RadiusMin;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_Delay;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_DelayDeviation;                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENpcAIPatrolRouteStrategy                     Patrol_RouteStrategy;                              // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCExpression                         Patrol_PathingSpeedMultiplier;                     // 0x0028(0x0050)(Edit)
	bool                                          UnburyOnAggro;                                     // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCExpression                         Wander_SpeedMultiplier;                            // 0x0080(0x0050)(Edit)
};
static_assert(alignof(FPropertyBag_de055f17aada576b) == 0x000008, "Wrong alignment on FPropertyBag_de055f17aada576b");
static_assert(sizeof(FPropertyBag_de055f17aada576b) == 0x0000D0, "Wrong size on FPropertyBag_de055f17aada576b");
static_assert(offsetof(FPropertyBag_de055f17aada576b, Wander_RadiusMax) == 0x000000, "Member 'FPropertyBag_de055f17aada576b::Wander_RadiusMax' has a wrong offset!");
static_assert(offsetof(FPropertyBag_de055f17aada576b, Wander_RadiusMin) == 0x000008, "Member 'FPropertyBag_de055f17aada576b::Wander_RadiusMin' has a wrong offset!");
static_assert(offsetof(FPropertyBag_de055f17aada576b, Wander_Delay) == 0x000010, "Member 'FPropertyBag_de055f17aada576b::Wander_Delay' has a wrong offset!");
static_assert(offsetof(FPropertyBag_de055f17aada576b, Wander_DelayDeviation) == 0x000018, "Member 'FPropertyBag_de055f17aada576b::Wander_DelayDeviation' has a wrong offset!");
static_assert(offsetof(FPropertyBag_de055f17aada576b, Patrol_RouteStrategy) == 0x000020, "Member 'FPropertyBag_de055f17aada576b::Patrol_RouteStrategy' has a wrong offset!");
static_assert(offsetof(FPropertyBag_de055f17aada576b, Patrol_PathingSpeedMultiplier) == 0x000028, "Member 'FPropertyBag_de055f17aada576b::Patrol_PathingSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_de055f17aada576b, UnburyOnAggro) == 0x000078, "Member 'FPropertyBag_de055f17aada576b::UnburyOnAggro' has a wrong offset!");
static_assert(offsetof(FPropertyBag_de055f17aada576b, Wander_SpeedMultiplier) == 0x000080, "Member 'FPropertyBag_de055f17aada576b::Wander_SpeedMultiplier' has a wrong offset!");

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosDestructionEvent_SWC) == 0x000004, "Wrong alignment on FChaosDestructionEvent_SWC");
static_assert(sizeof(FChaosDestructionEvent_SWC) == 0x000044, "Wrong size on FChaosDestructionEvent_SWC");
static_assert(offsetof(FChaosDestructionEvent_SWC, Position) == 0x000000, "Member 'FChaosDestructionEvent_SWC::Position' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Normal) == 0x00000C, "Member 'FChaosDestructionEvent_SWC::Normal' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Velocity) == 0x000018, "Member 'FChaosDestructionEvent_SWC::Velocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, AngularVelocity) == 0x000024, "Member 'FChaosDestructionEvent_SWC::AngularVelocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMin) == 0x000030, "Member 'FChaosDestructionEvent_SWC::ExtentMin' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMax) == 0x000034, "Member 'FChaosDestructionEvent_SWC::ExtentMax' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ParticleID) == 0x000038, "Member 'FChaosDestructionEvent_SWC::ParticleID' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Time) == 0x00003C, "Member 'FChaosDestructionEvent_SWC::Time' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Type) == 0x000040, "Member 'FChaosDestructionEvent_SWC::Type' has a wrong offset!");

// PropertyBag Transient.PropertyBag_e48dc0b454ef185f
// 0x00E0 (0x00E0 - 0x0000)
struct FPropertyBag_e48dc0b454ef185f final
{
public:
	double                                        Wander_RadiusMax;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_RadiusMin;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_Delay;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_DelayDeviation;                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENpcAIPatrolRouteStrategy                     Patrol_RouteStrategy;                              // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCExpression                         Patrol_PathingSpeedMultiplier;                     // 0x0028(0x0050)(Edit)
	struct FAoCExpression                         Wander_SpeedMultiplier;                            // 0x0078(0x0050)(Edit)
	bool                                          CanSkull;                                          // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ambush;                                            // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dormant;                                           // 0x00CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MeleeDistance;                                     // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanDuplicate;                                      // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_e48dc0b454ef185f) == 0x000008, "Wrong alignment on FPropertyBag_e48dc0b454ef185f");
static_assert(sizeof(FPropertyBag_e48dc0b454ef185f) == 0x0000E0, "Wrong size on FPropertyBag_e48dc0b454ef185f");
static_assert(offsetof(FPropertyBag_e48dc0b454ef185f, Wander_RadiusMax) == 0x000000, "Member 'FPropertyBag_e48dc0b454ef185f::Wander_RadiusMax' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e48dc0b454ef185f, Wander_RadiusMin) == 0x000008, "Member 'FPropertyBag_e48dc0b454ef185f::Wander_RadiusMin' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e48dc0b454ef185f, Wander_Delay) == 0x000010, "Member 'FPropertyBag_e48dc0b454ef185f::Wander_Delay' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e48dc0b454ef185f, Wander_DelayDeviation) == 0x000018, "Member 'FPropertyBag_e48dc0b454ef185f::Wander_DelayDeviation' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e48dc0b454ef185f, Patrol_RouteStrategy) == 0x000020, "Member 'FPropertyBag_e48dc0b454ef185f::Patrol_RouteStrategy' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e48dc0b454ef185f, Patrol_PathingSpeedMultiplier) == 0x000028, "Member 'FPropertyBag_e48dc0b454ef185f::Patrol_PathingSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e48dc0b454ef185f, Wander_SpeedMultiplier) == 0x000078, "Member 'FPropertyBag_e48dc0b454ef185f::Wander_SpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e48dc0b454ef185f, CanSkull) == 0x0000C8, "Member 'FPropertyBag_e48dc0b454ef185f::CanSkull' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e48dc0b454ef185f, Ambush) == 0x0000C9, "Member 'FPropertyBag_e48dc0b454ef185f::Ambush' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e48dc0b454ef185f, Dormant) == 0x0000CA, "Member 'FPropertyBag_e48dc0b454ef185f::Dormant' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e48dc0b454ef185f, MeleeDistance) == 0x0000D0, "Member 'FPropertyBag_e48dc0b454ef185f::MeleeDistance' has a wrong offset!");
static_assert(offsetof(FPropertyBag_e48dc0b454ef185f, CanDuplicate) == 0x0000D8, "Member 'FPropertyBag_e48dc0b454ef185f::CanDuplicate' has a wrong offset!");

// PropertyBag Transient.PropertyBag_bdc0d003074d8353
// 0x00D0 (0x00D0 - 0x0000)
struct FPropertyBag_bdc0d003074d8353 final
{
public:
	double                                        Wander_RadiusMax;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_RadiusMin;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_Delay;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_DelayDeviation;                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENpcAIPatrolRouteStrategy                     Patrol_RouteStrategy;                              // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCExpression                         Patrol_PathingSpeedMultiplier;                     // 0x0028(0x0050)(Edit)
	bool                                          IsInvulnerable;                                    // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTargetable;                                      // 0x0079(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNameplateDrawn;                                  // 0x007A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAoCExpression                         Wander_SpeedMultiplier;                            // 0x0080(0x0050)(Edit)
};
