#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_0
// 0x0000 (0x0000 - 0x0000)
struct FPropertyBag_0 final
{
};
static_assert(alignof(FPropertyBag_0) == 0x000001, "Wrong alignment on FPropertyBag_0");
static_assert(sizeof(FPropertyBag_0) == 0x000001, "Wrong size on FPropertyBag_0");

// PropertyBag Transient.PropertyBag_8f37cd1d381a6377
// 0x0020 (0x0020 - 0x0000)
struct FPropertyBag_8f37cd1d381a6377 final
{
public:
	double                                        Wander_RadiusMax;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_RadiusMin;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_Delay;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wander_DelayDeviation;                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_8f37cd1d381a6377) == 0x000008, "Wrong alignment on FPropertyBag_8f37cd1d381a6377");
static_assert(sizeof(FPropertyBag_8f37cd1d381a6377) == 0x000020, "Wrong size on FPropertyBag_8f37cd1d381a6377");
static_assert(offsetof(FPropertyBag_8f37cd1d381a6377, Wander_RadiusMax) == 0x000000, "Member 'FPropertyBag_8f37cd1d381a6377::Wander_RadiusMax' has a wrong offset!");
static_assert(offsetof(FPropertyBag_8f37cd1d381a6377, Wander_RadiusMin) == 0x000008, "Member 'FPropertyBag_8f37cd1d381a6377::Wander_RadiusMin' has a wrong offset!");
static_assert(offsetof(FPropertyBag_8f37cd1d381a6377, Wander_Delay) == 0x000010, "Member 'FPropertyBag_8f37cd1d381a6377::Wander_Delay' has a wrong offset!");
static_assert(offsetof(FPropertyBag_8f37cd1d381a6377, Wander_DelayDeviation) == 0x000018, "Member 'FPropertyBag_8f37cd1d381a6377::Wander_DelayDeviation' has a wrong offset!");

// ScriptStruct Transient.HoudiniEvent_SWC
// 0x0048 (0x0048 - 0x0000)
struct FHoudiniEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Impulse;                                           // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Velocity;                                          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         POINTID;                                           // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LIFE;                                              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHoudiniEvent_SWC) == 0x000004, "Wrong alignment on FHoudiniEvent_SWC");
static_assert(sizeof(FHoudiniEvent_SWC) == 0x000048, "Wrong size on FHoudiniEvent_SWC");
static_assert(offsetof(FHoudiniEvent_SWC, Position) == 0x000000, "Member 'FHoudiniEvent_SWC::Position' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, Normal) == 0x00000C, "Member 'FHoudiniEvent_SWC::Normal' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, Impulse) == 0x000018, "Member 'FHoudiniEvent_SWC::Impulse' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, Velocity) == 0x00001C, "Member 'FHoudiniEvent_SWC::Velocity' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, POINTID) == 0x000028, "Member 'FHoudiniEvent_SWC::POINTID' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, Time) == 0x00002C, "Member 'FHoudiniEvent_SWC::Time' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, LIFE) == 0x000030, "Member 'FHoudiniEvent_SWC::LIFE' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, Color) == 0x000034, "Member 'FHoudiniEvent_SWC::Color' has a wrong offset!");
static_assert(offsetof(FHoudiniEvent_SWC, Type) == 0x000044, "Member 'FHoudiniEvent_SWC::Type' has a wrong offset!");

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosDestructionEvent_SWC) == 0x000004, "Wrong alignment on FChaosDestructionEvent_SWC");
static_assert(sizeof(FChaosDestructionEvent_SWC) == 0x000044, "Wrong size on FChaosDestructionEvent_SWC");
static_assert(offsetof(FChaosDestructionEvent_SWC, Position) == 0x000000, "Member 'FChaosDestructionEvent_SWC::Position' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Normal) == 0x00000C, "Member 'FChaosDestructionEvent_SWC::Normal' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Velocity) == 0x000018, "Member 'FChaosDestructionEvent_SWC::Velocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, AngularVelocity) == 0x000024, "Member 'FChaosDestructionEvent_SWC::AngularVelocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMin) == 0x000030, "Member 'FChaosDestructionEvent_SWC::ExtentMin' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMax) == 0x000034, "Member 'FChaosDestructionEvent_SWC::ExtentMax' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ParticleID) == 0x000038, "Member 'FChaosDestructionEvent_SWC::ParticleID' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Time) == 0x00003C, "Member 'FChaosDestructionEvent_SWC::Time' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Type) == 0x000040, "Member 'FChaosDestructionEvent_SWC::Type' has a wrong offset!");

}

