#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TreasureLootPile

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TreasureLootPile.TreasureLootPile_C
// 0x0018 (0x03A8 - 0x0390)
class ATreasureLootPile_C final : public ATreasureHuntLootPile
{
public:
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      LavaMaterial;                                      // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TreasureLootPile_C">();
	}
	static class ATreasureLootPile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATreasureLootPile_C>();
	}
};
static_assert(alignof(ATreasureLootPile_C) == 0x000008, "Wrong alignment on ATreasureLootPile_C");
static_assert(sizeof(ATreasureLootPile_C) == 0x0003A8, "Wrong size on ATreasureLootPile_C");
static_assert(offsetof(ATreasureLootPile_C, ParticleSystem) == 0x000390, "Member 'ATreasureLootPile_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ATreasureLootPile_C, StaticMesh) == 0x000398, "Member 'ATreasureLootPile_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ATreasureLootPile_C, LavaMaterial) == 0x0003A0, "Member 'ATreasureLootPile_C::LavaMaterial' has a wrong offset!");

}

