#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TurnInPlaceAnimNotify

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TurnInPlaceAnimNotify.TurnInPlaceAnimNotify_C.Received_NotifyTick
// 0x0050 (0x0050 - 0x0000)
struct TurnInPlaceAnimNotify_C_Received_NotifyTick final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDeltaTime;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0018(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TurnInPlaceAnimNotify_C_Received_NotifyTick) == 0x000008, "Wrong alignment on TurnInPlaceAnimNotify_C_Received_NotifyTick");
static_assert(sizeof(TurnInPlaceAnimNotify_C_Received_NotifyTick) == 0x000050, "Wrong size on TurnInPlaceAnimNotify_C_Received_NotifyTick");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyTick, MeshComp) == 0x000000, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyTick::MeshComp' has a wrong offset!");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyTick, Animation) == 0x000008, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyTick::Animation' has a wrong offset!");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyTick, FrameDeltaTime) == 0x000010, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyTick::FrameDeltaTime' has a wrong offset!");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyTick, EventReference) == 0x000018, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyTick::EventReference' has a wrong offset!");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyTick, ReturnValue) == 0x000048, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyTick::ReturnValue' has a wrong offset!");

// Function TurnInPlaceAnimNotify.TurnInPlaceAnimNotify_C.Received_NotifyEnd
// 0x0048 (0x0048 - 0x0000)
struct TurnInPlaceAnimNotify_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TurnInPlaceAnimNotify_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on TurnInPlaceAnimNotify_C_Received_NotifyEnd");
static_assert(sizeof(TurnInPlaceAnimNotify_C_Received_NotifyEnd) == 0x000048, "Wrong size on TurnInPlaceAnimNotify_C_Received_NotifyEnd");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyEnd, EventReference) == 0x000010, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyEnd::EventReference' has a wrong offset!");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyEnd, ReturnValue) == 0x000040, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");

// Function TurnInPlaceAnimNotify.TurnInPlaceAnimNotify_C.Received_NotifyBegin
// 0x0050 (0x0050 - 0x0000)
struct TurnInPlaceAnimNotify_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0018(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TurnInPlaceAnimNotify_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on TurnInPlaceAnimNotify_C_Received_NotifyBegin");
static_assert(sizeof(TurnInPlaceAnimNotify_C_Received_NotifyBegin) == 0x000050, "Wrong size on TurnInPlaceAnimNotify_C_Received_NotifyBegin");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyBegin, EventReference) == 0x000018, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyBegin::EventReference' has a wrong offset!");
static_assert(offsetof(TurnInPlaceAnimNotify_C_Received_NotifyBegin, ReturnValue) == 0x000048, "Member 'TurnInPlaceAnimNotify_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");

}

