#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TwoH_SWD_NPC_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct 2H_SWD_NPC_AnimBP.2H_SWD_NPC_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01C7 (0x01C8 - 0x0001)
struct TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_471;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_472;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_473;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_474;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_475;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_476;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_477;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_478;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_479;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_480;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_481;                                 // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_482;                               // 0x0060(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_483;                                // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_484;                               // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_485;                              // 0x0078(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_486;                               // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_487;                                // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_488;                                // 0x00A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_489;                                // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_490;                                // 0x00B4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_491;                                // 0x00BC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_492;                                 // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_493;                               // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_494;                               // 0x00D8(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_495;                                // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_496;                                  // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_497;                                // 0x00F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_498;                                // 0x00F9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_499;                                // 0x00FA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_500;                               // 0x0100(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_501;                              // 0x0110(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0130(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01B0(0x0018)()
};
static_assert(alignof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001C8, "Wrong size on TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_471) == 0x000004, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_471' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_472) == 0x000010, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_472' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_473) == 0x000020, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_473' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_474) == 0x000028, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_474' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_475) == 0x000030, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_475' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_476) == 0x000038, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_476' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_477) == 0x000040, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_477' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_478) == 0x000044, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_478' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_479) == 0x00004C, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_479' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_480) == 0x000050, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_480' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_481) == 0x000058, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_481' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_482) == 0x000060, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_482' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_483) == 0x000070, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_483' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_484) == 0x000074, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_484' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_485) == 0x000078, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_485' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_486) == 0x0000A4, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_486' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_487) == 0x0000A8, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_487' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_488) == 0x0000A9, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_488' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_489) == 0x0000AC, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_489' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_490) == 0x0000B4, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_490' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_491) == 0x0000BC, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_491' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_492) == 0x0000C4, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_492' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_493) == 0x0000C8, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_493' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_494) == 0x0000D8, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_494' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_495) == 0x0000E8, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_495' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_496) == 0x0000F0, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_496' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_497) == 0x0000F8, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_497' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_498) == 0x0000F9, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_498' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_499) == 0x0000FA, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_499' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_500) == 0x000100, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_500' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_501) == 0x000110, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_501' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000130, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001B0, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct 2H_SWD_NPC_AnimBP.2H_SWD_NPC_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x002F (0x0030 - 0x0001)
struct TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x001D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_8;                                   // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_10;                                  // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x002D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000030, "Wrong size on TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x000008, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x00000C, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000010, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000014, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x000018, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_6) == 0x00001C, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_6' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x00001D, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_8) == 0x000020, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_8' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_9) == 0x000024, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_9' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __IntProperty_10) == 0x000028, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__IntProperty_10' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_11) == 0x00002C, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_11' has a wrong offset!");
static_assert(offsetof(TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_12) == 0x00002D, "Member 'TwoH_SWD_NPC_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_12' has a wrong offset!");

}

