#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UNARMED_NPC_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UNARMED_NPC_AnimBP.UNARMED_NPC_AnimBP_C.ExecuteUbergraph_UNARMED_NPC_AnimBP
// 0x0100 (0x0100 - 0x0000)
struct UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_3;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_4;       // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_4;          // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_5;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInCombat_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTurnRate_ReturnValue;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize2D_ReturnValue;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_2;    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_3;    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_3;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_4;    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_4;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_5;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_TurnRate_ImplicitCast;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP) == 0x000008, "Wrong alignment on UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP");
static_assert(sizeof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP) == 0x000100, "Wrong size on UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, EntryPoint) == 0x000000, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000005, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x000006, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000007, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue_3) == 0x000009, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x00000A, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x00000C, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x000011, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x000012, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanOR_ReturnValue_1) == 0x000013, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue_4) == 0x000014, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_3) == 0x000015, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue_5) == 0x000016, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000017, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_4) == 0x000018, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_5) == 0x000019, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue_6) == 0x00001A, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_6) == 0x00001B, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_7) == 0x00001C, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000020, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000024, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_8) == 0x000025, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue_7) == 0x000026, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000027, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_9) == 0x000028, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000029, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue_8) == 0x00002A, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x00002B, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_10) == 0x00002C, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue_9) == 0x00002D, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue_3) == 0x00002E, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x00002F, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanOR_ReturnValue_2) == 0x000030, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_11) == 0x000031, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue_10) == 0x000032, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_4) == 0x000033, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_12) == 0x000034, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue_11) == 0x000035, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue_4) == 0x000036, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_13) == 0x000037, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Not_PreBool_ReturnValue_12) == 0x000038, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Not_PreBool_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue_5) == 0x000039, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_BooleanAND_ReturnValue_14) == 0x00003A, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_BooleanAND_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, K2Node_Event_DeltaTimeX) == 0x00003C, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000040, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000048, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, K2Node_DynamicCast_AsBase_Character) == 0x000050, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_GetInCombat_ReturnValue) == 0x000059, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_GetInCombat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_GetTurnRate_ReturnValue) == 0x00005C, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_GetTurnRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_IsDead_ReturnValue) == 0x000060, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_GetVelocity_ReturnValue) == 0x000068, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000080, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_VSize2D_ReturnValue) == 0x000090, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000A0, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x0000A8, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x0000B0, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x0000B8, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x0000C0, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_2) == 0x0000C8, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_3) == 0x0000D0, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast_3) == 0x0000D8, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_4) == 0x0000E0, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast_4) == 0x0000E8, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast_5) == 0x0000F0, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP, K2Node_VariableSet_TurnRate_ImplicitCast) == 0x0000F8, "Member 'UNARMED_NPC_AnimBP_C_ExecuteUbergraph_UNARMED_NPC_AnimBP::K2Node_VariableSet_TurnRate_ImplicitCast' has a wrong offset!");

// Function UNARMED_NPC_AnimBP.UNARMED_NPC_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct UNARMED_NPC_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UNARMED_NPC_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on UNARMED_NPC_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(UNARMED_NPC_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on UNARMED_NPC_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'UNARMED_NPC_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function UNARMED_NPC_AnimBP.UNARMED_NPC_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct UNARMED_NPC_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(UNARMED_NPC_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on UNARMED_NPC_AnimBP_C_AnimGraph");
static_assert(sizeof(UNARMED_NPC_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on UNARMED_NPC_AnimBP_C_AnimGraph");
static_assert(offsetof(UNARMED_NPC_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'UNARMED_NPC_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

