#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VendorItem

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct VendorItem.VendorItem
// 0x0028 (0x0028 - 0x0000)
struct FVendorItem final
{
public:
	class FString                                 VendorListID_2_8FCF1E9D43490A213EF12A90BDB335C7;   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         NodeLevel_5_C645CF6C4D9FE0BBDACC508CD3D8B2EB;      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Item_21_DE3BCFEF4A53597502ADB6B511287550;          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Price_11_F2AE18FF4DE10DDDC8DE5BA73AE55317;         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FVendorItem) == 0x000008, "Wrong alignment on FVendorItem");
static_assert(sizeof(FVendorItem) == 0x000028, "Wrong size on FVendorItem");
static_assert(offsetof(FVendorItem, VendorListID_2_8FCF1E9D43490A213EF12A90BDB335C7) == 0x000000, "Member 'FVendorItem::VendorListID_2_8FCF1E9D43490A213EF12A90BDB335C7' has a wrong offset!");
static_assert(offsetof(FVendorItem, NodeLevel_5_C645CF6C4D9FE0BBDACC508CD3D8B2EB) == 0x000010, "Member 'FVendorItem::NodeLevel_5_C645CF6C4D9FE0BBDACC508CD3D8B2EB' has a wrong offset!");
static_assert(offsetof(FVendorItem, Item_21_DE3BCFEF4A53597502ADB6B511287550) == 0x000018, "Member 'FVendorItem::Item_21_DE3BCFEF4A53597502ADB6B511287550' has a wrong offset!");
static_assert(offsetof(FVendorItem, Price_11_F2AE18FF4DE10DDDC8DE5BA73AE55317) == 0x000020, "Member 'FVendorItem::Price_11_F2AE18FF4DE10DDDC8DE5BA73AE55317' has a wrong offset!");

}

