#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Verra_World_Master

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function Verra_World_Master.Verra_World_Master_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Verra_World_Master_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Verra_World_Master_C_ReceiveTick) == 0x000004, "Wrong alignment on Verra_World_Master_C_ReceiveTick");
static_assert(sizeof(Verra_World_Master_C_ReceiveTick) == 0x000004, "Wrong size on Verra_World_Master_C_ReceiveTick");
static_assert(offsetof(Verra_World_Master_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Verra_World_Master_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Verra_World_Master.Verra_World_Master_C.IntrepidInitialize
// 0x0008 (0x0008 - 0x0000)
struct Verra_World_Master_C_IntrepidInitialize final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Verra_World_Master_C_IntrepidInitialize) == 0x000008, "Wrong alignment on Verra_World_Master_C_IntrepidInitialize");
static_assert(sizeof(Verra_World_Master_C_IntrepidInitialize) == 0x000008, "Wrong size on Verra_World_Master_C_IntrepidInitialize");
static_assert(offsetof(Verra_World_Master_C_IntrepidInitialize, Controller) == 0x000000, "Member 'Verra_World_Master_C_IntrepidInitialize::Controller' has a wrong offset!");

// Function Verra_World_Master.Verra_World_Master_C.InpActEvt_Multiply_UniqueObjectNameForCooking_2
// 0x0018 (0x0018 - 0x0000)
struct Verra_World_Master_C_InpActEvt_Multiply_UniqueObjectNameForCooking_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Verra_World_Master_C_InpActEvt_Multiply_UniqueObjectNameForCooking_2) == 0x000008, "Wrong alignment on Verra_World_Master_C_InpActEvt_Multiply_UniqueObjectNameForCooking_2");
static_assert(sizeof(Verra_World_Master_C_InpActEvt_Multiply_UniqueObjectNameForCooking_2) == 0x000018, "Wrong size on Verra_World_Master_C_InpActEvt_Multiply_UniqueObjectNameForCooking_2");
static_assert(offsetof(Verra_World_Master_C_InpActEvt_Multiply_UniqueObjectNameForCooking_2, Key) == 0x000000, "Member 'Verra_World_Master_C_InpActEvt_Multiply_UniqueObjectNameForCooking_2::Key' has a wrong offset!");

// Function Verra_World_Master.Verra_World_Master_C.InpActEvt_Ctrl_Home_UniqueObjectNameForCooking_1
// 0x0018 (0x0018 - 0x0000)
struct Verra_World_Master_C_InpActEvt_Ctrl_Home_UniqueObjectNameForCooking_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Verra_World_Master_C_InpActEvt_Ctrl_Home_UniqueObjectNameForCooking_1) == 0x000008, "Wrong alignment on Verra_World_Master_C_InpActEvt_Ctrl_Home_UniqueObjectNameForCooking_1");
static_assert(sizeof(Verra_World_Master_C_InpActEvt_Ctrl_Home_UniqueObjectNameForCooking_1) == 0x000018, "Wrong size on Verra_World_Master_C_InpActEvt_Ctrl_Home_UniqueObjectNameForCooking_1");
static_assert(offsetof(Verra_World_Master_C_InpActEvt_Ctrl_Home_UniqueObjectNameForCooking_1, Key) == 0x000000, "Member 'Verra_World_Master_C_InpActEvt_Ctrl_Home_UniqueObjectNameForCooking_1::Key' has a wrong offset!");

// Function Verra_World_Master.Verra_World_Master_C.ExecuteUbergraph_Verra_World_Master
// 0x0088 (0x0088 - 0x0000)
struct Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAoCPlayerControllerBP_C*               K2Node_DynamicCast_AsAo_CPlayer_Controller_BP;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAoCGameStateBP_C*                      K2Node_DynamicCast_AsAo_CGame_State_BP;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_controller;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAoCPlayerControllerBP_C*               K2Node_DynamicCast_AsAo_CPlayer_Controller_BP_1;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   UniqueObjectNameForCooking_Key;                    // 0x0058(0x0018)(HasGetValueTypeHash)
	struct FKey                                   UniqueObjectNameForCooking_Key_1;                  // 0x0070(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master) == 0x000008, "Wrong alignment on Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master");
static_assert(sizeof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master) == 0x000088, "Wrong size on Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, EntryPoint) == 0x000000, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, K2Node_DynamicCast_AsAo_CPlayer_Controller_BP) == 0x000018, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::K2Node_DynamicCast_AsAo_CPlayer_Controller_BP' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, K2Node_DynamicCast_AsAo_CGame_State_BP) == 0x000028, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::K2Node_DynamicCast_AsAo_CGame_State_BP' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, K2Node_Event_controller) == 0x000038, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::K2Node_Event_controller' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, K2Node_DynamicCast_AsAo_CPlayer_Controller_BP_1) == 0x000048, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::K2Node_DynamicCast_AsAo_CPlayer_Controller_BP_1' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000051, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, UniqueObjectNameForCooking_Key) == 0x000058, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::UniqueObjectNameForCooking_Key' has a wrong offset!");
static_assert(offsetof(Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master, UniqueObjectNameForCooking_Key_1) == 0x000070, "Member 'Verra_World_Master_C_ExecuteUbergraph_Verra_World_Master::UniqueObjectNameForCooking_Key_1' has a wrong offset!");

}

