#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NodeMaster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NodeMaster.WBP_NodeMaster_C
// 0x0018 (0x0B50 - 0x0B38)
class UWBP_NodeMaster_C final : public UNodeMaster
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         CurrencyBox;                                       // 0x0B40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyTiersItem_C*               NodeCurrencyItem;                                  // 0x0B48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_NodeMaster(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NodeMaster_C">();
	}
	static class UWBP_NodeMaster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NodeMaster_C>();
	}
};
static_assert(alignof(UWBP_NodeMaster_C) == 0x000008, "Wrong alignment on UWBP_NodeMaster_C");
static_assert(sizeof(UWBP_NodeMaster_C) == 0x000B50, "Wrong size on UWBP_NodeMaster_C");
static_assert(offsetof(UWBP_NodeMaster_C, UberGraphFrame) == 0x000B38, "Member 'UWBP_NodeMaster_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NodeMaster_C, CurrencyBox) == 0x000B40, "Member 'UWBP_NodeMaster_C::CurrencyBox' has a wrong offset!");
static_assert(offsetof(UWBP_NodeMaster_C, NodeCurrencyItem) == 0x000B48, "Member 'UWBP_NodeMaster_C::NodeCurrencyItem' has a wrong offset!");

}

