#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MayoralAvailableCommissionItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MayoralAvailableCommissionItem.WBP_MayoralAvailableCommissionItem_C
// 0x0030 (0x17E0 - 0x17B0)
class UWBP_MayoralAvailableCommissionItem_C final : public UMayoralAvailableCommissionItem
{
public:
	class UCommonBorder*                          B_AlternatingBG;                                   // 0x17B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RewardsSection;                                    // 0x17B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon;                           // 0x17C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon_1;                         // 0x17C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon_2;                         // 0x17D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon_3;                         // 0x17D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MayoralAvailableCommissionItem_C">();
	}
	static class UWBP_MayoralAvailableCommissionItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MayoralAvailableCommissionItem_C>();
	}
};
static_assert(alignof(UWBP_MayoralAvailableCommissionItem_C) == 0x000010, "Wrong alignment on UWBP_MayoralAvailableCommissionItem_C");
static_assert(sizeof(UWBP_MayoralAvailableCommissionItem_C) == 0x0017E0, "Wrong size on UWBP_MayoralAvailableCommissionItem_C");
static_assert(offsetof(UWBP_MayoralAvailableCommissionItem_C, B_AlternatingBG) == 0x0017B0, "Member 'UWBP_MayoralAvailableCommissionItem_C::B_AlternatingBG' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralAvailableCommissionItem_C, RewardsSection) == 0x0017B8, "Member 'UWBP_MayoralAvailableCommissionItem_C::RewardsSection' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralAvailableCommissionItem_C, WBP_RewardContainerIcon) == 0x0017C0, "Member 'UWBP_MayoralAvailableCommissionItem_C::WBP_RewardContainerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralAvailableCommissionItem_C, WBP_RewardContainerIcon_1) == 0x0017C8, "Member 'UWBP_MayoralAvailableCommissionItem_C::WBP_RewardContainerIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralAvailableCommissionItem_C, WBP_RewardContainerIcon_2) == 0x0017D0, "Member 'UWBP_MayoralAvailableCommissionItem_C::WBP_RewardContainerIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralAvailableCommissionItem_C, WBP_RewardContainerIcon_3) == 0x0017D8, "Member 'UWBP_MayoralAvailableCommissionItem_C::WBP_RewardContainerIcon_3' has a wrong offset!");

}

