#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemFeed

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemFeed.WBP_ItemFeed_C
// 0x0018 (0x0330 - 0x0318)
class UWBP_ItemFeed_C final : public UItemFeed
{
public:
	class UWBP_ItemFeedEntry_C*                   WBP_ItemFeedEntry;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemFeedEntry_C*                   WBP_ItemFeedEntry_68;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemFeedEntry_C*                   WBP_ItemFeedEntry_106;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemFeed_C">();
	}
	static class UWBP_ItemFeed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemFeed_C>();
	}
};
static_assert(alignof(UWBP_ItemFeed_C) == 0x000008, "Wrong alignment on UWBP_ItemFeed_C");
static_assert(sizeof(UWBP_ItemFeed_C) == 0x000330, "Wrong size on UWBP_ItemFeed_C");
static_assert(offsetof(UWBP_ItemFeed_C, WBP_ItemFeedEntry) == 0x000318, "Member 'UWBP_ItemFeed_C::WBP_ItemFeedEntry' has a wrong offset!");
static_assert(offsetof(UWBP_ItemFeed_C, WBP_ItemFeedEntry_68) == 0x000320, "Member 'UWBP_ItemFeed_C::WBP_ItemFeedEntry_68' has a wrong offset!");
static_assert(offsetof(UWBP_ItemFeed_C, WBP_ItemFeedEntry_106) == 0x000328, "Member 'UWBP_ItemFeed_C::WBP_ItemFeedEntry_106' has a wrong offset!");

}

