#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SurveyingMenu

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SurveyingMenu.WBP_SurveyingMenu_C
// 0x0048 (0x0338 - 0x02F0)
class UWBP_SurveyingMenu_C final : public UUserWidget
{
public:
	class UAoCCommonTextBlock*                    AvailableResourcesText;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIntrepidWrapBox*                       SurveyingResultsBox;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   WBP_ScrollWindow_NoFrameNoPadding;                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SurveyingResultsItem_C*            WBP_SurveyingResultsItem;                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SurveyingResultsItem_C*            WBP_SurveyingResultsItem_1;                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SurveyingResultsItem_C*            WBP_SurveyingResultsItem_2;                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SurveyingResultsItem_C*            WBP_SurveyingResultsItem_3;                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SurveyingResultsItem_C*            WBP_SurveyingResultsItem_4;                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SurveyingResultsItem_C*            WBP_SurveyingResultsItem_5;                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SurveyingMenu_C">();
	}
	static class UWBP_SurveyingMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SurveyingMenu_C>();
	}
};
static_assert(alignof(UWBP_SurveyingMenu_C) == 0x000008, "Wrong alignment on UWBP_SurveyingMenu_C");
static_assert(sizeof(UWBP_SurveyingMenu_C) == 0x000338, "Wrong size on UWBP_SurveyingMenu_C");
static_assert(offsetof(UWBP_SurveyingMenu_C, AvailableResourcesText) == 0x0002F0, "Member 'UWBP_SurveyingMenu_C::AvailableResourcesText' has a wrong offset!");
static_assert(offsetof(UWBP_SurveyingMenu_C, SurveyingResultsBox) == 0x0002F8, "Member 'UWBP_SurveyingMenu_C::SurveyingResultsBox' has a wrong offset!");
static_assert(offsetof(UWBP_SurveyingMenu_C, WBP_ScrollWindow_NoFrameNoPadding) == 0x000300, "Member 'UWBP_SurveyingMenu_C::WBP_ScrollWindow_NoFrameNoPadding' has a wrong offset!");
static_assert(offsetof(UWBP_SurveyingMenu_C, WBP_SurveyingResultsItem) == 0x000308, "Member 'UWBP_SurveyingMenu_C::WBP_SurveyingResultsItem' has a wrong offset!");
static_assert(offsetof(UWBP_SurveyingMenu_C, WBP_SurveyingResultsItem_1) == 0x000310, "Member 'UWBP_SurveyingMenu_C::WBP_SurveyingResultsItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_SurveyingMenu_C, WBP_SurveyingResultsItem_2) == 0x000318, "Member 'UWBP_SurveyingMenu_C::WBP_SurveyingResultsItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_SurveyingMenu_C, WBP_SurveyingResultsItem_3) == 0x000320, "Member 'UWBP_SurveyingMenu_C::WBP_SurveyingResultsItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_SurveyingMenu_C, WBP_SurveyingResultsItem_4) == 0x000328, "Member 'UWBP_SurveyingMenu_C::WBP_SurveyingResultsItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_SurveyingMenu_C, WBP_SurveyingResultsItem_5) == 0x000330, "Member 'UWBP_SurveyingMenu_C::WBP_SurveyingResultsItem_5' has a wrong offset!");

}

