#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LootRulesVotingModal

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LootRulesVotingModal.WBP_LootRulesVotingModal_C
// 0x0048 (0x0390 - 0x0348)
class UWBP_LootRulesVotingModal_C final : public ULootRulesVotingModal
{
public:
	class UImage*                                 IMG_HorizontalSepartor_1;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_HorizontalSepartor_2;                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LootRuleEntry_C*                   WBP_LootRuleEntry;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LootRuleEntry_C*                   WBP_LootRuleEntry_1;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LootRuleEntry_C*                   WBP_LootRuleEntry_2;                               // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LootRuleEntry_C*                   WBP_LootRuleEntry_3;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LootRuleEntry_C*                   WBP_LootRuleEntry_4;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LootRuleEntry_C*                   WBP_LootRuleEntry_5;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LootRuleEntry_C*                   WBP_LootRuleEntry_6;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LootRulesVotingModal_C">();
	}
	static class UWBP_LootRulesVotingModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LootRulesVotingModal_C>();
	}
};
static_assert(alignof(UWBP_LootRulesVotingModal_C) == 0x000008, "Wrong alignment on UWBP_LootRulesVotingModal_C");
static_assert(sizeof(UWBP_LootRulesVotingModal_C) == 0x000390, "Wrong size on UWBP_LootRulesVotingModal_C");
static_assert(offsetof(UWBP_LootRulesVotingModal_C, IMG_HorizontalSepartor_1) == 0x000348, "Member 'UWBP_LootRulesVotingModal_C::IMG_HorizontalSepartor_1' has a wrong offset!");
static_assert(offsetof(UWBP_LootRulesVotingModal_C, IMG_HorizontalSepartor_2) == 0x000350, "Member 'UWBP_LootRulesVotingModal_C::IMG_HorizontalSepartor_2' has a wrong offset!");
static_assert(offsetof(UWBP_LootRulesVotingModal_C, WBP_LootRuleEntry) == 0x000358, "Member 'UWBP_LootRulesVotingModal_C::WBP_LootRuleEntry' has a wrong offset!");
static_assert(offsetof(UWBP_LootRulesVotingModal_C, WBP_LootRuleEntry_1) == 0x000360, "Member 'UWBP_LootRulesVotingModal_C::WBP_LootRuleEntry_1' has a wrong offset!");
static_assert(offsetof(UWBP_LootRulesVotingModal_C, WBP_LootRuleEntry_2) == 0x000368, "Member 'UWBP_LootRulesVotingModal_C::WBP_LootRuleEntry_2' has a wrong offset!");
static_assert(offsetof(UWBP_LootRulesVotingModal_C, WBP_LootRuleEntry_3) == 0x000370, "Member 'UWBP_LootRulesVotingModal_C::WBP_LootRuleEntry_3' has a wrong offset!");
static_assert(offsetof(UWBP_LootRulesVotingModal_C, WBP_LootRuleEntry_4) == 0x000378, "Member 'UWBP_LootRulesVotingModal_C::WBP_LootRuleEntry_4' has a wrong offset!");
static_assert(offsetof(UWBP_LootRulesVotingModal_C, WBP_LootRuleEntry_5) == 0x000380, "Member 'UWBP_LootRulesVotingModal_C::WBP_LootRuleEntry_5' has a wrong offset!");
static_assert(offsetof(UWBP_LootRulesVotingModal_C, WBP_LootRuleEntry_6) == 0x000388, "Member 'UWBP_LootRulesVotingModal_C::WBP_LootRuleEntry_6' has a wrong offset!");

}

