#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GuildMemberList

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GuildMemberList.WBP_GuildMemberList_C
// 0x00B8 (0x0400 - 0x0348)
class UWBP_GuildMemberList_C final : public UGuildMemberList
{
public:
	class UCircularThrobber*                      Loading;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScrollWindow;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_1;                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_2;                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_3;                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_4;                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_5;                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_6;                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_7;                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_8;                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_9;                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_10;                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_11;                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_12;                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_13;                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_14;                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_15;                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_16;                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_17;                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_18;                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_19;                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildMemberListEntry_C*            WBP_GuildMemberListEntry_20;                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GuildMemberList_C">();
	}
	static class UWBP_GuildMemberList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GuildMemberList_C>();
	}
};
static_assert(alignof(UWBP_GuildMemberList_C) == 0x000008, "Wrong alignment on UWBP_GuildMemberList_C");
static_assert(sizeof(UWBP_GuildMemberList_C) == 0x000400, "Wrong size on UWBP_GuildMemberList_C");
static_assert(offsetof(UWBP_GuildMemberList_C, Loading) == 0x000348, "Member 'UWBP_GuildMemberList_C::Loading' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, ScrollWindow) == 0x000350, "Member 'UWBP_GuildMemberList_C::ScrollWindow' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry) == 0x000358, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_1) == 0x000360, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_1' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_2) == 0x000368, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_2' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_3) == 0x000370, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_3' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_4) == 0x000378, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_4' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_5) == 0x000380, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_5' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_6) == 0x000388, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_6' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_7) == 0x000390, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_7' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_8) == 0x000398, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_8' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_9) == 0x0003A0, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_9' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_10) == 0x0003A8, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_10' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_11) == 0x0003B0, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_11' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_12) == 0x0003B8, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_12' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_13) == 0x0003C0, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_13' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_14) == 0x0003C8, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_14' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_15) == 0x0003D0, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_15' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_16) == 0x0003D8, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_16' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_17) == 0x0003E0, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_17' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_18) == 0x0003E8, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_18' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_19) == 0x0003F0, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_19' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMemberList_C, WBP_GuildMemberListEntry_20) == 0x0003F8, "Member 'UWBP_GuildMemberList_C::WBP_GuildMemberListEntry_20' has a wrong offset!");

}

