#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ArtisanshipMaterialItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ArtisanshipMaterialItem.WBP_ArtisanshipMaterialItem_C
// 0x0020 (0x03F8 - 0x03D8)
class UWBP_ArtisanshipMaterialItem_C final : public UArtisanshipMaterialItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Rarity;                                            // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Have;                                              // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Need;                                              // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             MaterialTexture;                                   // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ArtisanshipMaterialItem(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ArtisanshipMaterialItem_C">();
	}
	static class UWBP_ArtisanshipMaterialItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ArtisanshipMaterialItem_C>();
	}
};
static_assert(alignof(UWBP_ArtisanshipMaterialItem_C) == 0x000008, "Wrong alignment on UWBP_ArtisanshipMaterialItem_C");
static_assert(sizeof(UWBP_ArtisanshipMaterialItem_C) == 0x0003F8, "Wrong size on UWBP_ArtisanshipMaterialItem_C");
static_assert(offsetof(UWBP_ArtisanshipMaterialItem_C, UberGraphFrame) == 0x0003D8, "Member 'UWBP_ArtisanshipMaterialItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipMaterialItem_C, Rarity) == 0x0003E0, "Member 'UWBP_ArtisanshipMaterialItem_C::Rarity' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipMaterialItem_C, Have) == 0x0003E8, "Member 'UWBP_ArtisanshipMaterialItem_C::Have' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipMaterialItem_C, Need) == 0x0003EC, "Member 'UWBP_ArtisanshipMaterialItem_C::Need' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipMaterialItem_C, MaterialTexture) == 0x0003F0, "Member 'UWBP_ArtisanshipMaterialItem_C::MaterialTexture' has a wrong offset!");

}

