#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChatTextColorsGrid

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ChatTextColorsGrid.WBP_ChatTextColorsGrid_C
// 0x0030 (0x03C0 - 0x0390)
class UWBP_ChatTextColorsGrid_C final : public UCommonRow
{
public:
	class UIntrepidVerticalBox*                   ColorItemsBox;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          LabelBorder;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ChatTextColorItem_C*               WBP_ChatTextColorItem;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ChatTextColorItem_C*               WBP_ChatTextColorItem_1;                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ChatTextColorItem_C*               WBP_ChatTextColorItem_2;                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ChatTextColorItem_C*               WBP_ChatTextColorItem_3;                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ChatTextColorsGrid_C">();
	}
	static class UWBP_ChatTextColorsGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ChatTextColorsGrid_C>();
	}
};
static_assert(alignof(UWBP_ChatTextColorsGrid_C) == 0x000008, "Wrong alignment on UWBP_ChatTextColorsGrid_C");
static_assert(sizeof(UWBP_ChatTextColorsGrid_C) == 0x0003C0, "Wrong size on UWBP_ChatTextColorsGrid_C");
static_assert(offsetof(UWBP_ChatTextColorsGrid_C, ColorItemsBox) == 0x000390, "Member 'UWBP_ChatTextColorsGrid_C::ColorItemsBox' has a wrong offset!");
static_assert(offsetof(UWBP_ChatTextColorsGrid_C, LabelBorder) == 0x000398, "Member 'UWBP_ChatTextColorsGrid_C::LabelBorder' has a wrong offset!");
static_assert(offsetof(UWBP_ChatTextColorsGrid_C, WBP_ChatTextColorItem) == 0x0003A0, "Member 'UWBP_ChatTextColorsGrid_C::WBP_ChatTextColorItem' has a wrong offset!");
static_assert(offsetof(UWBP_ChatTextColorsGrid_C, WBP_ChatTextColorItem_1) == 0x0003A8, "Member 'UWBP_ChatTextColorsGrid_C::WBP_ChatTextColorItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_ChatTextColorsGrid_C, WBP_ChatTextColorItem_2) == 0x0003B0, "Member 'UWBP_ChatTextColorsGrid_C::WBP_ChatTextColorItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_ChatTextColorsGrid_C, WBP_ChatTextColorItem_3) == 0x0003B8, "Member 'UWBP_ChatTextColorsGrid_C::WBP_ChatTextColorItem_3' has a wrong offset!");

}

