#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Slider

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Slider.WBP_Slider_C
// 0x0018 (0x0340 - 0x0328)
class UWBP_Slider_C final : public UEditableTextSlider
{
public:
	class UCommonButton_C*                        DecreaseButton;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonButton_C*                        IncreaseButton;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SliderGlow;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Slider_C">();
	}
	static class UWBP_Slider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Slider_C>();
	}
};
static_assert(alignof(UWBP_Slider_C) == 0x000008, "Wrong alignment on UWBP_Slider_C");
static_assert(sizeof(UWBP_Slider_C) == 0x000340, "Wrong size on UWBP_Slider_C");
static_assert(offsetof(UWBP_Slider_C, DecreaseButton) == 0x000328, "Member 'UWBP_Slider_C::DecreaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_C, IncreaseButton) == 0x000330, "Member 'UWBP_Slider_C::IncreaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_C, SliderGlow) == 0x000338, "Member 'UWBP_Slider_C::SliderGlow' has a wrong offset!");

}

