#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RaidFrame

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RaidFrame.WBP_RaidFrame_C
// 0x0028 (0x0380 - 0x0358)
class UWBP_RaidFrame_C final : public URaidFrame
{
public:
	class UWBP_RaidGroupWidget_C*                 WBP_RaidGroupWidget;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaidGroupWidget_C*                 WBP_RaidGroupWidget_1;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaidGroupWidget_C*                 WBP_RaidGroupWidget_2;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaidGroupWidget_C*                 WBP_RaidGroupWidget_3;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaidGroupWidget_C*                 WBP_RaidGroupWidget_4;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RaidFrame_C">();
	}
	static class UWBP_RaidFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RaidFrame_C>();
	}
};
static_assert(alignof(UWBP_RaidFrame_C) == 0x000008, "Wrong alignment on UWBP_RaidFrame_C");
static_assert(sizeof(UWBP_RaidFrame_C) == 0x000380, "Wrong size on UWBP_RaidFrame_C");
static_assert(offsetof(UWBP_RaidFrame_C, WBP_RaidGroupWidget) == 0x000358, "Member 'UWBP_RaidFrame_C::WBP_RaidGroupWidget' has a wrong offset!");
static_assert(offsetof(UWBP_RaidFrame_C, WBP_RaidGroupWidget_1) == 0x000360, "Member 'UWBP_RaidFrame_C::WBP_RaidGroupWidget_1' has a wrong offset!");
static_assert(offsetof(UWBP_RaidFrame_C, WBP_RaidGroupWidget_2) == 0x000368, "Member 'UWBP_RaidFrame_C::WBP_RaidGroupWidget_2' has a wrong offset!");
static_assert(offsetof(UWBP_RaidFrame_C, WBP_RaidGroupWidget_3) == 0x000370, "Member 'UWBP_RaidFrame_C::WBP_RaidGroupWidget_3' has a wrong offset!");
static_assert(offsetof(UWBP_RaidFrame_C, WBP_RaidGroupWidget_4) == 0x000378, "Member 'UWBP_RaidFrame_C::WBP_RaidGroupWidget_4' has a wrong offset!");

}

