#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeathSummaryItem

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DeathSummaryItem.WBP_DeathSummaryItem_C
// 0x0038 (0x0328 - 0x02F0)
class UWBP_DeathSummaryItem_C final : public UUserWidget
{
public:
	class UAoCCommonTextBlock*                    ActionTextBlock;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIntrepidCommonBorder*                  B_MainContainer;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    DamageDealerTextBlock;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    DamageValuelTextBlock;                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DeathblowHeader;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ModifierIcon;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    ModifierTextBlock;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DeathSummaryItem_C">();
	}
	static class UWBP_DeathSummaryItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DeathSummaryItem_C>();
	}
};
static_assert(alignof(UWBP_DeathSummaryItem_C) == 0x000008, "Wrong alignment on UWBP_DeathSummaryItem_C");
static_assert(sizeof(UWBP_DeathSummaryItem_C) == 0x000328, "Wrong size on UWBP_DeathSummaryItem_C");
static_assert(offsetof(UWBP_DeathSummaryItem_C, ActionTextBlock) == 0x0002F0, "Member 'UWBP_DeathSummaryItem_C::ActionTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryItem_C, B_MainContainer) == 0x0002F8, "Member 'UWBP_DeathSummaryItem_C::B_MainContainer' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryItem_C, DamageDealerTextBlock) == 0x000300, "Member 'UWBP_DeathSummaryItem_C::DamageDealerTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryItem_C, DamageValuelTextBlock) == 0x000308, "Member 'UWBP_DeathSummaryItem_C::DamageValuelTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryItem_C, DeathblowHeader) == 0x000310, "Member 'UWBP_DeathSummaryItem_C::DeathblowHeader' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryItem_C, ModifierIcon) == 0x000318, "Member 'UWBP_DeathSummaryItem_C::ModifierIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryItem_C, ModifierTextBlock) == 0x000320, "Member 'UWBP_DeathSummaryItem_C::ModifierTextBlock' has a wrong offset!");

}

