#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServiceBuildingDetailsPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ServiceBuildingDetailsPanel.WBP_ServiceBuildingDetailsPanel_C.ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel
// 0x0038 (0x0038 - 0x0000)
struct WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_SectionWidget;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_SectionLabel;                         // 0x0010(0x0018)(ConstParm)
	class UWBP_BuildingManagerSection_C*          K2Node_DynamicCast_AsWBP_Building_Manager_Section; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel) == 0x000008, "Wrong alignment on WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel");
static_assert(sizeof(WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel) == 0x000038, "Wrong size on WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel");
static_assert(offsetof(WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel, EntryPoint) == 0x000000, "Member 'WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel, K2Node_Event_SectionWidget) == 0x000008, "Member 'WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel::K2Node_Event_SectionWidget' has a wrong offset!");
static_assert(offsetof(WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel, K2Node_Event_SectionLabel) == 0x000010, "Member 'WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel::K2Node_Event_SectionLabel' has a wrong offset!");
static_assert(offsetof(WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel, K2Node_DynamicCast_AsWBP_Building_Manager_Section) == 0x000028, "Member 'WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel::K2Node_DynamicCast_AsWBP_Building_Manager_Section' has a wrong offset!");
static_assert(offsetof(WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_ServiceBuildingDetailsPanel_C_ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ServiceBuildingDetailsPanel.WBP_ServiceBuildingDetailsPanel_C.SetSectionLabelBP
// 0x0020 (0x0020 - 0x0000)
struct WBP_ServiceBuildingDetailsPanel_C_SetSectionLabelBP final
{
public:
	class UUserWidget*                            SectionWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   SectionLabel;                                      // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ServiceBuildingDetailsPanel_C_SetSectionLabelBP) == 0x000008, "Wrong alignment on WBP_ServiceBuildingDetailsPanel_C_SetSectionLabelBP");
static_assert(sizeof(WBP_ServiceBuildingDetailsPanel_C_SetSectionLabelBP) == 0x000020, "Wrong size on WBP_ServiceBuildingDetailsPanel_C_SetSectionLabelBP");
static_assert(offsetof(WBP_ServiceBuildingDetailsPanel_C_SetSectionLabelBP, SectionWidget) == 0x000000, "Member 'WBP_ServiceBuildingDetailsPanel_C_SetSectionLabelBP::SectionWidget' has a wrong offset!");
static_assert(offsetof(WBP_ServiceBuildingDetailsPanel_C_SetSectionLabelBP, SectionLabel) == 0x000008, "Member 'WBP_ServiceBuildingDetailsPanel_C_SetSectionLabelBP::SectionLabel' has a wrong offset!");

}

