#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TradeItemDisplay

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TradeItemDisplay.WBP_TradeItemDisplay_C
// 0x0020 (0x0388 - 0x0368)
class UWBP_TradeItemDisplay_C final : public UTradeItemDisplayBase
{
public:
	class UWBP_Pager_C*                           Pager;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TradeVertBox;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WarehouseHeader_C*                 WBP_WarehouseHeader;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WarehouseHeader_C*                 WBP_WarehouseHeader_89;                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TradeItemDisplay_C">();
	}
	static class UWBP_TradeItemDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TradeItemDisplay_C>();
	}
};
static_assert(alignof(UWBP_TradeItemDisplay_C) == 0x000008, "Wrong alignment on UWBP_TradeItemDisplay_C");
static_assert(sizeof(UWBP_TradeItemDisplay_C) == 0x000388, "Wrong size on UWBP_TradeItemDisplay_C");
static_assert(offsetof(UWBP_TradeItemDisplay_C, Pager) == 0x000368, "Member 'UWBP_TradeItemDisplay_C::Pager' has a wrong offset!");
static_assert(offsetof(UWBP_TradeItemDisplay_C, TradeVertBox) == 0x000370, "Member 'UWBP_TradeItemDisplay_C::TradeVertBox' has a wrong offset!");
static_assert(offsetof(UWBP_TradeItemDisplay_C, WBP_WarehouseHeader) == 0x000378, "Member 'UWBP_TradeItemDisplay_C::WBP_WarehouseHeader' has a wrong offset!");
static_assert(offsetof(UWBP_TradeItemDisplay_C, WBP_WarehouseHeader_89) == 0x000380, "Member 'UWBP_TradeItemDisplay_C::WBP_WarehouseHeader_89' has a wrong offset!");

}

