#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FastCraftingMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FastCraftingMenu.WBP_FastCraftingMenu_C
// 0x0048 (0x04F8 - 0x04B0)
class UWBP_FastCraftingMenu_C final : public UFastCraftingMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAoCCommonTextBlock*                    RequirementsTextBlock;                             // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PossibleProcessingItem_C*          WBP_PossibleProcessingItem;                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PossibleProcessingItem_C*          WBP_PossibleProcessingItem_1;                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   WBP_ScrollWindow_NoFrameNoPadding;                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           CraftableCategoryDesignTimeText;                   // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           CraftableItemsDesignTimeText;                      // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Add_Materials();
	void ExecuteUbergraph_WBP_FastCraftingMenu(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FastCraftingMenu_C">();
	}
	static class UWBP_FastCraftingMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FastCraftingMenu_C>();
	}
};
static_assert(alignof(UWBP_FastCraftingMenu_C) == 0x000008, "Wrong alignment on UWBP_FastCraftingMenu_C");
static_assert(sizeof(UWBP_FastCraftingMenu_C) == 0x0004F8, "Wrong size on UWBP_FastCraftingMenu_C");
static_assert(offsetof(UWBP_FastCraftingMenu_C, UberGraphFrame) == 0x0004B0, "Member 'UWBP_FastCraftingMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FastCraftingMenu_C, RequirementsTextBlock) == 0x0004B8, "Member 'UWBP_FastCraftingMenu_C::RequirementsTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_FastCraftingMenu_C, WBP_PossibleProcessingItem) == 0x0004C0, "Member 'UWBP_FastCraftingMenu_C::WBP_PossibleProcessingItem' has a wrong offset!");
static_assert(offsetof(UWBP_FastCraftingMenu_C, WBP_PossibleProcessingItem_1) == 0x0004C8, "Member 'UWBP_FastCraftingMenu_C::WBP_PossibleProcessingItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_FastCraftingMenu_C, WBP_ScrollWindow_NoFrameNoPadding) == 0x0004D0, "Member 'UWBP_FastCraftingMenu_C::WBP_ScrollWindow_NoFrameNoPadding' has a wrong offset!");
static_assert(offsetof(UWBP_FastCraftingMenu_C, CraftableCategoryDesignTimeText) == 0x0004D8, "Member 'UWBP_FastCraftingMenu_C::CraftableCategoryDesignTimeText' has a wrong offset!");
static_assert(offsetof(UWBP_FastCraftingMenu_C, CraftableItemsDesignTimeText) == 0x0004E8, "Member 'UWBP_FastCraftingMenu_C::CraftableItemsDesignTimeText' has a wrong offset!");

}

