#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipStatChangeBlock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TooltipStatChangeBlock.WBP_TooltipStatChangeBlock_C
// 0x0020 (0x0320 - 0x0300)
class UWBP_TooltipStatChangeBlock_C final : public UTooltipStatChangeBlock
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 AdvancedToolTipBG;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_EffectRiderText;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TooltipBorder;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TooltipStatChangeBlock(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TooltipStatChangeBlock_C">();
	}
	static class UWBP_TooltipStatChangeBlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TooltipStatChangeBlock_C>();
	}
};
static_assert(alignof(UWBP_TooltipStatChangeBlock_C) == 0x000008, "Wrong alignment on UWBP_TooltipStatChangeBlock_C");
static_assert(sizeof(UWBP_TooltipStatChangeBlock_C) == 0x000320, "Wrong size on UWBP_TooltipStatChangeBlock_C");
static_assert(offsetof(UWBP_TooltipStatChangeBlock_C, UberGraphFrame) == 0x000300, "Member 'UWBP_TooltipStatChangeBlock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipStatChangeBlock_C, AdvancedToolTipBG) == 0x000308, "Member 'UWBP_TooltipStatChangeBlock_C::AdvancedToolTipBG' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipStatChangeBlock_C, TB_EffectRiderText) == 0x000310, "Member 'UWBP_TooltipStatChangeBlock_C::TB_EffectRiderText' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipStatChangeBlock_C, TooltipBorder) == 0x000318, "Member 'UWBP_TooltipStatChangeBlock_C::TooltipBorder' has a wrong offset!");

}

