#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TrackedEvent

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TrackedEvent.WBP_TrackedEvent_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TrackedEvent_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TrackedEvent_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TrackedEvent_C_PreConstruct");
static_assert(sizeof(WBP_TrackedEvent_C_PreConstruct) == 0x000001, "Wrong size on WBP_TrackedEvent_C_PreConstruct");
static_assert(offsetof(WBP_TrackedEvent_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TrackedEvent_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TrackedEvent.WBP_TrackedEvent_C.ExecuteUbergraph_WBP_TrackedEvent
// 0x0058 (0x0058 - 0x0000)
struct WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_EventObjectiveItem_C*              CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_EventObjectiveItem_C*              CallFunc_Create_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Event_AlignmentJoinButton_C*       CallFunc_Create_ReturnValue_2;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0040(0x0018)(ConstParm)
};
static_assert(alignof(WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent) == 0x000008, "Wrong alignment on WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent");
static_assert(sizeof(WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent) == 0x000058, "Wrong size on WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent");
static_assert(offsetof(WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent, EntryPoint) == 0x000000, "Member 'WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent, CallFunc_Create_ReturnValue_1) == 0x000010, "Member 'WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000020, "Member 'WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent, CallFunc_Create_ReturnValue_2) == 0x000028, "Member 'WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000030, "Member 'WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent, Temp_text_Variable) == 0x000040, "Member 'WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent::Temp_text_Variable' has a wrong offset!");

}

