#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DamageMeter

#include "Basic.hpp"

#include "ST_DamageMeterData_structs.hpp"
#include "ST_DamageMeterHitInfo_structs.hpp"
#include "ST_DamageMeterMapData_structs.hpp"
#include "ST_DamageMeterTimeData_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "ST_DamageMeterBarData_structs.hpp"
#include "ST_DamageMeterHitData_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_DamageMeter.WBP_DamageMeter_C.AddDataToMap
// 0x0198 (0x0198 - 0x0000)
struct WBP_DamageMeter_C_AddDataToMap final
{
public:
	struct FST_DamageMeterMapData                 Map;                                               // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	double                                        Value;                                             // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectiveValue;                                    // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         HitGuid;                                           // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Flags_0;                                           // 0x0078(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DamageMeterHitData                 CallFunc_Map_Find_Value;                           // 0x00A0(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_DamageMeterHitData                 CallFunc_Map_Find_Value_1;                         // 0x00D8(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DamageMeterHitData                 K2Node_MakeStruct_ST_DamageMeterHitData;           // 0x0130(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_5;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DamageMeterHitData                 K2Node_MakeStruct_ST_DamageMeterHitData_1;         // 0x0168(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_AddDataToMap) == 0x000008, "Wrong alignment on WBP_DamageMeter_C_AddDataToMap");
static_assert(sizeof(WBP_DamageMeter_C_AddDataToMap) == 0x000198, "Wrong size on WBP_DamageMeter_C_AddDataToMap");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, Map) == 0x000000, "Member 'WBP_DamageMeter_C_AddDataToMap::Map' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, Value) == 0x000060, "Member 'WBP_DamageMeter_C_AddDataToMap::Value' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, EffectiveValue) == 0x000068, "Member 'WBP_DamageMeter_C_AddDataToMap::EffectiveValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, HitGuid) == 0x000070, "Member 'WBP_DamageMeter_C_AddDataToMap::HitGuid' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, Flags_0) == 0x000078, "Member 'WBP_DamageMeter_C_AddDataToMap::Flags_0' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_MakeLiteralByte_ReturnValue) == 0x000079, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00007C, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000080, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000088, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_And_IntInt_ReturnValue) == 0x000090, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Conv_IntToBool_ReturnValue) == 0x000094, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000098, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Map_Find_Value) == 0x0000A0, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Map_Find_ReturnValue) == 0x0000D0, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Map_Find_Value_1) == 0x0000D8, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Map_Find_ReturnValue_1) == 0x000108, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Add_IntInt_ReturnValue) == 0x00010C, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Add_IntInt_ReturnValue_1) == 0x000110, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000118, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000120, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x000128, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, K2Node_MakeStruct_ST_DamageMeterHitData) == 0x000130, "Member 'WBP_DamageMeter_C_AddDataToMap::K2Node_MakeStruct_ST_DamageMeterHitData' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, CallFunc_Add_DoubleDouble_ReturnValue_5) == 0x000160, "Member 'WBP_DamageMeter_C_AddDataToMap::CallFunc_Add_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMap, K2Node_MakeStruct_ST_DamageMeterHitData_1) == 0x000168, "Member 'WBP_DamageMeter_C_AddDataToMap::K2Node_MakeStruct_ST_DamageMeterHitData_1' has a wrong offset!");

// Function WBP_DamageMeter.WBP_DamageMeter_C.AddDataToMaps
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_DamageMeter_C_AddDataToMaps final
{
public:
	struct FST_DamageMeterMapData                 Map;                                               // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TMap<struct FGuid, int32>                     indexMap;                                          // 0x0060(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FST_DamageMeterMapData>         targetArary;                                       // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGuid                                  Target;                                            // 0x00C0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Value;                                             // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectiveValue;                                    // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         HitGuid;                                           // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Flags_0;                                           // 0x00E8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_AddDataToMaps) == 0x000008, "Wrong alignment on WBP_DamageMeter_C_AddDataToMaps");
static_assert(sizeof(WBP_DamageMeter_C_AddDataToMaps) == 0x0000F0, "Wrong size on WBP_DamageMeter_C_AddDataToMaps");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMaps, Map) == 0x000000, "Member 'WBP_DamageMeter_C_AddDataToMaps::Map' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMaps, indexMap) == 0x000060, "Member 'WBP_DamageMeter_C_AddDataToMaps::indexMap' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMaps, targetArary) == 0x0000B0, "Member 'WBP_DamageMeter_C_AddDataToMaps::targetArary' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMaps, Target) == 0x0000C0, "Member 'WBP_DamageMeter_C_AddDataToMaps::Target' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMaps, Value) == 0x0000D0, "Member 'WBP_DamageMeter_C_AddDataToMaps::Value' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMaps, EffectiveValue) == 0x0000D8, "Member 'WBP_DamageMeter_C_AddDataToMaps::EffectiveValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMaps, HitGuid) == 0x0000E0, "Member 'WBP_DamageMeter_C_AddDataToMaps::HitGuid' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToMaps, Flags_0) == 0x0000E8, "Member 'WBP_DamageMeter_C_AddDataToMaps::Flags_0' has a wrong offset!");

// Function WBP_DamageMeter.WBP_DamageMeter_C.AddDataToTargetMap
// 0x0100 (0x0100 - 0x0000)
struct WBP_DamageMeter_C_AddDataToTargetMap final
{
public:
	TMap<struct FGuid, int32>                     TargetIndexMap;                                    // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FST_DamageMeterMapData>         TargetMap;                                         // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGuid                                  Target;                                            // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Value;                                             // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectiveValue;                                    // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         HitGuid;                                           // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Flags_0;                                           // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_DamageMeterMapData                 K2Node_MakeStruct_ST_DamageMeterMapData;           // 0x0090(0x0060)(HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_AddDataToTargetMap) == 0x000008, "Wrong alignment on WBP_DamageMeter_C_AddDataToTargetMap");
static_assert(sizeof(WBP_DamageMeter_C_AddDataToTargetMap) == 0x000100, "Wrong size on WBP_DamageMeter_C_AddDataToTargetMap");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToTargetMap, TargetIndexMap) == 0x000000, "Member 'WBP_DamageMeter_C_AddDataToTargetMap::TargetIndexMap' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToTargetMap, TargetMap) == 0x000050, "Member 'WBP_DamageMeter_C_AddDataToTargetMap::TargetMap' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToTargetMap, Target) == 0x000060, "Member 'WBP_DamageMeter_C_AddDataToTargetMap::Target' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToTargetMap, Value) == 0x000070, "Member 'WBP_DamageMeter_C_AddDataToTargetMap::Value' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToTargetMap, EffectiveValue) == 0x000078, "Member 'WBP_DamageMeter_C_AddDataToTargetMap::EffectiveValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToTargetMap, HitGuid) == 0x000080, "Member 'WBP_DamageMeter_C_AddDataToTargetMap::HitGuid' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToTargetMap, Flags_0) == 0x000088, "Member 'WBP_DamageMeter_C_AddDataToTargetMap::Flags_0' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToTargetMap, K2Node_MakeStruct_ST_DamageMeterMapData) == 0x000090, "Member 'WBP_DamageMeter_C_AddDataToTargetMap::K2Node_MakeStruct_ST_DamageMeterMapData' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToTargetMap, CallFunc_Map_Find_Value) == 0x0000F0, "Member 'WBP_DamageMeter_C_AddDataToTargetMap::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToTargetMap, CallFunc_Map_Find_ReturnValue) == 0x0000F4, "Member 'WBP_DamageMeter_C_AddDataToTargetMap::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToTargetMap, CallFunc_Array_Add_ReturnValue) == 0x0000F8, "Member 'WBP_DamageMeter_C_AddDataToTargetMap::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddDataToTargetMap, CallFunc_Array_Length_ReturnValue) == 0x0000FC, "Member 'WBP_DamageMeter_C_AddDataToTargetMap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function WBP_DamageMeter.WBP_DamageMeter_C.AddMissToMap
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_DamageMeter_C_AddMissToMap final
{
public:
	struct FST_DamageMeterMapData                 Map;                                               // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	int64                                         HitGuid;                                           // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DamageMeterHitData                 CallFunc_Map_Find_Value;                           // 0x0068(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DamageMeterHitData                 K2Node_MakeStruct_ST_DamageMeterHitData;           // 0x00A0(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_AddMissToMap) == 0x000008, "Wrong alignment on WBP_DamageMeter_C_AddMissToMap");
static_assert(sizeof(WBP_DamageMeter_C_AddMissToMap) == 0x0000D0, "Wrong size on WBP_DamageMeter_C_AddMissToMap");
static_assert(offsetof(WBP_DamageMeter_C_AddMissToMap, Map) == 0x000000, "Member 'WBP_DamageMeter_C_AddMissToMap::Map' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddMissToMap, HitGuid) == 0x000060, "Member 'WBP_DamageMeter_C_AddMissToMap::HitGuid' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddMissToMap, CallFunc_Map_Find_Value) == 0x000068, "Member 'WBP_DamageMeter_C_AddMissToMap::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddMissToMap, CallFunc_Map_Find_ReturnValue) == 0x000098, "Member 'WBP_DamageMeter_C_AddMissToMap::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddMissToMap, CallFunc_Add_IntInt_ReturnValue) == 0x00009C, "Member 'WBP_DamageMeter_C_AddMissToMap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddMissToMap, K2Node_MakeStruct_ST_DamageMeterHitData) == 0x0000A0, "Member 'WBP_DamageMeter_C_AddMissToMap::K2Node_MakeStruct_ST_DamageMeterHitData' has a wrong offset!");

// Function WBP_DamageMeter.WBP_DamageMeter_C.AddMissToTargetMap
// 0x0080 (0x0080 - 0x0000)
struct WBP_DamageMeter_C_AddMissToTargetMap final
{
public:
	TMap<struct FGuid, int32>                     TargetIndexMap;                                    // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FST_DamageMeterMapData>         TargetMap;                                         // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGuid                                  Target;                                            // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         HitGuid;                                           // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_AddMissToTargetMap) == 0x000008, "Wrong alignment on WBP_DamageMeter_C_AddMissToTargetMap");
static_assert(sizeof(WBP_DamageMeter_C_AddMissToTargetMap) == 0x000080, "Wrong size on WBP_DamageMeter_C_AddMissToTargetMap");
static_assert(offsetof(WBP_DamageMeter_C_AddMissToTargetMap, TargetIndexMap) == 0x000000, "Member 'WBP_DamageMeter_C_AddMissToTargetMap::TargetIndexMap' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddMissToTargetMap, TargetMap) == 0x000050, "Member 'WBP_DamageMeter_C_AddMissToTargetMap::TargetMap' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddMissToTargetMap, Target) == 0x000060, "Member 'WBP_DamageMeter_C_AddMissToTargetMap::Target' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddMissToTargetMap, HitGuid) == 0x000070, "Member 'WBP_DamageMeter_C_AddMissToTargetMap::HitGuid' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddMissToTargetMap, CallFunc_Map_Find_Value) == 0x000078, "Member 'WBP_DamageMeter_C_AddMissToTargetMap::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_AddMissToTargetMap, CallFunc_Map_Find_ReturnValue) == 0x00007C, "Member 'WBP_DamageMeter_C_AddMissToTargetMap::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_DamageMeter.WBP_DamageMeter_C.BarClicked
// 0x0020 (0x0020 - 0x0000)
struct WBP_DamageMeter_C_BarClicked final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isMain;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          rightMouse;                                        // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FST_DamageMeterBarData>         K2Node_Select_Default;                             // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue_1;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_BarClicked) == 0x000008, "Wrong alignment on WBP_DamageMeter_C_BarClicked");
static_assert(sizeof(WBP_DamageMeter_C_BarClicked) == 0x000020, "Wrong size on WBP_DamageMeter_C_BarClicked");
static_assert(offsetof(WBP_DamageMeter_C_BarClicked, Index_0) == 0x000000, "Member 'WBP_DamageMeter_C_BarClicked::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_BarClicked, isMain) == 0x000004, "Member 'WBP_DamageMeter_C_BarClicked::isMain' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_BarClicked, rightMouse) == 0x000005, "Member 'WBP_DamageMeter_C_BarClicked::rightMouse' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_BarClicked, Temp_bool_Variable) == 0x000006, "Member 'WBP_DamageMeter_C_BarClicked::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_BarClicked, CallFunc_IsValid_Guid_ReturnValue) == 0x000007, "Member 'WBP_DamageMeter_C_BarClicked::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_BarClicked, K2Node_Select_Default) == 0x000008, "Member 'WBP_DamageMeter_C_BarClicked::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_BarClicked, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'WBP_DamageMeter_C_BarClicked::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_BarClicked, CallFunc_IsValid_Guid_ReturnValue_1) == 0x000019, "Member 'WBP_DamageMeter_C_BarClicked::CallFunc_IsValid_Guid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_BarClicked, CallFunc_NotEqual_Int64Int64_ReturnValue) == 0x00001A, "Member 'WBP_DamageMeter_C_BarClicked::CallFunc_NotEqual_Int64Int64_ReturnValue' has a wrong offset!");

// Function WBP_DamageMeter.WBP_DamageMeter_C.BndEvt__DamageMeter_DamageCBString_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_DamageMeter_C_BndEvt__DamageMeter_DamageCBString_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_BndEvt__DamageMeter_DamageCBString_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DamageMeter_C_BndEvt__DamageMeter_DamageCBString_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_DamageMeter_C_BndEvt__DamageMeter_DamageCBString_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_DamageMeter_C_BndEvt__DamageMeter_DamageCBString_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_DamageMeter_C_BndEvt__DamageMeter_DamageCBString_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_DamageMeter_C_BndEvt__DamageMeter_DamageCBString_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_BndEvt__DamageMeter_DamageCBString_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_DamageMeter_C_BndEvt__DamageMeter_DamageCBString_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_DamageMeter.WBP_DamageMeter_C.BndEvt__DamageMeter_IconsCB_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DamageMeter_C_BndEvt__DamageMeter_IconsCB_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_BndEvt__DamageMeter_IconsCB_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DamageMeter_C_BndEvt__DamageMeter_IconsCB_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DamageMeter_C_BndEvt__DamageMeter_IconsCB_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DamageMeter_C_BndEvt__DamageMeter_IconsCB_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DamageMeter_C_BndEvt__DamageMeter_IconsCB_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DamageMeter_C_BndEvt__DamageMeter_IconsCB_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DamageMeter.WBP_DamageMeter_C.BndEvt__DamageMeter_InstigatorCBString_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_DamageMeter_C_BndEvt__DamageMeter_InstigatorCBString_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_BndEvt__DamageMeter_InstigatorCBString_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DamageMeter_C_BndEvt__DamageMeter_InstigatorCBString_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_DamageMeter_C_BndEvt__DamageMeter_InstigatorCBString_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_DamageMeter_C_BndEvt__DamageMeter_InstigatorCBString_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_DamageMeter_C_BndEvt__DamageMeter_InstigatorCBString_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_DamageMeter_C_BndEvt__DamageMeter_InstigatorCBString_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_BndEvt__DamageMeter_InstigatorCBString_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_DamageMeter_C_BndEvt__DamageMeter_InstigatorCBString_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_DamageMeter.WBP_DamageMeter_C.BndEvt__DesignDamageMeter_CheckBox_301_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DamageMeter_C_BndEvt__DesignDamageMeter_CheckBox_301_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_BndEvt__DesignDamageMeter_CheckBox_301_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DamageMeter_C_BndEvt__DesignDamageMeter_CheckBox_301_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DamageMeter_C_BndEvt__DesignDamageMeter_CheckBox_301_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DamageMeter_C_BndEvt__DesignDamageMeter_CheckBox_301_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DamageMeter_C_BndEvt__DesignDamageMeter_CheckBox_301_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DamageMeter_C_BndEvt__DesignDamageMeter_CheckBox_301_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DamageMeter.WBP_DamageMeter_C.CalcCombatTime
// 0x0068 (0x0068 - 0x0000)
struct WBP_DamageMeter_C_CalcCombatTime final
{
public:
	struct FGuid                                  PlayerGuid;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_CalcCombatTime) == 0x000008, "Wrong alignment on WBP_DamageMeter_C_CalcCombatTime");
static_assert(sizeof(WBP_DamageMeter_C_CalcCombatTime) == 0x000068, "Wrong size on WBP_DamageMeter_C_CalcCombatTime");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, PlayerGuid) == 0x000000, "Member 'WBP_DamageMeter_C_CalcCombatTime::PlayerGuid' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, Time) == 0x000010, "Member 'WBP_DamageMeter_C_CalcCombatTime::Time' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, IsActive) == 0x000018, "Member 'WBP_DamageMeter_C_CalcCombatTime::IsActive' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, CallFunc_Map_Find_Value) == 0x00001C, "Member 'WBP_DamageMeter_C_CalcCombatTime::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'WBP_DamageMeter_C_CalcCombatTime::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, CallFunc_GetTimeSeconds_ReturnValue) == 0x000028, "Member 'WBP_DamageMeter_C_CalcCombatTime::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_DamageMeter_C_CalcCombatTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_DamageMeter_C_CalcCombatTime::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'WBP_DamageMeter_C_CalcCombatTime::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000048, "Member 'WBP_DamageMeter_C_CalcCombatTime::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_DamageMeter_C_CalcCombatTime::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, CallFunc_SelectFloat_ReturnValue) == 0x000058, "Member 'WBP_DamageMeter_C_CalcCombatTime::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcCombatTime, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'WBP_DamageMeter_C_CalcCombatTime::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_DamageMeter.WBP_DamageMeter_C.CalcHitColorName
// 0x0038 (0x0038 - 0x0000)
struct WBP_DamageMeter_C_CalcHitColorName final
{
public:
	TArray<struct FGameplayTag>                   Tags;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FName                                   hitName;                                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_2;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_CalcHitColorName) == 0x000008, "Wrong alignment on WBP_DamageMeter_C_CalcHitColorName");
static_assert(sizeof(WBP_DamageMeter_C_CalcHitColorName) == 0x000038, "Wrong size on WBP_DamageMeter_C_CalcHitColorName");
static_assert(offsetof(WBP_DamageMeter_C_CalcHitColorName, Tags) == 0x000000, "Member 'WBP_DamageMeter_C_CalcHitColorName::Tags' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcHitColorName, hitName) == 0x000010, "Member 'WBP_DamageMeter_C_CalcHitColorName::hitName' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcHitColorName, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_DamageMeter_C_CalcHitColorName::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcHitColorName, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_DamageMeter_C_CalcHitColorName::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcHitColorName, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_DamageMeter_C_CalcHitColorName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcHitColorName, CallFunc_MatchesTag_ReturnValue) == 0x000028, "Member 'WBP_DamageMeter_C_CalcHitColorName::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcHitColorName, CallFunc_MatchesTag_ReturnValue_1) == 0x000029, "Member 'WBP_DamageMeter_C_CalcHitColorName::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcHitColorName, CallFunc_MatchesTag_ReturnValue_2) == 0x00002A, "Member 'WBP_DamageMeter_C_CalcHitColorName::CallFunc_MatchesTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcHitColorName, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'WBP_DamageMeter_C_CalcHitColorName::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcHitColorName, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_DamageMeter_C_CalcHitColorName::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_CalcHitColorName, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_DamageMeter_C_CalcHitColorName::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_DamageMeter.WBP_DamageMeter_C.EnsureCharacterData
// 0x04F8 (0x04F8 - 0x0000)
struct WBP_DamageMeter_C_EnsureCharacterData final
{
public:
	class ABaseCharacter*                         instigatorChar;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetCharacterGuid_ReturnValue;             // 0x000C(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCharacterName_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterName_ReturnValue_1;           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetCharacterGuid_ReturnValue_1;           // 0x0050(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetInstigatorInfo_color;                  // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterClass                               CallFunc_GetInstigatorInfo_class;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetInstigatorInfo_color_1;                // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterClass                               CallFunc_GetInstigatorInfo_class_1;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_MakeLiteralInt64_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameStatFromGuid_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAoCPlayerController*                   K2Node_DynamicCast_AsAo_CPlayer_Controller;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       CallFunc_GetActualPlayer_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_DamageMeterData                    K2Node_MakeStruct_ST_DamageMeterData;              // 0x00D8(0x0410)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_MakeStruct_HealthBase_128_14812B854804E54BF28DE2A4B3D3D6C4_ImplicitCast; // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeter_C_EnsureCharacterData) == 0x000008, "Wrong alignment on WBP_DamageMeter_C_EnsureCharacterData");
static_assert(sizeof(WBP_DamageMeter_C_EnsureCharacterData) == 0x0004F8, "Wrong size on WBP_DamageMeter_C_EnsureCharacterData");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, instigatorChar) == 0x000000, "Member 'WBP_DamageMeter_C_EnsureCharacterData::instigatorChar' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, Success) == 0x000008, "Member 'WBP_DamageMeter_C_EnsureCharacterData::Success' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_GetCharacterGuid_ReturnValue) == 0x00000C, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_GetCharacterGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_GetCharacterName_ReturnValue) == 0x000020, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_GetCharacterName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_GetCharacterName_ReturnValue_1) == 0x000030, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_GetCharacterName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_IsEmpty_ReturnValue) == 0x000040, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_Conv_StringToName_ReturnValue) == 0x000044, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_Not_PreBool_ReturnValue) == 0x00004C, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_GetCharacterGuid_ReturnValue_1) == 0x000050, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_GetCharacterGuid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_IsValid_Guid_ReturnValue) == 0x000060, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_GetInstigatorInfo_color) == 0x000064, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_GetInstigatorInfo_color' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_GetInstigatorInfo_class) == 0x000074, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_GetInstigatorInfo_class' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_BooleanAND_ReturnValue) == 0x000075, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_GetInstigatorInfo_color_1) == 0x000078, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_GetInstigatorInfo_color_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_GetInstigatorInfo_class_1) == 0x000088, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_GetInstigatorInfo_class_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_MakeLiteralInt64_ReturnValue) == 0x000090, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_MakeLiteralInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_GetGameStatFromGuid_ReturnValue) == 0x000098, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_GetGameStatFromGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_Map_Find_Value) == 0x00009C, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_Map_Find_ReturnValue) == 0x0000A0, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, K2Node_DynamicCast_AsAo_CPlayer_Controller) == 0x0000B0, "Member 'WBP_DamageMeter_C_EnsureCharacterData::K2Node_DynamicCast_AsAo_CPlayer_Controller' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'WBP_DamageMeter_C_EnsureCharacterData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_GetTimeSeconds_ReturnValue) == 0x0000C0, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_GetActualPlayer_ReturnValue) == 0x0000C8, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_GetActualPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeter_C_EnsureCharacterData, CallFunc_IsEnemy_ReturnValue) == 0x0000D0, "Member 'WBP_DamageMeter_C_EnsureCharacterData::CallFunc_IsEnemy_ReturnValue' has a wrong offset!");
