#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VotingWindow

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VotingWindow.WBP_VotingWindow_C
// 0x0020 (0x0350 - 0x0330)
class UWBP_VotingWindow_C final : public UVotingWindow
{
public:
	class UImage*                                 HeaderAccent;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VotingWindowItem_C*                WBP_VotingWindowItem;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VotingWindowItem_C*                WBP_VotingWindowItem_44;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VotingWindowItem_C*                WBP_VotingWindowItem_108;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VotingWindow_C">();
	}
	static class UWBP_VotingWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VotingWindow_C>();
	}
};
static_assert(alignof(UWBP_VotingWindow_C) == 0x000008, "Wrong alignment on UWBP_VotingWindow_C");
static_assert(sizeof(UWBP_VotingWindow_C) == 0x000350, "Wrong size on UWBP_VotingWindow_C");
static_assert(offsetof(UWBP_VotingWindow_C, HeaderAccent) == 0x000330, "Member 'UWBP_VotingWindow_C::HeaderAccent' has a wrong offset!");
static_assert(offsetof(UWBP_VotingWindow_C, WBP_VotingWindowItem) == 0x000338, "Member 'UWBP_VotingWindow_C::WBP_VotingWindowItem' has a wrong offset!");
static_assert(offsetof(UWBP_VotingWindow_C, WBP_VotingWindowItem_44) == 0x000340, "Member 'UWBP_VotingWindow_C::WBP_VotingWindowItem_44' has a wrong offset!");
static_assert(offsetof(UWBP_VotingWindow_C, WBP_VotingWindowItem_108) == 0x000348, "Member 'UWBP_VotingWindow_C::WBP_VotingWindowItem_108' has a wrong offset!");

}

