#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NineSliceTestingWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NineSliceTestingWidget.WBP_NineSliceTestingWidget_C
// 0x0020 (0x0310 - 0x02F0)
class UWBP_NineSliceTestingWidget_C final : public UUserWidget
{
public:
	class UCommonLazyImage*                       BHorzImage;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       LVertImage;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       RVertImage;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       THorzImage;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NineSliceTestingWidget_C">();
	}
	static class UWBP_NineSliceTestingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NineSliceTestingWidget_C>();
	}
};
static_assert(alignof(UWBP_NineSliceTestingWidget_C) == 0x000008, "Wrong alignment on UWBP_NineSliceTestingWidget_C");
static_assert(sizeof(UWBP_NineSliceTestingWidget_C) == 0x000310, "Wrong size on UWBP_NineSliceTestingWidget_C");
static_assert(offsetof(UWBP_NineSliceTestingWidget_C, BHorzImage) == 0x0002F0, "Member 'UWBP_NineSliceTestingWidget_C::BHorzImage' has a wrong offset!");
static_assert(offsetof(UWBP_NineSliceTestingWidget_C, LVertImage) == 0x0002F8, "Member 'UWBP_NineSliceTestingWidget_C::LVertImage' has a wrong offset!");
static_assert(offsetof(UWBP_NineSliceTestingWidget_C, RVertImage) == 0x000300, "Member 'UWBP_NineSliceTestingWidget_C::RVertImage' has a wrong offset!");
static_assert(offsetof(UWBP_NineSliceTestingWidget_C, THorzImage) == 0x000308, "Member 'UWBP_NineSliceTestingWidget_C::THorzImage' has a wrong offset!");

}

