#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerSelection

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerSelection.WBP_ServerSelection_C
// 0x0060 (0x0468 - 0x0408)
class UWBP_ServerSelection_C final : public UServerSelection
{
public:
	class UImage*                                 IMG_InnerShadow;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_RefreshIcon;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_WindowBG;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_WindowFrame;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SortNumCharactersArrowImage;                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextButton_C*                    SortNumCharactersButton;                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SortOnlineFriendsArrowImage;                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextButton_C*                    SortOnlineFriendsButton;                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextButton_C*                    SortPopButton;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SortPopButtonArrowImage;                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   WBP_ScrollWindow_NoFrameNoPadding_C_0;             // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServerConnectionModal_C*           WBP_ServerConnectionModal;                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerSelection_C">();
	}
	static class UWBP_ServerSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerSelection_C>();
	}
};
static_assert(alignof(UWBP_ServerSelection_C) == 0x000008, "Wrong alignment on UWBP_ServerSelection_C");
static_assert(sizeof(UWBP_ServerSelection_C) == 0x000468, "Wrong size on UWBP_ServerSelection_C");
static_assert(offsetof(UWBP_ServerSelection_C, IMG_InnerShadow) == 0x000408, "Member 'UWBP_ServerSelection_C::IMG_InnerShadow' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelection_C, IMG_RefreshIcon) == 0x000410, "Member 'UWBP_ServerSelection_C::IMG_RefreshIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelection_C, IMG_WindowBG) == 0x000418, "Member 'UWBP_ServerSelection_C::IMG_WindowBG' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelection_C, IMG_WindowFrame) == 0x000420, "Member 'UWBP_ServerSelection_C::IMG_WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelection_C, SortNumCharactersArrowImage) == 0x000428, "Member 'UWBP_ServerSelection_C::SortNumCharactersArrowImage' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelection_C, SortNumCharactersButton) == 0x000430, "Member 'UWBP_ServerSelection_C::SortNumCharactersButton' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelection_C, SortOnlineFriendsArrowImage) == 0x000438, "Member 'UWBP_ServerSelection_C::SortOnlineFriendsArrowImage' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelection_C, SortOnlineFriendsButton) == 0x000440, "Member 'UWBP_ServerSelection_C::SortOnlineFriendsButton' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelection_C, SortPopButton) == 0x000448, "Member 'UWBP_ServerSelection_C::SortPopButton' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelection_C, SortPopButtonArrowImage) == 0x000450, "Member 'UWBP_ServerSelection_C::SortPopButtonArrowImage' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelection_C, WBP_ScrollWindow_NoFrameNoPadding_C_0) == 0x000458, "Member 'UWBP_ServerSelection_C::WBP_ScrollWindow_NoFrameNoPadding_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelection_C, WBP_ServerConnectionModal) == 0x000460, "Member 'UWBP_ServerSelection_C::WBP_ServerConnectionModal' has a wrong offset!");

}

