#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UnitFrameLayoutMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UnitFrameLayoutMenu.WBP_UnitFrameLayoutMenu_C
// 0x0020 (0x0420 - 0x0400)
class UWBP_UnitFrameLayoutMenu_C final : public UUnitFrameLayoutMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxString*                        AnchoredToDropDown;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ToScreensDropDown;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        WidgetHierarchyDropDown;                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DisplayUndoDebugTextBP(const TArray<struct FHudElementState>& CachedStates);
	void ExecuteUbergraph_WBP_UnitFrameLayoutMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UnitFrameLayoutMenu_C">();
	}
	static class UWBP_UnitFrameLayoutMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UnitFrameLayoutMenu_C>();
	}
};
static_assert(alignof(UWBP_UnitFrameLayoutMenu_C) == 0x000008, "Wrong alignment on UWBP_UnitFrameLayoutMenu_C");
static_assert(sizeof(UWBP_UnitFrameLayoutMenu_C) == 0x000420, "Wrong size on UWBP_UnitFrameLayoutMenu_C");
static_assert(offsetof(UWBP_UnitFrameLayoutMenu_C, UberGraphFrame) == 0x000400, "Member 'UWBP_UnitFrameLayoutMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UnitFrameLayoutMenu_C, AnchoredToDropDown) == 0x000408, "Member 'UWBP_UnitFrameLayoutMenu_C::AnchoredToDropDown' has a wrong offset!");
static_assert(offsetof(UWBP_UnitFrameLayoutMenu_C, ToScreensDropDown) == 0x000410, "Member 'UWBP_UnitFrameLayoutMenu_C::ToScreensDropDown' has a wrong offset!");
static_assert(offsetof(UWBP_UnitFrameLayoutMenu_C, WidgetHierarchyDropDown) == 0x000418, "Member 'UWBP_UnitFrameLayoutMenu_C::WidgetHierarchyDropDown' has a wrong offset!");

}

