#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerWidget.WBP_PlayerWidget_C.ExecuteUbergraph_WBP_PlayerWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             UniqueObjectNameForCooking_OutputDelegate;         // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget) == 0x000008, "Wrong alignment on WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget");
static_assert(sizeof(WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget) == 0x000030, "Wrong size on WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget");
static_assert(offsetof(WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget, EntryPoint) == 0x000000, "Member 'WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget, Temp_bool_Variable) == 0x000004, "Member 'WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget, UniqueObjectNameForCooking_OutputDelegate) == 0x000008, "Member 'WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget::UniqueObjectNameForCooking_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget, Temp_byte_Variable) == 0x000018, "Member 'WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget, Temp_byte_Variable_1) == 0x000028, "Member 'WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget, K2Node_Select_Default) == 0x000029, "Member 'WBP_PlayerWidget_C_ExecuteUbergraph_WBP_PlayerWidget::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PlayerWidget.WBP_PlayerWidget_C.SetClassResourceBar
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_PlayerWidget_C_SetClassResourceBar final
{
public:
	class FName                                   StatName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAoCStatsComponent*                     StatComp;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           bar;                                               // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             BarText;                                           // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            UniqueObjectNameForCooking_Array;                  // 0x0030(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0040(0x0018)()
	float                                         CallFunc_GetGameStat_ReturnValue;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0070(0x0018)()
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerWidget_C_SetClassResourceBar) == 0x000008, "Wrong alignment on WBP_PlayerWidget_C_SetClassResourceBar");
static_assert(sizeof(WBP_PlayerWidget_C_SetClassResourceBar) == 0x0000A8, "Wrong size on WBP_PlayerWidget_C_SetClassResourceBar");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, StatName) == 0x000000, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::StatName' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, Color) == 0x000008, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::Color' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, StatComp) == 0x000018, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::StatComp' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, bar) == 0x000020, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::bar' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, BarText) == 0x000028, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::BarText' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, UniqueObjectNameForCooking_Array) == 0x000030, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::UniqueObjectNameForCooking_Array' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, CallFunc_Format_ReturnValue) == 0x000040, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, CallFunc_GetGameStat_ReturnValue) == 0x000058, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::CallFunc_GetGameStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00005C, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, CallFunc_FMax_ReturnValue) == 0x000068, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000070, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, CallFunc_FMax_A_ImplicitCast) == 0x000088, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_SetClassResourceBar, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000A0, "Member 'WBP_PlayerWidget_C_SetClassResourceBar::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_PlayerWidget.WBP_PlayerWidget_C.UpdateClassResourceBar
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlayerWidget_C_UpdateClassResourceBar final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAoCPlayerController*                   K2Node_DynamicCast_AsAo_CPlayer_Controller;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         CallFunc_GetBaseCharacter_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAoCStatsComponent*                     CallFunc_GetStatsComponent_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerWidget_C_UpdateClassResourceBar) == 0x000008, "Wrong alignment on WBP_PlayerWidget_C_UpdateClassResourceBar");
static_assert(sizeof(WBP_PlayerWidget_C_UpdateClassResourceBar) == 0x000030, "Wrong size on WBP_PlayerWidget_C_UpdateClassResourceBar");
static_assert(offsetof(WBP_PlayerWidget_C_UpdateClassResourceBar, IsVisible_0) == 0x000000, "Member 'WBP_PlayerWidget_C_UpdateClassResourceBar::IsVisible_0' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_UpdateClassResourceBar, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_PlayerWidget_C_UpdateClassResourceBar::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_UpdateClassResourceBar, K2Node_DynamicCast_AsAo_CPlayer_Controller) == 0x000010, "Member 'WBP_PlayerWidget_C_UpdateClassResourceBar::K2Node_DynamicCast_AsAo_CPlayer_Controller' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_UpdateClassResourceBar, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_PlayerWidget_C_UpdateClassResourceBar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_UpdateClassResourceBar, CallFunc_GetBaseCharacter_ReturnValue) == 0x000020, "Member 'WBP_PlayerWidget_C_UpdateClassResourceBar::CallFunc_GetBaseCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerWidget_C_UpdateClassResourceBar, CallFunc_GetStatsComponent_ReturnValue) == 0x000028, "Member 'WBP_PlayerWidget_C_UpdateClassResourceBar::CallFunc_GetStatsComponent_ReturnValue' has a wrong offset!");

}

