#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChatWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"
#include "E_ResizeType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ChatWindow.WBP_ChatWindow_C
// 0x0080 (0x17E0 - 0x1760)
class UWBP_ChatWindow_C final : public UChatSystem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1760(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close2;                                            // 0x1768(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Close3;                                            // 0x1770(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredChat;                                       // 0x1778(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonButton_C*                        AddChannelButton;                                  // 0x1780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonButton_C*                        ScrollDownButton;                                  // 0x1788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonButton_C*                        ScrollUpButton;                                    // 0x1790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              CapturedMousePositionWhenDragging_0;               // 0x1798(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ResizeType                                  ResizingWindowOnX;                                 // 0x17A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ResizeType                                  ResizingWindowOnY;                                 // 0x17A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17AA[0x6];                                     // 0x17AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ChatEmblemDecorators;                              // 0x17B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ChatRichText;                                      // 0x17C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ChatWindow(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ChatWindow_C">();
	}
	static class UWBP_ChatWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ChatWindow_C>();
	}
};
static_assert(alignof(UWBP_ChatWindow_C) == 0x000010, "Wrong alignment on UWBP_ChatWindow_C");
static_assert(sizeof(UWBP_ChatWindow_C) == 0x0017E0, "Wrong size on UWBP_ChatWindow_C");
static_assert(offsetof(UWBP_ChatWindow_C, UberGraphFrame) == 0x001760, "Member 'UWBP_ChatWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, Close2) == 0x001768, "Member 'UWBP_ChatWindow_C::Close2' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, Close3) == 0x001770, "Member 'UWBP_ChatWindow_C::Close3' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, HoveredChat) == 0x001778, "Member 'UWBP_ChatWindow_C::HoveredChat' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, AddChannelButton) == 0x001780, "Member 'UWBP_ChatWindow_C::AddChannelButton' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ScrollDownButton) == 0x001788, "Member 'UWBP_ChatWindow_C::ScrollDownButton' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ScrollUpButton) == 0x001790, "Member 'UWBP_ChatWindow_C::ScrollUpButton' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, CapturedMousePositionWhenDragging_0) == 0x001798, "Member 'UWBP_ChatWindow_C::CapturedMousePositionWhenDragging_0' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ResizingWindowOnX) == 0x0017A8, "Member 'UWBP_ChatWindow_C::ResizingWindowOnX' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ResizingWindowOnY) == 0x0017A9, "Member 'UWBP_ChatWindow_C::ResizingWindowOnY' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ChatEmblemDecorators) == 0x0017B0, "Member 'UWBP_ChatWindow_C::ChatEmblemDecorators' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ChatRichText) == 0x0017C8, "Member 'UWBP_ChatWindow_C::ChatRichText' has a wrong offset!");

}

