#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUDEditorResetWindowPositions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUDEditorResetWindowPositions.WBP_HUDEditorResetWindowPositions_C
// 0x0018 (0x03A8 - 0x0390)
class UWBP_HUDEditorResetWindowPositions_C final : public UCommonRow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          AlternatingBG;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextButton_C*                    ResetWindowsButton;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();
	void ExecuteUbergraph_WBP_HUDEditorResetWindowPositions(int32 EntryPoint);
	void BndEvt__WBP_HUDEditorResetWindowPositions_ResetWindowsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUDEditorResetWindowPositions_C">();
	}
	static class UWBP_HUDEditorResetWindowPositions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUDEditorResetWindowPositions_C>();
	}
};
static_assert(alignof(UWBP_HUDEditorResetWindowPositions_C) == 0x000008, "Wrong alignment on UWBP_HUDEditorResetWindowPositions_C");
static_assert(sizeof(UWBP_HUDEditorResetWindowPositions_C) == 0x0003A8, "Wrong size on UWBP_HUDEditorResetWindowPositions_C");
static_assert(offsetof(UWBP_HUDEditorResetWindowPositions_C, UberGraphFrame) == 0x000390, "Member 'UWBP_HUDEditorResetWindowPositions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUDEditorResetWindowPositions_C, AlternatingBG) == 0x000398, "Member 'UWBP_HUDEditorResetWindowPositions_C::AlternatingBG' has a wrong offset!");
static_assert(offsetof(UWBP_HUDEditorResetWindowPositions_C, ResetWindowsButton) == 0x0003A0, "Member 'UWBP_HUDEditorResetWindowPositions_C::ResetWindowsButton' has a wrong offset!");

}

