#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JournalQuestDetails

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_JournalQuestDetails.WBP_JournalQuestDetails_C
// 0x0020 (0x0458 - 0x0438)
class UWBP_JournalQuestDetails_C final : public UQuestProgressDetails
{
public:
	class UAoCCommonTextBlock*                    Body2TextBlock;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBG;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               HeaderOverlay;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InvalidIndicator_1;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_JournalQuestDetails_C">();
	}
	static class UWBP_JournalQuestDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_JournalQuestDetails_C>();
	}
};
static_assert(alignof(UWBP_JournalQuestDetails_C) == 0x000008, "Wrong alignment on UWBP_JournalQuestDetails_C");
static_assert(sizeof(UWBP_JournalQuestDetails_C) == 0x000458, "Wrong size on UWBP_JournalQuestDetails_C");
static_assert(offsetof(UWBP_JournalQuestDetails_C, Body2TextBlock) == 0x000438, "Member 'UWBP_JournalQuestDetails_C::Body2TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_JournalQuestDetails_C, HeaderBG) == 0x000440, "Member 'UWBP_JournalQuestDetails_C::HeaderBG' has a wrong offset!");
static_assert(offsetof(UWBP_JournalQuestDetails_C, HeaderOverlay) == 0x000448, "Member 'UWBP_JournalQuestDetails_C::HeaderOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_JournalQuestDetails_C, InvalidIndicator_1) == 0x000450, "Member 'UWBP_JournalQuestDetails_C::InvalidIndicator_1' has a wrong offset!");

}

