#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActiveCommissionCard

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActiveCommissionCard.WBP_ActiveCommissionCard_C
// 0x0078 (0x06A0 - 0x0628)
class UWBP_ActiveCommissionCard_C final : public UActiveCommissionCard
{
public:
	class UButton*                                Button_1;                                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CommissionLevelContainer;                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CooldownOverlay;                                   // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EmptyOverlay;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EmptySlotOverlay;                                  // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_LevelFrame;                                    // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LockedOverlay;                                     // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainOverlay_1;                                     // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ObjectiveStateImage;                               // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             RewardsContainerIcon;                              // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimerTextBlock_C*                  SlotCooldownTextBlock;                             // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_EmptySlotLabel;                                 // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_SlotCooldownLabel;                              // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon_2;                         // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon_3;                         // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ActiveCommissionCard_C">();
	}
	static class UWBP_ActiveCommissionCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActiveCommissionCard_C>();
	}
};
static_assert(alignof(UWBP_ActiveCommissionCard_C) == 0x000008, "Wrong alignment on UWBP_ActiveCommissionCard_C");
static_assert(sizeof(UWBP_ActiveCommissionCard_C) == 0x0006A0, "Wrong size on UWBP_ActiveCommissionCard_C");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, Button_1) == 0x000628, "Member 'UWBP_ActiveCommissionCard_C::Button_1' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, CommissionLevelContainer) == 0x000630, "Member 'UWBP_ActiveCommissionCard_C::CommissionLevelContainer' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, CooldownOverlay) == 0x000638, "Member 'UWBP_ActiveCommissionCard_C::CooldownOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, EmptyOverlay) == 0x000640, "Member 'UWBP_ActiveCommissionCard_C::EmptyOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, EmptySlotOverlay) == 0x000648, "Member 'UWBP_ActiveCommissionCard_C::EmptySlotOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, IMG_LevelFrame) == 0x000650, "Member 'UWBP_ActiveCommissionCard_C::IMG_LevelFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, LockedOverlay) == 0x000658, "Member 'UWBP_ActiveCommissionCard_C::LockedOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, MainOverlay_1) == 0x000660, "Member 'UWBP_ActiveCommissionCard_C::MainOverlay_1' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, ObjectiveStateImage) == 0x000668, "Member 'UWBP_ActiveCommissionCard_C::ObjectiveStateImage' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, RewardsContainerIcon) == 0x000670, "Member 'UWBP_ActiveCommissionCard_C::RewardsContainerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, SlotCooldownTextBlock) == 0x000678, "Member 'UWBP_ActiveCommissionCard_C::SlotCooldownTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, TB_EmptySlotLabel) == 0x000680, "Member 'UWBP_ActiveCommissionCard_C::TB_EmptySlotLabel' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, TB_SlotCooldownLabel) == 0x000688, "Member 'UWBP_ActiveCommissionCard_C::TB_SlotCooldownLabel' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, WBP_RewardContainerIcon_2) == 0x000690, "Member 'UWBP_ActiveCommissionCard_C::WBP_RewardContainerIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, WBP_RewardContainerIcon_3) == 0x000698, "Member 'UWBP_ActiveCommissionCard_C::WBP_RewardContainerIcon_3' has a wrong offset!");

}

