#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuckFloatingTextManager

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_BuckFloatingTextManager.WBP_BuckFloatingTextManager_C.AbilitySystem_OnHit
// 0x0050 (0x0050 - 0x0000)
struct WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit final
{
public:
	struct FHitInst                               HitInst;                                           // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit) == 0x000008, "Wrong alignment on WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit");
static_assert(sizeof(WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit) == 0x000050, "Wrong size on WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit, HitInst) == 0x000000, "Member 'WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit::HitInst' has a wrong offset!");

// Function WBP_BuckFloatingTextManager.WBP_BuckFloatingTextManager_C.AddFloaterToTarget
// 0x0D38 (0x0D38 - 0x0000)
struct WBP_BuckFloatingTextManager_C_AddFloaterToTarget final
{
public:
	struct FStatModInst                           StatMod;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class ABaseCharacter*                         Target;                                            // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitTargetInst                         HitTargetInst;                                     // 0x0030(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FAbilityHitRecord                      HitRecord;                                         // 0x00E8(0x0A28)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int64                                         SourceRecordType;                                  // 0x0B10(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          hitting_OtherwiseGettingHit_;                      // 0x0B18(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B19[0x7];                                      // 0x0B19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 hitStr;                                            // 0x0B20(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0B30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0B34(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B35[0x3];                                      // 0x0B35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0B38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0B3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3D[0x3];                                      // 0x0B3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCharacterFloaterData*            CallFunc_GetCharacterFloaterData_ReturnValue;      // 0x0B40(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0B48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0B4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4D[0x3];                                      // 0x0B4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0B50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0B54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0B58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0B5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5D[0x3];                                      // 0x0B5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0B60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0B64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B65[0x3];                                      // 0x0B65(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatModRecord                         CallFunc_GetStatModRecordByGuid_ReturnValue;       // 0x0B68(0x0110)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0C78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C79[0x3];                                      // 0x0C79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0C7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0C80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C81[0x7];                                      // 0x0C81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBuckFloatingTextWidget*                CallFunc_Array_Get_Item;                           // 0x0C88(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BuckFloatingText_C*                K2Node_DynamicCast_AsWBP_Buck_Floating_Text;       // 0x0C90(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0C98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0C99(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9A[0x6];                                      // 0x0C9A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0CA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x0CA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0CA9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAA[0x2];                                      // 0x0CAA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0CAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBuckFloatingTextWidget*                CallFunc_Array_Get_Item_1;                         // 0x0CB0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BuckFloatingText_C*                K2Node_DynamicCast_AsWBP_Buck_Floating_Text_1;     // 0x0CB8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0CC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0CC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC2[0x6];                                      // 0x0CC2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_BuckFloatingText_C*                CallFunc_GetNextFloaterBP_ret;                     // 0x0CC8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0CD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0CD4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0CD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD9[0x3];                                      // 0x0CD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0CDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0CE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0CE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE2[0x2];                                      // 0x0CE2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0CE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x0CE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0CEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0CF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF1[0x3];                                      // 0x0CF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_And_IntInt_ReturnValue_1;                 // 0x0CF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0CF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x0CF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CFA[0x2];                                      // 0x0CFA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0CFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue_2;                 // 0x0D00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_2;             // 0x0D04(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0D05(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0D06(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D07[0x1];                                      // 0x0D07(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0D08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetFloater_value_ImplicitCast;            // 0x0D10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetFloater_rawValue_ImplicitCast;         // 0x0D18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetFloater_rawValue_ImplicitCast_1;       // 0x0D20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0D28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0D30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget) == 0x000008, "Wrong alignment on WBP_BuckFloatingTextManager_C_AddFloaterToTarget");
static_assert(sizeof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget) == 0x000D38, "Wrong size on WBP_BuckFloatingTextManager_C_AddFloaterToTarget");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, StatMod) == 0x000000, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::StatMod' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, Target) == 0x000028, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::Target' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, HitTargetInst) == 0x000030, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::HitTargetInst' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, HitRecord) == 0x0000E8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::HitRecord' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, SourceRecordType) == 0x000B10, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::SourceRecordType' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, hitting_OtherwiseGettingHit_) == 0x000B18, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::hitting_OtherwiseGettingHit_' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, hitStr) == 0x000B20, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::hitStr' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, Temp_int_Loop_Counter_Variable) == 0x000B30, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_IsEmpty_ReturnValue) == 0x000B34, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000B38, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Not_PreBool_ReturnValue) == 0x000B3C, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_GetCharacterFloaterData_ReturnValue) == 0x000B40, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_GetCharacterFloaterData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000B48, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_IsValid_ReturnValue) == 0x000B4C, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Array_Length_ReturnValue) == 0x000B50, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Array_Length_ReturnValue_1) == 0x000B54, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000B58, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000B5C, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000B60, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000B64, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_GetStatModRecordByGuid_ReturnValue) == 0x000B68, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_GetStatModRecordByGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Not_PreBool_ReturnValue_1) == 0x000C78, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, Temp_int_Array_Index_Variable) == 0x000C7C, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_BooleanAND_ReturnValue) == 0x000C80, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Array_Get_Item) == 0x000C88, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, K2Node_DynamicCast_AsWBP_Buck_Floating_Text) == 0x000C90, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::K2Node_DynamicCast_AsWBP_Buck_Floating_Text' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, K2Node_DynamicCast_bSuccess) == 0x000C98, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000C99, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000CA0, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x000CA8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_BooleanAND_ReturnValue_1) == 0x000CA9, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, Temp_int_Array_Index_Variable_1) == 0x000CAC, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Array_Get_Item_1) == 0x000CB0, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, K2Node_DynamicCast_AsWBP_Buck_Floating_Text_1) == 0x000CB8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::K2Node_DynamicCast_AsWBP_Buck_Floating_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, K2Node_DynamicCast_bSuccess_1) == 0x000CC0, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000CC1, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_GetNextFloaterBP_ret) == 0x000CC8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_GetNextFloaterBP_ret' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, Temp_int_Loop_Counter_Variable_1) == 0x000CD0, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Array_Add_ReturnValue) == 0x000CD4, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000CD8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000CDC, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_MakeLiteralByte_ReturnValue) == 0x000CE0, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000CE1, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000CE4, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_And_IntInt_ReturnValue) == 0x000CE8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000CEC, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_IntToBool_ReturnValue) == 0x000CF0, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_And_IntInt_ReturnValue_1) == 0x000CF4, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_And_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000CF8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x000CF9, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000CFC, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_And_IntInt_ReturnValue_2) == 0x000D00, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_And_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_IntToBool_ReturnValue_2) == 0x000D04, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_IntToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Not_PreBool_ReturnValue_2) == 0x000D05, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_BooleanAND_ReturnValue_2) == 0x000D06, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x000D08, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_SetFloater_value_ImplicitCast) == 0x000D10, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_SetFloater_value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_SetFloater_rawValue_ImplicitCast) == 0x000D18, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_SetFloater_rawValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_SetFloater_rawValue_ImplicitCast_1) == 0x000D20, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_SetFloater_rawValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000D28, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000D30, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_BuckFloatingTextManager.WBP_BuckFloatingTextManager_C.CacheCharsBP
// 0x0028 (0x0028 - 0x0000)
struct WBP_BuckFloatingTextManager_C_CacheCharsBP final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAoCPlayerController*                   K2Node_DynamicCast_AsAo_CPlayer_Controller;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         CallFunc_GetBaseCharacter_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuckFloatingTextManager_C_CacheCharsBP) == 0x000008, "Wrong alignment on WBP_BuckFloatingTextManager_C_CacheCharsBP");
static_assert(sizeof(WBP_BuckFloatingTextManager_C_CacheCharsBP) == 0x000028, "Wrong size on WBP_BuckFloatingTextManager_C_CacheCharsBP");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CacheCharsBP, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'WBP_BuckFloatingTextManager_C_CacheCharsBP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CacheCharsBP, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_BuckFloatingTextManager_C_CacheCharsBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CacheCharsBP, K2Node_DynamicCast_AsAo_CPlayer_Controller) == 0x000010, "Member 'WBP_BuckFloatingTextManager_C_CacheCharsBP::K2Node_DynamicCast_AsAo_CPlayer_Controller' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CacheCharsBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_BuckFloatingTextManager_C_CacheCharsBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CacheCharsBP, CallFunc_GetBaseCharacter_ReturnValue) == 0x000020, "Member 'WBP_BuckFloatingTextManager_C_CacheCharsBP::CallFunc_GetBaseCharacter_ReturnValue' has a wrong offset!");

// Function WBP_BuckFloatingTextManager.WBP_BuckFloatingTextManager_C.EnsureDataBP
// 0x0020 (0x0020 - 0x0000)
struct WBP_BuckFloatingTextManager_C_EnsureDataBP final
{
public:
	class ABaseCharacter*                         BaseChar;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCharacterFloaterData*                  CallFunc_Map_Find_Value;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterFloaterData*                  CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuckFloatingTextManager_C_EnsureDataBP) == 0x000008, "Wrong alignment on WBP_BuckFloatingTextManager_C_EnsureDataBP");
static_assert(sizeof(WBP_BuckFloatingTextManager_C_EnsureDataBP) == 0x000020, "Wrong size on WBP_BuckFloatingTextManager_C_EnsureDataBP");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_EnsureDataBP, BaseChar) == 0x000000, "Member 'WBP_BuckFloatingTextManager_C_EnsureDataBP::BaseChar' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_EnsureDataBP, CallFunc_Map_Find_Value) == 0x000008, "Member 'WBP_BuckFloatingTextManager_C_EnsureDataBP::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_EnsureDataBP, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'WBP_BuckFloatingTextManager_C_EnsureDataBP::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_EnsureDataBP, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'WBP_BuckFloatingTextManager_C_EnsureDataBP::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_BuckFloatingTextManager.WBP_BuckFloatingTextManager_C.ExecuteUbergraph_WBP_BuckFloatingTextManager
// 0x2080 (0x2080 - 0x0000)
struct WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FHitInst& HitInst)> UniqueObjectNameForCooking_OutputDelegate;       // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitInst                               K2Node_CustomEvent_HitInst;                        // 0x0038(0x0050)(ConstParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitTargetInst                         CallFunc_Array_Get_Item;                           // 0x0090(0x00B8)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatModInst                           CallFunc_Array_Get_Item_1;                         // 0x0158(0x0028)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0186(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0187(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character;               // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character_1;             // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetCharacterGuid_ReturnValue;             // 0x01AC(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetCharacterGuid_ReturnValue_1;           // 0x01BC(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue;           // 0x01D0(0x0A28)(ConstParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0BF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BFC[0x4];                                      // 0x0BFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Trim_ReturnValue;                         // 0x0C00(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_TrimTrailing_ReturnValue;                 // 0x0C10(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0C20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0C21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0C22(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C23[0x1];                                      // 0x0C23(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0C24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x0C28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetCharacterGuid_ReturnValue_2;           // 0x0C2C(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0C3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GuidGuid_ReturnValue;          // 0x0C3D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0C3E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0C3F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0C40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C41[0x7];                                      // 0x0C41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitTargetInst                         Temp_struct_Variable;                              // 0x0C48(0x00B8)(ContainsInstancedReference)
	struct FAbilityHitRecord                      Temp_struct_Variable_1;                            // 0x0D00(0x0A28)()
	TDelegate<void(class UAoCStatsComponent* AoCStatsComponent, const struct FEffectInst& EffectInst)> UniqueObjectNameForCooking_OutputDelegate_1; // 0x1728(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x1738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1739[0x7];                                     // 0x1739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAoCStatsComponent*                     K2Node_CustomEvent_AoCStatsComponent;              // 0x1740(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEffectInst                            K2Node_CustomEvent_EffectInst;                     // 0x1748(0x0168)(ConstParm, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x18B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEffectRecord                          CallFunc_GetEffectRecordByGuid_ReturnValue;        // 0x18B8(0x0788)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x2040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2041[0x7];                                     // 0x2041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Trim_ReturnValue_1;                       // 0x2048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character_2;             // 0x2058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x2060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2061[0x7];                                     // 0x2061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_TrimTrailing_ReturnValue_1;               // 0x2068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GuidGuid_ReturnValue_1;        // 0x2078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x2079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x207A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x207B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager) == 0x000008, "Wrong alignment on WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager");
static_assert(sizeof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager) == 0x002080, "Wrong size on WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, EntryPoint) == 0x000000, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000018, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, UniqueObjectNameForCooking_OutputDelegate) == 0x000024, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::UniqueObjectNameForCooking_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, K2Node_CustomEvent_HitInst) == 0x000038, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::K2Node_CustomEvent_HitInst' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, Temp_int_Loop_Counter_Variable_1) == 0x000088, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Less_IntInt_ReturnValue) == 0x00014C, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000150, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000154, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Array_Get_Item_1) == 0x000158, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Array_Length_ReturnValue_1) == 0x000180, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Array_IsNotEmpty_ReturnValue_1) == 0x000184, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Array_IsNotEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x000185, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_BooleanOR_ReturnValue) == 0x000186, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_IsValid_ReturnValue_1) == 0x000187, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_GetOwner_ReturnValue) == 0x000188, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, K2Node_DynamicCast_AsBase_Character) == 0x000190, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, K2Node_DynamicCast_AsBase_Character_1) == 0x0001A0, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::K2Node_DynamicCast_AsBase_Character_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_GetCharacterGuid_ReturnValue) == 0x0001AC, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_GetCharacterGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_GetCharacterGuid_ReturnValue_1) == 0x0001BC, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_GetCharacterGuid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_GetHitRecordByGuid_ReturnValue) == 0x0001D0, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_GetHitRecordByGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x000BF8, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Trim_ReturnValue) == 0x000C00, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Trim_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_TrimTrailing_ReturnValue) == 0x000C10, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_TrimTrailing_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_MakeLiteralByte_ReturnValue) == 0x000C20, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_IsEmpty_ReturnValue) == 0x000C21, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Not_PreBool_ReturnValue) == 0x000C22, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000C24, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_And_IntInt_ReturnValue) == 0x000C28, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_GetCharacterGuid_ReturnValue_2) == 0x000C2C, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_GetCharacterGuid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager, CallFunc_Conv_IntToBool_ReturnValue) == 0x000C3C, "Member 'WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
