#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServiceBuildingDetailsPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServiceBuildingDetailsPanel.WBP_ServiceBuildingDetailsPanel_C
// 0x0088 (0x06E0 - 0x0658)
class UWBP_ServiceBuildingDetailsPanel_C final : public UNodeBuildingDetailsPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0658(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIntrepidWrapBox*                       BuildingStatsBox;                                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               ConstructionCostsBox_1;                            // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyTiersItem_C*               ConstructionCurrency_1;                            // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ConstructionCurrencyPanel_1;                       // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BuildingManagerSection_C*          RepairContributionSection;                         // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScrollableBuildingList;                            // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScW_Main;                                          // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_FabricationHeader;                              // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_SelectBuildingHeader;                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityIcon_C*                   WBP_CommodityIcon_6;                               // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityIcon_C*                   WBP_CommodityIcon_7;                               // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExpansionPointIcon_C*              WBP_ExpansionPointIcon_2;                          // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeBuildingListItem_C*            WBP_NodeBuildingListItem_2;                        // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeBuildingListItem_C*            WBP_NodeBuildingListItem_3;                        // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeBuildingListItem_C*            WBP_NodeBuildingListItem_4;                        // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeBuildingListItem_C*            WBP_NodeBuildingListItem_5;                        // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServiceBuildingDetailsPanel_C">();
	}
	static class UWBP_ServiceBuildingDetailsPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServiceBuildingDetailsPanel_C>();
	}
};
static_assert(alignof(UWBP_ServiceBuildingDetailsPanel_C) == 0x000008, "Wrong alignment on UWBP_ServiceBuildingDetailsPanel_C");
static_assert(sizeof(UWBP_ServiceBuildingDetailsPanel_C) == 0x0006E0, "Wrong size on UWBP_ServiceBuildingDetailsPanel_C");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, UberGraphFrame) == 0x000658, "Member 'UWBP_ServiceBuildingDetailsPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, BuildingStatsBox) == 0x000660, "Member 'UWBP_ServiceBuildingDetailsPanel_C::BuildingStatsBox' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, ConstructionCostsBox_1) == 0x000668, "Member 'UWBP_ServiceBuildingDetailsPanel_C::ConstructionCostsBox_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, ConstructionCurrency_1) == 0x000670, "Member 'UWBP_ServiceBuildingDetailsPanel_C::ConstructionCurrency_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, ConstructionCurrencyPanel_1) == 0x000678, "Member 'UWBP_ServiceBuildingDetailsPanel_C::ConstructionCurrencyPanel_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, RepairContributionSection) == 0x000680, "Member 'UWBP_ServiceBuildingDetailsPanel_C::RepairContributionSection' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, ScrollableBuildingList) == 0x000688, "Member 'UWBP_ServiceBuildingDetailsPanel_C::ScrollableBuildingList' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, ScW_Main) == 0x000690, "Member 'UWBP_ServiceBuildingDetailsPanel_C::ScW_Main' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, TB_FabricationHeader) == 0x000698, "Member 'UWBP_ServiceBuildingDetailsPanel_C::TB_FabricationHeader' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, TB_SelectBuildingHeader) == 0x0006A0, "Member 'UWBP_ServiceBuildingDetailsPanel_C::TB_SelectBuildingHeader' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_CommodityIcon_6) == 0x0006A8, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_CommodityIcon_6' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_CommodityIcon_7) == 0x0006B0, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_CommodityIcon_7' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_ExpansionPointIcon_2) == 0x0006B8, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_ExpansionPointIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_NodeBuildingListItem_2) == 0x0006C0, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_NodeBuildingListItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_NodeBuildingListItem_3) == 0x0006C8, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_NodeBuildingListItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_NodeBuildingListItem_4) == 0x0006D0, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_NodeBuildingListItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_NodeBuildingListItem_5) == 0x0006D8, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_NodeBuildingListItem_5' has a wrong offset!");

}

