#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapEventTooltip

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapEventTooltip.WBP_MapEventTooltip_C
// 0x0018 (0x0380 - 0x0368)
class UWBP_MapEventTooltip_C final : public UMapEventTooltip
{
public:
	class UImage*                                 EventIcon;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EventIconFrame;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ToolTipBG;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapEventTooltip_C">();
	}
	static class UWBP_MapEventTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapEventTooltip_C>();
	}
};
static_assert(alignof(UWBP_MapEventTooltip_C) == 0x000008, "Wrong alignment on UWBP_MapEventTooltip_C");
static_assert(sizeof(UWBP_MapEventTooltip_C) == 0x000380, "Wrong size on UWBP_MapEventTooltip_C");
static_assert(offsetof(UWBP_MapEventTooltip_C, EventIcon) == 0x000368, "Member 'UWBP_MapEventTooltip_C::EventIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MapEventTooltip_C, EventIconFrame) == 0x000370, "Member 'UWBP_MapEventTooltip_C::EventIconFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MapEventTooltip_C, ToolTipBG) == 0x000378, "Member 'UWBP_MapEventTooltip_C::ToolTipBG' has a wrong offset!");

}

