#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerConnectionModal

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerConnectionModal.WBP_ServerConnectionModal_C
// 0x0018 (0x0308 - 0x02F0)
class UWBP_ServerConnectionModal_C final : public UUserWidget
{
public:
	class UCommonTextButton_C*                    CancelButton;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    QueueTimer_1;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    ServerStatusMessage;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerConnectionModal_C">();
	}
	static class UWBP_ServerConnectionModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerConnectionModal_C>();
	}
};
static_assert(alignof(UWBP_ServerConnectionModal_C) == 0x000008, "Wrong alignment on UWBP_ServerConnectionModal_C");
static_assert(sizeof(UWBP_ServerConnectionModal_C) == 0x000308, "Wrong size on UWBP_ServerConnectionModal_C");
static_assert(offsetof(UWBP_ServerConnectionModal_C, CancelButton) == 0x0002F0, "Member 'UWBP_ServerConnectionModal_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UWBP_ServerConnectionModal_C, QueueTimer_1) == 0x0002F8, "Member 'UWBP_ServerConnectionModal_C::QueueTimer_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServerConnectionModal_C, ServerStatusMessage) == 0x000300, "Member 'UWBP_ServerConnectionModal_C::ServerStatusMessage' has a wrong offset!");

}

