#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GuildWarDeclaration

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GuildWarDeclaration.WBP_GuildWarDeclaration_C
// 0x0070 (0x0468 - 0x03F8)
class UWBP_GuildWarDeclaration_C final : public UGuildWarDeclarationWidget
{
public:
	class UCircularThrobber*                      Loading;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScrollContent;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildListEntry_C*                  WBP_GuildListEntry;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildListEntry_C*                  WBP_GuildListEntry_1;                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildListEntry_C*                  WBP_GuildListEntry_2;                              // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildListEntry_C*                  WBP_GuildListEntry_3;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildListEntry_C*                  WBP_GuildListEntry_4;                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildListEntry_C*                  WBP_GuildListEntry_5;                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildListEntry_C*                  WBP_GuildListEntry_6;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildListEntry_C*                  WBP_GuildListEntry_7;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildListEntry_C*                  WBP_GuildListEntry_8;                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildListEntry_C*                  WBP_GuildListEntry_9;                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildListEntry_C*                  WBP_GuildListEntry_10;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildListEntry_C*                  WBP_GuildListEntry_11;                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GuildWarDeclaration_C">();
	}
	static class UWBP_GuildWarDeclaration_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GuildWarDeclaration_C>();
	}
};
static_assert(alignof(UWBP_GuildWarDeclaration_C) == 0x000008, "Wrong alignment on UWBP_GuildWarDeclaration_C");
static_assert(sizeof(UWBP_GuildWarDeclaration_C) == 0x000468, "Wrong size on UWBP_GuildWarDeclaration_C");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, Loading) == 0x0003F8, "Member 'UWBP_GuildWarDeclaration_C::Loading' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, ScrollContent) == 0x000400, "Member 'UWBP_GuildWarDeclaration_C::ScrollContent' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, WBP_GuildListEntry) == 0x000408, "Member 'UWBP_GuildWarDeclaration_C::WBP_GuildListEntry' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, WBP_GuildListEntry_1) == 0x000410, "Member 'UWBP_GuildWarDeclaration_C::WBP_GuildListEntry_1' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, WBP_GuildListEntry_2) == 0x000418, "Member 'UWBP_GuildWarDeclaration_C::WBP_GuildListEntry_2' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, WBP_GuildListEntry_3) == 0x000420, "Member 'UWBP_GuildWarDeclaration_C::WBP_GuildListEntry_3' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, WBP_GuildListEntry_4) == 0x000428, "Member 'UWBP_GuildWarDeclaration_C::WBP_GuildListEntry_4' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, WBP_GuildListEntry_5) == 0x000430, "Member 'UWBP_GuildWarDeclaration_C::WBP_GuildListEntry_5' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, WBP_GuildListEntry_6) == 0x000438, "Member 'UWBP_GuildWarDeclaration_C::WBP_GuildListEntry_6' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, WBP_GuildListEntry_7) == 0x000440, "Member 'UWBP_GuildWarDeclaration_C::WBP_GuildListEntry_7' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, WBP_GuildListEntry_8) == 0x000448, "Member 'UWBP_GuildWarDeclaration_C::WBP_GuildListEntry_8' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, WBP_GuildListEntry_9) == 0x000450, "Member 'UWBP_GuildWarDeclaration_C::WBP_GuildListEntry_9' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, WBP_GuildListEntry_10) == 0x000458, "Member 'UWBP_GuildWarDeclaration_C::WBP_GuildListEntry_10' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWarDeclaration_C, WBP_GuildListEntry_11) == 0x000460, "Member 'UWBP_GuildWarDeclaration_C::WBP_GuildListEntry_11' has a wrong offset!");

}

