#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommodityGrid

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CommodityGrid.WBP_CommodityGrid_C
// 0x00A0 (0x03E8 - 0x0348)
class UWBP_CommodityGrid_C final : public UCommodityGrid
{
public:
	class UWBP_ScrollWindow_Gradient_C*           RightScrollWindow;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_1;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_2;                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_3;                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_4;                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_5;                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_6;                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_7;                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_8;                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_9;                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_10;                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_11;                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_12;                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_13;                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_14;                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_15;                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_16;                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_17;                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityPriceItem_C*              WBP_CommodityPriceItem_18;                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	TSubclassOf<class UCommonButtonStyle> GetOddButtonStyle();
	TSubclassOf<class UCommonButtonStyle> GetEvenButtonStyle();
	class UPanelWidget* GetButtonContainer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CommodityGrid_C">();
	}
	static class UWBP_CommodityGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CommodityGrid_C>();
	}
};
static_assert(alignof(UWBP_CommodityGrid_C) == 0x000008, "Wrong alignment on UWBP_CommodityGrid_C");
static_assert(sizeof(UWBP_CommodityGrid_C) == 0x0003E8, "Wrong size on UWBP_CommodityGrid_C");
static_assert(offsetof(UWBP_CommodityGrid_C, RightScrollWindow) == 0x000348, "Member 'UWBP_CommodityGrid_C::RightScrollWindow' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem) == 0x000350, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_1) == 0x000358, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_2) == 0x000360, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_3) == 0x000368, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_4) == 0x000370, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_5) == 0x000378, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_5' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_6) == 0x000380, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_6' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_7) == 0x000388, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_7' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_8) == 0x000390, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_8' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_9) == 0x000398, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_9' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_10) == 0x0003A0, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_10' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_11) == 0x0003A8, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_11' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_12) == 0x0003B0, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_12' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_13) == 0x0003B8, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_13' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_14) == 0x0003C0, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_14' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_15) == 0x0003C8, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_15' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_16) == 0x0003D0, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_16' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_17) == 0x0003D8, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_17' has a wrong offset!");
static_assert(offsetof(UWBP_CommodityGrid_C, WBP_CommodityPriceItem_18) == 0x0003E0, "Member 'UWBP_CommodityGrid_C::WBP_CommodityPriceItem_18' has a wrong offset!");

}

