#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeathSummaryModal

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DeathSummaryModal.WBP_DeathSummaryModal_C
// 0x0048 (0x0338 - 0x02F0)
class UWBP_DeathSummaryModal_C final : public UUserWidget
{
public:
	class UImage*                                 IMG_TopAccent;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIntrepidVerticalBox*                   ItemsList;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_Gradient_C*           ScrollWindow;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DeathSummaryItem_C*                WBP_DeathSummaryItem;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DeathSummaryItem_C*                WBP_DeathSummaryItem_1;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DeathSummaryItem_C*                WBP_DeathSummaryItem_2;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DeathSummaryItem_C*                WBP_DeathSummaryItem_3;                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DeathSummaryItem_C*                WBP_DeathSummaryItem_4;                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DeathSummaryItem_C*                WBP_DeathSummaryItem_5;                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	TSubclassOf<class UCommonBorderStyle> GetOddBorderStyle();
	TSubclassOf<class UCommonBorderStyle> GetEvenBorderStyle();
	class UPanelWidget* GetBorderContainer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DeathSummaryModal_C">();
	}
	static class UWBP_DeathSummaryModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DeathSummaryModal_C>();
	}
};
static_assert(alignof(UWBP_DeathSummaryModal_C) == 0x000008, "Wrong alignment on UWBP_DeathSummaryModal_C");
static_assert(sizeof(UWBP_DeathSummaryModal_C) == 0x000338, "Wrong size on UWBP_DeathSummaryModal_C");
static_assert(offsetof(UWBP_DeathSummaryModal_C, IMG_TopAccent) == 0x0002F0, "Member 'UWBP_DeathSummaryModal_C::IMG_TopAccent' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryModal_C, ItemsList) == 0x0002F8, "Member 'UWBP_DeathSummaryModal_C::ItemsList' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryModal_C, ScrollWindow) == 0x000300, "Member 'UWBP_DeathSummaryModal_C::ScrollWindow' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryModal_C, WBP_DeathSummaryItem) == 0x000308, "Member 'UWBP_DeathSummaryModal_C::WBP_DeathSummaryItem' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryModal_C, WBP_DeathSummaryItem_1) == 0x000310, "Member 'UWBP_DeathSummaryModal_C::WBP_DeathSummaryItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryModal_C, WBP_DeathSummaryItem_2) == 0x000318, "Member 'UWBP_DeathSummaryModal_C::WBP_DeathSummaryItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryModal_C, WBP_DeathSummaryItem_3) == 0x000320, "Member 'UWBP_DeathSummaryModal_C::WBP_DeathSummaryItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryModal_C, WBP_DeathSummaryItem_4) == 0x000328, "Member 'UWBP_DeathSummaryModal_C::WBP_DeathSummaryItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_DeathSummaryModal_C, WBP_DeathSummaryItem_5) == 0x000330, "Member 'UWBP_DeathSummaryModal_C::WBP_DeathSummaryItem_5' has a wrong offset!");

}

