#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MayoralCommissionThumb

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MayoralCommissionThumb.WBP_MayoralCommissionThumb_C
// 0x0028 (0x04B0 - 0x0488)
class UWBP_MayoralCommissionThumb_C final : public UMayoralCommissionCard
{
public:
	class UImage*                                 BaseBackgroundImage;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CommissionLevelBG;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExperienceBarFrame;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityBorder;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               StatusImageContainer;                              // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MayoralCommissionThumb_C">();
	}
	static class UWBP_MayoralCommissionThumb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MayoralCommissionThumb_C>();
	}
};
static_assert(alignof(UWBP_MayoralCommissionThumb_C) == 0x000008, "Wrong alignment on UWBP_MayoralCommissionThumb_C");
static_assert(sizeof(UWBP_MayoralCommissionThumb_C) == 0x0004B0, "Wrong size on UWBP_MayoralCommissionThumb_C");
static_assert(offsetof(UWBP_MayoralCommissionThumb_C, BaseBackgroundImage) == 0x000488, "Member 'UWBP_MayoralCommissionThumb_C::BaseBackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionThumb_C, CommissionLevelBG) == 0x000490, "Member 'UWBP_MayoralCommissionThumb_C::CommissionLevelBG' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionThumb_C, ExperienceBarFrame) == 0x000498, "Member 'UWBP_MayoralCommissionThumb_C::ExperienceBarFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionThumb_C, RarityBorder) == 0x0004A0, "Member 'UWBP_MayoralCommissionThumb_C::RarityBorder' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionThumb_C, StatusImageContainer) == 0x0004A8, "Member 'UWBP_MayoralCommissionThumb_C::StatusImageContainer' has a wrong offset!");

}

