#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DamageMeterBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DamageMeterBar.WBP_DamageMeterBar_C
// 0x0070 (0x0360 - 0x02F0)
class UWBP_DamageMeterBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                BarButton;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BarImage;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BarText;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DPSText;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EffectiveBarImage;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageIcon;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PercentBox;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PercentText;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueText;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         barIndex;                                          // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DamageMeter_C*                     meter;                                             // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          isMainBars;                                        // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ExecuteUbergraph_WBP_DamageMeterBar(int32 EntryPoint);
	void BndEvt__DesignDamageMeter_Bar_BarButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__DesignDamageMeter_Bar_BarButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__DesignDamageMeter_Bar_BarButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DamageMeterBar_C">();
	}
	static class UWBP_DamageMeterBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DamageMeterBar_C>();
	}
};
static_assert(alignof(UWBP_DamageMeterBar_C) == 0x000008, "Wrong alignment on UWBP_DamageMeterBar_C");
static_assert(sizeof(UWBP_DamageMeterBar_C) == 0x000360, "Wrong size on UWBP_DamageMeterBar_C");
static_assert(offsetof(UWBP_DamageMeterBar_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_DamageMeterBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, BarButton) == 0x0002F8, "Member 'UWBP_DamageMeterBar_C::BarButton' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, BarImage) == 0x000300, "Member 'UWBP_DamageMeterBar_C::BarImage' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, BarText) == 0x000308, "Member 'UWBP_DamageMeterBar_C::BarText' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, DPSText) == 0x000310, "Member 'UWBP_DamageMeterBar_C::DPSText' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, EffectiveBarImage) == 0x000318, "Member 'UWBP_DamageMeterBar_C::EffectiveBarImage' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, ImageIcon) == 0x000320, "Member 'UWBP_DamageMeterBar_C::ImageIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, PercentBox) == 0x000328, "Member 'UWBP_DamageMeterBar_C::PercentBox' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, PercentText) == 0x000330, "Member 'UWBP_DamageMeterBar_C::PercentText' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, SizeBox_1) == 0x000338, "Member 'UWBP_DamageMeterBar_C::SizeBox_1' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, ValueText) == 0x000340, "Member 'UWBP_DamageMeterBar_C::ValueText' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, barIndex) == 0x000348, "Member 'UWBP_DamageMeterBar_C::barIndex' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, meter) == 0x000350, "Member 'UWBP_DamageMeterBar_C::meter' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterBar_C, isMainBars) == 0x000358, "Member 'UWBP_DamageMeterBar_C::isMainBars' has a wrong offset!");

}

