#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerWarLeaderboard

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerWarLeaderboard.WBP_PlayerWarLeaderboard_C
// 0x0050 (0x0350 - 0x0300)
class UWBP_PlayerWarLeaderboard_C final : public UIndividualWarStatsMenu
{
public:
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_1;                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_2;                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_3;                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_4;                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_5;                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_6;                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_7;                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_8;                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_9;                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerWarLeaderboard_C">();
	}
	static class UWBP_PlayerWarLeaderboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerWarLeaderboard_C>();
	}
};
static_assert(alignof(UWBP_PlayerWarLeaderboard_C) == 0x000008, "Wrong alignment on UWBP_PlayerWarLeaderboard_C");
static_assert(sizeof(UWBP_PlayerWarLeaderboard_C) == 0x000350, "Wrong size on UWBP_PlayerWarLeaderboard_C");
static_assert(offsetof(UWBP_PlayerWarLeaderboard_C, WBP_PlayerWarLeaderboardItem) == 0x000300, "Member 'UWBP_PlayerWarLeaderboard_C::WBP_PlayerWarLeaderboardItem' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerWarLeaderboard_C, WBP_PlayerWarLeaderboardItem_1) == 0x000308, "Member 'UWBP_PlayerWarLeaderboard_C::WBP_PlayerWarLeaderboardItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerWarLeaderboard_C, WBP_PlayerWarLeaderboardItem_2) == 0x000310, "Member 'UWBP_PlayerWarLeaderboard_C::WBP_PlayerWarLeaderboardItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerWarLeaderboard_C, WBP_PlayerWarLeaderboardItem_3) == 0x000318, "Member 'UWBP_PlayerWarLeaderboard_C::WBP_PlayerWarLeaderboardItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerWarLeaderboard_C, WBP_PlayerWarLeaderboardItem_4) == 0x000320, "Member 'UWBP_PlayerWarLeaderboard_C::WBP_PlayerWarLeaderboardItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerWarLeaderboard_C, WBP_PlayerWarLeaderboardItem_5) == 0x000328, "Member 'UWBP_PlayerWarLeaderboard_C::WBP_PlayerWarLeaderboardItem_5' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerWarLeaderboard_C, WBP_PlayerWarLeaderboardItem_6) == 0x000330, "Member 'UWBP_PlayerWarLeaderboard_C::WBP_PlayerWarLeaderboardItem_6' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerWarLeaderboard_C, WBP_PlayerWarLeaderboardItem_7) == 0x000338, "Member 'UWBP_PlayerWarLeaderboard_C::WBP_PlayerWarLeaderboardItem_7' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerWarLeaderboard_C, WBP_PlayerWarLeaderboardItem_8) == 0x000340, "Member 'UWBP_PlayerWarLeaderboard_C::WBP_PlayerWarLeaderboardItem_8' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerWarLeaderboard_C, WBP_PlayerWarLeaderboardItem_9) == 0x000348, "Member 'UWBP_PlayerWarLeaderboard_C::WBP_PlayerWarLeaderboardItem_9' has a wrong offset!");

}

