#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillTreeNode

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SkillTreeNode.WBP_SkillTreeNode_C
// 0x0018 (0x07B0 - 0x0798)
class UWBP_SkillTreeNode_C final : public UPurchasableSkillTreeNode
{
public:
	class UImage*                                 InvalidImage;                                      // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PathsCanvas;                                       // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnPurchasedImage;                                  // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SkillTreeNode_C">();
	}
	static class UWBP_SkillTreeNode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SkillTreeNode_C>();
	}
};
static_assert(alignof(UWBP_SkillTreeNode_C) == 0x000008, "Wrong alignment on UWBP_SkillTreeNode_C");
static_assert(sizeof(UWBP_SkillTreeNode_C) == 0x0007B0, "Wrong size on UWBP_SkillTreeNode_C");
static_assert(offsetof(UWBP_SkillTreeNode_C, InvalidImage) == 0x000798, "Member 'UWBP_SkillTreeNode_C::InvalidImage' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTreeNode_C, PathsCanvas) == 0x0007A0, "Member 'UWBP_SkillTreeNode_C::PathsCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTreeNode_C, UnPurchasedImage) == 0x0007A8, "Member 'UWBP_SkillTreeNode_C::UnPurchasedImage' has a wrong offset!");

}

