#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MountWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MountWidget.WBP_MountWidget_C
// 0x0058 (0x0628 - 0x05D0)
class UWBP_MountWidget_C final : public UMountWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ClassIconImageOld;                                 // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconFrame;                                         // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvBox;                                            // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MountImage;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               O_Stamina;                                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SecondaryClass_Icon;                               // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           StaminaBar;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           StaminaBar_Old;                                    // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StaminaBarText;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent();
	void ExecuteUbergraph_WBP_MountWidget(int32 EntryPoint);
	void SetClassResourceBar(class FName StatName, const struct FLinearColor& Color, class UAoCStatsComponent* StatComp);
	void UpdateClassResourceBar();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MountWidget_C">();
	}
	static class UWBP_MountWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MountWidget_C>();
	}
};
static_assert(alignof(UWBP_MountWidget_C) == 0x000008, "Wrong alignment on UWBP_MountWidget_C");
static_assert(sizeof(UWBP_MountWidget_C) == 0x000628, "Wrong size on UWBP_MountWidget_C");
static_assert(offsetof(UWBP_MountWidget_C, UberGraphFrame) == 0x0005D0, "Member 'UWBP_MountWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MountWidget_C, ClassIconImageOld) == 0x0005D8, "Member 'UWBP_MountWidget_C::ClassIconImageOld' has a wrong offset!");
static_assert(offsetof(UWBP_MountWidget_C, IconFrame) == 0x0005E0, "Member 'UWBP_MountWidget_C::IconFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MountWidget_C, Image) == 0x0005E8, "Member 'UWBP_MountWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_MountWidget_C, InvBox) == 0x0005F0, "Member 'UWBP_MountWidget_C::InvBox' has a wrong offset!");
static_assert(offsetof(UWBP_MountWidget_C, MountImage) == 0x0005F8, "Member 'UWBP_MountWidget_C::MountImage' has a wrong offset!");
static_assert(offsetof(UWBP_MountWidget_C, O_Stamina) == 0x000600, "Member 'UWBP_MountWidget_C::O_Stamina' has a wrong offset!");
static_assert(offsetof(UWBP_MountWidget_C, SecondaryClass_Icon) == 0x000608, "Member 'UWBP_MountWidget_C::SecondaryClass_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_MountWidget_C, StaminaBar) == 0x000610, "Member 'UWBP_MountWidget_C::StaminaBar' has a wrong offset!");
static_assert(offsetof(UWBP_MountWidget_C, StaminaBar_Old) == 0x000618, "Member 'UWBP_MountWidget_C::StaminaBar_Old' has a wrong offset!");
static_assert(offsetof(UWBP_MountWidget_C, StaminaBarText) == 0x000620, "Member 'UWBP_MountWidget_C::StaminaBarText' has a wrong offset!");

}

