#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServiceBuildingDetailsPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServiceBuildingDetailsPanel.WBP_ServiceBuildingDetailsPanel_C
// 0x0120 (0x0888 - 0x0768)
class UWBP_ServiceBuildingDetailsPanel_C final : public UNodeBuildingDetailsPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0768(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BuildingStateIcon;                                 // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIntrepidWrapBox*                       BuildingStatsBox;                                  // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               ConstructionCostsBox_1;                            // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyTiersItem_C*               ConstructionCurrency_1;                            // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ConstructionCurrencyPanel_1;                       // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    InProgressUpgradeSubheaderTextBlock;               // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BuildingManagerSection_C*          RepairContributionSection;                         // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScrollableBuildingList;                            // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScW_Main;                                          // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    ServicesTextBlock;                                 // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_FabricationHeader;                              // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_SelectBuildingHeader;                           // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_VotingSectionHeader;                            // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityIcon_C*                   WBP_CommodityIcon;                                 // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityIcon_C*                   WBP_CommodityIcon_1;                               // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityIcon_C*                   WBP_CommodityIcon_2;                               // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityIcon_C*                   WBP_CommodityIcon_3;                               // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityIcon_C*                   WBP_CommodityIcon_4;                               // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityIcon_C*                   WBP_CommodityIcon_5;                               // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityIcon_C*                   WBP_CommodityIcon_6;                               // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommodityIcon_C*                   WBP_CommodityIcon_7;                               // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExpansionPointIcon_C*              WBP_ExpansionPointIcon;                            // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExpansionPointIcon_C*              WBP_ExpansionPointIcon_1;                          // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExpansionPointIcon_C*              WBP_ExpansionPointIcon_2;                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeBuildingListItem_C*            WBP_NodeBuildingListItem_2;                        // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeBuildingListItem_C*            WBP_NodeBuildingListItem_3;                        // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeBuildingListItem_C*            WBP_NodeBuildingListItem_4;                        // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeBuildingListItem_C*            WBP_NodeBuildingListItem_5;                        // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServiceBuildingStatWidget_C*       WBP_ServiceBuildingStatWidget;                     // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServiceBuildingStatWidget_C*       WBP_ServiceBuildingStatWidget_1;                   // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServiceBuildingStatWidget_C*       WBP_ServiceBuildingStatWidget_2;                   // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServiceBuildingStatWidget_C*       WBP_ServiceBuildingStatWidget_3;                   // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServicesProvidedEntry_C*           WBP_ServicesProvidedEntry;                         // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServicesProvidedEntry_C*           WBP_ServicesProvidedEntry_1;                       // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServicesProvidedEntry_C*           WBP_ServicesProvidedEntry_2;                       // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ServiceBuildingDetailsPanel(int32 EntryPoint);
	void SetSectionLabelBP(class UUserWidget* SectionWidget, const class FText& SectionLabel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServiceBuildingDetailsPanel_C">();
	}
	static class UWBP_ServiceBuildingDetailsPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServiceBuildingDetailsPanel_C>();
	}
};
static_assert(alignof(UWBP_ServiceBuildingDetailsPanel_C) == 0x000008, "Wrong alignment on UWBP_ServiceBuildingDetailsPanel_C");
static_assert(sizeof(UWBP_ServiceBuildingDetailsPanel_C) == 0x000888, "Wrong size on UWBP_ServiceBuildingDetailsPanel_C");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, UberGraphFrame) == 0x000768, "Member 'UWBP_ServiceBuildingDetailsPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, BuildingStateIcon) == 0x000770, "Member 'UWBP_ServiceBuildingDetailsPanel_C::BuildingStateIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, BuildingStatsBox) == 0x000778, "Member 'UWBP_ServiceBuildingDetailsPanel_C::BuildingStatsBox' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, ConstructionCostsBox_1) == 0x000780, "Member 'UWBP_ServiceBuildingDetailsPanel_C::ConstructionCostsBox_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, ConstructionCurrency_1) == 0x000788, "Member 'UWBP_ServiceBuildingDetailsPanel_C::ConstructionCurrency_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, ConstructionCurrencyPanel_1) == 0x000790, "Member 'UWBP_ServiceBuildingDetailsPanel_C::ConstructionCurrencyPanel_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, InProgressUpgradeSubheaderTextBlock) == 0x000798, "Member 'UWBP_ServiceBuildingDetailsPanel_C::InProgressUpgradeSubheaderTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, RepairContributionSection) == 0x0007A0, "Member 'UWBP_ServiceBuildingDetailsPanel_C::RepairContributionSection' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, ScrollableBuildingList) == 0x0007A8, "Member 'UWBP_ServiceBuildingDetailsPanel_C::ScrollableBuildingList' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, ScW_Main) == 0x0007B0, "Member 'UWBP_ServiceBuildingDetailsPanel_C::ScW_Main' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, ServicesTextBlock) == 0x0007B8, "Member 'UWBP_ServiceBuildingDetailsPanel_C::ServicesTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, TB_FabricationHeader) == 0x0007C0, "Member 'UWBP_ServiceBuildingDetailsPanel_C::TB_FabricationHeader' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, TB_SelectBuildingHeader) == 0x0007C8, "Member 'UWBP_ServiceBuildingDetailsPanel_C::TB_SelectBuildingHeader' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, TB_VotingSectionHeader) == 0x0007D0, "Member 'UWBP_ServiceBuildingDetailsPanel_C::TB_VotingSectionHeader' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_CommodityIcon) == 0x0007D8, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_CommodityIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_CommodityIcon_1) == 0x0007E0, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_CommodityIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_CommodityIcon_2) == 0x0007E8, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_CommodityIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_CommodityIcon_3) == 0x0007F0, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_CommodityIcon_3' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_CommodityIcon_4) == 0x0007F8, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_CommodityIcon_4' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_CommodityIcon_5) == 0x000800, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_CommodityIcon_5' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_CommodityIcon_6) == 0x000808, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_CommodityIcon_6' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_CommodityIcon_7) == 0x000810, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_CommodityIcon_7' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_ExpansionPointIcon) == 0x000818, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_ExpansionPointIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_ExpansionPointIcon_1) == 0x000820, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_ExpansionPointIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_ExpansionPointIcon_2) == 0x000828, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_ExpansionPointIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_NodeBuildingListItem_2) == 0x000830, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_NodeBuildingListItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_NodeBuildingListItem_3) == 0x000838, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_NodeBuildingListItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_NodeBuildingListItem_4) == 0x000840, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_NodeBuildingListItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_NodeBuildingListItem_5) == 0x000848, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_NodeBuildingListItem_5' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_ServiceBuildingStatWidget) == 0x000850, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_ServiceBuildingStatWidget' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_ServiceBuildingStatWidget_1) == 0x000858, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_ServiceBuildingStatWidget_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_ServiceBuildingStatWidget_2) == 0x000860, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_ServiceBuildingStatWidget_2' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_ServiceBuildingStatWidget_3) == 0x000868, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_ServiceBuildingStatWidget_3' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_ServicesProvidedEntry) == 0x000870, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_ServicesProvidedEntry' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_ServicesProvidedEntry_1) == 0x000878, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_ServicesProvidedEntry_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingDetailsPanel_C, WBP_ServicesProvidedEntry_2) == 0x000880, "Member 'UWBP_ServiceBuildingDetailsPanel_C::WBP_ServicesProvidedEntry_2' has a wrong offset!");

}

