#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UnitFrameDisplayMenu

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UnitFrameDisplayMenu.WBP_UnitFrameDisplayMenu_C
// 0x0038 (0x0328 - 0x02F0)
class UWBP_UnitFrameDisplayMenu_C final : public UUserWidget
{
public:
	class UWBP_CommonSliderRow_C*                 WBP_CommonSliderRow;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectablePipButton_C*             WBP_SelectablePipButton;                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectablePipButton_C*             WBP_SelectablePipButton_1;                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectablePipButton_C*             WBP_SelectablePipButton_2;                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectablePipButton_C*             WBP_SelectablePipButton_3;                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectablePipButton_C*             WBP_SelectablePipButton_4;                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectablePipButton_C*             WBP_SelectablePipButton_5;                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UnitFrameDisplayMenu_C">();
	}
	static class UWBP_UnitFrameDisplayMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UnitFrameDisplayMenu_C>();
	}
};
static_assert(alignof(UWBP_UnitFrameDisplayMenu_C) == 0x000008, "Wrong alignment on UWBP_UnitFrameDisplayMenu_C");
static_assert(sizeof(UWBP_UnitFrameDisplayMenu_C) == 0x000328, "Wrong size on UWBP_UnitFrameDisplayMenu_C");
static_assert(offsetof(UWBP_UnitFrameDisplayMenu_C, WBP_CommonSliderRow) == 0x0002F0, "Member 'UWBP_UnitFrameDisplayMenu_C::WBP_CommonSliderRow' has a wrong offset!");
static_assert(offsetof(UWBP_UnitFrameDisplayMenu_C, WBP_SelectablePipButton) == 0x0002F8, "Member 'UWBP_UnitFrameDisplayMenu_C::WBP_SelectablePipButton' has a wrong offset!");
static_assert(offsetof(UWBP_UnitFrameDisplayMenu_C, WBP_SelectablePipButton_1) == 0x000300, "Member 'UWBP_UnitFrameDisplayMenu_C::WBP_SelectablePipButton_1' has a wrong offset!");
static_assert(offsetof(UWBP_UnitFrameDisplayMenu_C, WBP_SelectablePipButton_2) == 0x000308, "Member 'UWBP_UnitFrameDisplayMenu_C::WBP_SelectablePipButton_2' has a wrong offset!");
static_assert(offsetof(UWBP_UnitFrameDisplayMenu_C, WBP_SelectablePipButton_3) == 0x000310, "Member 'UWBP_UnitFrameDisplayMenu_C::WBP_SelectablePipButton_3' has a wrong offset!");
static_assert(offsetof(UWBP_UnitFrameDisplayMenu_C, WBP_SelectablePipButton_4) == 0x000318, "Member 'UWBP_UnitFrameDisplayMenu_C::WBP_SelectablePipButton_4' has a wrong offset!");
static_assert(offsetof(UWBP_UnitFrameDisplayMenu_C, WBP_SelectablePipButton_5) == 0x000320, "Member 'UWBP_UnitFrameDisplayMenu_C::WBP_SelectablePipButton_5' has a wrong offset!");

}

