#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NodeSummaryPanel

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NodeSummaryPanel.WBP_NodeSummaryPanel_C
// 0x0038 (0x0440 - 0x0408)
class UWBP_NodeSummaryPanel_C final : public UNodeSummaryPanel
{
public:
	class UImage*                                 NodeIcon_1;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    NodePopulation;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NodeStatusIcon;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PolicyIcon1;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PolicyIcon2;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PolicyIcon3;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PolicyIcon4;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NodeSummaryPanel_C">();
	}
	static class UWBP_NodeSummaryPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NodeSummaryPanel_C>();
	}
};
static_assert(alignof(UWBP_NodeSummaryPanel_C) == 0x000008, "Wrong alignment on UWBP_NodeSummaryPanel_C");
static_assert(sizeof(UWBP_NodeSummaryPanel_C) == 0x000440, "Wrong size on UWBP_NodeSummaryPanel_C");
static_assert(offsetof(UWBP_NodeSummaryPanel_C, NodeIcon_1) == 0x000408, "Member 'UWBP_NodeSummaryPanel_C::NodeIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_NodeSummaryPanel_C, NodePopulation) == 0x000410, "Member 'UWBP_NodeSummaryPanel_C::NodePopulation' has a wrong offset!");
static_assert(offsetof(UWBP_NodeSummaryPanel_C, NodeStatusIcon) == 0x000418, "Member 'UWBP_NodeSummaryPanel_C::NodeStatusIcon' has a wrong offset!");
static_assert(offsetof(UWBP_NodeSummaryPanel_C, PolicyIcon1) == 0x000420, "Member 'UWBP_NodeSummaryPanel_C::PolicyIcon1' has a wrong offset!");
static_assert(offsetof(UWBP_NodeSummaryPanel_C, PolicyIcon2) == 0x000428, "Member 'UWBP_NodeSummaryPanel_C::PolicyIcon2' has a wrong offset!");
static_assert(offsetof(UWBP_NodeSummaryPanel_C, PolicyIcon3) == 0x000430, "Member 'UWBP_NodeSummaryPanel_C::PolicyIcon3' has a wrong offset!");
static_assert(offsetof(UWBP_NodeSummaryPanel_C, PolicyIcon4) == 0x000438, "Member 'UWBP_NodeSummaryPanel_C::PolicyIcon4' has a wrong offset!");

}

