#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TargetMarkersWindow

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TargetMarkersWindow.WBP_TargetMarkersWindow_C
// 0x0040 (0x0358 - 0x0318)
class UWBP_TargetMarkersWindow_C final : public UTargetMarkersWindow
{
public:
	class UWBP_TargetMarkerItem_C*                WBP_TargetMarkerItem_1;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TargetMarkerItem_C*                WBP_TargetMarkerItem_2;                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TargetMarkerItem_C*                WBP_TargetMarkerItem_3;                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TargetMarkerItem_C*                WBP_TargetMarkerItem_4;                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TargetMarkerItem_C*                WBP_TargetMarkerItem_5;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TargetMarkerItem_C*                WBP_TargetMarkerItem_6;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TargetMarkerItem_C*                WBP_TargetMarkerItem_7;                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TargetMarkerItem_C*                WBP_TargetMarkerItem_8;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TargetMarkersWindow_C">();
	}
	static class UWBP_TargetMarkersWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TargetMarkersWindow_C>();
	}
};
static_assert(alignof(UWBP_TargetMarkersWindow_C) == 0x000008, "Wrong alignment on UWBP_TargetMarkersWindow_C");
static_assert(sizeof(UWBP_TargetMarkersWindow_C) == 0x000358, "Wrong size on UWBP_TargetMarkersWindow_C");
static_assert(offsetof(UWBP_TargetMarkersWindow_C, WBP_TargetMarkerItem_1) == 0x000318, "Member 'UWBP_TargetMarkersWindow_C::WBP_TargetMarkerItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_TargetMarkersWindow_C, WBP_TargetMarkerItem_2) == 0x000320, "Member 'UWBP_TargetMarkersWindow_C::WBP_TargetMarkerItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_TargetMarkersWindow_C, WBP_TargetMarkerItem_3) == 0x000328, "Member 'UWBP_TargetMarkersWindow_C::WBP_TargetMarkerItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_TargetMarkersWindow_C, WBP_TargetMarkerItem_4) == 0x000330, "Member 'UWBP_TargetMarkersWindow_C::WBP_TargetMarkerItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_TargetMarkersWindow_C, WBP_TargetMarkerItem_5) == 0x000338, "Member 'UWBP_TargetMarkersWindow_C::WBP_TargetMarkerItem_5' has a wrong offset!");
static_assert(offsetof(UWBP_TargetMarkersWindow_C, WBP_TargetMarkerItem_6) == 0x000340, "Member 'UWBP_TargetMarkersWindow_C::WBP_TargetMarkerItem_6' has a wrong offset!");
static_assert(offsetof(UWBP_TargetMarkersWindow_C, WBP_TargetMarkerItem_7) == 0x000348, "Member 'UWBP_TargetMarkersWindow_C::WBP_TargetMarkerItem_7' has a wrong offset!");
static_assert(offsetof(UWBP_TargetMarkersWindow_C, WBP_TargetMarkerItem_8) == 0x000350, "Member 'UWBP_TargetMarkersWindow_C::WBP_TargetMarkerItem_8' has a wrong offset!");

}

