#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MayoralCommissionCard

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MayoralCommissionCard.WBP_MayoralCommissionCard_C
// 0x0088 (0x0510 - 0x0488)
class UWBP_MayoralCommissionCard_C final : public UMayoralCommissionCard
{
public:
	class UImage*                                 BaseBackgroundImage;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CommissionImage;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIntrepidVerticalBox*                   CommissionInfo;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    CommissionTitle;                                   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimerTextBlock_C*                  CompleteCooldownTextBlock;                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CompletionSection;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConditionalIcon;                                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CurrencyPanel;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DifficultyIcon;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExperienceBarFrame;                                // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ExpPanel;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ExpTextBlock;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityBorder;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyTiersItem_C*               RewardCurrencies;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_SlotCooldownLabel;                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 xpIcon;                                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MayoralCommissionCard_C">();
	}
	static class UWBP_MayoralCommissionCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MayoralCommissionCard_C>();
	}
};
static_assert(alignof(UWBP_MayoralCommissionCard_C) == 0x000008, "Wrong alignment on UWBP_MayoralCommissionCard_C");
static_assert(sizeof(UWBP_MayoralCommissionCard_C) == 0x000510, "Wrong size on UWBP_MayoralCommissionCard_C");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, BaseBackgroundImage) == 0x000488, "Member 'UWBP_MayoralCommissionCard_C::BaseBackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, Button) == 0x000490, "Member 'UWBP_MayoralCommissionCard_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, CommissionImage) == 0x000498, "Member 'UWBP_MayoralCommissionCard_C::CommissionImage' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, CommissionInfo) == 0x0004A0, "Member 'UWBP_MayoralCommissionCard_C::CommissionInfo' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, CommissionTitle) == 0x0004A8, "Member 'UWBP_MayoralCommissionCard_C::CommissionTitle' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, CompleteCooldownTextBlock) == 0x0004B0, "Member 'UWBP_MayoralCommissionCard_C::CompleteCooldownTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, CompletionSection) == 0x0004B8, "Member 'UWBP_MayoralCommissionCard_C::CompletionSection' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, ConditionalIcon) == 0x0004C0, "Member 'UWBP_MayoralCommissionCard_C::ConditionalIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, CurrencyPanel) == 0x0004C8, "Member 'UWBP_MayoralCommissionCard_C::CurrencyPanel' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, DifficultyIcon) == 0x0004D0, "Member 'UWBP_MayoralCommissionCard_C::DifficultyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, ExperienceBarFrame) == 0x0004D8, "Member 'UWBP_MayoralCommissionCard_C::ExperienceBarFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, ExpPanel) == 0x0004E0, "Member 'UWBP_MayoralCommissionCard_C::ExpPanel' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, ExpTextBlock) == 0x0004E8, "Member 'UWBP_MayoralCommissionCard_C::ExpTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, RarityBorder) == 0x0004F0, "Member 'UWBP_MayoralCommissionCard_C::RarityBorder' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, RewardCurrencies) == 0x0004F8, "Member 'UWBP_MayoralCommissionCard_C::RewardCurrencies' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, TB_SlotCooldownLabel) == 0x000500, "Member 'UWBP_MayoralCommissionCard_C::TB_SlotCooldownLabel' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionCard_C, xpIcon) == 0x000508, "Member 'UWBP_MayoralCommissionCard_C::xpIcon' has a wrong offset!");

}

