#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TetrisSlotDragIcon

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TetrisSlotDragIcon.WBP_TetrisSlotDragIcon_C
// 0x0068 (0x04C0 - 0x0458)
class UWBP_TetrisSlotDragIcon_C final : public UTetrisSlotDragIcon
{
public:
	class UImage*                                 Image;                                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_12;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_13;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_14;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            SplitStackAnchor;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TetrisSlotDragIcon_C">();
	}
	static class UWBP_TetrisSlotDragIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TetrisSlotDragIcon_C>();
	}
};
static_assert(alignof(UWBP_TetrisSlotDragIcon_C) == 0x000008, "Wrong alignment on UWBP_TetrisSlotDragIcon_C");
static_assert(sizeof(UWBP_TetrisSlotDragIcon_C) == 0x0004C0, "Wrong size on UWBP_TetrisSlotDragIcon_C");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, Image) == 0x000458, "Member 'UWBP_TetrisSlotDragIcon_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, Image_1) == 0x000460, "Member 'UWBP_TetrisSlotDragIcon_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, Image_2) == 0x000468, "Member 'UWBP_TetrisSlotDragIcon_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, Image_4) == 0x000470, "Member 'UWBP_TetrisSlotDragIcon_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, Image_5) == 0x000478, "Member 'UWBP_TetrisSlotDragIcon_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, Image_6) == 0x000480, "Member 'UWBP_TetrisSlotDragIcon_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, Image_8) == 0x000488, "Member 'UWBP_TetrisSlotDragIcon_C::Image_8' has a wrong offset!");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, Image_9) == 0x000490, "Member 'UWBP_TetrisSlotDragIcon_C::Image_9' has a wrong offset!");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, Image_10) == 0x000498, "Member 'UWBP_TetrisSlotDragIcon_C::Image_10' has a wrong offset!");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, Image_12) == 0x0004A0, "Member 'UWBP_TetrisSlotDragIcon_C::Image_12' has a wrong offset!");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, Image_13) == 0x0004A8, "Member 'UWBP_TetrisSlotDragIcon_C::Image_13' has a wrong offset!");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, Image_14) == 0x0004B0, "Member 'UWBP_TetrisSlotDragIcon_C::Image_14' has a wrong offset!");
static_assert(offsetof(UWBP_TetrisSlotDragIcon_C, SplitStackAnchor) == 0x0004B8, "Member 'UWBP_TetrisSlotDragIcon_C::SplitStackAnchor' has a wrong offset!");

}

