#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ESCMenu

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ESCMenu.WBP_ESCMenu_C
// 0x0020 (0x0398 - 0x0378)
class UWBP_ESCMenu_C final : public UEscapeMenu
{
public:
	class UWidgetAnimation*                       PanelShow;                                         // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelHide;                                         // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 HeaderPattern;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TitleTextBlock;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ESCMenu_C">();
	}
	static class UWBP_ESCMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ESCMenu_C>();
	}
};
static_assert(alignof(UWBP_ESCMenu_C) == 0x000008, "Wrong alignment on UWBP_ESCMenu_C");
static_assert(sizeof(UWBP_ESCMenu_C) == 0x000398, "Wrong size on UWBP_ESCMenu_C");
static_assert(offsetof(UWBP_ESCMenu_C, PanelShow) == 0x000378, "Member 'UWBP_ESCMenu_C::PanelShow' has a wrong offset!");
static_assert(offsetof(UWBP_ESCMenu_C, PanelHide) == 0x000380, "Member 'UWBP_ESCMenu_C::PanelHide' has a wrong offset!");
static_assert(offsetof(UWBP_ESCMenu_C, HeaderPattern) == 0x000388, "Member 'UWBP_ESCMenu_C::HeaderPattern' has a wrong offset!");
static_assert(offsetof(UWBP_ESCMenu_C, TitleTextBlock) == 0x000390, "Member 'UWBP_ESCMenu_C::TitleTextBlock' has a wrong offset!");

}

