#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BetaIDDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BetaIDDisplay.WBP_BetaIDDisplay_C
// 0x0018 (0x0308 - 0x02F0)
class UWBP_BetaIDDisplay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             BetaIdText;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FRandomStream                          Randomness;                                        // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)

public:
	void Construct();
	void ExecuteUbergraph_WBP_BetaIDDisplay(int32 EntryPoint);
	void OnTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BetaIDDisplay_C">();
	}
	static class UWBP_BetaIDDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BetaIDDisplay_C>();
	}
};
static_assert(alignof(UWBP_BetaIDDisplay_C) == 0x000008, "Wrong alignment on UWBP_BetaIDDisplay_C");
static_assert(sizeof(UWBP_BetaIDDisplay_C) == 0x000308, "Wrong size on UWBP_BetaIDDisplay_C");
static_assert(offsetof(UWBP_BetaIDDisplay_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_BetaIDDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BetaIDDisplay_C, BetaIdText) == 0x0002F8, "Member 'UWBP_BetaIDDisplay_C::BetaIdText' has a wrong offset!");
static_assert(offsetof(UWBP_BetaIDDisplay_C, Randomness) == 0x000300, "Member 'UWBP_BetaIDDisplay_C::Randomness' has a wrong offset!");

}

