#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProfessionProgressionMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ProfessionProgressionMenu.WBP_ProfessionProgressionMenu_C.GetButtonContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_ProfessionProgressionMenu_C_GetButtonContainer final
{
public:
	class UPanelWidget*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfessionProgressionMenu_C_GetButtonContainer) == 0x000008, "Wrong alignment on WBP_ProfessionProgressionMenu_C_GetButtonContainer");
static_assert(sizeof(WBP_ProfessionProgressionMenu_C_GetButtonContainer) == 0x000008, "Wrong size on WBP_ProfessionProgressionMenu_C_GetButtonContainer");
static_assert(offsetof(WBP_ProfessionProgressionMenu_C_GetButtonContainer, ReturnValue) == 0x000000, "Member 'WBP_ProfessionProgressionMenu_C_GetButtonContainer::ReturnValue' has a wrong offset!");

// Function WBP_ProfessionProgressionMenu.WBP_ProfessionProgressionMenu_C.GetEvenButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_ProfessionProgressionMenu_C_GetEvenButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfessionProgressionMenu_C_GetEvenButtonStyle) == 0x000008, "Wrong alignment on WBP_ProfessionProgressionMenu_C_GetEvenButtonStyle");
static_assert(sizeof(WBP_ProfessionProgressionMenu_C_GetEvenButtonStyle) == 0x000008, "Wrong size on WBP_ProfessionProgressionMenu_C_GetEvenButtonStyle");
static_assert(offsetof(WBP_ProfessionProgressionMenu_C_GetEvenButtonStyle, ReturnValue) == 0x000000, "Member 'WBP_ProfessionProgressionMenu_C_GetEvenButtonStyle::ReturnValue' has a wrong offset!");

// Function WBP_ProfessionProgressionMenu.WBP_ProfessionProgressionMenu_C.GetOddButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_ProfessionProgressionMenu_C_GetOddButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfessionProgressionMenu_C_GetOddButtonStyle) == 0x000008, "Wrong alignment on WBP_ProfessionProgressionMenu_C_GetOddButtonStyle");
static_assert(sizeof(WBP_ProfessionProgressionMenu_C_GetOddButtonStyle) == 0x000008, "Wrong size on WBP_ProfessionProgressionMenu_C_GetOddButtonStyle");
static_assert(offsetof(WBP_ProfessionProgressionMenu_C_GetOddButtonStyle, ReturnValue) == 0x000000, "Member 'WBP_ProfessionProgressionMenu_C_GetOddButtonStyle::ReturnValue' has a wrong offset!");

}

