#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DamageMeterBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_DamageMeterBar.WBP_DamageMeterBar_C.OnMouseButtonDown
// 0x0240 (0x0240 - 0x0000)
struct WBP_DamageMeterBar_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0168(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0188(0x00B8)()
};
static_assert(alignof(WBP_DamageMeterBar_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_DamageMeterBar_C_OnMouseButtonDown");
static_assert(sizeof(WBP_DamageMeterBar_C_OnMouseButtonDown) == 0x000240, "Wrong size on WBP_DamageMeterBar_C_OnMouseButtonDown");
static_assert(offsetof(WBP_DamageMeterBar_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_DamageMeterBar_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterBar_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_DamageMeterBar_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterBar_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_DamageMeterBar_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterBar_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000168, "Member 'WBP_DamageMeterBar_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterBar_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000180, "Member 'WBP_DamageMeterBar_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterBar_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000188, "Member 'WBP_DamageMeterBar_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DamageMeterBar.WBP_DamageMeterBar_C.ExecuteUbergraph_WBP_DamageMeterBar
// 0x0008 (0x0008 - 0x0000)
struct WBP_DamageMeterBar_C_ExecuteUbergraph_WBP_DamageMeterBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeterBar_C_ExecuteUbergraph_WBP_DamageMeterBar) == 0x000004, "Wrong alignment on WBP_DamageMeterBar_C_ExecuteUbergraph_WBP_DamageMeterBar");
static_assert(sizeof(WBP_DamageMeterBar_C_ExecuteUbergraph_WBP_DamageMeterBar) == 0x000008, "Wrong size on WBP_DamageMeterBar_C_ExecuteUbergraph_WBP_DamageMeterBar");
static_assert(offsetof(WBP_DamageMeterBar_C_ExecuteUbergraph_WBP_DamageMeterBar, EntryPoint) == 0x000000, "Member 'WBP_DamageMeterBar_C_ExecuteUbergraph_WBP_DamageMeterBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterBar_C_ExecuteUbergraph_WBP_DamageMeterBar, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_DamageMeterBar_C_ExecuteUbergraph_WBP_DamageMeterBar::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

