#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActiveCommissionCard

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActiveCommissionCard.WBP_ActiveCommissionCard_C
// 0x0040 (0x0630 - 0x05F0)
class UWBP_ActiveCommissionCard_C final : public UActiveCommissionCard
{
public:
	class UButton*                                Button_1;                                          // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EmptySlotOverlay;                                  // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainOverlay_1;                                     // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ObjectiveStateImage;                               // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon;                           // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon_1;                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon_2;                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon_3;                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ActiveCommissionCard_C">();
	}
	static class UWBP_ActiveCommissionCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActiveCommissionCard_C>();
	}
};
static_assert(alignof(UWBP_ActiveCommissionCard_C) == 0x000008, "Wrong alignment on UWBP_ActiveCommissionCard_C");
static_assert(sizeof(UWBP_ActiveCommissionCard_C) == 0x000630, "Wrong size on UWBP_ActiveCommissionCard_C");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, Button_1) == 0x0005F0, "Member 'UWBP_ActiveCommissionCard_C::Button_1' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, EmptySlotOverlay) == 0x0005F8, "Member 'UWBP_ActiveCommissionCard_C::EmptySlotOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, MainOverlay_1) == 0x000600, "Member 'UWBP_ActiveCommissionCard_C::MainOverlay_1' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, ObjectiveStateImage) == 0x000608, "Member 'UWBP_ActiveCommissionCard_C::ObjectiveStateImage' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, WBP_RewardContainerIcon) == 0x000610, "Member 'UWBP_ActiveCommissionCard_C::WBP_RewardContainerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, WBP_RewardContainerIcon_1) == 0x000618, "Member 'UWBP_ActiveCommissionCard_C::WBP_RewardContainerIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, WBP_RewardContainerIcon_2) == 0x000620, "Member 'UWBP_ActiveCommissionCard_C::WBP_RewardContainerIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCard_C, WBP_RewardContainerIcon_3) == 0x000628, "Member 'UWBP_ActiveCommissionCard_C::WBP_RewardContainerIcon_3' has a wrong offset!");

}

