#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChatTextColorItem

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ChatTextColorItem.WBP_ChatTextColorItem_C
// 0x0018 (0x0308 - 0x02F0)
class UWBP_ChatTextColorItem_C final : public UUserWidget
{
public:
	class UCommonBorder*                          AlternatingBG;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ColorPickerDropdown_C*             LeftColorDropdown;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ColorPickerDropdown_C*             RightColorDropdown;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ChatTextColorItem_C">();
	}
	static class UWBP_ChatTextColorItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ChatTextColorItem_C>();
	}
};
static_assert(alignof(UWBP_ChatTextColorItem_C) == 0x000008, "Wrong alignment on UWBP_ChatTextColorItem_C");
static_assert(sizeof(UWBP_ChatTextColorItem_C) == 0x000308, "Wrong size on UWBP_ChatTextColorItem_C");
static_assert(offsetof(UWBP_ChatTextColorItem_C, AlternatingBG) == 0x0002F0, "Member 'UWBP_ChatTextColorItem_C::AlternatingBG' has a wrong offset!");
static_assert(offsetof(UWBP_ChatTextColorItem_C, LeftColorDropdown) == 0x0002F8, "Member 'UWBP_ChatTextColorItem_C::LeftColorDropdown' has a wrong offset!");
static_assert(offsetof(UWBP_ChatTextColorItem_C, RightColorDropdown) == 0x000300, "Member 'UWBP_ChatTextColorItem_C::RightColorDropdown' has a wrong offset!");

}

