#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EventObjectiveItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_StoryArcObjectiveStates_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EventObjectiveItem.WBP_EventObjectiveItem_C
// 0x0038 (0x0378 - 0x0340)
class UWBP_EventObjectiveItem_C final : public UEventObjectiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DashImage;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimerProgressBarFrame;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_StoryArcObjectiveStates                     Objective_State;                                   // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Objective_Text;                                    // 0x0360(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_EventObjectiveItem(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Setup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EventObjectiveItem_C">();
	}
	static class UWBP_EventObjectiveItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EventObjectiveItem_C>();
	}
};
static_assert(alignof(UWBP_EventObjectiveItem_C) == 0x000008, "Wrong alignment on UWBP_EventObjectiveItem_C");
static_assert(sizeof(UWBP_EventObjectiveItem_C) == 0x000378, "Wrong size on UWBP_EventObjectiveItem_C");
static_assert(offsetof(UWBP_EventObjectiveItem_C, UberGraphFrame) == 0x000340, "Member 'UWBP_EventObjectiveItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EventObjectiveItem_C, DashImage) == 0x000348, "Member 'UWBP_EventObjectiveItem_C::DashImage' has a wrong offset!");
static_assert(offsetof(UWBP_EventObjectiveItem_C, TimerProgressBarFrame) == 0x000350, "Member 'UWBP_EventObjectiveItem_C::TimerProgressBarFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EventObjectiveItem_C, Objective_State) == 0x000358, "Member 'UWBP_EventObjectiveItem_C::Objective_State' has a wrong offset!");
static_assert(offsetof(UWBP_EventObjectiveItem_C, Objective_Text) == 0x000360, "Member 'UWBP_EventObjectiveItem_C::Objective_Text' has a wrong offset!");

}

