#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BlendHighlight

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_BlendHighlight.WBP_BlendHighlight_C.ExecuteUbergraph_WBP_BlendHighlight
// 0x0018 (0x0018 - 0x0000)
struct WBP_BlendHighlight_C_ExecuteUbergraph_WBP_BlendHighlight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BlendHighlight_C_ExecuteUbergraph_WBP_BlendHighlight) == 0x000008, "Wrong alignment on WBP_BlendHighlight_C_ExecuteUbergraph_WBP_BlendHighlight");
static_assert(sizeof(WBP_BlendHighlight_C_ExecuteUbergraph_WBP_BlendHighlight) == 0x000018, "Wrong size on WBP_BlendHighlight_C_ExecuteUbergraph_WBP_BlendHighlight");
static_assert(offsetof(WBP_BlendHighlight_C_ExecuteUbergraph_WBP_BlendHighlight, EntryPoint) == 0x000000, "Member 'WBP_BlendHighlight_C_ExecuteUbergraph_WBP_BlendHighlight::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BlendHighlight_C_ExecuteUbergraph_WBP_BlendHighlight, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_BlendHighlight_C_ExecuteUbergraph_WBP_BlendHighlight::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BlendHighlight_C_ExecuteUbergraph_WBP_BlendHighlight, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_BlendHighlight_C_ExecuteUbergraph_WBP_BlendHighlight::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_BlendHighlight.WBP_BlendHighlight_C.OnMouseButtonDown_0
// 0x0180 (0x0180 - 0x0000)
struct WBP_BlendHighlight_C_OnMouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacterCreatorController*            K2Node_DynamicCast_AsCharacter_Creator_Controller; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BlendHighlight_C_OnMouseButtonDown_0) == 0x000008, "Wrong alignment on WBP_BlendHighlight_C_OnMouseButtonDown_0");
static_assert(sizeof(WBP_BlendHighlight_C_OnMouseButtonDown_0) == 0x000180, "Wrong size on WBP_BlendHighlight_C_OnMouseButtonDown_0");
static_assert(offsetof(WBP_BlendHighlight_C_OnMouseButtonDown_0, MyGeometry) == 0x000000, "Member 'WBP_BlendHighlight_C_OnMouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_BlendHighlight_C_OnMouseButtonDown_0, MouseEvent) == 0x000038, "Member 'WBP_BlendHighlight_C_OnMouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_BlendHighlight_C_OnMouseButtonDown_0, ReturnValue) == 0x0000B0, "Member 'WBP_BlendHighlight_C_OnMouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BlendHighlight_C_OnMouseButtonDown_0, CallFunc_GetPlayerController_ReturnValue) == 0x000168, "Member 'WBP_BlendHighlight_C_OnMouseButtonDown_0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BlendHighlight_C_OnMouseButtonDown_0, K2Node_DynamicCast_AsCharacter_Creator_Controller) == 0x000170, "Member 'WBP_BlendHighlight_C_OnMouseButtonDown_0::K2Node_DynamicCast_AsCharacter_Creator_Controller' has a wrong offset!");
static_assert(offsetof(WBP_BlendHighlight_C_OnMouseButtonDown_0, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'WBP_BlendHighlight_C_OnMouseButtonDown_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_BlendHighlight.WBP_BlendHighlight_C.OnMouseButtonUp
// 0x0220 (0x0220 - 0x0000)
struct WBP_BlendHighlight_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(WBP_BlendHighlight_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on WBP_BlendHighlight_C_OnMouseButtonUp");
static_assert(sizeof(WBP_BlendHighlight_C_OnMouseButtonUp) == 0x000220, "Wrong size on WBP_BlendHighlight_C_OnMouseButtonUp");
static_assert(offsetof(WBP_BlendHighlight_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'WBP_BlendHighlight_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_BlendHighlight_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'WBP_BlendHighlight_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_BlendHighlight_C_OnMouseButtonUp, ReturnValue) == 0x0000B0, "Member 'WBP_BlendHighlight_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BlendHighlight_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'WBP_BlendHighlight_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

