#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MultiSelectFiltered

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MultiSelectFiltered.WBP_MultiSelectFiltered_C
// 0x0048 (0x0478 - 0x0430)
class UWBP_MultiSelectFiltered_C final : public UMultiSelectFilterModal
{
public:
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   SelectedItemsScroll;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   TB_MultiPurchaseInfo;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   TB_SelectedFuelActions;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MultiSelectItem_C*                 WBP_MultiSelectItem;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MultiSelectItem_C*                 WBP_MultiSelectItem_1;                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MultiSelectItem_C*                 WBP_MultiSelectItem_2;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MultiSelectItem_C*                 WBP_MultiSelectItem_3;                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MultiSelectItem_C*                 WBP_MultiSelectItem_4;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MultiSelectItem_C*                 WBP_MultiSelectItem_5;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MultiSelectFiltered_C">();
	}
	static class UWBP_MultiSelectFiltered_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MultiSelectFiltered_C>();
	}
};
static_assert(alignof(UWBP_MultiSelectFiltered_C) == 0x000008, "Wrong alignment on UWBP_MultiSelectFiltered_C");
static_assert(sizeof(UWBP_MultiSelectFiltered_C) == 0x000478, "Wrong size on UWBP_MultiSelectFiltered_C");
static_assert(offsetof(UWBP_MultiSelectFiltered_C, SelectedItemsScroll) == 0x000430, "Member 'UWBP_MultiSelectFiltered_C::SelectedItemsScroll' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectFiltered_C, TB_MultiPurchaseInfo) == 0x000438, "Member 'UWBP_MultiSelectFiltered_C::TB_MultiPurchaseInfo' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectFiltered_C, TB_SelectedFuelActions) == 0x000440, "Member 'UWBP_MultiSelectFiltered_C::TB_SelectedFuelActions' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectFiltered_C, WBP_MultiSelectItem) == 0x000448, "Member 'UWBP_MultiSelectFiltered_C::WBP_MultiSelectItem' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectFiltered_C, WBP_MultiSelectItem_1) == 0x000450, "Member 'UWBP_MultiSelectFiltered_C::WBP_MultiSelectItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectFiltered_C, WBP_MultiSelectItem_2) == 0x000458, "Member 'UWBP_MultiSelectFiltered_C::WBP_MultiSelectItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectFiltered_C, WBP_MultiSelectItem_3) == 0x000460, "Member 'UWBP_MultiSelectFiltered_C::WBP_MultiSelectItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectFiltered_C, WBP_MultiSelectItem_4) == 0x000468, "Member 'UWBP_MultiSelectFiltered_C::WBP_MultiSelectItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectFiltered_C, WBP_MultiSelectItem_5) == 0x000470, "Member 'UWBP_MultiSelectFiltered_C::WBP_MultiSelectItem_5' has a wrong offset!");

}

