#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RaidGroupWidget

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RaidGroupWidget.WBP_RaidGroupWidget_C
// 0x0068 (0x0378 - 0x0310)
class UWBP_RaidGroupWidget_C final : public URaidGroupWidget
{
public:
	class UCommonXButton_C*                       CloseButton;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HudEditWidget_C*                   HudEditWidget;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonXButton_C*                       LockedButton;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonXButton_C*                       RaidOptionsButton;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonXButton_C*                       UnlockedButton;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaidMemberWidget_C*                WBP_RaidMemberWidget;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaidMemberWidget_C*                WBP_RaidMemberWidget_1;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaidMemberWidget_C*                WBP_RaidMemberWidget_2;                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaidMemberWidget_C*                WBP_RaidMemberWidget_3;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaidMemberWidget_C*                WBP_RaidMemberWidget_4;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaidMemberWidget_C*                WBP_RaidMemberWidget_5;                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaidMemberWidget_C*                WBP_RaidMemberWidget_6;                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaidMemberWidget_C*                WBP_RaidMemberWidget_7;                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RaidGroupWidget_C">();
	}
	static class UWBP_RaidGroupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RaidGroupWidget_C>();
	}
};
static_assert(alignof(UWBP_RaidGroupWidget_C) == 0x000008, "Wrong alignment on UWBP_RaidGroupWidget_C");
static_assert(sizeof(UWBP_RaidGroupWidget_C) == 0x000378, "Wrong size on UWBP_RaidGroupWidget_C");
static_assert(offsetof(UWBP_RaidGroupWidget_C, CloseButton) == 0x000310, "Member 'UWBP_RaidGroupWidget_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UWBP_RaidGroupWidget_C, HudEditWidget) == 0x000318, "Member 'UWBP_RaidGroupWidget_C::HudEditWidget' has a wrong offset!");
static_assert(offsetof(UWBP_RaidGroupWidget_C, LockedButton) == 0x000320, "Member 'UWBP_RaidGroupWidget_C::LockedButton' has a wrong offset!");
static_assert(offsetof(UWBP_RaidGroupWidget_C, RaidOptionsButton) == 0x000328, "Member 'UWBP_RaidGroupWidget_C::RaidOptionsButton' has a wrong offset!");
static_assert(offsetof(UWBP_RaidGroupWidget_C, UnlockedButton) == 0x000330, "Member 'UWBP_RaidGroupWidget_C::UnlockedButton' has a wrong offset!");
static_assert(offsetof(UWBP_RaidGroupWidget_C, WBP_RaidMemberWidget) == 0x000338, "Member 'UWBP_RaidGroupWidget_C::WBP_RaidMemberWidget' has a wrong offset!");
static_assert(offsetof(UWBP_RaidGroupWidget_C, WBP_RaidMemberWidget_1) == 0x000340, "Member 'UWBP_RaidGroupWidget_C::WBP_RaidMemberWidget_1' has a wrong offset!");
static_assert(offsetof(UWBP_RaidGroupWidget_C, WBP_RaidMemberWidget_2) == 0x000348, "Member 'UWBP_RaidGroupWidget_C::WBP_RaidMemberWidget_2' has a wrong offset!");
static_assert(offsetof(UWBP_RaidGroupWidget_C, WBP_RaidMemberWidget_3) == 0x000350, "Member 'UWBP_RaidGroupWidget_C::WBP_RaidMemberWidget_3' has a wrong offset!");
static_assert(offsetof(UWBP_RaidGroupWidget_C, WBP_RaidMemberWidget_4) == 0x000358, "Member 'UWBP_RaidGroupWidget_C::WBP_RaidMemberWidget_4' has a wrong offset!");
static_assert(offsetof(UWBP_RaidGroupWidget_C, WBP_RaidMemberWidget_5) == 0x000360, "Member 'UWBP_RaidGroupWidget_C::WBP_RaidMemberWidget_5' has a wrong offset!");
static_assert(offsetof(UWBP_RaidGroupWidget_C, WBP_RaidMemberWidget_6) == 0x000368, "Member 'UWBP_RaidGroupWidget_C::WBP_RaidMemberWidget_6' has a wrong offset!");
static_assert(offsetof(UWBP_RaidGroupWidget_C, WBP_RaidMemberWidget_7) == 0x000370, "Member 'UWBP_RaidGroupWidget_C::WBP_RaidMemberWidget_7' has a wrong offset!");

}

