#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GuildRanking

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GuildRanking.WBP_GuildRanking_C
// 0x0050 (0x0360 - 0x0310)
class UWBP_GuildRanking_C final : public UGuildRanking
{
public:
	class UCircularThrobber*                      Loading;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScrollWindow;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_GuildRanksLabel;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildRankListEntry_C*              WBP_GuildRankListEntry;                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildRankListEntry_C*              WBP_GuildRankListEntry_1;                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildRankListEntry_C*              WBP_GuildRankListEntry_2;                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildRankListEntry_C*              WBP_GuildRankListEntry_3;                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildRankListEntry_C*              WBP_GuildRankListEntry_4;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildRankListEntry_C*              WBP_GuildRankListEntry_5;                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuildRankListEntry_C*              WBP_GuildRankListEntry_6;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GuildRanking_C">();
	}
	static class UWBP_GuildRanking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GuildRanking_C>();
	}
};
static_assert(alignof(UWBP_GuildRanking_C) == 0x000008, "Wrong alignment on UWBP_GuildRanking_C");
static_assert(sizeof(UWBP_GuildRanking_C) == 0x000360, "Wrong size on UWBP_GuildRanking_C");
static_assert(offsetof(UWBP_GuildRanking_C, Loading) == 0x000310, "Member 'UWBP_GuildRanking_C::Loading' has a wrong offset!");
static_assert(offsetof(UWBP_GuildRanking_C, ScrollWindow) == 0x000318, "Member 'UWBP_GuildRanking_C::ScrollWindow' has a wrong offset!");
static_assert(offsetof(UWBP_GuildRanking_C, TB_GuildRanksLabel) == 0x000320, "Member 'UWBP_GuildRanking_C::TB_GuildRanksLabel' has a wrong offset!");
static_assert(offsetof(UWBP_GuildRanking_C, WBP_GuildRankListEntry) == 0x000328, "Member 'UWBP_GuildRanking_C::WBP_GuildRankListEntry' has a wrong offset!");
static_assert(offsetof(UWBP_GuildRanking_C, WBP_GuildRankListEntry_1) == 0x000330, "Member 'UWBP_GuildRanking_C::WBP_GuildRankListEntry_1' has a wrong offset!");
static_assert(offsetof(UWBP_GuildRanking_C, WBP_GuildRankListEntry_2) == 0x000338, "Member 'UWBP_GuildRanking_C::WBP_GuildRankListEntry_2' has a wrong offset!");
static_assert(offsetof(UWBP_GuildRanking_C, WBP_GuildRankListEntry_3) == 0x000340, "Member 'UWBP_GuildRanking_C::WBP_GuildRankListEntry_3' has a wrong offset!");
static_assert(offsetof(UWBP_GuildRanking_C, WBP_GuildRankListEntry_4) == 0x000348, "Member 'UWBP_GuildRanking_C::WBP_GuildRankListEntry_4' has a wrong offset!");
static_assert(offsetof(UWBP_GuildRanking_C, WBP_GuildRankListEntry_5) == 0x000350, "Member 'UWBP_GuildRanking_C::WBP_GuildRankListEntry_5' has a wrong offset!");
static_assert(offsetof(UWBP_GuildRanking_C, WBP_GuildRankListEntry_6) == 0x000358, "Member 'UWBP_GuildRanking_C::WBP_GuildRankListEntry_6' has a wrong offset!");

}

