#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsMenuLabeledBox

#include "Basic.hpp"

#include "WBP_LabeledWrapBox_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OptionsMenuLabeledBox.WBP_OptionsMenuLabeledBox_C
// 0x0020 (0x03A0 - 0x0380)
class UWBP_OptionsMenuLabeledBox_C final : public UWBP_LabeledWrapBox_C
{
public:
	class UWBP_CommonDropDownRow_C*               WBP_CommonDropDownRow;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonDropDownRow_C*               WBP_CommonDropDownRow_1;                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonDropDownRow_C*               WBP_CommonDropDownRow_2;                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonDropDownRow_C*               WBP_CommonDropDownRow_3;                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OptionsMenuLabeledBox_C">();
	}
	static class UWBP_OptionsMenuLabeledBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OptionsMenuLabeledBox_C>();
	}
};
static_assert(alignof(UWBP_OptionsMenuLabeledBox_C) == 0x000008, "Wrong alignment on UWBP_OptionsMenuLabeledBox_C");
static_assert(sizeof(UWBP_OptionsMenuLabeledBox_C) == 0x0003A0, "Wrong size on UWBP_OptionsMenuLabeledBox_C");
static_assert(offsetof(UWBP_OptionsMenuLabeledBox_C, WBP_CommonDropDownRow) == 0x000380, "Member 'UWBP_OptionsMenuLabeledBox_C::WBP_CommonDropDownRow' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuLabeledBox_C, WBP_CommonDropDownRow_1) == 0x000388, "Member 'UWBP_OptionsMenuLabeledBox_C::WBP_CommonDropDownRow_1' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuLabeledBox_C, WBP_CommonDropDownRow_2) == 0x000390, "Member 'UWBP_OptionsMenuLabeledBox_C::WBP_CommonDropDownRow_2' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuLabeledBox_C, WBP_CommonDropDownRow_3) == 0x000398, "Member 'UWBP_OptionsMenuLabeledBox_C::WBP_CommonDropDownRow_3' has a wrong offset!");

}

