#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ArtisanshipMaterialItem

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ArtisanshipMaterialItem.WBP_ArtisanshipMaterialItem_C.ExecuteUbergraph_WBP_ArtisanshipMaterialItem
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    UniqueObjectNameForCooking_FormatArgumentData;     // 0x0018(0x0050)(HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    UniqueObjectNameForCooking_FormatArgumentData_1;   // 0x0078(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            UniqueObjectNameForCooking_Array;                  // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
};
static_assert(alignof(WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem) == 0x000008, "Wrong alignment on WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem");
static_assert(sizeof(WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem) == 0x0000F0, "Wrong size on WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem");
static_assert(offsetof(WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem, EntryPoint) == 0x000000, "Member 'WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem, UniqueObjectNameForCooking_FormatArgumentData) == 0x000018, "Member 'WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem::UniqueObjectNameForCooking_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem, K2Node_Event_IsDesignTime) == 0x000068, "Member 'WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000070, "Member 'WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem, UniqueObjectNameForCooking_FormatArgumentData_1) == 0x000078, "Member 'WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem::UniqueObjectNameForCooking_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem, UniqueObjectNameForCooking_Array) == 0x0000C8, "Member 'WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem::UniqueObjectNameForCooking_Array' has a wrong offset!");
static_assert(offsetof(WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'WBP_ArtisanshipMaterialItem_C_ExecuteUbergraph_WBP_ArtisanshipMaterialItem::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_ArtisanshipMaterialItem.WBP_ArtisanshipMaterialItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ArtisanshipMaterialItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ArtisanshipMaterialItem_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ArtisanshipMaterialItem_C_PreConstruct");
static_assert(sizeof(WBP_ArtisanshipMaterialItem_C_PreConstruct) == 0x000001, "Wrong size on WBP_ArtisanshipMaterialItem_C_PreConstruct");
static_assert(offsetof(WBP_ArtisanshipMaterialItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ArtisanshipMaterialItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

