#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DragDropChatTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DragDropChatTab.WBP_DragDropChatTab_C
// 0x0018 (0x0308 - 0x02F0)
class UWBP_DragDropChatTab_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Image_To_Display;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_DragDropChatTab(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DragDropChatTab_C">();
	}
	static class UWBP_DragDropChatTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DragDropChatTab_C>();
	}
};
static_assert(alignof(UWBP_DragDropChatTab_C) == 0x000008, "Wrong alignment on UWBP_DragDropChatTab_C");
static_assert(sizeof(UWBP_DragDropChatTab_C) == 0x000308, "Wrong size on UWBP_DragDropChatTab_C");
static_assert(offsetof(UWBP_DragDropChatTab_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_DragDropChatTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DragDropChatTab_C, Image) == 0x0002F8, "Member 'UWBP_DragDropChatTab_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_DragDropChatTab_C, Image_To_Display) == 0x000300, "Member 'UWBP_DragDropChatTab_C::Image_To_Display' has a wrong offset!");

}

