#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Subaccordion

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Subaccordion.WBP_Subaccordion_C
// 0x0028 (0x0410 - 0x03E8)
class UWBP_Subaccordion_C final : public UAccordion
{
public:
	class UImage*                                 UnreadNotifier;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListItem_C*                        WBP_ListItem;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListItem_C*                        WBP_ListItem_1;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListItem_C*                        WBP_ListItem_2;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListItem_C*                        WBP_ListItem_3;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UWidget* GetBreadcrumbWidget();
	class UAoCCommonButtonBase* GetButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Subaccordion_C">();
	}
	static class UWBP_Subaccordion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Subaccordion_C>();
	}
};
static_assert(alignof(UWBP_Subaccordion_C) == 0x000008, "Wrong alignment on UWBP_Subaccordion_C");
static_assert(sizeof(UWBP_Subaccordion_C) == 0x000410, "Wrong size on UWBP_Subaccordion_C");
static_assert(offsetof(UWBP_Subaccordion_C, UnreadNotifier) == 0x0003E8, "Member 'UWBP_Subaccordion_C::UnreadNotifier' has a wrong offset!");
static_assert(offsetof(UWBP_Subaccordion_C, WBP_ListItem) == 0x0003F0, "Member 'UWBP_Subaccordion_C::WBP_ListItem' has a wrong offset!");
static_assert(offsetof(UWBP_Subaccordion_C, WBP_ListItem_1) == 0x0003F8, "Member 'UWBP_Subaccordion_C::WBP_ListItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_Subaccordion_C, WBP_ListItem_2) == 0x000400, "Member 'UWBP_Subaccordion_C::WBP_ListItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_Subaccordion_C, WBP_ListItem_3) == 0x000408, "Member 'UWBP_Subaccordion_C::WBP_ListItem_3' has a wrong offset!");

}

