#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VendorMenu

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VendorMenu.WBP_VendorMenu_C
// 0x00E8 (0x0750 - 0x0668)
class UWBP_VendorMenu_C final : public UVendorMenu
{
public:
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   CartContent;                                       // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CopperIcon;                                        // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    CopperText;                                        // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GoldIcon;                                          // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    GoldText;                                          // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderAccent;                                      // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderAccent_1;                                    // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBG;                                          // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBG_1;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SilverIcon;                                        // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    SilverText;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TabsBox;                                           // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   TB_MultiPurchaseInfo;                              // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem;                            // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_1;                          // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_2;                          // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_3;                          // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_4;                          // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_5;                          // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_6;                          // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_7;                          // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_8;                          // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_9;                          // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_10;                         // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_11;                         // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_12;                         // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_13;                         // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_14;                         // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              WBP_VendorStandardItem_15;                         // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VendorMenu_C">();
	}
	static class UWBP_VendorMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VendorMenu_C>();
	}
};
static_assert(alignof(UWBP_VendorMenu_C) == 0x000008, "Wrong alignment on UWBP_VendorMenu_C");
static_assert(sizeof(UWBP_VendorMenu_C) == 0x000750, "Wrong size on UWBP_VendorMenu_C");
static_assert(offsetof(UWBP_VendorMenu_C, CartContent) == 0x000668, "Member 'UWBP_VendorMenu_C::CartContent' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, CopperIcon) == 0x000670, "Member 'UWBP_VendorMenu_C::CopperIcon' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, CopperText) == 0x000678, "Member 'UWBP_VendorMenu_C::CopperText' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, GoldIcon) == 0x000680, "Member 'UWBP_VendorMenu_C::GoldIcon' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, GoldText) == 0x000688, "Member 'UWBP_VendorMenu_C::GoldText' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, HeaderAccent) == 0x000690, "Member 'UWBP_VendorMenu_C::HeaderAccent' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, HeaderAccent_1) == 0x000698, "Member 'UWBP_VendorMenu_C::HeaderAccent_1' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, HeaderBG) == 0x0006A0, "Member 'UWBP_VendorMenu_C::HeaderBG' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, HeaderBG_1) == 0x0006A8, "Member 'UWBP_VendorMenu_C::HeaderBG_1' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, SilverIcon) == 0x0006B0, "Member 'UWBP_VendorMenu_C::SilverIcon' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, SilverText) == 0x0006B8, "Member 'UWBP_VendorMenu_C::SilverText' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, TabsBox) == 0x0006C0, "Member 'UWBP_VendorMenu_C::TabsBox' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, TB_MultiPurchaseInfo) == 0x0006C8, "Member 'UWBP_VendorMenu_C::TB_MultiPurchaseInfo' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem) == 0x0006D0, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_1) == 0x0006D8, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_2) == 0x0006E0, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_3) == 0x0006E8, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_4) == 0x0006F0, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_5) == 0x0006F8, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_5' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_6) == 0x000700, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_6' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_7) == 0x000708, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_7' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_8) == 0x000710, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_8' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_9) == 0x000718, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_9' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_10) == 0x000720, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_10' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_11) == 0x000728, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_11' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_12) == 0x000730, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_12' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_13) == 0x000738, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_13' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_14) == 0x000740, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_14' has a wrong offset!");
static_assert(offsetof(UWBP_VendorMenu_C, WBP_VendorStandardItem_15) == 0x000748, "Member 'UWBP_VendorMenu_C::WBP_VendorStandardItem_15' has a wrong offset!");

}

