#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUDEditorResetWindowPositions

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HUDEditorResetWindowPositions.WBP_HUDEditorResetWindowPositions_C.GetBorder
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUDEditorResetWindowPositions_C_GetBorder final
{
public:
	class UCommonBorder*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDEditorResetWindowPositions_C_GetBorder) == 0x000008, "Wrong alignment on WBP_HUDEditorResetWindowPositions_C_GetBorder");
static_assert(sizeof(WBP_HUDEditorResetWindowPositions_C_GetBorder) == 0x000008, "Wrong size on WBP_HUDEditorResetWindowPositions_C_GetBorder");
static_assert(offsetof(WBP_HUDEditorResetWindowPositions_C_GetBorder, ReturnValue) == 0x000000, "Member 'WBP_HUDEditorResetWindowPositions_C_GetBorder::ReturnValue' has a wrong offset!");

// Function WBP_HUDEditorResetWindowPositions.WBP_HUDEditorResetWindowPositions_C.ExecuteUbergraph_WBP_HUDEditorResetWindowPositions
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUDEditorResetWindowPositions_C_ExecuteUbergraph_WBP_HUDEditorResetWindowPositions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDEditorResetWindowPositions_C_ExecuteUbergraph_WBP_HUDEditorResetWindowPositions) == 0x000008, "Wrong alignment on WBP_HUDEditorResetWindowPositions_C_ExecuteUbergraph_WBP_HUDEditorResetWindowPositions");
static_assert(sizeof(WBP_HUDEditorResetWindowPositions_C_ExecuteUbergraph_WBP_HUDEditorResetWindowPositions) == 0x000010, "Wrong size on WBP_HUDEditorResetWindowPositions_C_ExecuteUbergraph_WBP_HUDEditorResetWindowPositions");
static_assert(offsetof(WBP_HUDEditorResetWindowPositions_C_ExecuteUbergraph_WBP_HUDEditorResetWindowPositions, EntryPoint) == 0x000000, "Member 'WBP_HUDEditorResetWindowPositions_C_ExecuteUbergraph_WBP_HUDEditorResetWindowPositions::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUDEditorResetWindowPositions_C_ExecuteUbergraph_WBP_HUDEditorResetWindowPositions, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_HUDEditorResetWindowPositions_C_ExecuteUbergraph_WBP_HUDEditorResetWindowPositions::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_HUDEditorResetWindowPositions.WBP_HUDEditorResetWindowPositions_C.BndEvt__WBP_HUDEditorResetWindowPositions_ResetWindowsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUDEditorResetWindowPositions_C_BndEvt__WBP_HUDEditorResetWindowPositions_ResetWindowsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDEditorResetWindowPositions_C_BndEvt__WBP_HUDEditorResetWindowPositions_ResetWindowsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HUDEditorResetWindowPositions_C_BndEvt__WBP_HUDEditorResetWindowPositions_ResetWindowsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_HUDEditorResetWindowPositions_C_BndEvt__WBP_HUDEditorResetWindowPositions_ResetWindowsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_HUDEditorResetWindowPositions_C_BndEvt__WBP_HUDEditorResetWindowPositions_ResetWindowsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_HUDEditorResetWindowPositions_C_BndEvt__WBP_HUDEditorResetWindowPositions_ResetWindowsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_HUDEditorResetWindowPositions_C_BndEvt__WBP_HUDEditorResetWindowPositions_ResetWindowsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

}

