#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GemSocketingDropdownItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GemSocketingDropdownItem.WBP_GemSocketingDropdownItem_C
// 0x0040 (0x17B0 - 0x1770)
class UWBP_GemSocketingDropdownItem_C final : public UGemSocketingDropdownItem
{
public:
	class UCommonBorder*                          AlternatingBG;                                     // 0x1770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GemStatusBuffEntry_C*              WBP_GemStatusBuffEntry;                            // 0x1778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GemStatusBuffEntry_C*              WBP_GemStatusBuffEntry_1;                          // 0x1780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GemStatusBuffEntry_C*              WBP_GemStatusBuffEntry_2;                          // 0x1788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GemStatusBuffEntry_C*              WBP_GemStatusBuffEntry_3;                          // 0x1790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GemStatusBuffEntry_C*              WBP_GemStatusBuffEntry_4;                          // 0x1798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GemStatusBuffEntry_C*              WBP_GemStatusBuffEntry_5;                          // 0x17A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GemSocketingDropdownItem_C">();
	}
	static class UWBP_GemSocketingDropdownItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GemSocketingDropdownItem_C>();
	}
};
static_assert(alignof(UWBP_GemSocketingDropdownItem_C) == 0x000010, "Wrong alignment on UWBP_GemSocketingDropdownItem_C");
static_assert(sizeof(UWBP_GemSocketingDropdownItem_C) == 0x0017B0, "Wrong size on UWBP_GemSocketingDropdownItem_C");
static_assert(offsetof(UWBP_GemSocketingDropdownItem_C, AlternatingBG) == 0x001770, "Member 'UWBP_GemSocketingDropdownItem_C::AlternatingBG' has a wrong offset!");
static_assert(offsetof(UWBP_GemSocketingDropdownItem_C, WBP_GemStatusBuffEntry) == 0x001778, "Member 'UWBP_GemSocketingDropdownItem_C::WBP_GemStatusBuffEntry' has a wrong offset!");
static_assert(offsetof(UWBP_GemSocketingDropdownItem_C, WBP_GemStatusBuffEntry_1) == 0x001780, "Member 'UWBP_GemSocketingDropdownItem_C::WBP_GemStatusBuffEntry_1' has a wrong offset!");
static_assert(offsetof(UWBP_GemSocketingDropdownItem_C, WBP_GemStatusBuffEntry_2) == 0x001788, "Member 'UWBP_GemSocketingDropdownItem_C::WBP_GemStatusBuffEntry_2' has a wrong offset!");
static_assert(offsetof(UWBP_GemSocketingDropdownItem_C, WBP_GemStatusBuffEntry_3) == 0x001790, "Member 'UWBP_GemSocketingDropdownItem_C::WBP_GemStatusBuffEntry_3' has a wrong offset!");
static_assert(offsetof(UWBP_GemSocketingDropdownItem_C, WBP_GemStatusBuffEntry_4) == 0x001798, "Member 'UWBP_GemSocketingDropdownItem_C::WBP_GemStatusBuffEntry_4' has a wrong offset!");
static_assert(offsetof(UWBP_GemSocketingDropdownItem_C, WBP_GemStatusBuffEntry_5) == 0x0017A0, "Member 'UWBP_GemSocketingDropdownItem_C::WBP_GemStatusBuffEntry_5' has a wrong offset!");

}

