#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CombatTooltipGenerator

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "DesignDataPlugin_structs.hpp"


namespace SDK::Params
{

// Function WBP_CombatTooltipGenerator.WBP_CombatTooltipGenerator_C.AddRichTextMarkupToEachLine
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine final
{
public:
	class FString                                 Input;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 markup;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Output;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 returnStr;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_1;                            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine) == 0x000008, "Wrong alignment on WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine");
static_assert(sizeof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine) == 0x0000F8, "Wrong size on WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, Input) == 0x000000, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::Input' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, markup) == 0x000010, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::markup' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, Output) == 0x000020, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::Output' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, returnStr) == 0x000030, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::returnStr' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, Temp_string_Variable) == 0x000040, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, CallFunc_ParseIntoArray_ReturnValue) == 0x000050, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, CallFunc_Array_LastIndex_ReturnValue) == 0x000064, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, Temp_int_Array_Index_Variable) == 0x000068, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000098, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000AC, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, Temp_string_Variable_1) == 0x0000B0, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, Temp_bool_Variable) == 0x0000C0, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000D8, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000E8, "Member 'WBP_CombatTooltipGenerator_C_AddRichTextMarkupToEachLine::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function WBP_CombatTooltipGenerator.WBP_CombatTooltipGenerator_C.BuildFinalTooltip
// 0x0098 (0x0098 - 0x0000)
struct WBP_CombatTooltipGenerator_C_BuildFinalTooltip final
{
public:
	class FString                                 txt;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TSet<class FString>                           alreadySeen;                                       // 0x0010(0x0050)(Edit, BlueprintVisible)
	class FString                                 CallFunc_TrimTrailing_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Trim_ReturnValue;                         // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
};
static_assert(alignof(WBP_CombatTooltipGenerator_C_BuildFinalTooltip) == 0x000008, "Wrong alignment on WBP_CombatTooltipGenerator_C_BuildFinalTooltip");
static_assert(sizeof(WBP_CombatTooltipGenerator_C_BuildFinalTooltip) == 0x000098, "Wrong size on WBP_CombatTooltipGenerator_C_BuildFinalTooltip");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_BuildFinalTooltip, txt) == 0x000000, "Member 'WBP_CombatTooltipGenerator_C_BuildFinalTooltip::txt' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_BuildFinalTooltip, alreadySeen) == 0x000010, "Member 'WBP_CombatTooltipGenerator_C_BuildFinalTooltip::alreadySeen' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_BuildFinalTooltip, CallFunc_TrimTrailing_ReturnValue) == 0x000060, "Member 'WBP_CombatTooltipGenerator_C_BuildFinalTooltip::CallFunc_TrimTrailing_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_BuildFinalTooltip, CallFunc_Trim_ReturnValue) == 0x000070, "Member 'WBP_CombatTooltipGenerator_C_BuildFinalTooltip::CallFunc_Trim_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_BuildFinalTooltip, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WBP_CombatTooltipGenerator_C_BuildFinalTooltip::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_CombatTooltipGenerator.WBP_CombatTooltipGenerator_C.CheckSpecificEffectArgs
// 0x0810 (0x0810 - 0x0000)
struct WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs final
{
public:
	class FString                                 Args;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FEffectRecordBase                      EffectRecord;                                      // 0x0010(0x0788)(BlueprintVisible, BlueprintReadOnly, Parm)
	class ABaseCharacter*                         Source;                                            // 0x0798(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 ret;                                               // 0x07A0(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTimeStr_str;                           // 0x07B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTimeStr_str_1;                         // 0x07C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_1;        // 0x07D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_2;        // 0x07D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D3[0x5];                                      // 0x07D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         Temp_object_Variable;                              // 0x07D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Temp_object_Variable_1;                            // 0x07E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EvalExpressionFloat_value;                // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTimeStr_str_2;                         // 0x07F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeStr_time_ImplicitCast;             // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeStr_time_ImplicitCast_1;           // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs) == 0x000008, "Wrong alignment on WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs");
static_assert(sizeof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs) == 0x000810, "Wrong size on WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, Args) == 0x000000, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::Args' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, EffectRecord) == 0x000010, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::EffectRecord' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, Source) == 0x000798, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::Source' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, ret) == 0x0007A0, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::ret' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, CallFunc_GetTimeStr_str) == 0x0007B0, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::CallFunc_GetTimeStr_str' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, CallFunc_GetTimeStr_str_1) == 0x0007C0, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::CallFunc_GetTimeStr_str_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x0007D0, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, CallFunc_EqualEqual_StriStri_ReturnValue_1) == 0x0007D1, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::CallFunc_EqualEqual_StriStri_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, CallFunc_EqualEqual_StriStri_ReturnValue_2) == 0x0007D2, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::CallFunc_EqualEqual_StriStri_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, Temp_object_Variable) == 0x0007D8, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, Temp_object_Variable_1) == 0x0007E0, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, CallFunc_EvalExpressionFloat_value) == 0x0007E8, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::CallFunc_EvalExpressionFloat_value' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, CallFunc_GetTimeStr_str_2) == 0x0007F0, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::CallFunc_GetTimeStr_str_2' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, CallFunc_GetTimeStr_time_ImplicitCast) == 0x000800, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::CallFunc_GetTimeStr_time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs, CallFunc_GetTimeStr_time_ImplicitCast_1) == 0x000808, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificEffectArgs::CallFunc_GetTimeStr_time_ImplicitCast_1' has a wrong offset!");

// Function WBP_CombatTooltipGenerator.WBP_CombatTooltipGenerator_C.CheckSpecificLingeringEffectArgs
// 0x0420 (0x0420 - 0x0000)
struct WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs final
{
public:
	class FString                                 Args;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FLingeringEffectRecord                 rec;                                               // 0x0010(0x03B8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class ABaseCharacter*                         Source;                                            // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Str;                                               // 0x03D0(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTimeStr_str;                           // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTimeStr_str_1;                         // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_1;        // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeStr_time_ImplicitCast;             // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeStr_time_ImplicitCast_1;           // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs) == 0x000008, "Wrong alignment on WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs");
static_assert(sizeof(WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs) == 0x000420, "Wrong size on WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs, Args) == 0x000000, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs::Args' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs, rec) == 0x000010, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs::rec' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs, Source) == 0x0003C8, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs::Source' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs, Str) == 0x0003D0, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs::Str' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x0003E0, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs, CallFunc_GetTimeStr_str) == 0x0003E8, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs::CallFunc_GetTimeStr_str' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs, CallFunc_GetTimeStr_str_1) == 0x0003F8, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs::CallFunc_GetTimeStr_str_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs, CallFunc_EqualEqual_StriStri_ReturnValue_1) == 0x000408, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs::CallFunc_EqualEqual_StriStri_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs, CallFunc_GetTimeStr_time_ImplicitCast) == 0x000410, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs::CallFunc_GetTimeStr_time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs, CallFunc_GetTimeStr_time_ImplicitCast_1) == 0x000418, "Member 'WBP_CombatTooltipGenerator_C_CheckSpecificLingeringEffectArgs::CallFunc_GetTimeStr_time_ImplicitCast_1' has a wrong offset!");

// Function WBP_CombatTooltipGenerator.WBP_CombatTooltipGenerator_C.EvalExpressionBool
// 0x0140 (0x0140 - 0x0000)
struct WBP_CombatTooltipGenerator_C_EvalExpressionBool final
{
public:
	struct FAoCExpression                         Expression;                                        // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ABaseCharacter*                         Source;                                            // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Target;                                            // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Instigator;                                        // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Owner;                                             // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExprValue                             CallFunc_EvaluateCombatExpression_ReturnValue;     // 0x0078(0x00C8)()
};
static_assert(alignof(WBP_CombatTooltipGenerator_C_EvalExpressionBool) == 0x000008, "Wrong alignment on WBP_CombatTooltipGenerator_C_EvalExpressionBool");
static_assert(sizeof(WBP_CombatTooltipGenerator_C_EvalExpressionBool) == 0x000140, "Wrong size on WBP_CombatTooltipGenerator_C_EvalExpressionBool");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionBool, Expression) == 0x000000, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionBool::Expression' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionBool, Source) == 0x000050, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionBool::Source' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionBool, Target) == 0x000058, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionBool::Target' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionBool, Instigator) == 0x000060, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionBool::Instigator' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionBool, Owner) == 0x000068, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionBool::Owner' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionBool, Value) == 0x000070, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionBool::Value' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionBool, CallFunc_EvaluateCombatExpression_ReturnValue) == 0x000078, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionBool::CallFunc_EvaluateCombatExpression_ReturnValue' has a wrong offset!");

// Function WBP_CombatTooltipGenerator.WBP_CombatTooltipGenerator_C.EvalExpressionFloat
// 0x0160 (0x0160 - 0x0000)
struct WBP_CombatTooltipGenerator_C_EvalExpressionFloat final
{
public:
	struct FAoCExpression                         Expression;                                        // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ABaseCharacter*                         Source;                                            // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Target;                                            // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Instigator;                                        // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         Owner;                                             // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	double                                        Value;                                             // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExprValue                             CallFunc_EvaluateCombatExpression_ReturnValue;     // 0x0080(0x00C8)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat) == 0x000008, "Wrong alignment on WBP_CombatTooltipGenerator_C_EvalExpressionFloat");
static_assert(sizeof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat) == 0x000160, "Wrong size on WBP_CombatTooltipGenerator_C_EvalExpressionFloat");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat, Expression) == 0x000000, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionFloat::Expression' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat, Source) == 0x000050, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionFloat::Source' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat, Target) == 0x000058, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionFloat::Target' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat, Instigator) == 0x000060, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionFloat::Instigator' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat, Owner) == 0x000068, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionFloat::Owner' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat, Value) == 0x000070, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionFloat::Value' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat, Temp_bool_Variable) == 0x000078, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionFloat::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat, CallFunc_EvaluateCombatExpression_ReturnValue) == 0x000080, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionFloat::CallFunc_EvaluateCombatExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000148, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionFloat::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000150, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionFloat::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_EvalExpressionFloat, K2Node_Select_Default) == 0x000158, "Member 'WBP_CombatTooltipGenerator_C_EvalExpressionFloat::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CombatTooltipGenerator.WBP_CombatTooltipGenerator_C.ExecuteUbergraph_WBP_CombatTooltipGenerator
// 0x2038 (0x2038 - 0x0000)
struct WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatTypeDefRecord                     K2Node_Event_StatRecord;                           // 0x0020(0x02C8)(ConstParm)
	struct FExpansionRecord                       K2Node_Event_ExpansionRecord;                      // 0x02E8(0x0428)(ConstParm)
	struct FItemRecord                            K2Node_Event_ItemRecord;                           // 0x0710(0x06C8)(ConstParm)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0DD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAoCAbilityRecord                      CallFunc_GetAbilityRecordByGuid_ReturnValue;       // 0x0DE0(0x1018)(ConstParm)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x1DF8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAbilityDescription_Internal_description; // 0x1E08(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedGameplayTag_ReturnValue;      // 0x1E18(0x0018)()
	class FName                                   CallFunc_GetTagName_ReturnValue_1;                 // 0x1E30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x1E38(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x1E48(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x1E58(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetLocalizedGameplayTag_ReturnValue_1;    // 0x1E68(0x0018)()
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x1E80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E84[0x4];                                     // 0x1E84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x1E88(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue_1;             // 0x1E98(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x1EA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA9[0x3];                                     // 0x1EA9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x1EAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x1EB0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetChunks_FAST_ret;                       // 0x1EC0(0x0010)(ReferenceParm)
	class FText                                   K2Node_Event_Text;                                 // 0x1ED0(0x0018)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x1EE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x1EEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x1EF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x1EF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EF5[0x3];                                     // 0x1EF5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_1;                            // 0x1EF8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x1F08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F09[0x7];                                     // 0x1F09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x1F10(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x1F20(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x1F30(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x1F48(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x1F58(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x1F68(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x1F78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F7C[0x4];                                     // 0x1F7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x1F80(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x1F90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x1F94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x1F95(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F96[0x2];                                     // 0x1F96(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x1F98(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x1FA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FAC[0x4];                                     // 0x1FAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuildEffectRecord                     K2Node_Event_GuildEffectRecord;                    // 0x1FB0(0x0080)(ConstParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x2030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2031[0x3];                                     // 0x2031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x2034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator) == 0x000008, "Wrong alignment on WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator");
static_assert(sizeof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator) == 0x002038, "Wrong size on WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, EntryPoint) == 0x000000, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, Temp_string_Variable) == 0x000008, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, K2Node_Event_StatRecord) == 0x000020, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::K2Node_Event_StatRecord' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, K2Node_Event_ExpansionRecord) == 0x0002E8, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::K2Node_Event_ExpansionRecord' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, K2Node_Event_ItemRecord) == 0x000710, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::K2Node_Event_ItemRecord' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_GetTagName_ReturnValue) == 0x000DD8, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_GetAbilityRecordByGuid_ReturnValue) == 0x000DE0, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_GetAbilityRecordByGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Conv_NameToString_ReturnValue) == 0x001DF8, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_GetAbilityDescription_Internal_description) == 0x001E08, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_GetAbilityDescription_Internal_description' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_GetLocalizedGameplayTag_ReturnValue) == 0x001E18, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_GetLocalizedGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_GetTagName_ReturnValue_1) == 0x001E30, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_GetTagName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Conv_TextToString_ReturnValue) == 0x001E38, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Conv_NameToString_ReturnValue_1) == 0x001E48, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_ParseIntoArray_ReturnValue) == 0x001E58, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_GetLocalizedGameplayTag_ReturnValue_1) == 0x001E68, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_GetLocalizedGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Array_LastIndex_ReturnValue) == 0x001E80, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Conv_TextToString_ReturnValue_1) == 0x001E88, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_ParseIntoArray_ReturnValue_1) == 0x001E98, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_ParseIntoArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x001EA8, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Array_LastIndex_ReturnValue_1) == 0x001EAC, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Conv_TextToString_ReturnValue_2) == 0x001EB0, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_GetChunks_FAST_ret) == 0x001EC0, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_GetChunks_FAST_ret' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, K2Node_Event_Text) == 0x001ED0, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Array_Length_ReturnValue) == 0x001EE8, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Array_Length_ReturnValue_1) == 0x001EEC, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Percent_IntInt_ReturnValue) == 0x001EF0, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x001EF4, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, Temp_string_Variable_1) == 0x001EF8, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, Temp_bool_Variable) == 0x001F08, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, K2Node_Select_Default) == 0x001F10, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Concat_StrStr_ReturnValue) == 0x001F20, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Conv_StringToText_ReturnValue) == 0x001F30, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Concat_StrStr_ReturnValue_1) == 0x001F48, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Concat_StrStr_ReturnValue_2) == 0x001F58, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Concat_StrStr_ReturnValue_3) == 0x001F68, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, Temp_int_Array_Index_Variable) == 0x001F78, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Array_Get_Item) == 0x001F80, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Percent_IntInt_ReturnValue_1) == 0x001F90, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, K2Node_SwitchString_CmpSuccess) == 0x001F94, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x001F95, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Concat_StrStr_ReturnValue_4) == 0x001F98, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, Temp_int_Loop_Counter_Variable) == 0x001FA8, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, K2Node_Event_GuildEffectRecord) == 0x001FB0, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::K2Node_Event_GuildEffectRecord' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Less_IntInt_ReturnValue) == 0x002030, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator, CallFunc_Add_IntInt_ReturnValue) == 0x002034, "Member 'WBP_CombatTooltipGenerator_C_ExecuteUbergraph_WBP_CombatTooltipGenerator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CombatTooltipGenerator.WBP_CombatTooltipGenerator_C.FindFormat
// 0x0180 (0x0180 - 0x0000)
struct WBP_CombatTooltipGenerator_C_FindFormat final
{
public:
	TArray<struct FGameplayTag>                   Tags;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Format;                                            // 0x0010(0x0018)(Parm, OutParm)
	class FString                                 stringer;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item_1;                         // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x006C(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
