#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterMenu

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterMenu.WBP_CharacterMenu_C
// 0x01C8 (0x06D8 - 0x0510)
class UWBP_CharacterMenu_C final : public UCharacterMenu
{
public:
	class UWBP_Accordion_C*                       ArtisanStatAccordion;                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   AxeSlot;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   BackEquipmentSlot_2;                               // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   BaitSlot;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       BaseAttributesAccordion_1;                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   BowSlot;                                           // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   ChestEquipmentSlot_2;                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           CorruptionBar;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CorruptionTextBlock;                               // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   CrowBarEquipmentSlot;                              // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   DrillSlot;                                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   EaringLeftEquipmentSlot_2;                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   EaringRightEquipmentSlot_2;                        // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   FeetEquipmentSlot_2;                               // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   FishingRodSlot;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   HandsEquipmentSlot_2;                              // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   HarpoonSlot;                                       // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   HeadEquipmentSlot_2;                               // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       HealingAccordion_1;                                // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonButton_C*                        HideHelmetButton;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   LegsEquipmentSlot_2;                               // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       MagicalDefenseAccordion_1;                         // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       MagicalOffenseAccordion_1;                         // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   NecklaceEquipmentSlot_2;                           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   NetSlot;                                           // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   PanSlot;                                           // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       PhysicalDefenseAccordion_1;                        // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       PhysicalOffenseAccordion_1;                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   PickaxeSlot;                                       // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   PrimaryWeaponEquipmentSlot_2;                      // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   RangedOffHandWeaponEquipmentSlot_2;                // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   RangedWeaponEquipmentSlot_2;                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       RegenerationAccordion_1;                           // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   RingLeftEquipmentSlot_2;                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   RingRightEquipmentSlot_2;                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   SawSlot;                                           // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   ScytheSlot;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   SecondaryWeaponEquipmentSlot_2;                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   ShearsSlot;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   ShirtEquipmentSlot;                                // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   ShouldersEquipmentSlot_2;                          // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   SickleSlot;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SubarchetypeIcon;                                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SubarchetypeIconContainer;                         // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   TapSlot;                                           // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   ToolBeltEquipmentSlot;                             // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SimpleTooltipIcon_C*               Tooltip_Artisanship;                               // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SimpleTooltipIcon_C*               Tooltip_Fishing;                                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SimpleTooltipIcon_C*               Tooltip_Herbalism;                                 // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SimpleTooltipIcon_C*               Tooltip_Hunting;                                   // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SimpleTooltipIcon_C*               Tooltip_Logging;                                   // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SimpleTooltipIcon_C*               Tooltip_Mining;                                    // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   TrapSlot;                                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   UndergarmentEquipmentSlot;                         // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   WaistEquipmentSlot_2;                              // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   WristsEquipmentSlot_2;                             // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 XPBarFrame;                                        // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterMenu_C">();
	}
	static class UWBP_CharacterMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterMenu_C>();
	}
};
static_assert(alignof(UWBP_CharacterMenu_C) == 0x000008, "Wrong alignment on UWBP_CharacterMenu_C");
static_assert(sizeof(UWBP_CharacterMenu_C) == 0x0006D8, "Wrong size on UWBP_CharacterMenu_C");
static_assert(offsetof(UWBP_CharacterMenu_C, ArtisanStatAccordion) == 0x000510, "Member 'UWBP_CharacterMenu_C::ArtisanStatAccordion' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, AxeSlot) == 0x000518, "Member 'UWBP_CharacterMenu_C::AxeSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, BackEquipmentSlot_2) == 0x000520, "Member 'UWBP_CharacterMenu_C::BackEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, BaitSlot) == 0x000528, "Member 'UWBP_CharacterMenu_C::BaitSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, BaseAttributesAccordion_1) == 0x000530, "Member 'UWBP_CharacterMenu_C::BaseAttributesAccordion_1' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, BowSlot) == 0x000538, "Member 'UWBP_CharacterMenu_C::BowSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, ChestEquipmentSlot_2) == 0x000540, "Member 'UWBP_CharacterMenu_C::ChestEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, CorruptionBar) == 0x000548, "Member 'UWBP_CharacterMenu_C::CorruptionBar' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, CorruptionTextBlock) == 0x000550, "Member 'UWBP_CharacterMenu_C::CorruptionTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, CrowBarEquipmentSlot) == 0x000558, "Member 'UWBP_CharacterMenu_C::CrowBarEquipmentSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, DrillSlot) == 0x000560, "Member 'UWBP_CharacterMenu_C::DrillSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, EaringLeftEquipmentSlot_2) == 0x000568, "Member 'UWBP_CharacterMenu_C::EaringLeftEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, EaringRightEquipmentSlot_2) == 0x000570, "Member 'UWBP_CharacterMenu_C::EaringRightEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, FeetEquipmentSlot_2) == 0x000578, "Member 'UWBP_CharacterMenu_C::FeetEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, FishingRodSlot) == 0x000580, "Member 'UWBP_CharacterMenu_C::FishingRodSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, HandsEquipmentSlot_2) == 0x000588, "Member 'UWBP_CharacterMenu_C::HandsEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, HarpoonSlot) == 0x000590, "Member 'UWBP_CharacterMenu_C::HarpoonSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, HeadEquipmentSlot_2) == 0x000598, "Member 'UWBP_CharacterMenu_C::HeadEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, HealingAccordion_1) == 0x0005A0, "Member 'UWBP_CharacterMenu_C::HealingAccordion_1' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, HideHelmetButton) == 0x0005A8, "Member 'UWBP_CharacterMenu_C::HideHelmetButton' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, LegsEquipmentSlot_2) == 0x0005B0, "Member 'UWBP_CharacterMenu_C::LegsEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, MagicalDefenseAccordion_1) == 0x0005B8, "Member 'UWBP_CharacterMenu_C::MagicalDefenseAccordion_1' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, MagicalOffenseAccordion_1) == 0x0005C0, "Member 'UWBP_CharacterMenu_C::MagicalOffenseAccordion_1' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, NecklaceEquipmentSlot_2) == 0x0005C8, "Member 'UWBP_CharacterMenu_C::NecklaceEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, NetSlot) == 0x0005D0, "Member 'UWBP_CharacterMenu_C::NetSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, PanSlot) == 0x0005D8, "Member 'UWBP_CharacterMenu_C::PanSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, PhysicalDefenseAccordion_1) == 0x0005E0, "Member 'UWBP_CharacterMenu_C::PhysicalDefenseAccordion_1' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, PhysicalOffenseAccordion_1) == 0x0005E8, "Member 'UWBP_CharacterMenu_C::PhysicalOffenseAccordion_1' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, PickaxeSlot) == 0x0005F0, "Member 'UWBP_CharacterMenu_C::PickaxeSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, PrimaryWeaponEquipmentSlot_2) == 0x0005F8, "Member 'UWBP_CharacterMenu_C::PrimaryWeaponEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, RangedOffHandWeaponEquipmentSlot_2) == 0x000600, "Member 'UWBP_CharacterMenu_C::RangedOffHandWeaponEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, RangedWeaponEquipmentSlot_2) == 0x000608, "Member 'UWBP_CharacterMenu_C::RangedWeaponEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, RegenerationAccordion_1) == 0x000610, "Member 'UWBP_CharacterMenu_C::RegenerationAccordion_1' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, RingLeftEquipmentSlot_2) == 0x000618, "Member 'UWBP_CharacterMenu_C::RingLeftEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, RingRightEquipmentSlot_2) == 0x000620, "Member 'UWBP_CharacterMenu_C::RingRightEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, SawSlot) == 0x000628, "Member 'UWBP_CharacterMenu_C::SawSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, ScytheSlot) == 0x000630, "Member 'UWBP_CharacterMenu_C::ScytheSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, SecondaryWeaponEquipmentSlot_2) == 0x000638, "Member 'UWBP_CharacterMenu_C::SecondaryWeaponEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, ShearsSlot) == 0x000640, "Member 'UWBP_CharacterMenu_C::ShearsSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, ShirtEquipmentSlot) == 0x000648, "Member 'UWBP_CharacterMenu_C::ShirtEquipmentSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, ShouldersEquipmentSlot_2) == 0x000650, "Member 'UWBP_CharacterMenu_C::ShouldersEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, SickleSlot) == 0x000658, "Member 'UWBP_CharacterMenu_C::SickleSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, SubarchetypeIcon) == 0x000660, "Member 'UWBP_CharacterMenu_C::SubarchetypeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, SubarchetypeIconContainer) == 0x000668, "Member 'UWBP_CharacterMenu_C::SubarchetypeIconContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, TapSlot) == 0x000670, "Member 'UWBP_CharacterMenu_C::TapSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, ToolBeltEquipmentSlot) == 0x000678, "Member 'UWBP_CharacterMenu_C::ToolBeltEquipmentSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, Tooltip_Artisanship) == 0x000680, "Member 'UWBP_CharacterMenu_C::Tooltip_Artisanship' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, Tooltip_Fishing) == 0x000688, "Member 'UWBP_CharacterMenu_C::Tooltip_Fishing' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, Tooltip_Herbalism) == 0x000690, "Member 'UWBP_CharacterMenu_C::Tooltip_Herbalism' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, Tooltip_Hunting) == 0x000698, "Member 'UWBP_CharacterMenu_C::Tooltip_Hunting' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, Tooltip_Logging) == 0x0006A0, "Member 'UWBP_CharacterMenu_C::Tooltip_Logging' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, Tooltip_Mining) == 0x0006A8, "Member 'UWBP_CharacterMenu_C::Tooltip_Mining' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, TrapSlot) == 0x0006B0, "Member 'UWBP_CharacterMenu_C::TrapSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, UndergarmentEquipmentSlot) == 0x0006B8, "Member 'UWBP_CharacterMenu_C::UndergarmentEquipmentSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, WaistEquipmentSlot_2) == 0x0006C0, "Member 'UWBP_CharacterMenu_C::WaistEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, WristsEquipmentSlot_2) == 0x0006C8, "Member 'UWBP_CharacterMenu_C::WristsEquipmentSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMenu_C, XPBarFrame) == 0x0006D0, "Member 'UWBP_CharacterMenu_C::XPBarFrame' has a wrong offset!");

}

