#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DamageMeterHealthLogBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DamageMeterHealthLogBar.WBP_DamageMeterHealthLogBar_C
// 0x0078 (0x0368 - 0x02F0)
class UWBP_DamageMeterHealthLogBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                BarButton;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BarImage;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BarText;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EffectiveBarImage;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HitFlagText;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageIcon;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InstigatorName;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PercentBox;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PercentText;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TimeText;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueText;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         barIndex;                                          // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isMainBars;                                        // 0x035C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DamageMeterHealthLog_C*            Log;                                               // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ExecuteUbergraph_WBP_DamageMeterHealthLogBar(int32 EntryPoint);
	void BndEvt__DesignDamageMeter_Bar_BarButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__DesignDamageMeter_Bar_BarButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__DesignDamageMeter_Bar_BarButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DamageMeterHealthLogBar_C">();
	}
	static class UWBP_DamageMeterHealthLogBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DamageMeterHealthLogBar_C>();
	}
};
static_assert(alignof(UWBP_DamageMeterHealthLogBar_C) == 0x000008, "Wrong alignment on UWBP_DamageMeterHealthLogBar_C");
static_assert(sizeof(UWBP_DamageMeterHealthLogBar_C) == 0x000368, "Wrong size on UWBP_DamageMeterHealthLogBar_C");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_DamageMeterHealthLogBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, BarButton) == 0x0002F8, "Member 'UWBP_DamageMeterHealthLogBar_C::BarButton' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, BarImage) == 0x000300, "Member 'UWBP_DamageMeterHealthLogBar_C::BarImage' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, BarText) == 0x000308, "Member 'UWBP_DamageMeterHealthLogBar_C::BarText' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, EffectiveBarImage) == 0x000310, "Member 'UWBP_DamageMeterHealthLogBar_C::EffectiveBarImage' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, HitFlagText) == 0x000318, "Member 'UWBP_DamageMeterHealthLogBar_C::HitFlagText' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, ImageIcon) == 0x000320, "Member 'UWBP_DamageMeterHealthLogBar_C::ImageIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, InstigatorName) == 0x000328, "Member 'UWBP_DamageMeterHealthLogBar_C::InstigatorName' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, PercentBox) == 0x000330, "Member 'UWBP_DamageMeterHealthLogBar_C::PercentBox' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, PercentText) == 0x000338, "Member 'UWBP_DamageMeterHealthLogBar_C::PercentText' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, SizeBox_1) == 0x000340, "Member 'UWBP_DamageMeterHealthLogBar_C::SizeBox_1' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, TimeText) == 0x000348, "Member 'UWBP_DamageMeterHealthLogBar_C::TimeText' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, ValueText) == 0x000350, "Member 'UWBP_DamageMeterHealthLogBar_C::ValueText' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, barIndex) == 0x000358, "Member 'UWBP_DamageMeterHealthLogBar_C::barIndex' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, isMainBars) == 0x00035C, "Member 'UWBP_DamageMeterHealthLogBar_C::isMainBars' has a wrong offset!");
static_assert(offsetof(UWBP_DamageMeterHealthLogBar_C, Log) == 0x000360, "Member 'UWBP_DamageMeterHealthLogBar_C::Log' has a wrong offset!");

}

