#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipFrame

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_TooltipFrame.WBP_TooltipFrame_C.ExecuteUbergraph_WBP_TooltipFrame
// 0x0050 (0x0050 - 0x0000)
struct WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                UniqueObjectNameForCooking_Margin;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_TooltipWindow_C*                   CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame) == 0x000008, "Wrong alignment on WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame");
static_assert(sizeof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame) == 0x000050, "Wrong size on WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, EntryPoint) == 0x000000, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, Temp_int_Variable) == 0x000004, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, UniqueObjectNameForCooking_Margin) == 0x000008, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::UniqueObjectNameForCooking_Margin' has a wrong offset!");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, CallFunc_GetChildAt_ReturnValue) == 0x000030, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000038, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame, CallFunc_HasAnyChildren_ReturnValue) == 0x000049, "Member 'WBP_TooltipFrame_C_ExecuteUbergraph_WBP_TooltipFrame::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");

// Function WBP_TooltipFrame.WBP_TooltipFrame_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TooltipFrame_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TooltipFrame_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TooltipFrame_C_PreConstruct");
static_assert(sizeof(WBP_TooltipFrame_C_PreConstruct) == 0x000001, "Wrong size on WBP_TooltipFrame_C_PreConstruct");
static_assert(offsetof(WBP_TooltipFrame_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TooltipFrame_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

