#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReticleWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReticleWidget.WBP_ReticleWidget_C
// 0x0018 (0x0308 - 0x02F0)
class UWBP_ReticleWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CenterReticle;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TargetReticle;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateTargetReticle();
	void UpdateReticleColor();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_WBP_ReticleWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReticleWidget_C">();
	}
	static class UWBP_ReticleWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReticleWidget_C>();
	}
};
static_assert(alignof(UWBP_ReticleWidget_C) == 0x000008, "Wrong alignment on UWBP_ReticleWidget_C");
static_assert(sizeof(UWBP_ReticleWidget_C) == 0x000308, "Wrong size on UWBP_ReticleWidget_C");
static_assert(offsetof(UWBP_ReticleWidget_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_ReticleWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ReticleWidget_C, CenterReticle) == 0x0002F8, "Member 'UWBP_ReticleWidget_C::CenterReticle' has a wrong offset!");
static_assert(offsetof(UWBP_ReticleWidget_C, TargetReticle) == 0x000300, "Member 'UWBP_ReticleWidget_C::TargetReticle' has a wrong offset!");

}

