#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LootWindow

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_LootWindow.WBP_LootWindow_C.ExecuteUbergraph_WBP_LootWindow
// 0x0030 (0x0030 - 0x0000)
struct WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GroupLootWindowEntry_C*            CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow) == 0x000008, "Wrong alignment on WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow");
static_assert(sizeof(WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow) == 0x000030, "Wrong size on WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow");
static_assert(offsetof(WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow, EntryPoint) == 0x000000, "Member 'WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow, Temp_int_Variable) == 0x000020, "Member 'WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'WBP_LootWindow_C_ExecuteUbergraph_WBP_LootWindow::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_LootWindow.WBP_LootWindow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_LootWindow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LootWindow_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_LootWindow_C_PreConstruct");
static_assert(sizeof(WBP_LootWindow_C_PreConstruct) == 0x000001, "Wrong size on WBP_LootWindow_C_PreConstruct");
static_assert(offsetof(WBP_LootWindow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_LootWindow_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

