#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FastCraftingMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_FastCraftingMenu.WBP_FastCraftingMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_FastCraftingMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FastCraftingMenu_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_FastCraftingMenu_C_PreConstruct");
static_assert(sizeof(WBP_FastCraftingMenu_C_PreConstruct) == 0x000001, "Wrong size on WBP_FastCraftingMenu_C_PreConstruct");
static_assert(offsetof(WBP_FastCraftingMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_FastCraftingMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_FastCraftingMenu.WBP_FastCraftingMenu_C.ExecuteUbergraph_WBP_FastCraftingMenu
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ArtisanshipMaterialItem_C*         CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ArtisanshipMaterialItem_C*         CallFunc_Create_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ArtisanshipMaterialItem_C*         CallFunc_Create_ReturnValue_2;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ArtisanshipMaterialItem_C*         CallFunc_Create_ReturnValue_3;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ArtisanshipMaterialItem_C*         CallFunc_Create_ReturnValue_4;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ArtisanshipMaterialItem_C*         CallFunc_Create_ReturnValue_5;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_2;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_3;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_4;      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_5;      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ArtisanshipMaterialItem_C*         CallFunc_Create_ReturnValue_6;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ArtisanshipMaterialItem_C*         CallFunc_Create_ReturnValue_7;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_6;      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_7;      // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MultiSelectButton_C*               CallFunc_Create_ReturnValue_8;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MultiSelectButton_C*               CallFunc_Create_ReturnValue_9;                     // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MultiSelectButton_C*               CallFunc_Create_ReturnValue_10;                    // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MultiSelectButton_C*               CallFunc_Create_ReturnValue_11;                    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_3;                   // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu) == 0x000008, "Wrong alignment on WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu");
static_assert(sizeof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu) == 0x0000E0, "Wrong size on WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, EntryPoint) == 0x000000, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_Create_ReturnValue_1) == 0x000010, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_Create_ReturnValue_2) == 0x000018, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_Create_ReturnValue_3) == 0x000020, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_Create_ReturnValue_4) == 0x000028, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_Create_ReturnValue_5) == 0x000030, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000040, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_AddChildToUniformGrid_ReturnValue_1) == 0x000048, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_AddChildToUniformGrid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_AddChildToUniformGrid_ReturnValue_2) == 0x000050, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_AddChildToUniformGrid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_AddChildToUniformGrid_ReturnValue_3) == 0x000058, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_AddChildToUniformGrid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_AddChildToUniformGrid_ReturnValue_4) == 0x000060, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_AddChildToUniformGrid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_AddChildToUniformGrid_ReturnValue_5) == 0x000068, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_AddChildToUniformGrid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, K2Node_Event_IsDesignTime) == 0x000070, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_Create_ReturnValue_6) == 0x000078, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_Create_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_Create_ReturnValue_7) == 0x000080, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_Create_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_AddChildToUniformGrid_ReturnValue_6) == 0x000088, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_AddChildToUniformGrid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_AddChildToUniformGrid_ReturnValue_7) == 0x000090, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_AddChildToUniformGrid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_Create_ReturnValue_8) == 0x000098, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_Create_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_Create_ReturnValue_9) == 0x0000A0, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_Create_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_Create_ReturnValue_10) == 0x0000A8, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_Create_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_Create_ReturnValue_11) == 0x0000B0, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_Create_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_AddChild_ReturnValue) == 0x0000C0, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_AddChild_ReturnValue_1) == 0x0000C8, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_AddChild_ReturnValue_2) == 0x0000D0, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_AddChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu, CallFunc_AddChild_ReturnValue_3) == 0x0000D8, "Member 'WBP_FastCraftingMenu_C_ExecuteUbergraph_WBP_FastCraftingMenu::CallFunc_AddChild_ReturnValue_3' has a wrong offset!");

}

