#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputViewer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InputViewer.WBP_InputViewer_C
// 0x01E0 (0x04D0 - 0x02F0)
class UWBP_InputViewer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Zero;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           One;                                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Two;                                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Three;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Four;                                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Five;                                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Six;                                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Seven;                                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Eight;                                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Nine;                                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           A;                                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Alt;                                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           C;                                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Ctrl;                                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           D;                                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           E;                                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           F;                                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_12;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_13;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_14;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_15;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_16;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_17;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_18;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_19;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_20;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_21;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_22;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_23;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_24;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_25;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_77;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_78;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           LMB;                                               // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           NumberPanel;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Q;                                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           R;                                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RMB;                                               // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root;                                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           S;                                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Shift;                                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Space;                                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           T;                                                 // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           V;                                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           W;                                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        CurrentKeyValue;                                   // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentKey;                                        // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_InputViewer(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InputViewer_C">();
	}
	static class UWBP_InputViewer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InputViewer_C>();
	}
};
static_assert(alignof(UWBP_InputViewer_C) == 0x000008, "Wrong alignment on UWBP_InputViewer_C");
static_assert(sizeof(UWBP_InputViewer_C) == 0x0004D0, "Wrong size on UWBP_InputViewer_C");
static_assert(offsetof(UWBP_InputViewer_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_InputViewer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Zero) == 0x0002F8, "Member 'UWBP_InputViewer_C::Zero' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, One) == 0x000300, "Member 'UWBP_InputViewer_C::One' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Two) == 0x000308, "Member 'UWBP_InputViewer_C::Two' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Three) == 0x000310, "Member 'UWBP_InputViewer_C::Three' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Four) == 0x000318, "Member 'UWBP_InputViewer_C::Four' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Five) == 0x000320, "Member 'UWBP_InputViewer_C::Five' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Six) == 0x000328, "Member 'UWBP_InputViewer_C::Six' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Seven) == 0x000330, "Member 'UWBP_InputViewer_C::Seven' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Eight) == 0x000338, "Member 'UWBP_InputViewer_C::Eight' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Nine) == 0x000340, "Member 'UWBP_InputViewer_C::Nine' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, A) == 0x000348, "Member 'UWBP_InputViewer_C::A' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Alt) == 0x000350, "Member 'UWBP_InputViewer_C::Alt' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, C) == 0x000358, "Member 'UWBP_InputViewer_C::C' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Ctrl) == 0x000360, "Member 'UWBP_InputViewer_C::Ctrl' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, D) == 0x000368, "Member 'UWBP_InputViewer_C::D' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, E) == 0x000370, "Member 'UWBP_InputViewer_C::E' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, F) == 0x000378, "Member 'UWBP_InputViewer_C::F' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image) == 0x000380, "Member 'UWBP_InputViewer_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_1) == 0x000388, "Member 'UWBP_InputViewer_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_2) == 0x000390, "Member 'UWBP_InputViewer_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_3) == 0x000398, "Member 'UWBP_InputViewer_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_4) == 0x0003A0, "Member 'UWBP_InputViewer_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_5) == 0x0003A8, "Member 'UWBP_InputViewer_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_6) == 0x0003B0, "Member 'UWBP_InputViewer_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_7) == 0x0003B8, "Member 'UWBP_InputViewer_C::Image_7' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_8) == 0x0003C0, "Member 'UWBP_InputViewer_C::Image_8' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_9) == 0x0003C8, "Member 'UWBP_InputViewer_C::Image_9' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_10) == 0x0003D0, "Member 'UWBP_InputViewer_C::Image_10' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_11) == 0x0003D8, "Member 'UWBP_InputViewer_C::Image_11' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_12) == 0x0003E0, "Member 'UWBP_InputViewer_C::Image_12' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_13) == 0x0003E8, "Member 'UWBP_InputViewer_C::Image_13' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_14) == 0x0003F0, "Member 'UWBP_InputViewer_C::Image_14' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_15) == 0x0003F8, "Member 'UWBP_InputViewer_C::Image_15' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_16) == 0x000400, "Member 'UWBP_InputViewer_C::Image_16' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_17) == 0x000408, "Member 'UWBP_InputViewer_C::Image_17' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_18) == 0x000410, "Member 'UWBP_InputViewer_C::Image_18' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_19) == 0x000418, "Member 'UWBP_InputViewer_C::Image_19' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_20) == 0x000420, "Member 'UWBP_InputViewer_C::Image_20' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_21) == 0x000428, "Member 'UWBP_InputViewer_C::Image_21' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_22) == 0x000430, "Member 'UWBP_InputViewer_C::Image_22' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_23) == 0x000438, "Member 'UWBP_InputViewer_C::Image_23' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_24) == 0x000440, "Member 'UWBP_InputViewer_C::Image_24' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_25) == 0x000448, "Member 'UWBP_InputViewer_C::Image_25' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_77) == 0x000450, "Member 'UWBP_InputViewer_C::Image_77' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Image_78) == 0x000458, "Member 'UWBP_InputViewer_C::Image_78' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, LMB) == 0x000460, "Member 'UWBP_InputViewer_C::LMB' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, NumberPanel) == 0x000468, "Member 'UWBP_InputViewer_C::NumberPanel' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Q) == 0x000470, "Member 'UWBP_InputViewer_C::Q' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, R) == 0x000478, "Member 'UWBP_InputViewer_C::R' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, RMB) == 0x000480, "Member 'UWBP_InputViewer_C::RMB' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Root) == 0x000488, "Member 'UWBP_InputViewer_C::Root' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, S) == 0x000490, "Member 'UWBP_InputViewer_C::S' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Shift) == 0x000498, "Member 'UWBP_InputViewer_C::Shift' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, Space) == 0x0004A0, "Member 'UWBP_InputViewer_C::Space' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, T) == 0x0004A8, "Member 'UWBP_InputViewer_C::T' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, V) == 0x0004B0, "Member 'UWBP_InputViewer_C::V' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, W) == 0x0004B8, "Member 'UWBP_InputViewer_C::W' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, CurrentKeyValue) == 0x0004C0, "Member 'UWBP_InputViewer_C::CurrentKeyValue' has a wrong offset!");
static_assert(offsetof(UWBP_InputViewer_C, CurrentKey) == 0x0004C8, "Member 'UWBP_InputViewer_C::CurrentKey' has a wrong offset!");

}

