#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JournalAccordion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_JournalAccordion.WBP_JournalAccordion_C
// 0x0028 (0x05D8 - 0x05B0)
class UWBP_JournalAccordion_C final : public UJournalAccordion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 UnreadNotifier;                                    // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JournalItem_C*                     WBP_JournalItem;                                   // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JournalItem_C*                     WBP_JournalItem_1;                                 // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JournalItem_C*                     WBP_JournalItem_2;                                 // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Set_Story_Arc_Type_Icon(class UTexture2D* Story_Arc_Type_Icon);
	void Set_Chapter_Text(const class FText& Chapter_Text);
	TSubclassOf<class UCommonButtonStyle> GetOddButtonStyle();
	TSubclassOf<class UCommonButtonStyle> GetEvenButtonStyle();
	class UPanelWidget* GetButtonContainer();
	class UWidget* GetBreadcrumbWidget();
	void ExecuteUbergraph_WBP_JournalAccordion(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_JournalAccordion_C">();
	}
	static class UWBP_JournalAccordion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_JournalAccordion_C>();
	}
};
static_assert(alignof(UWBP_JournalAccordion_C) == 0x000008, "Wrong alignment on UWBP_JournalAccordion_C");
static_assert(sizeof(UWBP_JournalAccordion_C) == 0x0005D8, "Wrong size on UWBP_JournalAccordion_C");
static_assert(offsetof(UWBP_JournalAccordion_C, UberGraphFrame) == 0x0005B0, "Member 'UWBP_JournalAccordion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_JournalAccordion_C, UnreadNotifier) == 0x0005B8, "Member 'UWBP_JournalAccordion_C::UnreadNotifier' has a wrong offset!");
static_assert(offsetof(UWBP_JournalAccordion_C, WBP_JournalItem) == 0x0005C0, "Member 'UWBP_JournalAccordion_C::WBP_JournalItem' has a wrong offset!");
static_assert(offsetof(UWBP_JournalAccordion_C, WBP_JournalItem_1) == 0x0005C8, "Member 'UWBP_JournalAccordion_C::WBP_JournalItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_JournalAccordion_C, WBP_JournalItem_2) == 0x0005D0, "Member 'UWBP_JournalAccordion_C::WBP_JournalItem_2' has a wrong offset!");

}

