#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MaintenanceResourceAccordion

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MaintenanceResourceAccordion.WBP_MaintenanceResourceAccordion_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MaintenanceResourceAccordion_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MaintenanceResourceAccordion_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_MaintenanceResourceAccordion_C_PreConstruct");
static_assert(sizeof(WBP_MaintenanceResourceAccordion_C_PreConstruct) == 0x000001, "Wrong size on WBP_MaintenanceResourceAccordion_C_PreConstruct");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_MaintenanceResourceAccordion_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_MaintenanceResourceAccordion.WBP_MaintenanceResourceAccordion_C.GetOddButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_MaintenanceResourceAccordion_C_GetOddButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MaintenanceResourceAccordion_C_GetOddButtonStyle) == 0x000008, "Wrong alignment on WBP_MaintenanceResourceAccordion_C_GetOddButtonStyle");
static_assert(sizeof(WBP_MaintenanceResourceAccordion_C_GetOddButtonStyle) == 0x000008, "Wrong size on WBP_MaintenanceResourceAccordion_C_GetOddButtonStyle");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_GetOddButtonStyle, ReturnValue) == 0x000000, "Member 'WBP_MaintenanceResourceAccordion_C_GetOddButtonStyle::ReturnValue' has a wrong offset!");

// Function WBP_MaintenanceResourceAccordion.WBP_MaintenanceResourceAccordion_C.GetEvenButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_MaintenanceResourceAccordion_C_GetEvenButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MaintenanceResourceAccordion_C_GetEvenButtonStyle) == 0x000008, "Wrong alignment on WBP_MaintenanceResourceAccordion_C_GetEvenButtonStyle");
static_assert(sizeof(WBP_MaintenanceResourceAccordion_C_GetEvenButtonStyle) == 0x000008, "Wrong size on WBP_MaintenanceResourceAccordion_C_GetEvenButtonStyle");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_GetEvenButtonStyle, ReturnValue) == 0x000000, "Member 'WBP_MaintenanceResourceAccordion_C_GetEvenButtonStyle::ReturnValue' has a wrong offset!");

// Function WBP_MaintenanceResourceAccordion.WBP_MaintenanceResourceAccordion_C.GetButtonContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_MaintenanceResourceAccordion_C_GetButtonContainer final
{
public:
	class UPanelWidget*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MaintenanceResourceAccordion_C_GetButtonContainer) == 0x000008, "Wrong alignment on WBP_MaintenanceResourceAccordion_C_GetButtonContainer");
static_assert(sizeof(WBP_MaintenanceResourceAccordion_C_GetButtonContainer) == 0x000008, "Wrong size on WBP_MaintenanceResourceAccordion_C_GetButtonContainer");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_GetButtonContainer, ReturnValue) == 0x000000, "Member 'WBP_MaintenanceResourceAccordion_C_GetButtonContainer::ReturnValue' has a wrong offset!");

// Function WBP_MaintenanceResourceAccordion.WBP_MaintenanceResourceAccordion_C.GetBreadcrumbWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_MaintenanceResourceAccordion_C_GetBreadcrumbWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MaintenanceResourceAccordion_C_GetBreadcrumbWidget) == 0x000008, "Wrong alignment on WBP_MaintenanceResourceAccordion_C_GetBreadcrumbWidget");
static_assert(sizeof(WBP_MaintenanceResourceAccordion_C_GetBreadcrumbWidget) == 0x000008, "Wrong size on WBP_MaintenanceResourceAccordion_C_GetBreadcrumbWidget");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_GetBreadcrumbWidget, ReturnValue) == 0x000000, "Member 'WBP_MaintenanceResourceAccordion_C_GetBreadcrumbWidget::ReturnValue' has a wrong offset!");

// Function WBP_MaintenanceResourceAccordion.WBP_MaintenanceResourceAccordion_C.ExecuteUbergraph_WBP_MaintenanceResourceAccordion
// 0x0030 (0x0030 - 0x0000)
struct WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetItems_ReturnValue;                     // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_MaintenanceResourceItem_C*         CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion) == 0x000008, "Wrong alignment on WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion");
static_assert(sizeof(WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion) == 0x000030, "Wrong size on WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion, EntryPoint) == 0x000000, "Member 'WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion, CallFunc_GetItems_ReturnValue) == 0x000008, "Member 'WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion::CallFunc_GetItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion, CallFunc_Array_IsEmpty_ReturnValue) == 0x000018, "Member 'WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion, K2Node_Event_IsDesignTime) == 0x000019, "Member 'WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion, Temp_int_Variable) == 0x00001C, "Member 'WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_MaintenanceResourceAccordion_C_ExecuteUbergraph_WBP_MaintenanceResourceAccordion::CallFunc_Create_ReturnValue' has a wrong offset!");

}

