#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DamageMeterHealthLog

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "ST_DamageMeterHitInfo_structs.hpp"
#include "ST_DamageMeterData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_DamageMeterTimeData_structs.hpp"


namespace SDK::Params
{

// Function WBP_DamageMeterHealthLog.WBP_DamageMeterHealthLog_C.BndEvt__DamageMeterHealthLog_InstigatorsCB_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_DamageMeterHealthLog_C_BndEvt__DamageMeterHealthLog_InstigatorsCB_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeterHealthLog_C_BndEvt__DamageMeterHealthLog_InstigatorsCB_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DamageMeterHealthLog_C_BndEvt__DamageMeterHealthLog_InstigatorsCB_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_DamageMeterHealthLog_C_BndEvt__DamageMeterHealthLog_InstigatorsCB_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_DamageMeterHealthLog_C_BndEvt__DamageMeterHealthLog_InstigatorsCB_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_BndEvt__DamageMeterHealthLog_InstigatorsCB_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_DamageMeterHealthLog_C_BndEvt__DamageMeterHealthLog_InstigatorsCB_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_BndEvt__DamageMeterHealthLog_InstigatorsCB_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_DamageMeterHealthLog_C_BndEvt__DamageMeterHealthLog_InstigatorsCB_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_DamageMeterHealthLog.WBP_DamageMeterHealthLog_C.ExecuteUbergraph_WBP_DamageMeterHealthLog
// 0x0058 (0x0058 - 0x0000)
struct WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x001C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog) == 0x000008, "Wrong alignment on WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog");
static_assert(sizeof(WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog) == 0x000058, "Wrong size on WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog, EntryPoint) == 0x000000, "Member 'WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog, K2Node_ComponentBoundEvent_SelectedItem) == 0x000008, "Member 'WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog, K2Node_ComponentBoundEvent_SelectionType) == 0x000018, "Member 'WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog, K2Node_Event_MyGeometry) == 0x00001C, "Member 'WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog, K2Node_Event_InDeltaTime) == 0x000054, "Member 'WBP_DamageMeterHealthLog_C_ExecuteUbergraph_WBP_DamageMeterHealthLog::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WBP_DamageMeterHealthLog.WBP_DamageMeterHealthLog_C.GetBarAtIndex
// 0x0050 (0x0050 - 0x0000)
struct WBP_DamageMeterHealthLog_C_GetBarAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_DamageMeterHealthLogBar_C*> Bars_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UVerticalBox*                           Layout;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_DamageMeterHealthLogBar_C*         bar;                                               // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_DamageMeterHealthLogBar_C*         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DamageMeterHealthLogBar_C*         CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeterHealthLog_C_GetBarAtIndex) == 0x000008, "Wrong alignment on WBP_DamageMeterHealthLog_C_GetBarAtIndex");
static_assert(sizeof(WBP_DamageMeterHealthLog_C_GetBarAtIndex) == 0x000050, "Wrong size on WBP_DamageMeterHealthLog_C_GetBarAtIndex");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_GetBarAtIndex, Index_0) == 0x000000, "Member 'WBP_DamageMeterHealthLog_C_GetBarAtIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_GetBarAtIndex, Bars_0) == 0x000008, "Member 'WBP_DamageMeterHealthLog_C_GetBarAtIndex::Bars_0' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_GetBarAtIndex, Layout) == 0x000018, "Member 'WBP_DamageMeterHealthLog_C_GetBarAtIndex::Layout' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_GetBarAtIndex, bar) == 0x000020, "Member 'WBP_DamageMeterHealthLog_C_GetBarAtIndex::bar' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_GetBarAtIndex, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_DamageMeterHealthLog_C_GetBarAtIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_GetBarAtIndex, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_DamageMeterHealthLog_C_GetBarAtIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_GetBarAtIndex, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000034, "Member 'WBP_DamageMeterHealthLog_C_GetBarAtIndex::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_GetBarAtIndex, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_DamageMeterHealthLog_C_GetBarAtIndex::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_GetBarAtIndex, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'WBP_DamageMeterHealthLog_C_GetBarAtIndex::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_GetBarAtIndex, CallFunc_AddChild_ReturnValue) == 0x000048, "Member 'WBP_DamageMeterHealthLog_C_GetBarAtIndex::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_DamageMeterHealthLog.WBP_DamageMeterHealthLog_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct WBP_DamageMeterHealthLog_C_Initialize final
{
public:
	class UWBP_DamageMeter_C*                     DamageMeter_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeterHealthLog_C_Initialize) == 0x000008, "Wrong alignment on WBP_DamageMeterHealthLog_C_Initialize");
static_assert(sizeof(WBP_DamageMeterHealthLog_C_Initialize) == 0x000008, "Wrong size on WBP_DamageMeterHealthLog_C_Initialize");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_Initialize, DamageMeter_0) == 0x000000, "Member 'WBP_DamageMeterHealthLog_C_Initialize::DamageMeter_0' has a wrong offset!");

// Function WBP_DamageMeterHealthLog.WBP_DamageMeterHealthLog_C.RebaseBars
// 0x0080 (0x0080 - 0x0000)
struct WBP_DamageMeterHealthLog_C_RebaseBars final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_MakeLiteralInt64_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameStatFromGuid_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeterHealthLog_C_RebaseBars) == 0x000008, "Wrong alignment on WBP_DamageMeterHealthLog_C_RebaseBars");
static_assert(sizeof(WBP_DamageMeterHealthLog_C_RebaseBars) == 0x000080, "Wrong size on WBP_DamageMeterHealthLog_C_RebaseBars");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_GetTimeSeconds_ReturnValue) == 0x000008, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_MakeLiteralInt64_ReturnValue) == 0x000018, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_MakeLiteralInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_GetSelectedIndex_ReturnValue) == 0x000024, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000028, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_GetGameStatFromGuid_ReturnValue) == 0x000030, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_GetGameStatFromGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000044, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000048, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Abs_ReturnValue) == 0x000058, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000060, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_BooleanAND_ReturnValue) == 0x000071, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_RebaseBars, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'WBP_DamageMeterHealthLog_C_RebaseBars::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_DamageMeterHealthLog.WBP_DamageMeterHealthLog_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_DamageMeterHealthLog_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeterHealthLog_C_Tick) == 0x000004, "Wrong alignment on WBP_DamageMeterHealthLog_C_Tick");
static_assert(sizeof(WBP_DamageMeterHealthLog_C_Tick) == 0x00003C, "Wrong size on WBP_DamageMeterHealthLog_C_Tick");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_DamageMeterHealthLog_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_DamageMeterHealthLog_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_DamageMeterHealthLog.WBP_DamageMeterHealthLog_C.TrimBars
// 0x0014 (0x0014 - 0x0000)
struct WBP_DamageMeterHealthLog_C_TrimBars final
{
public:
	int32                                         needed;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeterHealthLog_C_TrimBars) == 0x000004, "Wrong alignment on WBP_DamageMeterHealthLog_C_TrimBars");
static_assert(sizeof(WBP_DamageMeterHealthLog_C_TrimBars) == 0x000014, "Wrong size on WBP_DamageMeterHealthLog_C_TrimBars");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_TrimBars, needed) == 0x000000, "Member 'WBP_DamageMeterHealthLog_C_TrimBars::needed' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_TrimBars, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_DamageMeterHealthLog_C_TrimBars::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_TrimBars, CallFunc_Array_Length_ReturnValue_1) == 0x000008, "Member 'WBP_DamageMeterHealthLog_C_TrimBars::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_TrimBars, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_DamageMeterHealthLog_C_TrimBars::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_TrimBars, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WBP_DamageMeterHealthLog_C_TrimBars::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_TrimBars, CallFunc_RemoveChildAt_ReturnValue) == 0x000011, "Member 'WBP_DamageMeterHealthLog_C_TrimBars::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");

// Function WBP_DamageMeterHealthLog.WBP_DamageMeterHealthLog_C.UpdateBars
// 0x03A0 (0x03A0 - 0x0000)
struct WBP_DamageMeterHealthLog_C_UpdateBars final
{
public:
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            UniqueObjectNameForCooking_SlateColor;             // 0x006C(0x0014)()
	struct FSlateColor                            UniqueObjectNameForCooking_SlateColor_1;           // 0x0080(0x0014)()
	bool                                          Temp_bool_Variable_3;                              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_DamageMeterHealthLogBar_C*         CallFunc_GetBarAtIndex_bar;                        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_DamageMeterTimeData                CallFunc_Array_Get_Item;                           // 0x00C0(0x0040)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue_1;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_And_IntInt_ReturnValue_2;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_2;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_DamageMeterHitInfo                 CallFunc_Map_Find_Value;                           // 0x0130(0x0038)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0180(0x0018)()
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0208(0x0018)()
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x0290(0x0018)()
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    UniqueObjectNameForCooking_FormatArgumentData;     // 0x02B0(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_3;          // 0x0300(0x0018)()
	TArray<struct FFormatArgumentData>            UniqueObjectNameForCooking_Array;                  // 0x0318(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0328(0x0018)()
	int32                                         CallFunc_Map_Find_Value_1;                         // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0348(0x0018)()
	struct FSlateColor                            K2Node_Select_Default_3;                           // 0x0360(0x0014)()
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast;                 // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast;                 // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast;                 // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DamageMeterHealthLog_C_UpdateBars) == 0x000008, "Wrong alignment on WBP_DamageMeterHealthLog_C_UpdateBars");
static_assert(sizeof(WBP_DamageMeterHealthLog_C_UpdateBars) == 0x0003A0, "Wrong size on WBP_DamageMeterHealthLog_C_UpdateBars");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_MakeVector2D_ReturnValue) == 0x000000, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_MakeVector2D_ReturnValue_1) == 0x000020, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, Temp_struct_Variable) == 0x000030, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, Temp_struct_Variable_1) == 0x000040, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_GetTimeSeconds_ReturnValue) == 0x000050, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, Temp_bool_Variable) == 0x000058, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, Temp_bool_Variable_1) == 0x000059, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, Temp_bool_Variable_2) == 0x00005A, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000060, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_IsChecked_ReturnValue) == 0x000068, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, UniqueObjectNameForCooking_SlateColor) == 0x00006C, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::UniqueObjectNameForCooking_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, UniqueObjectNameForCooking_SlateColor_1) == 0x000080, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::UniqueObjectNameForCooking_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, Temp_bool_Variable_3) == 0x000094, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_MakeLiteralByte_ReturnValue) == 0x000095, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000096, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000098, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00009C, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0000A0, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x0000A4, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_GetBarAtIndex_bar) == 0x0000A8, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_GetBarAtIndex_bar' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_GetSelectedIndex_ReturnValue) == 0x0000B0, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000B4, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Array_Length_ReturnValue_1) == 0x000100, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000104, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_And_IntInt_ReturnValue) == 0x00010C, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Conv_IntToBool_ReturnValue) == 0x000110, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000114, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_And_IntInt_ReturnValue_1) == 0x000118, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_And_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x00011C, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x000120, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_And_IntInt_ReturnValue_2) == 0x000124, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_And_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Conv_IntToBool_ReturnValue_2) == 0x000128, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Conv_IntToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_BooleanAND_ReturnValue) == 0x000129, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Map_Find_Value) == 0x000130, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Map_Find_ReturnValue) == 0x000168, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000170, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Abs_ReturnValue) == 0x000178, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000180, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000198, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001A0, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Abs_ReturnValue_1) == 0x0001A8, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001B0, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, K2Node_Select_Default) == 0x0001B8, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, K2Node_Select_Default_1) == 0x0001C0, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001C8, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0001D0, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_FMin_ReturnValue) == 0x0001D8, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_FMin_ReturnValue_1) == 0x0001E0, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_MakeVector2D_ReturnValue_2) == 0x0001E8, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_MakeVector2D_ReturnValue_3) == 0x0001F8, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000208, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, K2Node_Select_Default_2) == 0x000220, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_BreakColor_R) == 0x000230, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_BreakColor_G) == 0x000234, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_BreakColor_B) == 0x000238, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_BreakColor_A) == 0x00023C, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000240, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000248, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000250, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000258, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_FMax_ReturnValue) == 0x000260, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DamageMeterHealthLog_C_UpdateBars, CallFunc_MakeColor_ReturnValue) == 0x000268, "Member 'WBP_DamageMeterHealthLog_C_UpdateBars::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
