#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadingScreen.WBP_LoadingScreen_C
// 0x0030 (0x0390 - 0x0360)
class UWBP_LoadingScreen_C final : public ULoadingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeFromBlack;                                     // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Black;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BlackFade;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Logo;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_LoadingScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadingScreen_C">();
	}
	static class UWBP_LoadingScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadingScreen_C>();
	}
};
static_assert(alignof(UWBP_LoadingScreen_C) == 0x000008, "Wrong alignment on UWBP_LoadingScreen_C");
static_assert(sizeof(UWBP_LoadingScreen_C) == 0x000390, "Wrong size on UWBP_LoadingScreen_C");
static_assert(offsetof(UWBP_LoadingScreen_C, UberGraphFrame) == 0x000360, "Member 'UWBP_LoadingScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingScreen_C, FadeFromBlack) == 0x000368, "Member 'UWBP_LoadingScreen_C::FadeFromBlack' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingScreen_C, CircularThrobber) == 0x000370, "Member 'UWBP_LoadingScreen_C::CircularThrobber' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingScreen_C, Image_Black) == 0x000378, "Member 'UWBP_LoadingScreen_C::Image_Black' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingScreen_C, Image_BlackFade) == 0x000380, "Member 'UWBP_LoadingScreen_C::Image_BlackFade' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingScreen_C, Image_Logo) == 0x000388, "Member 'UWBP_LoadingScreen_C::Image_Logo' has a wrong offset!");

}

