#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ResurrectAlertPrompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ResurrectAlertPrompt.WBP_ResurrectAlertPrompt_C
// 0x0018 (0x0350 - 0x0338)
class UWBP_ResurrectAlertPrompt_C final : public UResurrectAlert
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ConfirmationButtonBar_C*           WBP_ConfirmationButtonBar;                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             ResurrectSound;                                    // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void PlayResurrectSoundBP();
	void ExecuteUbergraph_WBP_ResurrectAlertPrompt(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ResurrectAlertPrompt_C">();
	}
	static class UWBP_ResurrectAlertPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ResurrectAlertPrompt_C>();
	}
};
static_assert(alignof(UWBP_ResurrectAlertPrompt_C) == 0x000008, "Wrong alignment on UWBP_ResurrectAlertPrompt_C");
static_assert(sizeof(UWBP_ResurrectAlertPrompt_C) == 0x000350, "Wrong size on UWBP_ResurrectAlertPrompt_C");
static_assert(offsetof(UWBP_ResurrectAlertPrompt_C, UberGraphFrame) == 0x000338, "Member 'UWBP_ResurrectAlertPrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ResurrectAlertPrompt_C, WBP_ConfirmationButtonBar) == 0x000340, "Member 'UWBP_ResurrectAlertPrompt_C::WBP_ConfirmationButtonBar' has a wrong offset!");
static_assert(offsetof(UWBP_ResurrectAlertPrompt_C, ResurrectSound) == 0x000348, "Member 'UWBP_ResurrectAlertPrompt_C::ResurrectSound' has a wrong offset!");

}

