#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChatTab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ChatTab.WBP_ChatTab_C.OnDragDetected
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_ChatTab_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDragDropOperation*                     CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_DragDropChatTab_C*                 CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatTab_C_OnDragDetected) == 0x000008, "Wrong alignment on WBP_ChatTab_C_OnDragDetected");
static_assert(sizeof(WBP_ChatTab_C_OnDragDetected) == 0x0000D0, "Wrong size on WBP_ChatTab_C_OnDragDetected");
static_assert(offsetof(WBP_ChatTab_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'WBP_ChatTab_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'WBP_ChatTab_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnDragDetected, Operation) == 0x0000B0, "Member 'WBP_ChatTab_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000B8, "Member 'WBP_ChatTab_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnDragDetected, CallFunc_GetPlayerController_ReturnValue) == 0x0000C0, "Member 'WBP_ChatTab_C_OnDragDetected::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnDragDetected, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'WBP_ChatTab_C_OnDragDetected::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_ChatTab.WBP_ChatTab_C.OnDrop
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_ChatTab_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatTab*                               K2Node_DynamicCast_AsChat_Tab;                     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatTab_C_OnDrop) == 0x000008, "Wrong alignment on WBP_ChatTab_C_OnDrop");
static_assert(sizeof(WBP_ChatTab_C_OnDrop) == 0x0000D0, "Wrong size on WBP_ChatTab_C_OnDrop");
static_assert(offsetof(WBP_ChatTab_C_OnDrop, MyGeometry) == 0x000000, "Member 'WBP_ChatTab_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnDrop, PointerEvent) == 0x000038, "Member 'WBP_ChatTab_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnDrop, Operation) == 0x0000B0, "Member 'WBP_ChatTab_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnDrop, ReturnValue) == 0x0000B8, "Member 'WBP_ChatTab_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnDrop, K2Node_DynamicCast_AsChat_Tab) == 0x0000C0, "Member 'WBP_ChatTab_C_OnDrop::K2Node_DynamicCast_AsChat_Tab' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'WBP_ChatTab_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ChatTab.WBP_ChatTab_C.OnMouseButtonDown
// 0x0220 (0x0220 - 0x0000)
struct WBP_ChatTab_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0168(0x00B8)()
};
static_assert(alignof(WBP_ChatTab_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_ChatTab_C_OnMouseButtonDown");
static_assert(sizeof(WBP_ChatTab_C_OnMouseButtonDown) == 0x000220, "Wrong size on WBP_ChatTab_C_OnMouseButtonDown");
static_assert(offsetof(WBP_ChatTab_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_ChatTab_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_ChatTab_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_ChatTab_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatTab_C_OnMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000168, "Member 'WBP_ChatTab_C_OnMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");

}

