#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipSetEffectsBlock

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TooltipSetEffectsBlock.WBP_TooltipSetEffectsBlock_C
// 0x0038 (0x0350 - 0x0318)
class UWBP_TooltipSetEffectsBlock_C final : public UTooltipSetEffectsBlock
{
public:
	class UCommonBorder*                          SectionBG;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TooltipCoreStatEntry_C*            WBP_TooltipCoreStatEntry_56;                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TooltipCoreStatEntry_C*            WBP_TooltipCoreStatEntry_144;                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TooltipCoreStatEntry_C*            WBP_TooltipCoreStatEntry_187;                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TooltipCoreStatEntry_C*            WBP_TooltipCoreStatEntry_261;                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TooltipEffectEntry_C*              WBP_TooltipEffectEntry;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TooltipEffectEntry_C*              WBP_TooltipEffectEntry_61;                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TooltipSetEffectsBlock_C">();
	}
	static class UWBP_TooltipSetEffectsBlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TooltipSetEffectsBlock_C>();
	}
};
static_assert(alignof(UWBP_TooltipSetEffectsBlock_C) == 0x000008, "Wrong alignment on UWBP_TooltipSetEffectsBlock_C");
static_assert(sizeof(UWBP_TooltipSetEffectsBlock_C) == 0x000350, "Wrong size on UWBP_TooltipSetEffectsBlock_C");
static_assert(offsetof(UWBP_TooltipSetEffectsBlock_C, SectionBG) == 0x000318, "Member 'UWBP_TooltipSetEffectsBlock_C::SectionBG' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipSetEffectsBlock_C, WBP_TooltipCoreStatEntry_56) == 0x000320, "Member 'UWBP_TooltipSetEffectsBlock_C::WBP_TooltipCoreStatEntry_56' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipSetEffectsBlock_C, WBP_TooltipCoreStatEntry_144) == 0x000328, "Member 'UWBP_TooltipSetEffectsBlock_C::WBP_TooltipCoreStatEntry_144' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipSetEffectsBlock_C, WBP_TooltipCoreStatEntry_187) == 0x000330, "Member 'UWBP_TooltipSetEffectsBlock_C::WBP_TooltipCoreStatEntry_187' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipSetEffectsBlock_C, WBP_TooltipCoreStatEntry_261) == 0x000338, "Member 'UWBP_TooltipSetEffectsBlock_C::WBP_TooltipCoreStatEntry_261' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipSetEffectsBlock_C, WBP_TooltipEffectEntry) == 0x000340, "Member 'UWBP_TooltipSetEffectsBlock_C::WBP_TooltipEffectEntry' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipSetEffectsBlock_C, WBP_TooltipEffectEntry_61) == 0x000348, "Member 'UWBP_TooltipSetEffectsBlock_C::WBP_TooltipEffectEntry_61' has a wrong offset!");

}

