#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SkillTooltip.WBP_SkillTooltip_C
// 0x0068 (0x0C90 - 0x0C28)
class UWBP_SkillTooltip_C final : public USkillTooltip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               AbilityPropertiesBox;                              // 0x0C30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIntrepidCommonBorder*                  DescriptionBorder;                                 // 0x0C38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_CostLabel;                                      // 0x0C40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_LevelLabel;                                     // 0x0C48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ToolTipBG;                                         // 0x0C50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TooltipBorder;                                     // 0x0C58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TooltipHeaderAccent;                               // 0x0C60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TooltipHeaderBG;                                   // 0x0C68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RichTextTooltip_C*                 WBP_RichTextTooltip;                               // 0x0C70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RichTextTooltip_C*                 WBP_RichTextTooltip_1;                             // 0x0C78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RichTextTooltip_C*                 WBP_RichTextTooltip_2;                             // 0x0C80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RichTextTooltip_C*                 WBP_RichTextTooltip_3;                             // 0x0C88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SkillTooltip(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SkillTooltip_C">();
	}
	static class UWBP_SkillTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SkillTooltip_C>();
	}
};
static_assert(alignof(UWBP_SkillTooltip_C) == 0x000008, "Wrong alignment on UWBP_SkillTooltip_C");
static_assert(sizeof(UWBP_SkillTooltip_C) == 0x000C90, "Wrong size on UWBP_SkillTooltip_C");
static_assert(offsetof(UWBP_SkillTooltip_C, UberGraphFrame) == 0x000C28, "Member 'UWBP_SkillTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTooltip_C, AbilityPropertiesBox) == 0x000C30, "Member 'UWBP_SkillTooltip_C::AbilityPropertiesBox' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTooltip_C, DescriptionBorder) == 0x000C38, "Member 'UWBP_SkillTooltip_C::DescriptionBorder' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTooltip_C, TB_CostLabel) == 0x000C40, "Member 'UWBP_SkillTooltip_C::TB_CostLabel' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTooltip_C, TB_LevelLabel) == 0x000C48, "Member 'UWBP_SkillTooltip_C::TB_LevelLabel' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTooltip_C, ToolTipBG) == 0x000C50, "Member 'UWBP_SkillTooltip_C::ToolTipBG' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTooltip_C, TooltipBorder) == 0x000C58, "Member 'UWBP_SkillTooltip_C::TooltipBorder' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTooltip_C, TooltipHeaderAccent) == 0x000C60, "Member 'UWBP_SkillTooltip_C::TooltipHeaderAccent' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTooltip_C, TooltipHeaderBG) == 0x000C68, "Member 'UWBP_SkillTooltip_C::TooltipHeaderBG' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTooltip_C, WBP_RichTextTooltip) == 0x000C70, "Member 'UWBP_SkillTooltip_C::WBP_RichTextTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTooltip_C, WBP_RichTextTooltip_1) == 0x000C78, "Member 'UWBP_SkillTooltip_C::WBP_RichTextTooltip_1' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTooltip_C, WBP_RichTextTooltip_2) == 0x000C80, "Member 'UWBP_SkillTooltip_C::WBP_RichTextTooltip_2' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTooltip_C, WBP_RichTextTooltip_3) == 0x000C88, "Member 'UWBP_SkillTooltip_C::WBP_RichTextTooltip_3' has a wrong offset!");

}

