#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TreasuryMenu

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TreasuryMenu.WBP_TreasuryMenu_C
// 0x0040 (0x08B0 - 0x0870)
class UWBP_TreasuryMenu_C final : public UTreasuryMenu
{
public:
	class UWBP_TextTooltipIcon_C*                 CitizenshipDuesHint;                               // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    DuesStatusLabel;                                   // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    DuesStatusLabel_1;                                 // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PropertyTaxCitizenValueTextBlock;                  // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PropertyTaxNonCitizenValueTextBlock;               // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SalesTaxCitizenValueTextBlock;                     // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SalesTaxNonCitizenValueTextBlock;                  // 0x08A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Main;                                          // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TreasuryMenu_C">();
	}
	static class UWBP_TreasuryMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TreasuryMenu_C>();
	}
};
static_assert(alignof(UWBP_TreasuryMenu_C) == 0x000008, "Wrong alignment on UWBP_TreasuryMenu_C");
static_assert(sizeof(UWBP_TreasuryMenu_C) == 0x0008B0, "Wrong size on UWBP_TreasuryMenu_C");
static_assert(offsetof(UWBP_TreasuryMenu_C, CitizenshipDuesHint) == 0x000870, "Member 'UWBP_TreasuryMenu_C::CitizenshipDuesHint' has a wrong offset!");
static_assert(offsetof(UWBP_TreasuryMenu_C, DuesStatusLabel) == 0x000878, "Member 'UWBP_TreasuryMenu_C::DuesStatusLabel' has a wrong offset!");
static_assert(offsetof(UWBP_TreasuryMenu_C, DuesStatusLabel_1) == 0x000880, "Member 'UWBP_TreasuryMenu_C::DuesStatusLabel_1' has a wrong offset!");
static_assert(offsetof(UWBP_TreasuryMenu_C, PropertyTaxCitizenValueTextBlock) == 0x000888, "Member 'UWBP_TreasuryMenu_C::PropertyTaxCitizenValueTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_TreasuryMenu_C, PropertyTaxNonCitizenValueTextBlock) == 0x000890, "Member 'UWBP_TreasuryMenu_C::PropertyTaxNonCitizenValueTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_TreasuryMenu_C, SalesTaxCitizenValueTextBlock) == 0x000898, "Member 'UWBP_TreasuryMenu_C::SalesTaxCitizenValueTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_TreasuryMenu_C, SalesTaxNonCitizenValueTextBlock) == 0x0008A0, "Member 'UWBP_TreasuryMenu_C::SalesTaxNonCitizenValueTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_TreasuryMenu_C, SzB_Main) == 0x0008A8, "Member 'UWBP_TreasuryMenu_C::SzB_Main' has a wrong offset!");

}

