#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProfessionProgressionMenu

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ProfessionProgressionMenu.WBP_ProfessionProgressionMenu_C
// 0x0088 (0x04C8 - 0x0440)
class UWBP_ProfessionProgressionMenu_C final : public UProfessionProgressionMenu
{
public:
	class UWBP_EquipmentSlot_C*                   AxeSlot;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   BaitSlot;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   BowSlot;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   DrillSlot;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   FishingRodSlot;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   HarpoonSlot;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   NetSlot;                                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   PanSlot;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ContextualModal_C*                 PendingChangesModal;                               // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   PickaxeSlot;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   SawSlot;                                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScW_Accordions;                                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   ScytheSlot;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   ShearsSlot;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   SickleSlot;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   TapSlot;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipmentSlot_C*                   TrapSlot;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	TSubclassOf<class UCommonButtonStyle> GetOddButtonStyle();
	TSubclassOf<class UCommonButtonStyle> GetEvenButtonStyle();
	class UPanelWidget* GetButtonContainer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ProfessionProgressionMenu_C">();
	}
	static class UWBP_ProfessionProgressionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ProfessionProgressionMenu_C>();
	}
};
static_assert(alignof(UWBP_ProfessionProgressionMenu_C) == 0x000008, "Wrong alignment on UWBP_ProfessionProgressionMenu_C");
static_assert(sizeof(UWBP_ProfessionProgressionMenu_C) == 0x0004C8, "Wrong size on UWBP_ProfessionProgressionMenu_C");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, AxeSlot) == 0x000440, "Member 'UWBP_ProfessionProgressionMenu_C::AxeSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, BaitSlot) == 0x000448, "Member 'UWBP_ProfessionProgressionMenu_C::BaitSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, BowSlot) == 0x000450, "Member 'UWBP_ProfessionProgressionMenu_C::BowSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, DrillSlot) == 0x000458, "Member 'UWBP_ProfessionProgressionMenu_C::DrillSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, FishingRodSlot) == 0x000460, "Member 'UWBP_ProfessionProgressionMenu_C::FishingRodSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, HarpoonSlot) == 0x000468, "Member 'UWBP_ProfessionProgressionMenu_C::HarpoonSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, NetSlot) == 0x000470, "Member 'UWBP_ProfessionProgressionMenu_C::NetSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, PanSlot) == 0x000478, "Member 'UWBP_ProfessionProgressionMenu_C::PanSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, PendingChangesModal) == 0x000480, "Member 'UWBP_ProfessionProgressionMenu_C::PendingChangesModal' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, PickaxeSlot) == 0x000488, "Member 'UWBP_ProfessionProgressionMenu_C::PickaxeSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, SawSlot) == 0x000490, "Member 'UWBP_ProfessionProgressionMenu_C::SawSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, ScW_Accordions) == 0x000498, "Member 'UWBP_ProfessionProgressionMenu_C::ScW_Accordions' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, ScytheSlot) == 0x0004A0, "Member 'UWBP_ProfessionProgressionMenu_C::ScytheSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, ShearsSlot) == 0x0004A8, "Member 'UWBP_ProfessionProgressionMenu_C::ShearsSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, SickleSlot) == 0x0004B0, "Member 'UWBP_ProfessionProgressionMenu_C::SickleSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, TapSlot) == 0x0004B8, "Member 'UWBP_ProfessionProgressionMenu_C::TapSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ProfessionProgressionMenu_C, TrapSlot) == 0x0004C0, "Member 'UWBP_ProfessionProgressionMenu_C::TrapSlot' has a wrong offset!");

}

