#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommissionRewards

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CommissionRewards.WBP_CommissionRewards_C
// 0x00A0 (0x03C8 - 0x0328)
class UWBP_CommissionRewards_C final : public UCommissionRewards
{
public:
	class UAoCCommonTextBlock*                    ChoiceText;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    ChoiceText_1;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    GuaranteedText;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    GuaranteedText_1;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SelectableRewardsHorizontalBox;                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SelectableRewardsHorizontalBox_1;                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SelectableRewardsOverlay;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SelectableRewardsOverlay_1;                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsSlot_C*                     WBP_SelectedRewardsSlot1;                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsSlot_C*                     WBP_SelectedRewardsSlot1_1;                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsSlot_C*                     WBP_SelectedRewardsSlot2;                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsSlot_C*                     WBP_SelectedRewardsSlot2_1;                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsSlot_C*                     WBP_SelectedRewardsSlot3;                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsSlot_C*                     WBP_SelectedRewardsSlot3_1;                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsSlot_C*                     WBP_SelectedRewardsSlot4;                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsSlot_C*                     WBP_SelectedRewardsSlot4_1;                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsSlot_C*                     WBP_SelectedRewardsSlot5;                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsSlot_C*                     WBP_SelectedRewardsSlot5_1;                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsSlot_C*                     WBP_SelectedRewardsSlot6;                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardsSlot_C*                     WBP_SelectedRewardsSlot6_1;                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CommissionRewards_C">();
	}
	static class UWBP_CommissionRewards_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CommissionRewards_C>();
	}
};
static_assert(alignof(UWBP_CommissionRewards_C) == 0x000008, "Wrong alignment on UWBP_CommissionRewards_C");
static_assert(sizeof(UWBP_CommissionRewards_C) == 0x0003C8, "Wrong size on UWBP_CommissionRewards_C");
static_assert(offsetof(UWBP_CommissionRewards_C, ChoiceText) == 0x000328, "Member 'UWBP_CommissionRewards_C::ChoiceText' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, ChoiceText_1) == 0x000330, "Member 'UWBP_CommissionRewards_C::ChoiceText_1' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, GuaranteedText) == 0x000338, "Member 'UWBP_CommissionRewards_C::GuaranteedText' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, GuaranteedText_1) == 0x000340, "Member 'UWBP_CommissionRewards_C::GuaranteedText_1' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, SelectableRewardsHorizontalBox) == 0x000348, "Member 'UWBP_CommissionRewards_C::SelectableRewardsHorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, SelectableRewardsHorizontalBox_1) == 0x000350, "Member 'UWBP_CommissionRewards_C::SelectableRewardsHorizontalBox_1' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, SelectableRewardsOverlay) == 0x000358, "Member 'UWBP_CommissionRewards_C::SelectableRewardsOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, SelectableRewardsOverlay_1) == 0x000360, "Member 'UWBP_CommissionRewards_C::SelectableRewardsOverlay_1' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, WBP_SelectedRewardsSlot1) == 0x000368, "Member 'UWBP_CommissionRewards_C::WBP_SelectedRewardsSlot1' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, WBP_SelectedRewardsSlot1_1) == 0x000370, "Member 'UWBP_CommissionRewards_C::WBP_SelectedRewardsSlot1_1' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, WBP_SelectedRewardsSlot2) == 0x000378, "Member 'UWBP_CommissionRewards_C::WBP_SelectedRewardsSlot2' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, WBP_SelectedRewardsSlot2_1) == 0x000380, "Member 'UWBP_CommissionRewards_C::WBP_SelectedRewardsSlot2_1' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, WBP_SelectedRewardsSlot3) == 0x000388, "Member 'UWBP_CommissionRewards_C::WBP_SelectedRewardsSlot3' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, WBP_SelectedRewardsSlot3_1) == 0x000390, "Member 'UWBP_CommissionRewards_C::WBP_SelectedRewardsSlot3_1' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, WBP_SelectedRewardsSlot4) == 0x000398, "Member 'UWBP_CommissionRewards_C::WBP_SelectedRewardsSlot4' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, WBP_SelectedRewardsSlot4_1) == 0x0003A0, "Member 'UWBP_CommissionRewards_C::WBP_SelectedRewardsSlot4_1' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, WBP_SelectedRewardsSlot5) == 0x0003A8, "Member 'UWBP_CommissionRewards_C::WBP_SelectedRewardsSlot5' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, WBP_SelectedRewardsSlot5_1) == 0x0003B0, "Member 'UWBP_CommissionRewards_C::WBP_SelectedRewardsSlot5_1' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, WBP_SelectedRewardsSlot6) == 0x0003B8, "Member 'UWBP_CommissionRewards_C::WBP_SelectedRewardsSlot6' has a wrong offset!");
static_assert(offsetof(UWBP_CommissionRewards_C, WBP_SelectedRewardsSlot6_1) == 0x0003C0, "Member 'UWBP_CommissionRewards_C::WBP_SelectedRewardsSlot6_1' has a wrong offset!");

}

