#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RecipeList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RecipeList.WBP_RecipeList_C
// 0x0028 (0x03B8 - 0x0390)
class UWBP_RecipeList_C final : public URecipeList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FText>                           CraftableCategoryDesignTimeText;                   // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           CraftableItemsDesignTimeText;                      // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_RecipeList(int32 EntryPoint);
	void Add_Craftable_Items();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RecipeList_C">();
	}
	static class UWBP_RecipeList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RecipeList_C>();
	}
};
static_assert(alignof(UWBP_RecipeList_C) == 0x000008, "Wrong alignment on UWBP_RecipeList_C");
static_assert(sizeof(UWBP_RecipeList_C) == 0x0003B8, "Wrong size on UWBP_RecipeList_C");
static_assert(offsetof(UWBP_RecipeList_C, UberGraphFrame) == 0x000390, "Member 'UWBP_RecipeList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RecipeList_C, CraftableCategoryDesignTimeText) == 0x000398, "Member 'UWBP_RecipeList_C::CraftableCategoryDesignTimeText' has a wrong offset!");
static_assert(offsetof(UWBP_RecipeList_C, CraftableItemsDesignTimeText) == 0x0003A8, "Member 'UWBP_RecipeList_C::CraftableItemsDesignTimeText' has a wrong offset!");

}

