#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MorphHighlight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MorphHighlight.WBP_MorphHighlight_C
// 0x0040 (0x0398 - 0x0358)
class UWBP_MorphHighlight_C final : public UBlendSpotWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_75;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          MouseButton;                                       // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        X;                                                 // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Y;                                                 // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseY;                                              // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseX;                                              // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BlendHighlight_Button_75_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BlendHighlight_Button_75_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BlendHighlight_Button_75_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_MorphHighlight(int32 EntryPoint);
	class FText GetToolTipText_0();
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UnHover();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MorphHighlight_C">();
	}
	static class UWBP_MorphHighlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MorphHighlight_C>();
	}
};
static_assert(alignof(UWBP_MorphHighlight_C) == 0x000008, "Wrong alignment on UWBP_MorphHighlight_C");
static_assert(sizeof(UWBP_MorphHighlight_C) == 0x000398, "Wrong size on UWBP_MorphHighlight_C");
static_assert(offsetof(UWBP_MorphHighlight_C, UberGraphFrame) == 0x000358, "Member 'UWBP_MorphHighlight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MorphHighlight_C, Fade) == 0x000360, "Member 'UWBP_MorphHighlight_C::Fade' has a wrong offset!");
static_assert(offsetof(UWBP_MorphHighlight_C, Button_75) == 0x000368, "Member 'UWBP_MorphHighlight_C::Button_75' has a wrong offset!");
static_assert(offsetof(UWBP_MorphHighlight_C, Image) == 0x000370, "Member 'UWBP_MorphHighlight_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_MorphHighlight_C, MouseButton) == 0x000378, "Member 'UWBP_MorphHighlight_C::MouseButton' has a wrong offset!");
static_assert(offsetof(UWBP_MorphHighlight_C, X) == 0x000380, "Member 'UWBP_MorphHighlight_C::X' has a wrong offset!");
static_assert(offsetof(UWBP_MorphHighlight_C, Y) == 0x000388, "Member 'UWBP_MorphHighlight_C::Y' has a wrong offset!");
static_assert(offsetof(UWBP_MorphHighlight_C, UseY) == 0x000390, "Member 'UWBP_MorphHighlight_C::UseY' has a wrong offset!");
static_assert(offsetof(UWBP_MorphHighlight_C, UseX) == 0x000391, "Member 'UWBP_MorphHighlight_C::UseX' has a wrong offset!");

}

