#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProfessionList

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ProfessionList.WBP_ProfessionList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ProfessionList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfessionList_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ProfessionList_C_PreConstruct");
static_assert(sizeof(WBP_ProfessionList_C_PreConstruct) == 0x000001, "Wrong size on WBP_ProfessionList_C_PreConstruct");
static_assert(offsetof(WBP_ProfessionList_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ProfessionList_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ProfessionList.WBP_ProfessionList_C.ExecuteUbergraph_WBP_ProfessionList
// 0x0040 (0x0040 - 0x0000)
struct WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ProfessionListButton_C*            CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList) == 0x000008, "Wrong alignment on WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList");
static_assert(sizeof(WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList) == 0x000040, "Wrong size on WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList");
static_assert(offsetof(WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList, EntryPoint) == 0x000000, "Member 'WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList, Temp_int_Variable) == 0x000030, "Member 'WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList, CallFunc_Array_IsEmpty_ReturnValue) == 0x000034, "Member 'WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000035, "Member 'WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList, K2Node_Event_IsDesignTime) == 0x00003C, "Member 'WBP_ProfessionList_C_ExecuteUbergraph_WBP_ProfessionList::K2Node_Event_IsDesignTime' has a wrong offset!");

}

