#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DestinationModal

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DestinationModal.WBP_DestinationModal_C
// 0x0020 (0x0448 - 0x0428)
class UWBP_DestinationModal_C final : public UDestinationSelectModal
{
public:
	class UAoCCommonTextBlock*                    CritSuccessSubheaderText;                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClaimIconEntry_C*                  WBP_ClaimIconEntry;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClaimIconEntry_C*                  WBP_ClaimIconEntry_1;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   WBP_ScrollWindow_NoFrameNoPadding;                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DestinationModal_C">();
	}
	static class UWBP_DestinationModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DestinationModal_C>();
	}
};
static_assert(alignof(UWBP_DestinationModal_C) == 0x000008, "Wrong alignment on UWBP_DestinationModal_C");
static_assert(sizeof(UWBP_DestinationModal_C) == 0x000448, "Wrong size on UWBP_DestinationModal_C");
static_assert(offsetof(UWBP_DestinationModal_C, CritSuccessSubheaderText) == 0x000428, "Member 'UWBP_DestinationModal_C::CritSuccessSubheaderText' has a wrong offset!");
static_assert(offsetof(UWBP_DestinationModal_C, WBP_ClaimIconEntry) == 0x000430, "Member 'UWBP_DestinationModal_C::WBP_ClaimIconEntry' has a wrong offset!");
static_assert(offsetof(UWBP_DestinationModal_C, WBP_ClaimIconEntry_1) == 0x000438, "Member 'UWBP_DestinationModal_C::WBP_ClaimIconEntry_1' has a wrong offset!");
static_assert(offsetof(UWBP_DestinationModal_C, WBP_ScrollWindow_NoFrameNoPadding) == 0x000440, "Member 'UWBP_DestinationModal_C::WBP_ScrollWindow_NoFrameNoPadding' has a wrong offset!");

}

