#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuyOrderFulfillmentSummary

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BuyOrderFulfillmentSummary.WBP_BuyOrderFulfillmentSummary_C
// 0x0050 (0x0360 - 0x0310)
class UWBP_BuyOrderFulfillmentSummary_C final : public UBuyOrderFulfillmentSummary
{
public:
	class UWBP_ItemIcon_C*                        WBP_ItemIcon;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_2;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_3;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_4;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_5;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_6;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_7;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_8;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_10;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_11;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BuyOrderFulfillmentSummary_C">();
	}
	static class UWBP_BuyOrderFulfillmentSummary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BuyOrderFulfillmentSummary_C>();
	}
};
static_assert(alignof(UWBP_BuyOrderFulfillmentSummary_C) == 0x000008, "Wrong alignment on UWBP_BuyOrderFulfillmentSummary_C");
static_assert(sizeof(UWBP_BuyOrderFulfillmentSummary_C) == 0x000360, "Wrong size on UWBP_BuyOrderFulfillmentSummary_C");
static_assert(offsetof(UWBP_BuyOrderFulfillmentSummary_C, WBP_ItemIcon) == 0x000310, "Member 'UWBP_BuyOrderFulfillmentSummary_C::WBP_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_BuyOrderFulfillmentSummary_C, WBP_ItemIcon_2) == 0x000318, "Member 'UWBP_BuyOrderFulfillmentSummary_C::WBP_ItemIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_BuyOrderFulfillmentSummary_C, WBP_ItemIcon_3) == 0x000320, "Member 'UWBP_BuyOrderFulfillmentSummary_C::WBP_ItemIcon_3' has a wrong offset!");
static_assert(offsetof(UWBP_BuyOrderFulfillmentSummary_C, WBP_ItemIcon_4) == 0x000328, "Member 'UWBP_BuyOrderFulfillmentSummary_C::WBP_ItemIcon_4' has a wrong offset!");
static_assert(offsetof(UWBP_BuyOrderFulfillmentSummary_C, WBP_ItemIcon_5) == 0x000330, "Member 'UWBP_BuyOrderFulfillmentSummary_C::WBP_ItemIcon_5' has a wrong offset!");
static_assert(offsetof(UWBP_BuyOrderFulfillmentSummary_C, WBP_ItemIcon_6) == 0x000338, "Member 'UWBP_BuyOrderFulfillmentSummary_C::WBP_ItemIcon_6' has a wrong offset!");
static_assert(offsetof(UWBP_BuyOrderFulfillmentSummary_C, WBP_ItemIcon_7) == 0x000340, "Member 'UWBP_BuyOrderFulfillmentSummary_C::WBP_ItemIcon_7' has a wrong offset!");
static_assert(offsetof(UWBP_BuyOrderFulfillmentSummary_C, WBP_ItemIcon_8) == 0x000348, "Member 'UWBP_BuyOrderFulfillmentSummary_C::WBP_ItemIcon_8' has a wrong offset!");
static_assert(offsetof(UWBP_BuyOrderFulfillmentSummary_C, WBP_ItemIcon_10) == 0x000350, "Member 'UWBP_BuyOrderFulfillmentSummary_C::WBP_ItemIcon_10' has a wrong offset!");
static_assert(offsetof(UWBP_BuyOrderFulfillmentSummary_C, WBP_ItemIcon_11) == 0x000358, "Member 'UWBP_BuyOrderFulfillmentSummary_C::WBP_ItemIcon_11' has a wrong offset!");

}

