#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BulletinBoard_ActiveStoryArcs

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BulletinBoard_ActiveStoryArcs.WBP_BulletinBoard_ActiveStoryArcs_C
// 0x0018 (0x0320 - 0x0308)
class UWBP_BulletinBoard_ActiveStoryArcs_C final : public UActiveStoryArcsWidget
{
public:
	class UWBP_JournalAccordion_C*                WBP_JournalAccordion;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JournalAccordion_C*                WBP_JournalAccordion_1;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JournalAccordion_C*                WBP_JournalAccordion_2;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BulletinBoard_ActiveStoryArcs_C">();
	}
	static class UWBP_BulletinBoard_ActiveStoryArcs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BulletinBoard_ActiveStoryArcs_C>();
	}
};
static_assert(alignof(UWBP_BulletinBoard_ActiveStoryArcs_C) == 0x000008, "Wrong alignment on UWBP_BulletinBoard_ActiveStoryArcs_C");
static_assert(sizeof(UWBP_BulletinBoard_ActiveStoryArcs_C) == 0x000320, "Wrong size on UWBP_BulletinBoard_ActiveStoryArcs_C");
static_assert(offsetof(UWBP_BulletinBoard_ActiveStoryArcs_C, WBP_JournalAccordion) == 0x000308, "Member 'UWBP_BulletinBoard_ActiveStoryArcs_C::WBP_JournalAccordion' has a wrong offset!");
static_assert(offsetof(UWBP_BulletinBoard_ActiveStoryArcs_C, WBP_JournalAccordion_1) == 0x000310, "Member 'UWBP_BulletinBoard_ActiveStoryArcs_C::WBP_JournalAccordion_1' has a wrong offset!");
static_assert(offsetof(UWBP_BulletinBoard_ActiveStoryArcs_C, WBP_JournalAccordion_2) == 0x000318, "Member 'UWBP_BulletinBoard_ActiveStoryArcs_C::WBP_JournalAccordion_2' has a wrong offset!");

}

