#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CC_SculptSubcategoryItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CC_SculptSubcategoryItem.WBP_CC_SculptSubcategoryItem_C
// 0x0020 (0x0398 - 0x0378)
class UWBP_CC_SculptSubcategoryItem_C final : public UCC_SculptSubcategoryItem
{
public:
	class UWBP_CC_SubcategorySlider_C*            WBP_CC_SubcategorySlider;                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CC_SubcategorySlider_C*            WBP_CC_SubcategorySlider_1;                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CC_SubcategorySlider_C*            WBP_CC_SubcategorySlider_2;                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CC_SubcategorySlider_C*            WBP_CC_SubcategorySlider_3;                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CC_SculptSubcategoryItem_C">();
	}
	static class UWBP_CC_SculptSubcategoryItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CC_SculptSubcategoryItem_C>();
	}
};
static_assert(alignof(UWBP_CC_SculptSubcategoryItem_C) == 0x000008, "Wrong alignment on UWBP_CC_SculptSubcategoryItem_C");
static_assert(sizeof(UWBP_CC_SculptSubcategoryItem_C) == 0x000398, "Wrong size on UWBP_CC_SculptSubcategoryItem_C");
static_assert(offsetof(UWBP_CC_SculptSubcategoryItem_C, WBP_CC_SubcategorySlider) == 0x000378, "Member 'UWBP_CC_SculptSubcategoryItem_C::WBP_CC_SubcategorySlider' has a wrong offset!");
static_assert(offsetof(UWBP_CC_SculptSubcategoryItem_C, WBP_CC_SubcategorySlider_1) == 0x000380, "Member 'UWBP_CC_SculptSubcategoryItem_C::WBP_CC_SubcategorySlider_1' has a wrong offset!");
static_assert(offsetof(UWBP_CC_SculptSubcategoryItem_C, WBP_CC_SubcategorySlider_2) == 0x000388, "Member 'UWBP_CC_SculptSubcategoryItem_C::WBP_CC_SubcategorySlider_2' has a wrong offset!");
static_assert(offsetof(UWBP_CC_SculptSubcategoryItem_C, WBP_CC_SubcategorySlider_3) == 0x000390, "Member 'UWBP_CC_SculptSubcategoryItem_C::WBP_CC_SubcategorySlider_3' has a wrong offset!");

}

