#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GuildWars

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GuildWars.WBP_GuildWars_C
// 0x0048 (0x03A0 - 0x0358)
class UWBP_GuildWars_C final : public UGuildWars
{
public:
	class UImage*                                 AttackerGuildIcon;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EnemyGuildIcon;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    GuildAbbreviationText;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_AttackArrow;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScrollWindow;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TargetAbbreviationText;                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PhaseSummaryItem_C*                WBP_PhaseSummaryItem;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PhaseSummaryItem_C*                WBP_PhaseSummaryItem_1;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   WBP_ScrollWindow_NoFrameNoPadding_C_0;             // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GuildWars_C">();
	}
	static class UWBP_GuildWars_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GuildWars_C>();
	}
};
static_assert(alignof(UWBP_GuildWars_C) == 0x000008, "Wrong alignment on UWBP_GuildWars_C");
static_assert(sizeof(UWBP_GuildWars_C) == 0x0003A0, "Wrong size on UWBP_GuildWars_C");
static_assert(offsetof(UWBP_GuildWars_C, AttackerGuildIcon) == 0x000358, "Member 'UWBP_GuildWars_C::AttackerGuildIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWars_C, EnemyGuildIcon) == 0x000360, "Member 'UWBP_GuildWars_C::EnemyGuildIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWars_C, GuildAbbreviationText) == 0x000368, "Member 'UWBP_GuildWars_C::GuildAbbreviationText' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWars_C, IMG_AttackArrow) == 0x000370, "Member 'UWBP_GuildWars_C::IMG_AttackArrow' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWars_C, ScrollWindow) == 0x000378, "Member 'UWBP_GuildWars_C::ScrollWindow' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWars_C, TargetAbbreviationText) == 0x000380, "Member 'UWBP_GuildWars_C::TargetAbbreviationText' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWars_C, WBP_PhaseSummaryItem) == 0x000388, "Member 'UWBP_GuildWars_C::WBP_PhaseSummaryItem' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWars_C, WBP_PhaseSummaryItem_1) == 0x000390, "Member 'UWBP_GuildWars_C::WBP_PhaseSummaryItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_GuildWars_C, WBP_ScrollWindow_NoFrameNoPadding_C_0) == 0x000398, "Member 'UWBP_GuildWars_C::WBP_ScrollWindow_NoFrameNoPadding_C_0' has a wrong offset!");

}

