#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServiceBuildingStatWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServiceBuildingStatWidget.WBP_ServiceBuildingStatWidget_C
// 0x0020 (0x0310 - 0x02F0)
class UWBP_ServiceBuildingStatWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          B_MainContainer;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    LabelTextBlock;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    ValueTextBlock;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	class UCommonBorder* GetBorder();
	void ExecuteUbergraph_WBP_ServiceBuildingStatWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServiceBuildingStatWidget_C">();
	}
	static class UWBP_ServiceBuildingStatWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServiceBuildingStatWidget_C>();
	}
};
static_assert(alignof(UWBP_ServiceBuildingStatWidget_C) == 0x000008, "Wrong alignment on UWBP_ServiceBuildingStatWidget_C");
static_assert(sizeof(UWBP_ServiceBuildingStatWidget_C) == 0x000310, "Wrong size on UWBP_ServiceBuildingStatWidget_C");
static_assert(offsetof(UWBP_ServiceBuildingStatWidget_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_ServiceBuildingStatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingStatWidget_C, B_MainContainer) == 0x0002F8, "Member 'UWBP_ServiceBuildingStatWidget_C::B_MainContainer' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingStatWidget_C, LabelTextBlock) == 0x000300, "Member 'UWBP_ServiceBuildingStatWidget_C::LabelTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ServiceBuildingStatWidget_C, ValueTextBlock) == 0x000308, "Member 'UWBP_ServiceBuildingStatWidget_C::ValueTextBlock' has a wrong offset!");

}

