#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PhaseSummaryEventItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PhaseSummaryEventItem.WBP_PhaseSummaryEventItem_C
// 0x0048 (0x0358 - 0x0310)
class UWBP_PhaseSummaryEventItem_C final : public UPhaseSummaryEventItem
{
public:
	class UImage*                                 AttackerGuildIcon;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    AttackerGuildNameTextBlock;                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    AttackerVictoryPointsTextBlock;                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          B_AlternatingBG;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DefendererGuildIcon;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    DefenderGuildNameTextBlock;                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    DefenderVictoryPointsTextBlock;                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    EventStateTextBlock;                               // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_ArrowIcon;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PhaseSummaryEventItem_C">();
	}
	static class UWBP_PhaseSummaryEventItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PhaseSummaryEventItem_C>();
	}
};
static_assert(alignof(UWBP_PhaseSummaryEventItem_C) == 0x000008, "Wrong alignment on UWBP_PhaseSummaryEventItem_C");
static_assert(sizeof(UWBP_PhaseSummaryEventItem_C) == 0x000358, "Wrong size on UWBP_PhaseSummaryEventItem_C");
static_assert(offsetof(UWBP_PhaseSummaryEventItem_C, AttackerGuildIcon) == 0x000310, "Member 'UWBP_PhaseSummaryEventItem_C::AttackerGuildIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryEventItem_C, AttackerGuildNameTextBlock) == 0x000318, "Member 'UWBP_PhaseSummaryEventItem_C::AttackerGuildNameTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryEventItem_C, AttackerVictoryPointsTextBlock) == 0x000320, "Member 'UWBP_PhaseSummaryEventItem_C::AttackerVictoryPointsTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryEventItem_C, B_AlternatingBG) == 0x000328, "Member 'UWBP_PhaseSummaryEventItem_C::B_AlternatingBG' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryEventItem_C, DefendererGuildIcon) == 0x000330, "Member 'UWBP_PhaseSummaryEventItem_C::DefendererGuildIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryEventItem_C, DefenderGuildNameTextBlock) == 0x000338, "Member 'UWBP_PhaseSummaryEventItem_C::DefenderGuildNameTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryEventItem_C, DefenderVictoryPointsTextBlock) == 0x000340, "Member 'UWBP_PhaseSummaryEventItem_C::DefenderVictoryPointsTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryEventItem_C, EventStateTextBlock) == 0x000348, "Member 'UWBP_PhaseSummaryEventItem_C::EventStateTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryEventItem_C, IMG_ArrowIcon) == 0x000350, "Member 'UWBP_PhaseSummaryEventItem_C::IMG_ArrowIcon' has a wrong offset!");

}

