#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TutorialArchiveMaster

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TutorialArchiveMaster.WBP_TutorialArchiveMaster_C
// 0x0020 (0x0390 - 0x0370)
class UWBP_TutorialArchiveMaster_C final : public UTutorialArchiveMaster
{
public:
	class UWBP_ScrollWindow_Framed_C*             AccordionListWindow;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       CargoStorageList;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       ItemsStorageList;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       MaterialsStorageList;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TutorialArchiveMaster_C">();
	}
	static class UWBP_TutorialArchiveMaster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TutorialArchiveMaster_C>();
	}
};
static_assert(alignof(UWBP_TutorialArchiveMaster_C) == 0x000008, "Wrong alignment on UWBP_TutorialArchiveMaster_C");
static_assert(sizeof(UWBP_TutorialArchiveMaster_C) == 0x000390, "Wrong size on UWBP_TutorialArchiveMaster_C");
static_assert(offsetof(UWBP_TutorialArchiveMaster_C, AccordionListWindow) == 0x000370, "Member 'UWBP_TutorialArchiveMaster_C::AccordionListWindow' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialArchiveMaster_C, CargoStorageList) == 0x000378, "Member 'UWBP_TutorialArchiveMaster_C::CargoStorageList' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialArchiveMaster_C, ItemsStorageList) == 0x000380, "Member 'UWBP_TutorialArchiveMaster_C::ItemsStorageList' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialArchiveMaster_C, MaterialsStorageList) == 0x000388, "Member 'UWBP_TutorialArchiveMaster_C::MaterialsStorageList' has a wrong offset!");

}

