#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuildingProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BuildingProgress.WBP_BuildingProgress_C
// 0x0018 (0x0378 - 0x0360)
class UWBP_BuildingProgress_C final : public UBuildingProgress
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BuildingStateIcon;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExperienceBarFrame;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_BuildingProgress(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BuildingProgress_C">();
	}
	static class UWBP_BuildingProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BuildingProgress_C>();
	}
};
static_assert(alignof(UWBP_BuildingProgress_C) == 0x000008, "Wrong alignment on UWBP_BuildingProgress_C");
static_assert(sizeof(UWBP_BuildingProgress_C) == 0x000378, "Wrong size on UWBP_BuildingProgress_C");
static_assert(offsetof(UWBP_BuildingProgress_C, UberGraphFrame) == 0x000360, "Member 'UWBP_BuildingProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BuildingProgress_C, BuildingStateIcon) == 0x000368, "Member 'UWBP_BuildingProgress_C::BuildingStateIcon' has a wrong offset!");
static_assert(offsetof(UWBP_BuildingProgress_C, ExperienceBarFrame) == 0x000370, "Member 'UWBP_BuildingProgress_C::ExperienceBarFrame' has a wrong offset!");

}

