#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipPrimaryStatBlock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TooltipPrimaryStatBlock.WBP_TooltipPrimaryStatBlock_C
// 0x0018 (0x0318 - 0x0300)
class UWBP_TooltipPrimaryStatBlock_C final : public UTooltipPrimaryStatBlock
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          SectionBG;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    SectionSubheader;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	class UCommonBorder* GetBorder();
	void ExecuteUbergraph_WBP_TooltipPrimaryStatBlock(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TooltipPrimaryStatBlock_C">();
	}
	static class UWBP_TooltipPrimaryStatBlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TooltipPrimaryStatBlock_C>();
	}
};
static_assert(alignof(UWBP_TooltipPrimaryStatBlock_C) == 0x000008, "Wrong alignment on UWBP_TooltipPrimaryStatBlock_C");
static_assert(sizeof(UWBP_TooltipPrimaryStatBlock_C) == 0x000318, "Wrong size on UWBP_TooltipPrimaryStatBlock_C");
static_assert(offsetof(UWBP_TooltipPrimaryStatBlock_C, UberGraphFrame) == 0x000300, "Member 'UWBP_TooltipPrimaryStatBlock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipPrimaryStatBlock_C, SectionBG) == 0x000308, "Member 'UWBP_TooltipPrimaryStatBlock_C::SectionBG' has a wrong offset!");
static_assert(offsetof(UWBP_TooltipPrimaryStatBlock_C, SectionSubheader) == 0x000310, "Member 'UWBP_TooltipPrimaryStatBlock_C::SectionSubheader' has a wrong offset!");

}

