#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuckFloatingTextManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_BuckFloatingTextManager.WBP_BuckFloatingTextManager_C.AbilitySystem_OnHit
// 0x0050 (0x0050 - 0x0000)
struct WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit final
{
public:
	struct FHitInst                               HitInst;                                           // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit) == 0x000008, "Wrong alignment on WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit");
static_assert(sizeof(WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit) == 0x000050, "Wrong size on WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit, HitInst) == 0x000000, "Member 'WBP_BuckFloatingTextManager_C_AbilitySystem_OnHit::HitInst' has a wrong offset!");

// Function WBP_BuckFloatingTextManager.WBP_BuckFloatingTextManager_C.AddFloaterToTarget
// 0x0D40 (0x0D40 - 0x0000)
struct WBP_BuckFloatingTextManager_C_AddFloaterToTarget final
{
public:
	struct FStatModInst                           StatMod;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class ABaseCharacter*                         Target;                                            // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitTargetInst                         HitTargetInst;                                     // 0x0030(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FAbilityHitRecord                      HitRecord;                                         // 0x00E8(0x0A30)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int64                                         SourceRecordType;                                  // 0x0B18(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          hitting_OtherwiseGettingHit_;                      // 0x0B20(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B21[0x7];                                      // 0x0B21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 hitStr_0;                                          // 0x0B28(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          resist;                                            // 0x0B38(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          immune;                                            // 0x0B39(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0B3A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0B3B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHitTags_weaponHit;                   // 0x0B3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHitTags_isPhysical;                  // 0x0B3D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHitTags_isMagical;                   // 0x0B3E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3F[0x1];                                      // 0x0B3F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0B40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0B44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0B48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4C[0x4];                                      // 0x0B4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCharacterFloaterData*            CallFunc_GetCharacterFloaterData_ReturnValue;      // 0x0B50(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0B58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0B59(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0B5A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5B[0x5];                                      // 0x0B5B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatModRecord                         CallFunc_GetStatModRecordByGuid_ReturnValue;       // 0x0B60(0x0110)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0C70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0C74(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C75[0x3];                                      // 0x0C75(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0C78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0C7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0C80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C84[0x4];                                      // 0x0C84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBuckFloatingTextWidget*                CallFunc_Array_Get_Item;                           // 0x0C88(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BuckFloatingText_C*                K2Node_DynamicCast_AsWBP_Buck_Floating_Text;       // 0x0C90(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0C98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0C99(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0C9A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9B[0x5];                                      // 0x0C9B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0CA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x0CA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA9[0x3];                                      // 0x0CA9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0CAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0CB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB1[0x3];                                      // 0x0CB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0CB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBuckFloatingTextWidget*                CallFunc_Array_Get_Item_1;                         // 0x0CB8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BuckFloatingText_C*                K2Node_DynamicCast_AsWBP_Buck_Floating_Text_1;     // 0x0CC0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0CC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0CC9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0CCA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CCB[0x5];                                      // 0x0CCB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_BuckFloatingText_C*                CallFunc_GetNextFloaterBP_ret;                     // 0x0CD0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0CD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0CDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x0CE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0CE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0CE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0CE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CEA[0x2];                                      // 0x0CEA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0CEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0CF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0CF1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF2[0x2];                                      // 0x0CF2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0CF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0CF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue_1;                 // 0x0CFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue_2;                 // 0x0D00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x0D04(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_2;             // 0x0D05(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0D06(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0D07(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0D08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0D09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D0A[0x6];                                      // 0x0D0A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0D10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetFloater_value_ImplicitCast;            // 0x0D18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetFloater_rawValue_ImplicitCast;         // 0x0D20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetFloater_rawValue_ImplicitCast_1;       // 0x0D28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0D30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0D38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget) == 0x000008, "Wrong alignment on WBP_BuckFloatingTextManager_C_AddFloaterToTarget");
static_assert(sizeof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget) == 0x000D40, "Wrong size on WBP_BuckFloatingTextManager_C_AddFloaterToTarget");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, StatMod) == 0x000000, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::StatMod' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, Target) == 0x000028, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::Target' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, HitTargetInst) == 0x000030, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::HitTargetInst' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, HitRecord) == 0x0000E8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::HitRecord' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, SourceRecordType) == 0x000B18, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::SourceRecordType' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, hitting_OtherwiseGettingHit_) == 0x000B20, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::hitting_OtherwiseGettingHit_' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, hitStr_0) == 0x000B28, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::hitStr_0' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, resist) == 0x000B38, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::resist' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, immune) == 0x000B39, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::immune' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_IsEmpty_ReturnValue) == 0x000B3A, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Not_PreBool_ReturnValue) == 0x000B3B, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_CheckHitTags_weaponHit) == 0x000B3C, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_CheckHitTags_weaponHit' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_CheckHitTags_isPhysical) == 0x000B3D, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_CheckHitTags_isPhysical' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_CheckHitTags_isMagical) == 0x000B3E, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_CheckHitTags_isMagical' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000B40, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000B44, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000B48, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_GetCharacterFloaterData_ReturnValue) == 0x000B50, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_GetCharacterFloaterData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_IsValid_ReturnValue) == 0x000B58, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000B59, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Not_PreBool_ReturnValue_1) == 0x000B5A, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_GetStatModRecordByGuid_ReturnValue) == 0x000B60, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_GetStatModRecordByGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Array_Length_ReturnValue) == 0x000C70, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_BooleanAND_ReturnValue) == 0x000C74, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Array_Length_ReturnValue_1) == 0x000C78, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, Temp_int_Array_Index_Variable) == 0x000C7C, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, Temp_int_Loop_Counter_Variable) == 0x000C80, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Array_Get_Item) == 0x000C88, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, K2Node_DynamicCast_AsWBP_Buck_Floating_Text) == 0x000C90, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::K2Node_DynamicCast_AsWBP_Buck_Floating_Text' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, K2Node_DynamicCast_bSuccess) == 0x000C98, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000C99, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000C9A, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000CA0, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x000CA8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000CAC, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_BooleanAND_ReturnValue_1) == 0x000CB0, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, Temp_int_Array_Index_Variable_1) == 0x000CB4, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Array_Get_Item_1) == 0x000CB8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, K2Node_DynamicCast_AsWBP_Buck_Floating_Text_1) == 0x000CC0, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::K2Node_DynamicCast_AsWBP_Buck_Floating_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, K2Node_DynamicCast_bSuccess_1) == 0x000CC8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000CC9, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_MakeLiteralByte_ReturnValue) == 0x000CCA, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_GetNextFloaterBP_ret) == 0x000CD0, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_GetNextFloaterBP_ret' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000CD8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Array_Add_ReturnValue) == 0x000CDC, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_And_IntInt_ReturnValue) == 0x000CE0, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, Temp_int_Loop_Counter_Variable_1) == 0x000CE4, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_IntToBool_ReturnValue) == 0x000CE8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000CE9, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000CEC, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000CF0, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000CF1, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000CF4, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000CF8, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_And_IntInt_ReturnValue_1) == 0x000CFC, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_And_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_And_IntInt_ReturnValue_2) == 0x000D00, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_And_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x000D04, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Conv_IntToBool_ReturnValue_2) == 0x000D05, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Conv_IntToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_BooleanOR_ReturnValue) == 0x000D06, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_BooleanOR_ReturnValue_1) == 0x000D07, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Not_PreBool_ReturnValue_2) == 0x000D08, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_BooleanAND_ReturnValue_2) == 0x000D09, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x000D10, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_SetFloater_value_ImplicitCast) == 0x000D18, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_SetFloater_value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_SetFloater_rawValue_ImplicitCast) == 0x000D20, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_SetFloater_rawValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_SetFloater_rawValue_ImplicitCast_1) == 0x000D28, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_SetFloater_rawValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000D30, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_AddFloaterToTarget, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000D38, "Member 'WBP_BuckFloatingTextManager_C_AddFloaterToTarget::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_BuckFloatingTextManager.WBP_BuckFloatingTextManager_C.CacheCharsBP
// 0x0028 (0x0028 - 0x0000)
struct WBP_BuckFloatingTextManager_C_CacheCharsBP final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAoCPlayerController*                   K2Node_DynamicCast_AsAo_CPlayer_Controller;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         CallFunc_GetBaseCharacter_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuckFloatingTextManager_C_CacheCharsBP) == 0x000008, "Wrong alignment on WBP_BuckFloatingTextManager_C_CacheCharsBP");
static_assert(sizeof(WBP_BuckFloatingTextManager_C_CacheCharsBP) == 0x000028, "Wrong size on WBP_BuckFloatingTextManager_C_CacheCharsBP");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CacheCharsBP, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'WBP_BuckFloatingTextManager_C_CacheCharsBP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CacheCharsBP, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_BuckFloatingTextManager_C_CacheCharsBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CacheCharsBP, K2Node_DynamicCast_AsAo_CPlayer_Controller) == 0x000010, "Member 'WBP_BuckFloatingTextManager_C_CacheCharsBP::K2Node_DynamicCast_AsAo_CPlayer_Controller' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CacheCharsBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_BuckFloatingTextManager_C_CacheCharsBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CacheCharsBP, CallFunc_GetBaseCharacter_ReturnValue) == 0x000020, "Member 'WBP_BuckFloatingTextManager_C_CacheCharsBP::CallFunc_GetBaseCharacter_ReturnValue' has a wrong offset!");

// Function WBP_BuckFloatingTextManager.WBP_BuckFloatingTextManager_C.CheckHitTags
// 0x0038 (0x0038 - 0x0000)
struct WBP_BuckFloatingTextManager_C_CheckHitTags final
{
public:
	TArray<struct FGameplayTag>                   hitTags;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          weaponHit;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isPhysical;                                        // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isMagical;                                         // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          mag;                                               // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          phys;                                              // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          wep;                                               // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuckFloatingTextManager_C_CheckHitTags) == 0x000008, "Wrong alignment on WBP_BuckFloatingTextManager_C_CheckHitTags");
static_assert(sizeof(WBP_BuckFloatingTextManager_C_CheckHitTags) == 0x000038, "Wrong size on WBP_BuckFloatingTextManager_C_CheckHitTags");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, hitTags) == 0x000000, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::hitTags' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, weaponHit) == 0x000010, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::weaponHit' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, isPhysical) == 0x000011, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::isPhysical' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, isMagical) == 0x000012, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::isMagical' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, mag) == 0x000013, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::mag' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, phys) == 0x000014, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::phys' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, wep) == 0x000015, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::wep' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, CallFunc_Array_Get_Item) == 0x000024, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x00002C, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, CallFunc_MatchesTag_ReturnValue) == 0x00002D, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, CallFunc_MatchesTag_ReturnValue_1) == 0x00002E, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, CallFunc_Less_IntInt_ReturnValue) == 0x00002F, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_CheckHitTags, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WBP_BuckFloatingTextManager_C_CheckHitTags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_BuckFloatingTextManager.WBP_BuckFloatingTextManager_C.EnsureDataBP
// 0x0020 (0x0020 - 0x0000)
struct WBP_BuckFloatingTextManager_C_EnsureDataBP final
{
public:
	class ABaseCharacter*                         BaseChar;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCharacterFloaterData*                  CallFunc_Map_Find_Value;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterFloaterData*                  CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuckFloatingTextManager_C_EnsureDataBP) == 0x000008, "Wrong alignment on WBP_BuckFloatingTextManager_C_EnsureDataBP");
static_assert(sizeof(WBP_BuckFloatingTextManager_C_EnsureDataBP) == 0x000020, "Wrong size on WBP_BuckFloatingTextManager_C_EnsureDataBP");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_EnsureDataBP, BaseChar) == 0x000000, "Member 'WBP_BuckFloatingTextManager_C_EnsureDataBP::BaseChar' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_EnsureDataBP, CallFunc_Map_Find_Value) == 0x000008, "Member 'WBP_BuckFloatingTextManager_C_EnsureDataBP::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_EnsureDataBP, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'WBP_BuckFloatingTextManager_C_EnsureDataBP::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuckFloatingTextManager_C_EnsureDataBP, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'WBP_BuckFloatingTextManager_C_EnsureDataBP::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_BuckFloatingTextManager.WBP_BuckFloatingTextManager_C.ExecuteUbergraph_WBP_BuckFloatingTextManager
// 0x45E8 (0x45E8 - 0x0000)
struct WBP_BuckFloatingTextManager_C_ExecuteUbergraph_WBP_BuckFloatingTextManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      Temp_struct_Variable;                              // 0x0008(0x0A30)()
	struct FGuid                                  CallFunc_GetCharacterGuid_ReturnValue;             // 0x0A38(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitTargetInst                         Temp_struct_Variable_1;                            // 0x0A48(0x00B8)(ContainsInstancedReference)
	struct FAbilityHitRecord                      Temp_struct_Variable_2;                            // 0x0B00(0x0A30)()
	struct FHitTargetInst                         Temp_struct_Variable_3;                            // 0x1530(0x00B8)(ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x15E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FEffectRecord& EffectRecord, const class AActor* Instigator, const class AActor* Target)> UniqueObjectNameForCooking_OutputDelegate; // 0x15EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x15FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x1600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x1604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x1608(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x1610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x1614(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1615[0x3];                                     // 0x1615(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x1618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FHitInst& HitInst)> UniqueObjectNameForCooking_OutputDelegate_1;     // 0x161C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162C[0x4];                                     // 0x162C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitInst                               K2Node_CustomEvent_HitInst;                        // 0x1630(0x0050)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FEffectRecord& EffectRecord, const class AActor* Instigator, const class AActor* Target)> UniqueObjectNameForCooking_OutputDelegate_2; // 0x1680(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitTargetInst                         CallFunc_Array_Get_Item;                           // 0x1690(0x00B8)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x1748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x174C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x1750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x1751(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1752[0x6];                                     // 0x1752(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatModInst                           CallFunc_Array_Get_Item_1;                         // 0x1758(0x0028)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x1780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x1784(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x1785(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x1786(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x1787(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x1788(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character;               // 0x1790(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x1798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1799[0x7];                                     // 0x1799(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character_1;             // 0x17A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x17A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A9[0x7];                                     // 0x17A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue;           // 0x17B0(0x0A30)(ConstParm)
	struct FGuid                                  CallFunc_GetCharacterGuid_ReturnValue_1;           // 0x21E0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Trim_ReturnValue;                         // 0x21F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_TrimTrailing_ReturnValue;                 // 0x2200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x2210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x2211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x2212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2213[0x5];                                     // 0x2213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitTargetInst                         Temp_struct_Variable_4;                            // 0x2218(0x00B8)(ContainsInstancedReference)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x22D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D4[0x4];                                     // 0x22D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      Temp_struct_Variable_5;                            // 0x22D8(0x0A30)()
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x2D08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D0C[0x4];                                     // 0x2D0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAoCStatsComponent*                     K2Node_CustomEvent_AoCStatsComponent;              // 0x2D10(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEffectInst                            K2Node_CustomEvent_EffectInst;                     // 0x2D18(0x0168)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x2E80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x2E81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E82[0x6];                                     // 0x2E82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectRecord                          CallFunc_GetEffectRecordByGuid_ReturnValue;        // 0x2E88(0x0788)(ConstParm)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x3610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3611[0x7];                                     // 0x3611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Trim_ReturnValue_1;                       // 0x3618(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_TrimTrailing_ReturnValue_1;               // 0x3628(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x3638(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x3640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x3641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3642[0x6];                                     // 0x3642(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character_2;             // 0x3648(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x3650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3651[0x3];                                     // 0x3651(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAoCStatsComponent* AoCStatsComponent, const struct FEffectInst& EffectInst)> UniqueObjectNameForCooking_OutputDelegate_3; // 0x3654(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShouldShowAndHitting_shouldShow;       // 0x3664(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShouldShowAndHitting_hitting;          // 0x3665(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3666[0x2];                                     // 0x3666(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectRecord                          K2Node_CustomEvent_EffectRecord_1;                 // 0x3668(0x0788)(ConstParm)
	const class AActor*                           K2Node_CustomEvent_Instigator_1;                   // 0x3DF0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           K2Node_CustomEvent_Target_1;                       // 0x3DF8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEffectRecord                          K2Node_CustomEvent_EffectRecord;                   // 0x3E00(0x0788)(ConstParm)
	const class AActor*                           K2Node_CustomEvent_Instigator;                     // 0x4588(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           K2Node_CustomEvent_Target;                         // 0x4590(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x4598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x4599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459A[0x6];                                     // 0x459A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character_3;             // 0x45A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x45A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A9[0x7];                                     // 0x45A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter*                         K2Node_DynamicCast_AsBase_Character_4;             // 0x45B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x45B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
