#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SystemsFrameButton

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SystemsFrameButton.WBP_SystemsFrameButton_C
// 0x0030 (0x03E8 - 0x03B8)
class UWBP_SystemsFrameButton_C final : public USystemsFrameButton
{
public:
	class UImage*                                 HoverStateImage;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserWidget*                            Panel;                                             // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	class UUserWidget* GetPanel();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SystemsFrameButton_C">();
	}
	static class UWBP_SystemsFrameButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SystemsFrameButton_C>();
	}
};
static_assert(alignof(UWBP_SystemsFrameButton_C) == 0x000008, "Wrong alignment on UWBP_SystemsFrameButton_C");
static_assert(sizeof(UWBP_SystemsFrameButton_C) == 0x0003E8, "Wrong size on UWBP_SystemsFrameButton_C");
static_assert(offsetof(UWBP_SystemsFrameButton_C, HoverStateImage) == 0x0003B8, "Member 'UWBP_SystemsFrameButton_C::HoverStateImage' has a wrong offset!");
static_assert(offsetof(UWBP_SystemsFrameButton_C, Panel) == 0x0003C0, "Member 'UWBP_SystemsFrameButton_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_SystemsFrameButton_C, OnHovered) == 0x0003C8, "Member 'UWBP_SystemsFrameButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWBP_SystemsFrameButton_C, OnUnhovered) == 0x0003D8, "Member 'UWBP_SystemsFrameButton_C::OnUnhovered' has a wrong offset!");

}

