#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ArtisanshipRecipeItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ArtisanshipRecipeItem.WBP_ArtisanshipRecipeItem_C
// 0x0080 (0x03C8 - 0x0348)
class UWBP_ArtisanshipRecipeItem_C final : public UArtisanshipRecipeItem
{
public:
	class UCommonBorder*                          B_AlternatingBG;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_1;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_2;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_3;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_4;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_5;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_6;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_7;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_8;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_9;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_10;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_11;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_12;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_13;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_14;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ArtisanshipRecipeItem_C">();
	}
	static class UWBP_ArtisanshipRecipeItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ArtisanshipRecipeItem_C>();
	}
};
static_assert(alignof(UWBP_ArtisanshipRecipeItem_C) == 0x000008, "Wrong alignment on UWBP_ArtisanshipRecipeItem_C");
static_assert(sizeof(UWBP_ArtisanshipRecipeItem_C) == 0x0003C8, "Wrong size on UWBP_ArtisanshipRecipeItem_C");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, B_AlternatingBG) == 0x000348, "Member 'UWBP_ArtisanshipRecipeItem_C::B_AlternatingBG' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon) == 0x000350, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_1) == 0x000358, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_2) == 0x000360, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_3) == 0x000368, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_3' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_4) == 0x000370, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_4' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_5) == 0x000378, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_5' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_6) == 0x000380, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_6' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_7) == 0x000388, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_7' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_8) == 0x000390, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_8' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_9) == 0x000398, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_9' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_10) == 0x0003A0, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_10' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_11) == 0x0003A8, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_11' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_12) == 0x0003B0, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_12' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_13) == 0x0003B8, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_13' has a wrong offset!");
static_assert(offsetof(UWBP_ArtisanshipRecipeItem_C, WBP_ItemIcon_14) == 0x0003C0, "Member 'UWBP_ArtisanshipRecipeItem_C::WBP_ItemIcon_14' has a wrong offset!");

}

