#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CastBar_Music_Pensive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CastBar_Music_Pensive.WBP_CastBar_Music_Pensive_C
// 0x0018 (0x03A0 - 0x0388)
class UWBP_CastBar_Music_Pensive_C final : public UCastBar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAoCCommonTextBlock*                    CastTimer;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        StartTime;                                         // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CastBar_Music_Pensive(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CastBar_Music_Pensive_C">();
	}
	static class UWBP_CastBar_Music_Pensive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CastBar_Music_Pensive_C>();
	}
};
static_assert(alignof(UWBP_CastBar_Music_Pensive_C) == 0x000008, "Wrong alignment on UWBP_CastBar_Music_Pensive_C");
static_assert(sizeof(UWBP_CastBar_Music_Pensive_C) == 0x0003A0, "Wrong size on UWBP_CastBar_Music_Pensive_C");
static_assert(offsetof(UWBP_CastBar_Music_Pensive_C, UberGraphFrame) == 0x000388, "Member 'UWBP_CastBar_Music_Pensive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CastBar_Music_Pensive_C, CastTimer) == 0x000390, "Member 'UWBP_CastBar_Music_Pensive_C::CastTimer' has a wrong offset!");
static_assert(offsetof(UWBP_CastBar_Music_Pensive_C, StartTime) == 0x000398, "Member 'UWBP_CastBar_Music_Pensive_C::StartTime' has a wrong offset!");

}

