#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NotificationsGrid

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_NotificationsGrid.WBP_NotificationsGrid_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_NotificationsGrid_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NotificationsGrid_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_NotificationsGrid_C_PreConstruct");
static_assert(sizeof(WBP_NotificationsGrid_C_PreConstruct) == 0x000001, "Wrong size on WBP_NotificationsGrid_C_PreConstruct");
static_assert(offsetof(WBP_NotificationsGrid_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_NotificationsGrid_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_NotificationsGrid.WBP_NotificationsGrid_C.ExecuteUbergraph_WBP_NotificationsGrid
// 0x0060 (0x0060 - 0x0000)
struct WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_NotificationItem_C*                CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPanelWidget*>                   K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid) == 0x000008, "Wrong alignment on WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid");
static_assert(sizeof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid) == 0x000060, "Wrong size on WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, EntryPoint) == 0x000000, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, Temp_int_Variable) == 0x000004, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, Temp_int_Variable_1) == 0x000020, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, K2Node_MakeArray_Array) == 0x000028, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, K2Node_Select_Default) == 0x000038, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, CallFunc_AddChild_ReturnValue) == 0x000050, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_NotificationsGrid_C_ExecuteUbergraph_WBP_NotificationsGrid::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

