#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Mailbox

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Mailbox.WBP_Mailbox_C
// 0x0050 (0x04D0 - 0x0480)
class UWBP_Mailbox_C final : public UMailbox
{
public:
	class UWBP_MailItem_C*                        WBP_MailItem;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MailItem_C*                        WBP_MailItem_1;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MailItem_C*                        WBP_MailItem_2;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MailItem_C*                        WBP_MailItem_3;                                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MailItem_C*                        WBP_MailItem_4;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MailItem_C*                        WBP_MailItem_5;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MailItem_C*                        WBP_MailItem_6;                                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MailItem_C*                        WBP_MailItem_7;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MailItem_C*                        WBP_MailItem_8;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MailItem_C*                        WBP_MailItem_9;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UPanelWidget* GetButtonContainer();
	TSubclassOf<class UCommonButtonStyle> GetEvenButtonStyle();
	TSubclassOf<class UCommonButtonStyle> GetOddButtonStyle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Mailbox_C">();
	}
	static class UWBP_Mailbox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Mailbox_C>();
	}
};
static_assert(alignof(UWBP_Mailbox_C) == 0x000008, "Wrong alignment on UWBP_Mailbox_C");
static_assert(sizeof(UWBP_Mailbox_C) == 0x0004D0, "Wrong size on UWBP_Mailbox_C");
static_assert(offsetof(UWBP_Mailbox_C, WBP_MailItem) == 0x000480, "Member 'UWBP_Mailbox_C::WBP_MailItem' has a wrong offset!");
static_assert(offsetof(UWBP_Mailbox_C, WBP_MailItem_1) == 0x000488, "Member 'UWBP_Mailbox_C::WBP_MailItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_Mailbox_C, WBP_MailItem_2) == 0x000490, "Member 'UWBP_Mailbox_C::WBP_MailItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_Mailbox_C, WBP_MailItem_3) == 0x000498, "Member 'UWBP_Mailbox_C::WBP_MailItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_Mailbox_C, WBP_MailItem_4) == 0x0004A0, "Member 'UWBP_Mailbox_C::WBP_MailItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_Mailbox_C, WBP_MailItem_5) == 0x0004A8, "Member 'UWBP_Mailbox_C::WBP_MailItem_5' has a wrong offset!");
static_assert(offsetof(UWBP_Mailbox_C, WBP_MailItem_6) == 0x0004B0, "Member 'UWBP_Mailbox_C::WBP_MailItem_6' has a wrong offset!");
static_assert(offsetof(UWBP_Mailbox_C, WBP_MailItem_7) == 0x0004B8, "Member 'UWBP_Mailbox_C::WBP_MailItem_7' has a wrong offset!");
static_assert(offsetof(UWBP_Mailbox_C, WBP_MailItem_8) == 0x0004C0, "Member 'UWBP_Mailbox_C::WBP_MailItem_8' has a wrong offset!");
static_assert(offsetof(UWBP_Mailbox_C, WBP_MailItem_9) == 0x0004C8, "Member 'UWBP_Mailbox_C::WBP_MailItem_9' has a wrong offset!");

}

