#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemStorage

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemStorage.WBP_ItemStorage_C
// 0x0060 (0x0478 - 0x0418)
class UWBP_ItemStorage_C final : public UItemStorage
{
public:
	class UWBP_InventorySlot_C*                   ItemSlot;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   ItemSlot_1;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   ItemSlot_2;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   ItemSlot_3;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   ItemSlot_4;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   ItemSlot_5;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   ItemSlot_6;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   ItemSlot_7;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   ItemSlot_8;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   ItemSlot_9;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   ItemSlot_10;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   ItemSlot_11;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemStorage_C">();
	}
	static class UWBP_ItemStorage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemStorage_C>();
	}
};
static_assert(alignof(UWBP_ItemStorage_C) == 0x000008, "Wrong alignment on UWBP_ItemStorage_C");
static_assert(sizeof(UWBP_ItemStorage_C) == 0x000478, "Wrong size on UWBP_ItemStorage_C");
static_assert(offsetof(UWBP_ItemStorage_C, ItemSlot) == 0x000418, "Member 'UWBP_ItemStorage_C::ItemSlot' has a wrong offset!");
static_assert(offsetof(UWBP_ItemStorage_C, ItemSlot_1) == 0x000420, "Member 'UWBP_ItemStorage_C::ItemSlot_1' has a wrong offset!");
static_assert(offsetof(UWBP_ItemStorage_C, ItemSlot_2) == 0x000428, "Member 'UWBP_ItemStorage_C::ItemSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_ItemStorage_C, ItemSlot_3) == 0x000430, "Member 'UWBP_ItemStorage_C::ItemSlot_3' has a wrong offset!");
static_assert(offsetof(UWBP_ItemStorage_C, ItemSlot_4) == 0x000438, "Member 'UWBP_ItemStorage_C::ItemSlot_4' has a wrong offset!");
static_assert(offsetof(UWBP_ItemStorage_C, ItemSlot_5) == 0x000440, "Member 'UWBP_ItemStorage_C::ItemSlot_5' has a wrong offset!");
static_assert(offsetof(UWBP_ItemStorage_C, ItemSlot_6) == 0x000448, "Member 'UWBP_ItemStorage_C::ItemSlot_6' has a wrong offset!");
static_assert(offsetof(UWBP_ItemStorage_C, ItemSlot_7) == 0x000450, "Member 'UWBP_ItemStorage_C::ItemSlot_7' has a wrong offset!");
static_assert(offsetof(UWBP_ItemStorage_C, ItemSlot_8) == 0x000458, "Member 'UWBP_ItemStorage_C::ItemSlot_8' has a wrong offset!");
static_assert(offsetof(UWBP_ItemStorage_C, ItemSlot_9) == 0x000460, "Member 'UWBP_ItemStorage_C::ItemSlot_9' has a wrong offset!");
static_assert(offsetof(UWBP_ItemStorage_C, ItemSlot_10) == 0x000468, "Member 'UWBP_ItemStorage_C::ItemSlot_10' has a wrong offset!");
static_assert(offsetof(UWBP_ItemStorage_C, ItemSlot_11) == 0x000470, "Member 'UWBP_ItemStorage_C::ItemSlot_11' has a wrong offset!");

}

