#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RelicActivationInfo

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RelicActivationInfo.WBP_RelicActivationInfo_C
// 0x0020 (0x03B8 - 0x0398)
class UWBP_RelicActivationInfo_C final : public URelicActivationInfo
{
public:
	class UCommonRichTextBlock*                   InsufficientEssenceCostLabel;                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicInfoEntry_C*                  WBP_RelicInfoEntry;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicInfoEntry_C*                  WBP_RelicInfoEntry_1;                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicInfoEntry_C*                  WBP_RelicInfoEntry_2;                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RelicActivationInfo_C">();
	}
	static class UWBP_RelicActivationInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RelicActivationInfo_C>();
	}
};
static_assert(alignof(UWBP_RelicActivationInfo_C) == 0x000008, "Wrong alignment on UWBP_RelicActivationInfo_C");
static_assert(sizeof(UWBP_RelicActivationInfo_C) == 0x0003B8, "Wrong size on UWBP_RelicActivationInfo_C");
static_assert(offsetof(UWBP_RelicActivationInfo_C, InsufficientEssenceCostLabel) == 0x000398, "Member 'UWBP_RelicActivationInfo_C::InsufficientEssenceCostLabel' has a wrong offset!");
static_assert(offsetof(UWBP_RelicActivationInfo_C, WBP_RelicInfoEntry) == 0x0003A0, "Member 'UWBP_RelicActivationInfo_C::WBP_RelicInfoEntry' has a wrong offset!");
static_assert(offsetof(UWBP_RelicActivationInfo_C, WBP_RelicInfoEntry_1) == 0x0003A8, "Member 'UWBP_RelicActivationInfo_C::WBP_RelicInfoEntry_1' has a wrong offset!");
static_assert(offsetof(UWBP_RelicActivationInfo_C, WBP_RelicInfoEntry_2) == 0x0003B0, "Member 'UWBP_RelicActivationInfo_C::WBP_RelicInfoEntry_2' has a wrong offset!");

}

