#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReliquaryMenu

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReliquaryMenu.WBP_ReliquaryMenu_C
// 0x0068 (0x0490 - 0x0428)
class UWBP_ReliquaryMenu_C final : public UReliquaryMenu
{
public:
	class USizeBox*                               SzB_MainWidth;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_NodeEssenceLabel;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_NodeEssenceLabel_1;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicItemSlot_C*                   WBP_RelicItem_1;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicItemSlot_C*                   WBP_RelicItem_2;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicItemSlot_C*                   WBP_RelicItem_3;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicItemSlot_C*                   WBP_RelicItem_4;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicItemSlot_C*                   WBP_RelicItem_5;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicItemSlot_C*                   WBP_RelicItem_6;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicItemSlot_C*                   WBP_RelicItem_7;                                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicItemSlot_C*                   WBP_RelicItem_8;                                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicItemSlot_C*                   WBP_RelicItem_9;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelicItemSlot_C*                   WBP_RelicItem_147;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReliquaryMenu_C">();
	}
	static class UWBP_ReliquaryMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReliquaryMenu_C>();
	}
};
static_assert(alignof(UWBP_ReliquaryMenu_C) == 0x000008, "Wrong alignment on UWBP_ReliquaryMenu_C");
static_assert(sizeof(UWBP_ReliquaryMenu_C) == 0x000490, "Wrong size on UWBP_ReliquaryMenu_C");
static_assert(offsetof(UWBP_ReliquaryMenu_C, SzB_MainWidth) == 0x000428, "Member 'UWBP_ReliquaryMenu_C::SzB_MainWidth' has a wrong offset!");
static_assert(offsetof(UWBP_ReliquaryMenu_C, TB_NodeEssenceLabel) == 0x000430, "Member 'UWBP_ReliquaryMenu_C::TB_NodeEssenceLabel' has a wrong offset!");
static_assert(offsetof(UWBP_ReliquaryMenu_C, TB_NodeEssenceLabel_1) == 0x000438, "Member 'UWBP_ReliquaryMenu_C::TB_NodeEssenceLabel_1' has a wrong offset!");
static_assert(offsetof(UWBP_ReliquaryMenu_C, WBP_RelicItem_1) == 0x000440, "Member 'UWBP_ReliquaryMenu_C::WBP_RelicItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_ReliquaryMenu_C, WBP_RelicItem_2) == 0x000448, "Member 'UWBP_ReliquaryMenu_C::WBP_RelicItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_ReliquaryMenu_C, WBP_RelicItem_3) == 0x000450, "Member 'UWBP_ReliquaryMenu_C::WBP_RelicItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_ReliquaryMenu_C, WBP_RelicItem_4) == 0x000458, "Member 'UWBP_ReliquaryMenu_C::WBP_RelicItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_ReliquaryMenu_C, WBP_RelicItem_5) == 0x000460, "Member 'UWBP_ReliquaryMenu_C::WBP_RelicItem_5' has a wrong offset!");
static_assert(offsetof(UWBP_ReliquaryMenu_C, WBP_RelicItem_6) == 0x000468, "Member 'UWBP_ReliquaryMenu_C::WBP_RelicItem_6' has a wrong offset!");
static_assert(offsetof(UWBP_ReliquaryMenu_C, WBP_RelicItem_7) == 0x000470, "Member 'UWBP_ReliquaryMenu_C::WBP_RelicItem_7' has a wrong offset!");
static_assert(offsetof(UWBP_ReliquaryMenu_C, WBP_RelicItem_8) == 0x000478, "Member 'UWBP_ReliquaryMenu_C::WBP_RelicItem_8' has a wrong offset!");
static_assert(offsetof(UWBP_ReliquaryMenu_C, WBP_RelicItem_9) == 0x000480, "Member 'UWBP_ReliquaryMenu_C::WBP_RelicItem_9' has a wrong offset!");
static_assert(offsetof(UWBP_ReliquaryMenu_C, WBP_RelicItem_147) == 0x000488, "Member 'UWBP_ReliquaryMenu_C::WBP_RelicItem_147' has a wrong offset!");

}

