#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActiveWarPhaseItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActiveWarPhaseItem.WBP_ActiveWarPhaseItem_C
// 0x0030 (0x0368 - 0x0338)
class UWBP_ActiveWarPhaseItem_C final : public UActiveWarPhaseItem
{
public:
	class UImage*                                 ActivePhaseBorder;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WarEventResult_C*                  WBP_WarEventResult;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WarEventResult_C*                  WBP_WarEventResult_1;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WarEventResult_C*                  WBP_WarEventResult_2;                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WarRuleItem_C*                     WBP_WarRuleItem;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WarRuleItem_C*                     WBP_WarRuleItem_1;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ActiveWarPhaseItem_C">();
	}
	static class UWBP_ActiveWarPhaseItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActiveWarPhaseItem_C>();
	}
};
static_assert(alignof(UWBP_ActiveWarPhaseItem_C) == 0x000008, "Wrong alignment on UWBP_ActiveWarPhaseItem_C");
static_assert(sizeof(UWBP_ActiveWarPhaseItem_C) == 0x000368, "Wrong size on UWBP_ActiveWarPhaseItem_C");
static_assert(offsetof(UWBP_ActiveWarPhaseItem_C, ActivePhaseBorder) == 0x000338, "Member 'UWBP_ActiveWarPhaseItem_C::ActivePhaseBorder' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveWarPhaseItem_C, WBP_WarEventResult) == 0x000340, "Member 'UWBP_ActiveWarPhaseItem_C::WBP_WarEventResult' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveWarPhaseItem_C, WBP_WarEventResult_1) == 0x000348, "Member 'UWBP_ActiveWarPhaseItem_C::WBP_WarEventResult_1' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveWarPhaseItem_C, WBP_WarEventResult_2) == 0x000350, "Member 'UWBP_ActiveWarPhaseItem_C::WBP_WarEventResult_2' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveWarPhaseItem_C, WBP_WarRuleItem) == 0x000358, "Member 'UWBP_ActiveWarPhaseItem_C::WBP_WarRuleItem' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveWarPhaseItem_C, WBP_WarRuleItem_1) == 0x000360, "Member 'UWBP_ActiveWarPhaseItem_C::WBP_WarRuleItem_1' has a wrong offset!");

}

