#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatInspectorBar

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatInspectorBar.WBP_StatInspectorBar_C
// 0x0050 (0x0340 - 0x02F0)
class UWBP_StatInspectorBar_C final : public UUserWidget
{
public:
	class UTextBlock*                             NameText;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Overline;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RatingText;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RatingTextSizeBox;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RatingTextSizeBox_1;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ServerRatingText;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ServerValueText;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ServerValueText_SizeBox;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueText;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ValueTextSizeBox;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatInspectorBar_C">();
	}
	static class UWBP_StatInspectorBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatInspectorBar_C>();
	}
};
static_assert(alignof(UWBP_StatInspectorBar_C) == 0x000008, "Wrong alignment on UWBP_StatInspectorBar_C");
static_assert(sizeof(UWBP_StatInspectorBar_C) == 0x000340, "Wrong size on UWBP_StatInspectorBar_C");
static_assert(offsetof(UWBP_StatInspectorBar_C, NameText) == 0x0002F0, "Member 'UWBP_StatInspectorBar_C::NameText' has a wrong offset!");
static_assert(offsetof(UWBP_StatInspectorBar_C, Overline) == 0x0002F8, "Member 'UWBP_StatInspectorBar_C::Overline' has a wrong offset!");
static_assert(offsetof(UWBP_StatInspectorBar_C, RatingText) == 0x000300, "Member 'UWBP_StatInspectorBar_C::RatingText' has a wrong offset!");
static_assert(offsetof(UWBP_StatInspectorBar_C, RatingTextSizeBox) == 0x000308, "Member 'UWBP_StatInspectorBar_C::RatingTextSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_StatInspectorBar_C, RatingTextSizeBox_1) == 0x000310, "Member 'UWBP_StatInspectorBar_C::RatingTextSizeBox_1' has a wrong offset!");
static_assert(offsetof(UWBP_StatInspectorBar_C, ServerRatingText) == 0x000318, "Member 'UWBP_StatInspectorBar_C::ServerRatingText' has a wrong offset!");
static_assert(offsetof(UWBP_StatInspectorBar_C, ServerValueText) == 0x000320, "Member 'UWBP_StatInspectorBar_C::ServerValueText' has a wrong offset!");
static_assert(offsetof(UWBP_StatInspectorBar_C, ServerValueText_SizeBox) == 0x000328, "Member 'UWBP_StatInspectorBar_C::ServerValueText_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_StatInspectorBar_C, ValueText) == 0x000330, "Member 'UWBP_StatInspectorBar_C::ValueText' has a wrong offset!");
static_assert(offsetof(UWBP_StatInspectorBar_C, ValueTextSizeBox) == 0x000338, "Member 'UWBP_StatInspectorBar_C::ValueTextSizeBox' has a wrong offset!");

}

