#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ListItem.WBP_ListItem_C
// 0x0040 (0x16E0 - 0x16A0)
class UWBP_ListItem_C final : public UAoCCommonButtonBase
{
public:
	uint8                                         Pad_1698[0x8];                                     // 0x1698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 AtWarIcon;                                         // 0x16A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CraftablePip;                                      // 0x16A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    LabelTextBlock;                                    // 0x16B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockedStateIcon;                                   // 0x16B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MasteryIcon;                                       // 0x16C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnderSiegeIcon;                                    // 0x16C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnreadNotifier;                                    // 0x16D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UAoCCommonButtonBase* GetButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ListItem_C">();
	}
	static class UWBP_ListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ListItem_C>();
	}
};
static_assert(alignof(UWBP_ListItem_C) == 0x000010, "Wrong alignment on UWBP_ListItem_C");
static_assert(sizeof(UWBP_ListItem_C) == 0x0016E0, "Wrong size on UWBP_ListItem_C");
static_assert(offsetof(UWBP_ListItem_C, AtWarIcon) == 0x0016A0, "Member 'UWBP_ListItem_C::AtWarIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ListItem_C, CraftablePip) == 0x0016A8, "Member 'UWBP_ListItem_C::CraftablePip' has a wrong offset!");
static_assert(offsetof(UWBP_ListItem_C, LabelTextBlock) == 0x0016B0, "Member 'UWBP_ListItem_C::LabelTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ListItem_C, LockedStateIcon) == 0x0016B8, "Member 'UWBP_ListItem_C::LockedStateIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ListItem_C, MasteryIcon) == 0x0016C0, "Member 'UWBP_ListItem_C::MasteryIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ListItem_C, UnderSiegeIcon) == 0x0016C8, "Member 'UWBP_ListItem_C::UnderSiegeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ListItem_C, UnreadNotifier) == 0x0016D0, "Member 'UWBP_ListItem_C::UnreadNotifier' has a wrong offset!");

}

