#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SiegeMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SiegeMenu.WBP_SiegeMenu_C
// 0x0020 (0x0688 - 0x0668)
class UWBP_SiegeMenu_C final : public USiegeMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScrollWindow;                                      // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SiegeListSwitcher;                                 // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_DurationLabel;                                  // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SiegeMenu(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SiegeMenu_C">();
	}
	static class UWBP_SiegeMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SiegeMenu_C>();
	}
};
static_assert(alignof(UWBP_SiegeMenu_C) == 0x000008, "Wrong alignment on UWBP_SiegeMenu_C");
static_assert(sizeof(UWBP_SiegeMenu_C) == 0x000688, "Wrong size on UWBP_SiegeMenu_C");
static_assert(offsetof(UWBP_SiegeMenu_C, UberGraphFrame) == 0x000668, "Member 'UWBP_SiegeMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SiegeMenu_C, ScrollWindow) == 0x000670, "Member 'UWBP_SiegeMenu_C::ScrollWindow' has a wrong offset!");
static_assert(offsetof(UWBP_SiegeMenu_C, SiegeListSwitcher) == 0x000678, "Member 'UWBP_SiegeMenu_C::SiegeListSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_SiegeMenu_C, TB_DurationLabel) == 0x000680, "Member 'UWBP_SiegeMenu_C::TB_DurationLabel' has a wrong offset!");

}

