#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GuildMenu

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GuildMenu.WBP_GuildMenu_C
// 0x0038 (0x0728 - 0x06F0)
class UWBP_GuildMenu_C final : public UGuildMenu
{
public:
	class UVerticalBox*                           AccordionsList;                                    // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        GuildIcon;                                         // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScrollWindow;                                      // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_GuildLevelLabel;                                // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeWarCharge_C*                   WBP_NodeWarCharge;                                 // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeWarCharge_C*                   WBP_NodeWarCharge_1;                               // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeWarCharge_C*                   WBP_NodeWarCharge_2;                               // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GuildMenu_C">();
	}
	static class UWBP_GuildMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GuildMenu_C>();
	}
};
static_assert(alignof(UWBP_GuildMenu_C) == 0x000008, "Wrong alignment on UWBP_GuildMenu_C");
static_assert(sizeof(UWBP_GuildMenu_C) == 0x000728, "Wrong size on UWBP_GuildMenu_C");
static_assert(offsetof(UWBP_GuildMenu_C, AccordionsList) == 0x0006F0, "Member 'UWBP_GuildMenu_C::AccordionsList' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMenu_C, GuildIcon) == 0x0006F8, "Member 'UWBP_GuildMenu_C::GuildIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMenu_C, ScrollWindow) == 0x000700, "Member 'UWBP_GuildMenu_C::ScrollWindow' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMenu_C, TB_GuildLevelLabel) == 0x000708, "Member 'UWBP_GuildMenu_C::TB_GuildLevelLabel' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMenu_C, WBP_NodeWarCharge) == 0x000710, "Member 'UWBP_GuildMenu_C::WBP_NodeWarCharge' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMenu_C, WBP_NodeWarCharge_1) == 0x000718, "Member 'UWBP_GuildMenu_C::WBP_NodeWarCharge_1' has a wrong offset!");
static_assert(offsetof(UWBP_GuildMenu_C, WBP_NodeWarCharge_2) == 0x000720, "Member 'UWBP_GuildMenu_C::WBP_NodeWarCharge_2' has a wrong offset!");

}

