#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CC_SculptWidget

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CC_SculptWidget.WBP_CC_SculptWidget_C
// 0x0050 (0x03B8 - 0x0368)
class UWBP_CC_SculptWidget_C final : public UCC_SculptWidget
{
public:
	class UOverlay*                               ButtonsPanel;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_PanelVignette;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMorphTool_C*                           MorphTool;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_CC_C*                 ScrollBox;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonButton_C*                        ScrollDownButton;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonButton_C*                        ScrollUpButton;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CC_SculptSubcategoryItem_C*        WBP_SculptSubcategoryItem;                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CC_SculptSubcategoryItem_C*        WBP_SculptSubcategoryItem_1;                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CC_SculptSubcategoryItem_C*        WBP_SculptSubcategoryItem_2;                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CC_SculptSubcategoryItem_C*        WBP_SculptSubcategoryItem_3;                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CC_SculptWidget_C">();
	}
	static class UWBP_CC_SculptWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CC_SculptWidget_C>();
	}
};
static_assert(alignof(UWBP_CC_SculptWidget_C) == 0x000008, "Wrong alignment on UWBP_CC_SculptWidget_C");
static_assert(sizeof(UWBP_CC_SculptWidget_C) == 0x0003B8, "Wrong size on UWBP_CC_SculptWidget_C");
static_assert(offsetof(UWBP_CC_SculptWidget_C, ButtonsPanel) == 0x000368, "Member 'UWBP_CC_SculptWidget_C::ButtonsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_CC_SculptWidget_C, IMG_PanelVignette) == 0x000370, "Member 'UWBP_CC_SculptWidget_C::IMG_PanelVignette' has a wrong offset!");
static_assert(offsetof(UWBP_CC_SculptWidget_C, MorphTool) == 0x000378, "Member 'UWBP_CC_SculptWidget_C::MorphTool' has a wrong offset!");
static_assert(offsetof(UWBP_CC_SculptWidget_C, ScrollBox) == 0x000380, "Member 'UWBP_CC_SculptWidget_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_CC_SculptWidget_C, ScrollDownButton) == 0x000388, "Member 'UWBP_CC_SculptWidget_C::ScrollDownButton' has a wrong offset!");
static_assert(offsetof(UWBP_CC_SculptWidget_C, ScrollUpButton) == 0x000390, "Member 'UWBP_CC_SculptWidget_C::ScrollUpButton' has a wrong offset!");
static_assert(offsetof(UWBP_CC_SculptWidget_C, WBP_SculptSubcategoryItem) == 0x000398, "Member 'UWBP_CC_SculptWidget_C::WBP_SculptSubcategoryItem' has a wrong offset!");
static_assert(offsetof(UWBP_CC_SculptWidget_C, WBP_SculptSubcategoryItem_1) == 0x0003A0, "Member 'UWBP_CC_SculptWidget_C::WBP_SculptSubcategoryItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_CC_SculptWidget_C, WBP_SculptSubcategoryItem_2) == 0x0003A8, "Member 'UWBP_CC_SculptWidget_C::WBP_SculptSubcategoryItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_CC_SculptWidget_C, WBP_SculptSubcategoryItem_3) == 0x0003B0, "Member 'UWBP_CC_SculptWidget_C::WBP_SculptSubcategoryItem_3' has a wrong offset!");

}

