#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChatWindow

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ChatWindow.WBP_ChatWindow_C.ExecuteUbergraph_WBP_ChatWindow
// 0x0020 (0x0020 - 0x0000)
struct WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UChatTab*>                       CallFunc_Map_Values_Values;                        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UChatTab*                               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow) == 0x000008, "Wrong alignment on WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow");
static_assert(sizeof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow) == 0x000020, "Wrong size on WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, EntryPoint) == 0x000000, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_Map_Values_Values) == 0x000008, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_Array_Get_Item' has a wrong offset!");

}

