#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DodgeRadial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DodgeRadial.WBP_DodgeRadial_C
// 0x0018 (0x0308 - 0x02F0)
class UWBP_DodgeRadial_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_81;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URadialSlider*                          RadialSlider_0;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent();
	void ExecuteUbergraph_WBP_DodgeRadial(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DodgeRadial_C">();
	}
	static class UWBP_DodgeRadial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DodgeRadial_C>();
	}
};
static_assert(alignof(UWBP_DodgeRadial_C) == 0x000008, "Wrong alignment on UWBP_DodgeRadial_C");
static_assert(sizeof(UWBP_DodgeRadial_C) == 0x000308, "Wrong size on UWBP_DodgeRadial_C");
static_assert(offsetof(UWBP_DodgeRadial_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_DodgeRadial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DodgeRadial_C, Image_81) == 0x0002F8, "Member 'UWBP_DodgeRadial_C::Image_81' has a wrong offset!");
static_assert(offsetof(UWBP_DodgeRadial_C, RadialSlider_0) == 0x000300, "Member 'UWBP_DodgeRadial_C::RadialSlider_0' has a wrong offset!");

}

