#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NodeRelationshipSummary

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NodeRelationshipSummary.WBP_NodeRelationshipSummary_C
// 0x0058 (0x0578 - 0x0520)
class UWBP_NodeRelationshipSummary_C final : public UNodeRelationshipsSummary
{
public:
	class UImage*                                 NodeStatusIcon;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    NodeStatusTextBlock;                               // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_HistorySectionLabel;                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_SovereignNodeLabel;                             // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_VerticalSeparator;                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrentWarHistoryItem_C*           WBP_CurrentWarHistoryItem;                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrentWarHistoryItem_C*           WBP_CurrentWarHistoryItem_1;                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrentWarHistoryItem_C*           WBP_CurrentWarHistoryItem_2;                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeWarCharge_C*                   WBP_NodeWarCharge;                                 // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeWarCharge_C*                   WBP_NodeWarCharge_1;                               // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NodeWarCharge_C*                   WBP_NodeWarCharge_2;                               // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NodeRelationshipSummary_C">();
	}
	static class UWBP_NodeRelationshipSummary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NodeRelationshipSummary_C>();
	}
};
static_assert(alignof(UWBP_NodeRelationshipSummary_C) == 0x000008, "Wrong alignment on UWBP_NodeRelationshipSummary_C");
static_assert(sizeof(UWBP_NodeRelationshipSummary_C) == 0x000578, "Wrong size on UWBP_NodeRelationshipSummary_C");
static_assert(offsetof(UWBP_NodeRelationshipSummary_C, NodeStatusIcon) == 0x000520, "Member 'UWBP_NodeRelationshipSummary_C::NodeStatusIcon' has a wrong offset!");
static_assert(offsetof(UWBP_NodeRelationshipSummary_C, NodeStatusTextBlock) == 0x000528, "Member 'UWBP_NodeRelationshipSummary_C::NodeStatusTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_NodeRelationshipSummary_C, TB_HistorySectionLabel) == 0x000530, "Member 'UWBP_NodeRelationshipSummary_C::TB_HistorySectionLabel' has a wrong offset!");
static_assert(offsetof(UWBP_NodeRelationshipSummary_C, TB_SovereignNodeLabel) == 0x000538, "Member 'UWBP_NodeRelationshipSummary_C::TB_SovereignNodeLabel' has a wrong offset!");
static_assert(offsetof(UWBP_NodeRelationshipSummary_C, TB_VerticalSeparator) == 0x000540, "Member 'UWBP_NodeRelationshipSummary_C::TB_VerticalSeparator' has a wrong offset!");
static_assert(offsetof(UWBP_NodeRelationshipSummary_C, WBP_CurrentWarHistoryItem) == 0x000548, "Member 'UWBP_NodeRelationshipSummary_C::WBP_CurrentWarHistoryItem' has a wrong offset!");
static_assert(offsetof(UWBP_NodeRelationshipSummary_C, WBP_CurrentWarHistoryItem_1) == 0x000550, "Member 'UWBP_NodeRelationshipSummary_C::WBP_CurrentWarHistoryItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_NodeRelationshipSummary_C, WBP_CurrentWarHistoryItem_2) == 0x000558, "Member 'UWBP_NodeRelationshipSummary_C::WBP_CurrentWarHistoryItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_NodeRelationshipSummary_C, WBP_NodeWarCharge) == 0x000560, "Member 'UWBP_NodeRelationshipSummary_C::WBP_NodeWarCharge' has a wrong offset!");
static_assert(offsetof(UWBP_NodeRelationshipSummary_C, WBP_NodeWarCharge_1) == 0x000568, "Member 'UWBP_NodeRelationshipSummary_C::WBP_NodeWarCharge_1' has a wrong offset!");
static_assert(offsetof(UWBP_NodeRelationshipSummary_C, WBP_NodeWarCharge_2) == 0x000570, "Member 'UWBP_NodeRelationshipSummary_C::WBP_NodeWarCharge_2' has a wrong offset!");

}

