#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VotingWindowItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VotingWindowItem.WBP_VotingWindowItem_C
// 0x0030 (0x0368 - 0x0338)
class UWBP_VotingWindowItem_C final : public UVotingWindowItem
{
public:
	class UCommonBorder*                          B_AlternatingBG;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GuildTextBlock;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NameTextBlock;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Checkbox_C*                        Rank1CheckBox;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Checkbox_C*                        Rank2CheckBox;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Checkbox_C*                        Rank3CheckBox;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VotingWindowItem_C">();
	}
	static class UWBP_VotingWindowItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VotingWindowItem_C>();
	}
};
static_assert(alignof(UWBP_VotingWindowItem_C) == 0x000008, "Wrong alignment on UWBP_VotingWindowItem_C");
static_assert(sizeof(UWBP_VotingWindowItem_C) == 0x000368, "Wrong size on UWBP_VotingWindowItem_C");
static_assert(offsetof(UWBP_VotingWindowItem_C, B_AlternatingBG) == 0x000338, "Member 'UWBP_VotingWindowItem_C::B_AlternatingBG' has a wrong offset!");
static_assert(offsetof(UWBP_VotingWindowItem_C, GuildTextBlock) == 0x000340, "Member 'UWBP_VotingWindowItem_C::GuildTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_VotingWindowItem_C, NameTextBlock) == 0x000348, "Member 'UWBP_VotingWindowItem_C::NameTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_VotingWindowItem_C, Rank1CheckBox) == 0x000350, "Member 'UWBP_VotingWindowItem_C::Rank1CheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_VotingWindowItem_C, Rank2CheckBox) == 0x000358, "Member 'UWBP_VotingWindowItem_C::Rank2CheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_VotingWindowItem_C, Rank3CheckBox) == 0x000360, "Member 'UWBP_VotingWindowItem_C::Rank3CheckBox' has a wrong offset!");

}

