#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TemperingMenu

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TemperingMenu.WBP_TemperingMenu_C
// 0x0040 (0x06B0 - 0x0670)
class UWBP_TemperingMenu_C final : public UTemperingMenu
{
public:
	class UVerticalBox*                           CostContents;                                      // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    InactiveMessagingText;                             // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               O_CostSection;                                     // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        TemperingCostItem;                                 // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TemperingItem_C*                   WBP_TemperingItem;                                 // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TemperingItem_C*                   WBP_TemperingItem_1;                               // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TemperingItem_C*                   WBP_TemperingItem_2;                               // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TemperingItem_C*                   WBP_TemperingItem_3;                               // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TemperingMenu_C">();
	}
	static class UWBP_TemperingMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TemperingMenu_C>();
	}
};
static_assert(alignof(UWBP_TemperingMenu_C) == 0x000008, "Wrong alignment on UWBP_TemperingMenu_C");
static_assert(sizeof(UWBP_TemperingMenu_C) == 0x0006B0, "Wrong size on UWBP_TemperingMenu_C");
static_assert(offsetof(UWBP_TemperingMenu_C, CostContents) == 0x000670, "Member 'UWBP_TemperingMenu_C::CostContents' has a wrong offset!");
static_assert(offsetof(UWBP_TemperingMenu_C, InactiveMessagingText) == 0x000678, "Member 'UWBP_TemperingMenu_C::InactiveMessagingText' has a wrong offset!");
static_assert(offsetof(UWBP_TemperingMenu_C, O_CostSection) == 0x000680, "Member 'UWBP_TemperingMenu_C::O_CostSection' has a wrong offset!");
static_assert(offsetof(UWBP_TemperingMenu_C, TemperingCostItem) == 0x000688, "Member 'UWBP_TemperingMenu_C::TemperingCostItem' has a wrong offset!");
static_assert(offsetof(UWBP_TemperingMenu_C, WBP_TemperingItem) == 0x000690, "Member 'UWBP_TemperingMenu_C::WBP_TemperingItem' has a wrong offset!");
static_assert(offsetof(UWBP_TemperingMenu_C, WBP_TemperingItem_1) == 0x000698, "Member 'UWBP_TemperingMenu_C::WBP_TemperingItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_TemperingMenu_C, WBP_TemperingItem_2) == 0x0006A0, "Member 'UWBP_TemperingMenu_C::WBP_TemperingItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_TemperingMenu_C, WBP_TemperingItem_3) == 0x0006A8, "Member 'UWBP_TemperingMenu_C::WBP_TemperingItem_3' has a wrong offset!");

}

