#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PhaseSummaryItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PhaseSummaryItem.WBP_PhaseSummaryItem_C
// 0x0048 (0x0550 - 0x0508)
class UWBP_PhaseSummaryItem_C final : public UPhaseSummaryItem
{
public:
	class UAoCCommonTextBlock*                    CompletionStatusText;                              // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_CompletedIcon;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PhaseImage;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_CompletionStatusLabel;                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PhaseSummaryEventItem_C*           WBP_PhaseSummaryEventItem;                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PhaseSummaryEventItem_C*           WBP_PhaseSummaryEventItem_1;                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WarRuleItem_C*                     WBP_WarRuleItem;                                   // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WarRuleItem_C*                     WBP_WarRuleItem_1;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WarRuleItem_C*                     WBP_WarRuleItem_2;                                 // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PhaseSummaryItem_C">();
	}
	static class UWBP_PhaseSummaryItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PhaseSummaryItem_C>();
	}
};
static_assert(alignof(UWBP_PhaseSummaryItem_C) == 0x000008, "Wrong alignment on UWBP_PhaseSummaryItem_C");
static_assert(sizeof(UWBP_PhaseSummaryItem_C) == 0x000550, "Wrong size on UWBP_PhaseSummaryItem_C");
static_assert(offsetof(UWBP_PhaseSummaryItem_C, CompletionStatusText) == 0x000508, "Member 'UWBP_PhaseSummaryItem_C::CompletionStatusText' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryItem_C, IMG_CompletedIcon) == 0x000510, "Member 'UWBP_PhaseSummaryItem_C::IMG_CompletedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryItem_C, PhaseImage) == 0x000518, "Member 'UWBP_PhaseSummaryItem_C::PhaseImage' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryItem_C, TB_CompletionStatusLabel) == 0x000520, "Member 'UWBP_PhaseSummaryItem_C::TB_CompletionStatusLabel' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryItem_C, WBP_PhaseSummaryEventItem) == 0x000528, "Member 'UWBP_PhaseSummaryItem_C::WBP_PhaseSummaryEventItem' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryItem_C, WBP_PhaseSummaryEventItem_1) == 0x000530, "Member 'UWBP_PhaseSummaryItem_C::WBP_PhaseSummaryEventItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryItem_C, WBP_WarRuleItem) == 0x000538, "Member 'UWBP_PhaseSummaryItem_C::WBP_WarRuleItem' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryItem_C, WBP_WarRuleItem_1) == 0x000540, "Member 'UWBP_PhaseSummaryItem_C::WBP_WarRuleItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_PhaseSummaryItem_C, WBP_WarRuleItem_2) == 0x000548, "Member 'UWBP_PhaseSummaryItem_C::WBP_WarRuleItem_2' has a wrong offset!");

}

