#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatInspector

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_StatInspector.WBP_StatInspector_C.UpdateStatNameIndex
// 0x001C (0x001C - 0x0000)
struct WBP_StatInspector_C_UpdateStatNameIndex final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatInspector_C_UpdateStatNameIndex) == 0x000004, "Wrong alignment on WBP_StatInspector_C_UpdateStatNameIndex");
static_assert(sizeof(WBP_StatInspector_C_UpdateStatNameIndex) == 0x00001C, "Wrong size on WBP_StatInspector_C_UpdateStatNameIndex");
static_assert(offsetof(WBP_StatInspector_C_UpdateStatNameIndex, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_StatInspector_C_UpdateStatNameIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_UpdateStatNameIndex, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_StatInspector_C_UpdateStatNameIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_UpdateStatNameIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_StatInspector_C_UpdateStatNameIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_UpdateStatNameIndex, CallFunc_Array_Get_Item) == 0x00000C, "Member 'WBP_StatInspector_C_UpdateStatNameIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_UpdateStatNameIndex, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_StatInspector_C_UpdateStatNameIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_UpdateStatNameIndex, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_StatInspector_C_UpdateStatNameIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_StatInspector.WBP_StatInspector_C.TrimBars
// 0x0020 (0x0020 - 0x0000)
struct WBP_StatInspector_C_TrimBars final
{
public:
	int32                                         NumBars;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           vertBox;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatInspector_C_TrimBars) == 0x000008, "Wrong alignment on WBP_StatInspector_C_TrimBars");
static_assert(sizeof(WBP_StatInspector_C_TrimBars) == 0x000020, "Wrong size on WBP_StatInspector_C_TrimBars");
static_assert(offsetof(WBP_StatInspector_C_TrimBars, NumBars) == 0x000000, "Member 'WBP_StatInspector_C_TrimBars::NumBars' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_TrimBars, vertBox) == 0x000008, "Member 'WBP_StatInspector_C_TrimBars::vertBox' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_TrimBars, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'WBP_StatInspector_C_TrimBars::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_TrimBars, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'WBP_StatInspector_C_TrimBars::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_TrimBars, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WBP_StatInspector_C_TrimBars::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_TrimBars, CallFunc_RemoveChildAt_ReturnValue) == 0x00001C, "Member 'WBP_StatInspector_C_TrimBars::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");

// Function WBP_StatInspector.WBP_StatInspector_C.SetToggleTextColor
// 0x002C (0x002C - 0x0000)
struct WBP_StatInspector_C_SetToggleTextColor final
{
public:
	bool                                          isSelf;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
};
static_assert(alignof(WBP_StatInspector_C_SetToggleTextColor) == 0x000004, "Wrong alignment on WBP_StatInspector_C_SetToggleTextColor");
static_assert(sizeof(WBP_StatInspector_C_SetToggleTextColor) == 0x00002C, "Wrong size on WBP_StatInspector_C_SetToggleTextColor");
static_assert(offsetof(WBP_StatInspector_C_SetToggleTextColor, isSelf) == 0x000000, "Member 'WBP_StatInspector_C_SetToggleTextColor::isSelf' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetToggleTextColor, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'WBP_StatInspector_C_SetToggleTextColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetToggleTextColor, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'WBP_StatInspector_C_SetToggleTextColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function WBP_StatInspector.WBP_StatInspector_C.SetTextColorByValue
// 0x0050 (0x0050 - 0x0000)
struct WBP_StatInspector_C_SetTextColorByValue final
{
public:
	class UTextBlock*                             Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Value;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            UniqueObjectNameForCooking_SlateColor;             // 0x0014(0x0014)()
	struct FSlateColor                            UniqueObjectNameForCooking_SlateColor_1;           // 0x0028(0x0014)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x003C(0x0014)()
};
static_assert(alignof(WBP_StatInspector_C_SetTextColorByValue) == 0x000008, "Wrong alignment on WBP_StatInspector_C_SetTextColorByValue");
static_assert(sizeof(WBP_StatInspector_C_SetTextColorByValue) == 0x000050, "Wrong size on WBP_StatInspector_C_SetTextColorByValue");
static_assert(offsetof(WBP_StatInspector_C_SetTextColorByValue, Text) == 0x000000, "Member 'WBP_StatInspector_C_SetTextColorByValue::Text' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetTextColorByValue, Value) == 0x000008, "Member 'WBP_StatInspector_C_SetTextColorByValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetTextColorByValue, Temp_bool_Variable) == 0x000010, "Member 'WBP_StatInspector_C_SetTextColorByValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetTextColorByValue, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000011, "Member 'WBP_StatInspector_C_SetTextColorByValue::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetTextColorByValue, UniqueObjectNameForCooking_SlateColor) == 0x000014, "Member 'WBP_StatInspector_C_SetTextColorByValue::UniqueObjectNameForCooking_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetTextColorByValue, UniqueObjectNameForCooking_SlateColor_1) == 0x000028, "Member 'WBP_StatInspector_C_SetTextColorByValue::UniqueObjectNameForCooking_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetTextColorByValue, K2Node_Select_Default) == 0x00003C, "Member 'WBP_StatInspector_C_SetTextColorByValue::K2Node_Select_Default' has a wrong offset!");

// Function WBP_StatInspector.WBP_StatInspector_C.SetTargetClassName
// 0x0050 (0x0050 - 0x0000)
struct WBP_StatInspector_C_SetTargetClassName final
{
public:
	class ABaseCharacter*                         BaseChar;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
};
static_assert(alignof(WBP_StatInspector_C_SetTargetClassName) == 0x000008, "Wrong alignment on WBP_StatInspector_C_SetTargetClassName");
static_assert(sizeof(WBP_StatInspector_C_SetTargetClassName) == 0x000050, "Wrong size on WBP_StatInspector_C_SetTargetClassName");
static_assert(offsetof(WBP_StatInspector_C_SetTargetClassName, BaseChar) == 0x000000, "Member 'WBP_StatInspector_C_SetTargetClassName::BaseChar' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetTargetClassName, CallFunc_GetObjectClass_ReturnValue) == 0x000008, "Member 'WBP_StatInspector_C_SetTargetClassName::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetTargetClassName, CallFunc_GetClassDisplayName_ReturnValue) == 0x000010, "Member 'WBP_StatInspector_C_SetTargetClassName::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetTargetClassName, CallFunc_Len_ReturnValue) == 0x000020, "Member 'WBP_StatInspector_C_SetTargetClassName::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetTargetClassName, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_StatInspector_C_SetTargetClassName::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetTargetClassName, CallFunc_GetSubstring_ReturnValue) == 0x000028, "Member 'WBP_StatInspector_C_SetTargetClassName::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetTargetClassName, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'WBP_StatInspector_C_SetTargetClassName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_StatInspector.WBP_StatInspector_C.SetStatsForActor
// 0x0290 (0x0290 - 0x0000)
struct WBP_StatInspector_C_SetStatsForActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           vertBox;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          hasRating;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          firstStat;                                         // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         numLines;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          anyNonOne;                                         // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          anyNonZero;                                        // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumBars;                                           // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           VisibleList;                                       // 0x0020(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAoCStatsComponent*                     CallFunc_GetStatsComponent_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            UniqueObjectNameForCooking_SlateColor;             // 0x0040(0x0014)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetStatNames_ReturnValue;                 // 0x0058(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FServerStatValues                      CallFunc_Array_Get_Item;                           // 0x0078(0x000C)(NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            UniqueObjectNameForCooking_SlateColor_1;           // 0x0090(0x0014)()
	int32                                         Temp_int_Variable_2;                               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue_1;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0117(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0158(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_StatInspectorBar_C*                CallFunc_GetBar_bar;                               // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameStat_ReturnValue;                  // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Get_Rating_Stat_Name_RatingStatName;      // 0x0194(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Rating_Stat_Name_hasRating;           // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetColorForStat_color;                    // 0x01A0(0x0014)()
	int32                                         CallFunc_Map_Find_Value;                           // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameStat_ReturnValue_1;                // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FServerStatValues                      CallFunc_Array_Get_Item_2;                         // 0x01C0(0x000C)(NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B[0x5];                                      // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0210(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0230(0x0018)()
	int32                                         K2Node_Select_Default_2;                           // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_FilterNames_Out;                          // 0x0250(0x0010)(ReferenceParm)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatAndSetText_value_ImplicitCast;      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatAndSetText_value_ImplicitCast_1;    // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatAndSetText_value_ImplicitCast_2;    // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FormatAndSetText_value_ImplicitCast_3;    // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_Size_ImplicitCast;        // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatInspector_C_SetStatsForActor) == 0x000008, "Wrong alignment on WBP_StatInspector_C_SetStatsForActor");
static_assert(sizeof(WBP_StatInspector_C_SetStatsForActor) == 0x000290, "Wrong size on WBP_StatInspector_C_SetStatsForActor");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Actor) == 0x000000, "Member 'WBP_StatInspector_C_SetStatsForActor::Actor' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, vertBox) == 0x000008, "Member 'WBP_StatInspector_C_SetStatsForActor::vertBox' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, hasRating) == 0x000010, "Member 'WBP_StatInspector_C_SetStatsForActor::hasRating' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, firstStat) == 0x000011, "Member 'WBP_StatInspector_C_SetStatsForActor::firstStat' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, numLines) == 0x000014, "Member 'WBP_StatInspector_C_SetStatsForActor::numLines' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, anyNonOne) == 0x000018, "Member 'WBP_StatInspector_C_SetStatsForActor::anyNonOne' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, anyNonZero) == 0x000019, "Member 'WBP_StatInspector_C_SetStatsForActor::anyNonZero' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, NumBars) == 0x00001C, "Member 'WBP_StatInspector_C_SetStatsForActor::NumBars' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, VisibleList) == 0x000020, "Member 'WBP_StatInspector_C_SetStatsForActor::VisibleList' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Temp_bool_Variable) == 0x000030, "Member 'WBP_StatInspector_C_SetStatsForActor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_GetStatsComponent_ReturnValue) == 0x000038, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_GetStatsComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, UniqueObjectNameForCooking_SlateColor) == 0x000040, "Member 'WBP_StatInspector_C_SetStatsForActor::UniqueObjectNameForCooking_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_GetStatNames_ReturnValue) == 0x000058, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_GetStatNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'WBP_StatInspector_C_SetStatsForActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Temp_int_Array_Index_Variable) == 0x000070, "Member 'WBP_StatInspector_C_SetStatsForActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Temp_int_Variable) == 0x000074, "Member 'WBP_StatInspector_C_SetStatsForActor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000084, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_IsChecked_ReturnValue) == 0x000085, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Not_PreBool_ReturnValue) == 0x000086, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Temp_int_Variable_1) == 0x000088, "Member 'WBP_StatInspector_C_SetStatsForActor::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_BooleanOR_ReturnValue) == 0x00008C, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, UniqueObjectNameForCooking_SlateColor_1) == 0x000090, "Member 'WBP_StatInspector_C_SetStatsForActor::UniqueObjectNameForCooking_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Temp_int_Variable_2) == 0x0000A4, "Member 'WBP_StatInspector_C_SetStatsForActor::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Temp_byte_Variable) == 0x0000A8, "Member 'WBP_StatInspector_C_SetStatsForActor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Conv_IntToString_ReturnValue) == 0x0000B0, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Temp_byte_Variable_1) == 0x0000C0, "Member 'WBP_StatInspector_C_SetStatsForActor::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C8, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Temp_bool_Variable_1) == 0x0000D8, "Member 'WBP_StatInspector_C_SetStatsForActor::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Temp_int_Variable_3) == 0x0000DC, "Member 'WBP_StatInspector_C_SetStatsForActor::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000E8, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F8, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000100, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Add_IntInt_ReturnValue_2) == 0x000110, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_IsChecked_ReturnValue_1) == 0x000114, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_IsChecked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Not_PreBool_ReturnValue_1) == 0x000115, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_BooleanOR_ReturnValue_1) == 0x000116, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Temp_bool_Variable_2) == 0x000117, "Member 'WBP_StatInspector_C_SetStatsForActor::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_BooleanAND_ReturnValue) == 0x000118, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, K2Node_Select_Default) == 0x000120, "Member 'WBP_StatInspector_C_SetStatsForActor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, K2Node_Select_Default_1) == 0x000130, "Member 'WBP_StatInspector_C_SetStatsForActor::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000138, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000148, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Conv_StringToText_ReturnValue) == 0x000158, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Add_IntInt_ReturnValue_3) == 0x000170, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_GetBar_bar) == 0x000178, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_GetBar_bar' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Array_Get_Item_1) == 0x000180, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_GetGameStat_ReturnValue) == 0x00018C, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_GetGameStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Less_IntInt_ReturnValue) == 0x000190, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Get_Rating_Stat_Name_RatingStatName) == 0x000194, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Get_Rating_Stat_Name_RatingStatName' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Get_Rating_Stat_Name_hasRating) == 0x00019C, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Get_Rating_Stat_Name_hasRating' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_GetColorForStat_color) == 0x0001A0, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_GetColorForStat_color' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Map_Find_Value) == 0x0001B4, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Map_Find_ReturnValue) == 0x0001B8, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_GetGameStat_ReturnValue_1) == 0x0001BC, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_GetGameStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Array_Get_Item_2) == 0x0001C0, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0001CC, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Conv_NameToString_ReturnValue) == 0x0001D0, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0001E0, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Contains_ReturnValue) == 0x0001F0, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Replace_ReturnValue) == 0x0001F8, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Contains_ReturnValue_1) == 0x000208, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Array_Contains_ReturnValue) == 0x000209, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Not_PreBool_ReturnValue_2) == 0x00020A, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000210, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_BooleanAND_ReturnValue_1) == 0x000228, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, Temp_int_Variable_4) == 0x00022C, "Member 'WBP_StatInspector_C_SetStatsForActor::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_GetText_ReturnValue) == 0x000230, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, K2Node_Select_Default_2) == 0x000248, "Member 'WBP_StatInspector_C_SetStatsForActor::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_FilterNames_Out) == 0x000250, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_FilterNames_Out' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000260, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_FormatAndSetText_value_ImplicitCast) == 0x000268, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_FormatAndSetText_value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_FormatAndSetText_value_ImplicitCast_1) == 0x000270, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_FormatAndSetText_value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_FormatAndSetText_value_ImplicitCast_2) == 0x000278, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_FormatAndSetText_value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, CallFunc_FormatAndSetText_value_ImplicitCast_3) == 0x000280, "Member 'WBP_StatInspector_C_SetStatsForActor::CallFunc_FormatAndSetText_value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetStatsForActor, K2Node_SetFieldsInStruct_Size_ImplicitCast) == 0x000288, "Member 'WBP_StatInspector_C_SetStatsForActor::K2Node_SetFieldsInStruct_Size_ImplicitCast' has a wrong offset!");

// Function WBP_StatInspector.WBP_StatInspector_C.SetEffectsForActor
// 0x0BE8 (0x0BE8 - 0x0000)
struct WBP_StatInspector_C_SetEffectsForActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           vertBox;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         NumBars;                                           // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAoCStatsComponent*                     CallFunc_GetStatsComponent_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            UniqueObjectNameForCooking_SlateColor;             // 0x0020(0x0014)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEffectInst>                    CallFunc_GetCurrentEffects_ReturnValue;            // 0x0038(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            UniqueObjectNameForCooking_SlateColor_1;           // 0x0050(0x0014)()
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0070(0x0018)()
	struct FFormatArgumentData                    UniqueObjectNameForCooking_FormatArgumentData;     // 0x0088(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            UniqueObjectNameForCooking_Array;                  // 0x00D8(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectInst                            CallFunc_Array_Get_Item;                           // 0x0118(0x0168)(ContainsInstancedReference)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0290(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x02A8(0x0018)()
	struct FEffectRecord                          CallFunc_GetEffectRecordByGuid_ReturnValue;        // 0x02C0(0x0788)(ConstParm)
	struct FFormatArgumentData                    UniqueObjectNameForCooking_FormatArgumentData_1;   // 0x0A48(0x0050)(HasGetValueTypeHash)
	struct FSlateColor                            UniqueObjectNameForCooking_SlateColor_2;           // 0x0A98(0x0014)()
	uint8                                         Pad_AAC[0x4];                                      // 0x0AAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0AB0(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0AC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC9[0x3];                                      // 0x0AC9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0ACC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            UniqueObjectNameForCooking_SlateColor_3;           // 0x0AD0(0x0014)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0AE4(0x0014)()
	struct FSlateColor                            UniqueObjectNameForCooking_SlateColor_4;           // 0x0AF8(0x0014)()
	uint8                                         Pad_B0C[0x4];                                      // 0x0B0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetSynchronizedTimeSeconds_ReturnValue;   // 0x0B10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0B18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x0B20(0x0018)()
	struct FFormatArgumentData                    UniqueObjectNameForCooking_FormatArgumentData_2;   // 0x0B38(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            UniqueObjectNameForCooking_Array_1;                // 0x0B88(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0B98(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0BB0(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0BC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BCC[0x4];                                      // 0x0BCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_StatInspectorBar_C*                CallFunc_GetBar_bar;                               // 0x0BD0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0BD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0BE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatInspector_C_SetEffectsForActor) == 0x000008, "Wrong alignment on WBP_StatInspector_C_SetEffectsForActor");
static_assert(sizeof(WBP_StatInspector_C_SetEffectsForActor) == 0x000BE8, "Wrong size on WBP_StatInspector_C_SetEffectsForActor");
static_assert(offsetof(WBP_StatInspector_C_SetEffectsForActor, Actor) == 0x000000, "Member 'WBP_StatInspector_C_SetEffectsForActor::Actor' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetEffectsForActor, vertBox) == 0x000008, "Member 'WBP_StatInspector_C_SetEffectsForActor::vertBox' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetEffectsForActor, NumBars) == 0x000010, "Member 'WBP_StatInspector_C_SetEffectsForActor::NumBars' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetEffectsForActor, Temp_bool_Variable) == 0x000014, "Member 'WBP_StatInspector_C_SetEffectsForActor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetEffectsForActor, CallFunc_GetStatsComponent_ReturnValue) == 0x000018, "Member 'WBP_StatInspector_C_SetEffectsForActor::CallFunc_GetStatsComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetEffectsForActor, UniqueObjectNameForCooking_SlateColor) == 0x000020, "Member 'WBP_StatInspector_C_SetEffectsForActor::UniqueObjectNameForCooking_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetEffectsForActor, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'WBP_StatInspector_C_SetEffectsForActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetEffectsForActor, CallFunc_GetCurrentEffects_ReturnValue) == 0x000038, "Member 'WBP_StatInspector_C_SetEffectsForActor::CallFunc_GetCurrentEffects_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetEffectsForActor, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_StatInspector_C_SetEffectsForActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatInspector_C_SetEffectsForActor, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'WBP_StatInspector_C_SetEffectsForActor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
