#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuestDetailsContent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QuestDetailsContent.WBP_QuestDetailsContent_C
// 0x0018 (0x04A8 - 0x0490)
class UWBP_QuestDetailsContent_C final : public UQuestDetailsContent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScrollWindow;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelWidget*                           Objectives_Box;                                    // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_QuestDetailsContent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_QuestDetailsContent_C">();
	}
	static class UWBP_QuestDetailsContent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QuestDetailsContent_C>();
	}
};
static_assert(alignof(UWBP_QuestDetailsContent_C) == 0x000008, "Wrong alignment on UWBP_QuestDetailsContent_C");
static_assert(sizeof(UWBP_QuestDetailsContent_C) == 0x0004A8, "Wrong size on UWBP_QuestDetailsContent_C");
static_assert(offsetof(UWBP_QuestDetailsContent_C, UberGraphFrame) == 0x000490, "Member 'UWBP_QuestDetailsContent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_QuestDetailsContent_C, ScrollWindow) == 0x000498, "Member 'UWBP_QuestDetailsContent_C::ScrollWindow' has a wrong offset!");
static_assert(offsetof(UWBP_QuestDetailsContent_C, Objectives_Box) == 0x0004A0, "Member 'UWBP_QuestDetailsContent_C::Objectives_Box' has a wrong offset!");

}

