#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BulletinBoard_Commissions

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BulletinBoard_Commissions.WBP_BulletinBoard_Commissions_C
// 0x0020 (0x03C8 - 0x03A8)
class UWBP_BulletinBoard_Commissions_C final : public UBulletinBoardCommissions
{
public:
	class UWBP_BulletinBoard_CommissionBoardOverview_C* WBP_BulletinBoard_CommissionBoardOverview;   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BulletinBoard_CommissionBoardOverview_C* WBP_BulletinBoard_CommissionBoardOverview_1; // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BulletinBoard_CommissionBoardOverview_C* WBP_BulletinBoard_CommissionBoardOverview_2; // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrame_C*            WBP_ScrollWindow_NoFrame;                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BulletinBoard_Commissions_C">();
	}
	static class UWBP_BulletinBoard_Commissions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BulletinBoard_Commissions_C>();
	}
};
static_assert(alignof(UWBP_BulletinBoard_Commissions_C) == 0x000008, "Wrong alignment on UWBP_BulletinBoard_Commissions_C");
static_assert(sizeof(UWBP_BulletinBoard_Commissions_C) == 0x0003C8, "Wrong size on UWBP_BulletinBoard_Commissions_C");
static_assert(offsetof(UWBP_BulletinBoard_Commissions_C, WBP_BulletinBoard_CommissionBoardOverview) == 0x0003A8, "Member 'UWBP_BulletinBoard_Commissions_C::WBP_BulletinBoard_CommissionBoardOverview' has a wrong offset!");
static_assert(offsetof(UWBP_BulletinBoard_Commissions_C, WBP_BulletinBoard_CommissionBoardOverview_1) == 0x0003B0, "Member 'UWBP_BulletinBoard_Commissions_C::WBP_BulletinBoard_CommissionBoardOverview_1' has a wrong offset!");
static_assert(offsetof(UWBP_BulletinBoard_Commissions_C, WBP_BulletinBoard_CommissionBoardOverview_2) == 0x0003B8, "Member 'UWBP_BulletinBoard_Commissions_C::WBP_BulletinBoard_CommissionBoardOverview_2' has a wrong offset!");
static_assert(offsetof(UWBP_BulletinBoard_Commissions_C, WBP_ScrollWindow_NoFrame) == 0x0003C0, "Member 'UWBP_BulletinBoard_Commissions_C::WBP_ScrollWindow_NoFrame' has a wrong offset!");

}

