#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HarbormasterPurchaseModal

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HarbormasterPurchaseModal.WBP_HarbormasterPurchaseModal_C
// 0x0078 (0x0390 - 0x0318)
class UWBP_HarbormasterPurchaseModal_C final : public UHarbormasterPurchaseModal
{
public:
	class UHorizontalBox*                         ConstructionCurrencyPanel;                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    LabelTextBlock;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScrollWindow;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AvailableShipItem_C*               WBP_AvailableShipItem;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AvailableShipItem_C*               WBP_AvailableShipItem_1;                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AvailableShipItem_C*               WBP_AvailableShipItem_2;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AvailableShipItem_C*               WBP_AvailableShipItem_3;                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AvailableShipItem_C*               WBP_AvailableShipItem_4;                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AvailableShipItem_C*               WBP_AvailableShipItem_5;                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AvailableShipItem_C*               WBP_AvailableShipItem_6;                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_1;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_2;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_3;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        WBP_ItemIcon_4;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HarbormasterPurchaseModal_C">();
	}
	static class UWBP_HarbormasterPurchaseModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HarbormasterPurchaseModal_C>();
	}
};
static_assert(alignof(UWBP_HarbormasterPurchaseModal_C) == 0x000008, "Wrong alignment on UWBP_HarbormasterPurchaseModal_C");
static_assert(sizeof(UWBP_HarbormasterPurchaseModal_C) == 0x000390, "Wrong size on UWBP_HarbormasterPurchaseModal_C");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, ConstructionCurrencyPanel) == 0x000318, "Member 'UWBP_HarbormasterPurchaseModal_C::ConstructionCurrencyPanel' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, LabelTextBlock) == 0x000320, "Member 'UWBP_HarbormasterPurchaseModal_C::LabelTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, ScrollWindow) == 0x000328, "Member 'UWBP_HarbormasterPurchaseModal_C::ScrollWindow' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, WBP_AvailableShipItem) == 0x000330, "Member 'UWBP_HarbormasterPurchaseModal_C::WBP_AvailableShipItem' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, WBP_AvailableShipItem_1) == 0x000338, "Member 'UWBP_HarbormasterPurchaseModal_C::WBP_AvailableShipItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, WBP_AvailableShipItem_2) == 0x000340, "Member 'UWBP_HarbormasterPurchaseModal_C::WBP_AvailableShipItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, WBP_AvailableShipItem_3) == 0x000348, "Member 'UWBP_HarbormasterPurchaseModal_C::WBP_AvailableShipItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, WBP_AvailableShipItem_4) == 0x000350, "Member 'UWBP_HarbormasterPurchaseModal_C::WBP_AvailableShipItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, WBP_AvailableShipItem_5) == 0x000358, "Member 'UWBP_HarbormasterPurchaseModal_C::WBP_AvailableShipItem_5' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, WBP_AvailableShipItem_6) == 0x000360, "Member 'UWBP_HarbormasterPurchaseModal_C::WBP_AvailableShipItem_6' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, WBP_ItemIcon) == 0x000368, "Member 'UWBP_HarbormasterPurchaseModal_C::WBP_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, WBP_ItemIcon_1) == 0x000370, "Member 'UWBP_HarbormasterPurchaseModal_C::WBP_ItemIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, WBP_ItemIcon_2) == 0x000378, "Member 'UWBP_HarbormasterPurchaseModal_C::WBP_ItemIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, WBP_ItemIcon_3) == 0x000380, "Member 'UWBP_HarbormasterPurchaseModal_C::WBP_ItemIcon_3' has a wrong offset!");
static_assert(offsetof(UWBP_HarbormasterPurchaseModal_C, WBP_ItemIcon_4) == 0x000388, "Member 'UWBP_HarbormasterPurchaseModal_C::WBP_ItemIcon_4' has a wrong offset!");

}

