#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TaxPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TaxPanel.WBP_TaxPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TaxPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TaxPanel_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TaxPanel_C_PreConstruct");
static_assert(sizeof(WBP_TaxPanel_C_PreConstruct) == 0x000001, "Wrong size on WBP_TaxPanel_C_PreConstruct");
static_assert(offsetof(WBP_TaxPanel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TaxPanel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TaxPanel.WBP_TaxPanel_C.ExecuteUbergraph_WBP_TaxPanel
// 0x0030 (0x0030 - 0x0000)
struct WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TaxSlider_C*                       CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel) == 0x000008, "Wrong alignment on WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel");
static_assert(sizeof(WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel) == 0x000030, "Wrong size on WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel");
static_assert(offsetof(WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel, EntryPoint) == 0x000000, "Member 'WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel, Temp_int_Variable) == 0x000010, "Member 'WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000015, "Member 'WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel, CallFunc_HasAnyChildren_ReturnValue) == 0x000028, "Member 'WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel, K2Node_Event_IsDesignTime) == 0x000029, "Member 'WBP_TaxPanel_C_ExecuteUbergraph_WBP_TaxPanel::K2Node_Event_IsDesignTime' has a wrong offset!");

}

