#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MayoralCommissionDeliveryItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MayoralCommissionDeliveryItem.WBP_MayoralCommissionDeliveryItem_C
// 0x0018 (0x03F0 - 0x03D8)
class UWBP_MayoralCommissionDeliveryItem_C final : public UMayoralCommissionDeliveryItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAoCCommonTextBlock*                    TB_CollectRewardsLabel;                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_CompleteLabel;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MayoralCommissionDeliveryItem_C">();
	}
	static class UWBP_MayoralCommissionDeliveryItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MayoralCommissionDeliveryItem_C>();
	}
};
static_assert(alignof(UWBP_MayoralCommissionDeliveryItem_C) == 0x000008, "Wrong alignment on UWBP_MayoralCommissionDeliveryItem_C");
static_assert(sizeof(UWBP_MayoralCommissionDeliveryItem_C) == 0x0003F0, "Wrong size on UWBP_MayoralCommissionDeliveryItem_C");
static_assert(offsetof(UWBP_MayoralCommissionDeliveryItem_C, UberGraphFrame) == 0x0003D8, "Member 'UWBP_MayoralCommissionDeliveryItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionDeliveryItem_C, TB_CollectRewardsLabel) == 0x0003E0, "Member 'UWBP_MayoralCommissionDeliveryItem_C::TB_CollectRewardsLabel' has a wrong offset!");
static_assert(offsetof(UWBP_MayoralCommissionDeliveryItem_C, TB_CompleteLabel) == 0x0003E8, "Member 'UWBP_MayoralCommissionDeliveryItem_C::TB_CompleteLabel' has a wrong offset!");

}

