#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ObjectiveAccordion_Primary

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ObjectiveAccordion_Primary.WBP_ObjectiveAccordion_Primary_C.ExecuteUbergraph_WBP_ObjectiveAccordion_Primary
// 0x0008 (0x0008 - 0x0000)
struct WBP_ObjectiveAccordion_Primary_C_ExecuteUbergraph_WBP_ObjectiveAccordion_Primary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObjectiveAccordion_Primary_C_ExecuteUbergraph_WBP_ObjectiveAccordion_Primary) == 0x000004, "Wrong alignment on WBP_ObjectiveAccordion_Primary_C_ExecuteUbergraph_WBP_ObjectiveAccordion_Primary");
static_assert(sizeof(WBP_ObjectiveAccordion_Primary_C_ExecuteUbergraph_WBP_ObjectiveAccordion_Primary) == 0x000008, "Wrong size on WBP_ObjectiveAccordion_Primary_C_ExecuteUbergraph_WBP_ObjectiveAccordion_Primary");
static_assert(offsetof(WBP_ObjectiveAccordion_Primary_C_ExecuteUbergraph_WBP_ObjectiveAccordion_Primary, EntryPoint) == 0x000000, "Member 'WBP_ObjectiveAccordion_Primary_C_ExecuteUbergraph_WBP_ObjectiveAccordion_Primary::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ObjectiveAccordion_Primary_C_ExecuteUbergraph_WBP_ObjectiveAccordion_Primary, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_ObjectiveAccordion_Primary_C_ExecuteUbergraph_WBP_ObjectiveAccordion_Primary::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_ObjectiveAccordion_Primary.WBP_ObjectiveAccordion_Primary_C.GetBreadcrumbWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_ObjectiveAccordion_Primary_C_GetBreadcrumbWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObjectiveAccordion_Primary_C_GetBreadcrumbWidget) == 0x000008, "Wrong alignment on WBP_ObjectiveAccordion_Primary_C_GetBreadcrumbWidget");
static_assert(sizeof(WBP_ObjectiveAccordion_Primary_C_GetBreadcrumbWidget) == 0x000008, "Wrong size on WBP_ObjectiveAccordion_Primary_C_GetBreadcrumbWidget");
static_assert(offsetof(WBP_ObjectiveAccordion_Primary_C_GetBreadcrumbWidget, ReturnValue) == 0x000000, "Member 'WBP_ObjectiveAccordion_Primary_C_GetBreadcrumbWidget::ReturnValue' has a wrong offset!");

// Function WBP_ObjectiveAccordion_Primary.WBP_ObjectiveAccordion_Primary_C.GetButtonContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_ObjectiveAccordion_Primary_C_GetButtonContainer final
{
public:
	class UPanelWidget*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObjectiveAccordion_Primary_C_GetButtonContainer) == 0x000008, "Wrong alignment on WBP_ObjectiveAccordion_Primary_C_GetButtonContainer");
static_assert(sizeof(WBP_ObjectiveAccordion_Primary_C_GetButtonContainer) == 0x000008, "Wrong size on WBP_ObjectiveAccordion_Primary_C_GetButtonContainer");
static_assert(offsetof(WBP_ObjectiveAccordion_Primary_C_GetButtonContainer, ReturnValue) == 0x000000, "Member 'WBP_ObjectiveAccordion_Primary_C_GetButtonContainer::ReturnValue' has a wrong offset!");

// Function WBP_ObjectiveAccordion_Primary.WBP_ObjectiveAccordion_Primary_C.GetEvenButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_ObjectiveAccordion_Primary_C_GetEvenButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObjectiveAccordion_Primary_C_GetEvenButtonStyle) == 0x000008, "Wrong alignment on WBP_ObjectiveAccordion_Primary_C_GetEvenButtonStyle");
static_assert(sizeof(WBP_ObjectiveAccordion_Primary_C_GetEvenButtonStyle) == 0x000008, "Wrong size on WBP_ObjectiveAccordion_Primary_C_GetEvenButtonStyle");
static_assert(offsetof(WBP_ObjectiveAccordion_Primary_C_GetEvenButtonStyle, ReturnValue) == 0x000000, "Member 'WBP_ObjectiveAccordion_Primary_C_GetEvenButtonStyle::ReturnValue' has a wrong offset!");

// Function WBP_ObjectiveAccordion_Primary.WBP_ObjectiveAccordion_Primary_C.GetOddButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_ObjectiveAccordion_Primary_C_GetOddButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObjectiveAccordion_Primary_C_GetOddButtonStyle) == 0x000008, "Wrong alignment on WBP_ObjectiveAccordion_Primary_C_GetOddButtonStyle");
static_assert(sizeof(WBP_ObjectiveAccordion_Primary_C_GetOddButtonStyle) == 0x000008, "Wrong size on WBP_ObjectiveAccordion_Primary_C_GetOddButtonStyle");
static_assert(offsetof(WBP_ObjectiveAccordion_Primary_C_GetOddButtonStyle, ReturnValue) == 0x000000, "Member 'WBP_ObjectiveAccordion_Primary_C_GetOddButtonStyle::ReturnValue' has a wrong offset!");

// Function WBP_ObjectiveAccordion_Primary.WBP_ObjectiveAccordion_Primary_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ObjectiveAccordion_Primary_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObjectiveAccordion_Primary_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ObjectiveAccordion_Primary_C_PreConstruct");
static_assert(sizeof(WBP_ObjectiveAccordion_Primary_C_PreConstruct) == 0x000001, "Wrong size on WBP_ObjectiveAccordion_Primary_C_PreConstruct");
static_assert(offsetof(WBP_ObjectiveAccordion_Primary_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ObjectiveAccordion_Primary_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

