#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CaravanMenu

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CaravanMenu.WBP_CaravanMenu_C
// 0x0020 (0x05C0 - 0x05A0)
class UWBP_CaravanMenu_C final : public UCaravanMenu
{
public:
	class UCommonIconButton_C*                    Filterbutton;                                      // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   LoadoutInventory;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextDropdown_C*                    SortByDropdown;                                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TabsBox;                                           // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CaravanMenu_C">();
	}
	static class UWBP_CaravanMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CaravanMenu_C>();
	}
};
static_assert(alignof(UWBP_CaravanMenu_C) == 0x000008, "Wrong alignment on UWBP_CaravanMenu_C");
static_assert(sizeof(UWBP_CaravanMenu_C) == 0x0005C0, "Wrong size on UWBP_CaravanMenu_C");
static_assert(offsetof(UWBP_CaravanMenu_C, Filterbutton) == 0x0005A0, "Member 'UWBP_CaravanMenu_C::Filterbutton' has a wrong offset!");
static_assert(offsetof(UWBP_CaravanMenu_C, LoadoutInventory) == 0x0005A8, "Member 'UWBP_CaravanMenu_C::LoadoutInventory' has a wrong offset!");
static_assert(offsetof(UWBP_CaravanMenu_C, SortByDropdown) == 0x0005B0, "Member 'UWBP_CaravanMenu_C::SortByDropdown' has a wrong offset!");
static_assert(offsetof(UWBP_CaravanMenu_C, TabsBox) == 0x0005B8, "Member 'UWBP_CaravanMenu_C::TabsBox' has a wrong offset!");

}

