#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MayoralCommissionDeliveryItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MayoralCommissionDeliveryItem.WBP_MayoralCommissionDeliveryItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MayoralCommissionDeliveryItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MayoralCommissionDeliveryItem_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_MayoralCommissionDeliveryItem_C_PreConstruct");
static_assert(sizeof(WBP_MayoralCommissionDeliveryItem_C_PreConstruct) == 0x000001, "Wrong size on WBP_MayoralCommissionDeliveryItem_C_PreConstruct");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_MayoralCommissionDeliveryItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_MayoralCommissionDeliveryItem.WBP_MayoralCommissionDeliveryItem_C.GetOddBorderStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_MayoralCommissionDeliveryItem_C_GetOddBorderStyle final
{
public:
	TSubclassOf<class UCommonBorderStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MayoralCommissionDeliveryItem_C_GetOddBorderStyle) == 0x000008, "Wrong alignment on WBP_MayoralCommissionDeliveryItem_C_GetOddBorderStyle");
static_assert(sizeof(WBP_MayoralCommissionDeliveryItem_C_GetOddBorderStyle) == 0x000008, "Wrong size on WBP_MayoralCommissionDeliveryItem_C_GetOddBorderStyle");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_GetOddBorderStyle, ReturnValue) == 0x000000, "Member 'WBP_MayoralCommissionDeliveryItem_C_GetOddBorderStyle::ReturnValue' has a wrong offset!");

// Function WBP_MayoralCommissionDeliveryItem.WBP_MayoralCommissionDeliveryItem_C.GetEvenBorderStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_MayoralCommissionDeliveryItem_C_GetEvenBorderStyle final
{
public:
	TSubclassOf<class UCommonBorderStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MayoralCommissionDeliveryItem_C_GetEvenBorderStyle) == 0x000008, "Wrong alignment on WBP_MayoralCommissionDeliveryItem_C_GetEvenBorderStyle");
static_assert(sizeof(WBP_MayoralCommissionDeliveryItem_C_GetEvenBorderStyle) == 0x000008, "Wrong size on WBP_MayoralCommissionDeliveryItem_C_GetEvenBorderStyle");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_GetEvenBorderStyle, ReturnValue) == 0x000000, "Member 'WBP_MayoralCommissionDeliveryItem_C_GetEvenBorderStyle::ReturnValue' has a wrong offset!");

// Function WBP_MayoralCommissionDeliveryItem.WBP_MayoralCommissionDeliveryItem_C.GetBorderContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_MayoralCommissionDeliveryItem_C_GetBorderContainer final
{
public:
	class UPanelWidget*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MayoralCommissionDeliveryItem_C_GetBorderContainer) == 0x000008, "Wrong alignment on WBP_MayoralCommissionDeliveryItem_C_GetBorderContainer");
static_assert(sizeof(WBP_MayoralCommissionDeliveryItem_C_GetBorderContainer) == 0x000008, "Wrong size on WBP_MayoralCommissionDeliveryItem_C_GetBorderContainer");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_GetBorderContainer, ReturnValue) == 0x000000, "Member 'WBP_MayoralCommissionDeliveryItem_C_GetBorderContainer::ReturnValue' has a wrong offset!");

// Function WBP_MayoralCommissionDeliveryItem.WBP_MayoralCommissionDeliveryItem_C.ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem
// 0x0028 (0x0028 - 0x0000)
struct WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MultiSelectButton_C*               CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem) == 0x000008, "Wrong alignment on WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem");
static_assert(sizeof(WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem) == 0x000028, "Wrong size on WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem, EntryPoint) == 0x000000, "Member 'WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem, Temp_int_Variable) == 0x000010, "Member 'WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem, CallFunc_HasAnyChildren_ReturnValue) == 0x00001D, "Member 'WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem, CallFunc_IsValid_ReturnValue) == 0x00001E, "Member 'WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'WBP_MayoralCommissionDeliveryItem_C_ExecuteUbergraph_WBP_MayoralCommissionDeliveryItem::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

