#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CriticalSuccessWindow

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CriticalSuccessWindow.WBP_CriticalSuccessWindow_C
// 0x0028 (0x0348 - 0x0320)
class UWBP_CriticalSuccessWindow_C final : public UCriticalSuccessWindow
{
public:
	class UWidgetAnimation*                       WindowOpenClose;                                   // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonIconButton_C*                    HelpButton;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProcIcon;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityBG;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   WBP_ScrollWindow_NoFrameNoPadding;                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CriticalSuccessWindow_C">();
	}
	static class UWBP_CriticalSuccessWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CriticalSuccessWindow_C>();
	}
};
static_assert(alignof(UWBP_CriticalSuccessWindow_C) == 0x000008, "Wrong alignment on UWBP_CriticalSuccessWindow_C");
static_assert(sizeof(UWBP_CriticalSuccessWindow_C) == 0x000348, "Wrong size on UWBP_CriticalSuccessWindow_C");
static_assert(offsetof(UWBP_CriticalSuccessWindow_C, WindowOpenClose) == 0x000320, "Member 'UWBP_CriticalSuccessWindow_C::WindowOpenClose' has a wrong offset!");
static_assert(offsetof(UWBP_CriticalSuccessWindow_C, HelpButton) == 0x000328, "Member 'UWBP_CriticalSuccessWindow_C::HelpButton' has a wrong offset!");
static_assert(offsetof(UWBP_CriticalSuccessWindow_C, ProcIcon) == 0x000330, "Member 'UWBP_CriticalSuccessWindow_C::ProcIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CriticalSuccessWindow_C, RarityBG) == 0x000338, "Member 'UWBP_CriticalSuccessWindow_C::RarityBG' has a wrong offset!");
static_assert(offsetof(UWBP_CriticalSuccessWindow_C, WBP_ScrollWindow_NoFrameNoPadding) == 0x000340, "Member 'UWBP_CriticalSuccessWindow_C::WBP_ScrollWindow_NoFrameNoPadding' has a wrong offset!");

}

