#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapControlPoint

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapControlPoint.WBP_MapControlPoint_C
// 0x0018 (0x06F8 - 0x06E0)
class UWBP_MapControlPoint_C final : public UMapControlPointPOIW
{
public:
	class UImage*                                 FinalObjectiveIcon;                                // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MainBorder;                                        // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnderSiegeIndicator;                               // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapControlPoint_C">();
	}
	static class UWBP_MapControlPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapControlPoint_C>();
	}
};
static_assert(alignof(UWBP_MapControlPoint_C) == 0x000008, "Wrong alignment on UWBP_MapControlPoint_C");
static_assert(sizeof(UWBP_MapControlPoint_C) == 0x0006F8, "Wrong size on UWBP_MapControlPoint_C");
static_assert(offsetof(UWBP_MapControlPoint_C, FinalObjectiveIcon) == 0x0006E0, "Member 'UWBP_MapControlPoint_C::FinalObjectiveIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MapControlPoint_C, MainBorder) == 0x0006E8, "Member 'UWBP_MapControlPoint_C::MainBorder' has a wrong offset!");
static_assert(offsetof(UWBP_MapControlPoint_C, UnderSiegeIndicator) == 0x0006F0, "Member 'UWBP_MapControlPoint_C::UnderSiegeIndicator' has a wrong offset!");

}

