#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StandardWindowFrame

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StandardWindowFrame.WBP_StandardWindowFrame_C
// 0x0020 (0x0728 - 0x0708)
class UWBP_StandardWindowFrame_C final : public UAoCWindow
{
public:
	class UWidgetAnimation*                       WindowOpenClose;                                   // 0x0708(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 HeaderPattern;                                     // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonIconButton_C*                    LootSettingsButton;                                // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ModalContainer;                                    // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StandardWindowFrame_C">();
	}
	static class UWBP_StandardWindowFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StandardWindowFrame_C>();
	}
};
static_assert(alignof(UWBP_StandardWindowFrame_C) == 0x000008, "Wrong alignment on UWBP_StandardWindowFrame_C");
static_assert(sizeof(UWBP_StandardWindowFrame_C) == 0x000728, "Wrong size on UWBP_StandardWindowFrame_C");
static_assert(offsetof(UWBP_StandardWindowFrame_C, WindowOpenClose) == 0x000708, "Member 'UWBP_StandardWindowFrame_C::WindowOpenClose' has a wrong offset!");
static_assert(offsetof(UWBP_StandardWindowFrame_C, HeaderPattern) == 0x000710, "Member 'UWBP_StandardWindowFrame_C::HeaderPattern' has a wrong offset!");
static_assert(offsetof(UWBP_StandardWindowFrame_C, LootSettingsButton) == 0x000718, "Member 'UWBP_StandardWindowFrame_C::LootSettingsButton' has a wrong offset!");
static_assert(offsetof(UWBP_StandardWindowFrame_C, ModalContainer) == 0x000720, "Member 'UWBP_StandardWindowFrame_C::ModalContainer' has a wrong offset!");

}

