#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NodeBuildingListItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NodeBuildingListItem.WBP_NodeBuildingListItem_C
// 0x0020 (0x19A0 - 0x1980)
class UWBP_NodeBuildingListItem_C final : public UNodeBuildingListItem
{
public:
	class UCommonBorder*                          B_BuildingListItem;                                // 0x1980(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ConstructionProgressBarTextBlock;                  // 0x1988(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimerProgressBarFrame;                             // 0x1990(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UAoCCommonButtonBase* GetButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NodeBuildingListItem_C">();
	}
	static class UWBP_NodeBuildingListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NodeBuildingListItem_C>();
	}
};
static_assert(alignof(UWBP_NodeBuildingListItem_C) == 0x000010, "Wrong alignment on UWBP_NodeBuildingListItem_C");
static_assert(sizeof(UWBP_NodeBuildingListItem_C) == 0x0019A0, "Wrong size on UWBP_NodeBuildingListItem_C");
static_assert(offsetof(UWBP_NodeBuildingListItem_C, B_BuildingListItem) == 0x001980, "Member 'UWBP_NodeBuildingListItem_C::B_BuildingListItem' has a wrong offset!");
static_assert(offsetof(UWBP_NodeBuildingListItem_C, ConstructionProgressBarTextBlock) == 0x001988, "Member 'UWBP_NodeBuildingListItem_C::ConstructionProgressBarTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_NodeBuildingListItem_C, TimerProgressBarFrame) == 0x001990, "Member 'UWBP_NodeBuildingListItem_C::TimerProgressBarFrame' has a wrong offset!");

}

