#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CastBar_Hunting_Bow

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CastBar_Hunting_Bow.WBP_CastBar_Hunting_Bow_C.ExecuteUbergraph_WBP_CastBar_Hunting_Bow
// 0x10D8 (0x10D8 - 0x0000)
struct WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAoCAbilityComponent*                   CallFunc_GetAbilityComponent_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<int64>                                 CallFunc_GetActiveAbilityRecordGuids_ReturnValue;  // 0x0058(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         CallFunc_GetAnyAbilityTarget_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAoCAbilityRecord                      CallFunc_GetAbilityRecordByGuid_ReturnValue;       // 0x0080(0x1020)(ConstParm)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x10A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A4[0x4];                                     // 0x10A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x10A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x10B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x10B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x10C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x10D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow) == 0x000008, "Wrong alignment on WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow");
static_assert(sizeof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow) == 0x0010D8, "Wrong size on WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, EntryPoint) == 0x000000, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_GetTimeSeconds_ReturnValue) == 0x000008, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, K2Node_Event_MyGeometry) == 0x000010, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_GetAbilityComponent_ReturnValue) == 0x000050, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_GetAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_GetActiveAbilityRecordGuids_ReturnValue) == 0x000058, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_GetActiveAbilityRecordGuids_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_GetAnyAbilityTarget_ReturnValue) == 0x000078, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_GetAnyAbilityTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_GetAbilityRecordByGuid_ReturnValue) == 0x000080, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_GetAbilityRecordByGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_GetDistanceTo_ReturnValue) == 0x0010A0, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0010A8, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0010B0, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_FClamp_ReturnValue) == 0x0010B8, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_MakeVector2D_ReturnValue) == 0x0010C0, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0010D0, "Member 'WBP_CastBar_Hunting_Bow_C_ExecuteUbergraph_WBP_CastBar_Hunting_Bow::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_CastBar_Hunting_Bow.WBP_CastBar_Hunting_Bow_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CastBar_Hunting_Bow_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CastBar_Hunting_Bow_C_Tick) == 0x000004, "Wrong alignment on WBP_CastBar_Hunting_Bow_C_Tick");
static_assert(sizeof(WBP_CastBar_Hunting_Bow_C_Tick) == 0x00003C, "Wrong size on WBP_CastBar_Hunting_Bow_C_Tick");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_CastBar_Hunting_Bow_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CastBar_Hunting_Bow_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_CastBar_Hunting_Bow_C_Tick::InDeltaTime' has a wrong offset!");

}

