#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Minimap_Header

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Minimap_Header.WBP_Minimap_Header_C
// 0x0040 (0x0550 - 0x0510)
class UWBP_Minimap_Header_C final : public UMapHeader
{
public:
	class UWidgetAnimation*                       MailNotificationReveal;                            // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MailCounterIncrease;                               // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_DurabilityIndicator_C*             DurabilityIndicator;                               // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBG;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvB_Buttons;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvB_Compass;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SeasonBG;                                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimeOfDayBG;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Minimap_Header_C">();
	}
	static class UWBP_Minimap_Header_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Minimap_Header_C>();
	}
};
static_assert(alignof(UWBP_Minimap_Header_C) == 0x000008, "Wrong alignment on UWBP_Minimap_Header_C");
static_assert(sizeof(UWBP_Minimap_Header_C) == 0x000550, "Wrong size on UWBP_Minimap_Header_C");
static_assert(offsetof(UWBP_Minimap_Header_C, MailNotificationReveal) == 0x000510, "Member 'UWBP_Minimap_Header_C::MailNotificationReveal' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_Header_C, MailCounterIncrease) == 0x000518, "Member 'UWBP_Minimap_Header_C::MailCounterIncrease' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_Header_C, DurabilityIndicator) == 0x000520, "Member 'UWBP_Minimap_Header_C::DurabilityIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_Header_C, HeaderBG) == 0x000528, "Member 'UWBP_Minimap_Header_C::HeaderBG' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_Header_C, InvB_Buttons) == 0x000530, "Member 'UWBP_Minimap_Header_C::InvB_Buttons' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_Header_C, InvB_Compass) == 0x000538, "Member 'UWBP_Minimap_Header_C::InvB_Compass' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_Header_C, SeasonBG) == 0x000540, "Member 'UWBP_Minimap_Header_C::SeasonBG' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_Header_C, TimeOfDayBG) == 0x000548, "Member 'UWBP_Minimap_Header_C::TimeOfDayBG' has a wrong offset!");

}

