#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RaidMemberWidget

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RaidMemberWidget.WBP_RaidMemberWidget_C
// 0x0018 (0x04E8 - 0x04D0)
class UWBP_RaidMemberWidget_C final : public URaidMemberWidget
{
public:
	class UInvalidationBox*                       InvalidationBox_578;                               // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SquadColorImg;                                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Portrait;                                          // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RaidMemberWidget_C">();
	}
	static class UWBP_RaidMemberWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RaidMemberWidget_C>();
	}
};
static_assert(alignof(UWBP_RaidMemberWidget_C) == 0x000008, "Wrong alignment on UWBP_RaidMemberWidget_C");
static_assert(sizeof(UWBP_RaidMemberWidget_C) == 0x0004E8, "Wrong size on UWBP_RaidMemberWidget_C");
static_assert(offsetof(UWBP_RaidMemberWidget_C, InvalidationBox_578) == 0x0004D0, "Member 'UWBP_RaidMemberWidget_C::InvalidationBox_578' has a wrong offset!");
static_assert(offsetof(UWBP_RaidMemberWidget_C, SquadColorImg) == 0x0004D8, "Member 'UWBP_RaidMemberWidget_C::SquadColorImg' has a wrong offset!");
static_assert(offsetof(UWBP_RaidMemberWidget_C, Portrait) == 0x0004E0, "Member 'UWBP_RaidMemberWidget_C::Portrait' has a wrong offset!");

}

