#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FriendsListMenu

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FriendsListMenu.WBP_FriendsListMenu_C
// 0x00A8 (0x0630 - 0x0588)
class UWBP_FriendsListMenu_C final : public UFriendsListMenu
{
public:
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem;                               // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_1;                             // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_2;                             // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_3;                             // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_4;                             // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_5;                             // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_6;                             // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_7;                             // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_8;                             // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_9;                             // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_10;                            // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_11;                            // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_12;                            // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_13;                            // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_14;                            // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_15;                            // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_16;                            // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_17;                            // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_18;                            // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsListItem_C*                 WBP_FriendsListItem_19;                            // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   WBP_ScrollWindow_NoFrameNoPadding;                 // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FriendsListMenu_C">();
	}
	static class UWBP_FriendsListMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FriendsListMenu_C>();
	}
};
static_assert(alignof(UWBP_FriendsListMenu_C) == 0x000008, "Wrong alignment on UWBP_FriendsListMenu_C");
static_assert(sizeof(UWBP_FriendsListMenu_C) == 0x000630, "Wrong size on UWBP_FriendsListMenu_C");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem) == 0x000588, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_1) == 0x000590, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_2) == 0x000598, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_3) == 0x0005A0, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_4) == 0x0005A8, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_5) == 0x0005B0, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_5' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_6) == 0x0005B8, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_6' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_7) == 0x0005C0, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_7' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_8) == 0x0005C8, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_8' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_9) == 0x0005D0, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_9' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_10) == 0x0005D8, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_10' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_11) == 0x0005E0, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_11' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_12) == 0x0005E8, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_12' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_13) == 0x0005F0, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_13' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_14) == 0x0005F8, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_14' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_15) == 0x000600, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_15' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_16) == 0x000608, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_16' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_17) == 0x000610, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_17' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_18) == 0x000618, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_18' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_FriendsListItem_19) == 0x000620, "Member 'UWBP_FriendsListMenu_C::WBP_FriendsListItem_19' has a wrong offset!");
static_assert(offsetof(UWBP_FriendsListMenu_C, WBP_ScrollWindow_NoFrameNoPadding) == 0x000628, "Member 'UWBP_FriendsListMenu_C::WBP_ScrollWindow_NoFrameNoPadding' has a wrong offset!");

}

