#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MultiSelectItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MultiSelectItem.WBP_MultiSelectItem_C
// 0x0020 (0x1730 - 0x1710)
class UWBP_MultiSelectItem_C final : public ULootWindowEntry
{
public:
	class UWidgetAnimation*                       ItemFeed_FadeOut;                                  // 0x1710(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemFeed_AddItem;                                  // 0x1718(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIntrepidCommonBorder*                  AlternatingBG;                                     // 0x1720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_FuelValueLabel;                                 // 0x1728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();
	class UAoCCommonButtonBase* GetButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MultiSelectItem_C">();
	}
	static class UWBP_MultiSelectItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MultiSelectItem_C>();
	}
};
static_assert(alignof(UWBP_MultiSelectItem_C) == 0x000010, "Wrong alignment on UWBP_MultiSelectItem_C");
static_assert(sizeof(UWBP_MultiSelectItem_C) == 0x001730, "Wrong size on UWBP_MultiSelectItem_C");
static_assert(offsetof(UWBP_MultiSelectItem_C, ItemFeed_FadeOut) == 0x001710, "Member 'UWBP_MultiSelectItem_C::ItemFeed_FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectItem_C, ItemFeed_AddItem) == 0x001718, "Member 'UWBP_MultiSelectItem_C::ItemFeed_AddItem' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectItem_C, AlternatingBG) == 0x001720, "Member 'UWBP_MultiSelectItem_C::AlternatingBG' has a wrong offset!");
static_assert(offsetof(UWBP_MultiSelectItem_C, TB_FuelValueLabel) == 0x001728, "Member 'UWBP_MultiSelectItem_C::TB_FuelValueLabel' has a wrong offset!");

}

