#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MarketplaceSoldItemEntry

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MarketplaceSoldItemEntry.WBP_MarketplaceSoldItemEntry_C
// 0x0030 (0x0320 - 0x02F0)
class UWBP_MarketplaceSoldItemEntry_C final : public UUserWidget
{
public:
	class UCommonBorder*                          B_AlternatingBG;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    BuyerNameLabel;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextButton_C*                    ClaimButton;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    NumberSoldCounter;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyTiersItem_C*               SoldForPrice;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorStandardItem_C*              SoldItem;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MarketplaceSoldItemEntry_C">();
	}
	static class UWBP_MarketplaceSoldItemEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MarketplaceSoldItemEntry_C>();
	}
};
static_assert(alignof(UWBP_MarketplaceSoldItemEntry_C) == 0x000008, "Wrong alignment on UWBP_MarketplaceSoldItemEntry_C");
static_assert(sizeof(UWBP_MarketplaceSoldItemEntry_C) == 0x000320, "Wrong size on UWBP_MarketplaceSoldItemEntry_C");
static_assert(offsetof(UWBP_MarketplaceSoldItemEntry_C, B_AlternatingBG) == 0x0002F0, "Member 'UWBP_MarketplaceSoldItemEntry_C::B_AlternatingBG' has a wrong offset!");
static_assert(offsetof(UWBP_MarketplaceSoldItemEntry_C, BuyerNameLabel) == 0x0002F8, "Member 'UWBP_MarketplaceSoldItemEntry_C::BuyerNameLabel' has a wrong offset!");
static_assert(offsetof(UWBP_MarketplaceSoldItemEntry_C, ClaimButton) == 0x000300, "Member 'UWBP_MarketplaceSoldItemEntry_C::ClaimButton' has a wrong offset!");
static_assert(offsetof(UWBP_MarketplaceSoldItemEntry_C, NumberSoldCounter) == 0x000308, "Member 'UWBP_MarketplaceSoldItemEntry_C::NumberSoldCounter' has a wrong offset!");
static_assert(offsetof(UWBP_MarketplaceSoldItemEntry_C, SoldForPrice) == 0x000310, "Member 'UWBP_MarketplaceSoldItemEntry_C::SoldForPrice' has a wrong offset!");
static_assert(offsetof(UWBP_MarketplaceSoldItemEntry_C, SoldItem) == 0x000318, "Member 'UWBP_MarketplaceSoldItemEntry_C::SoldItem' has a wrong offset!");

}

