#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConstructionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ConstructionMenu.WBP_ConstructionMenu_C
// 0x0018 (0x0420 - 0x0408)
class UWBP_ConstructionMenu_C final : public UConstructionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAoCCommonTextBlock*                    NPCFlavorText;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    TB_ConstructionInProgress;                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ConstructionMenu(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ConstructionMenu_C">();
	}
	static class UWBP_ConstructionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ConstructionMenu_C>();
	}
};
static_assert(alignof(UWBP_ConstructionMenu_C) == 0x000008, "Wrong alignment on UWBP_ConstructionMenu_C");
static_assert(sizeof(UWBP_ConstructionMenu_C) == 0x000420, "Wrong size on UWBP_ConstructionMenu_C");
static_assert(offsetof(UWBP_ConstructionMenu_C, UberGraphFrame) == 0x000408, "Member 'UWBP_ConstructionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ConstructionMenu_C, NPCFlavorText) == 0x000410, "Member 'UWBP_ConstructionMenu_C::NPCFlavorText' has a wrong offset!");
static_assert(offsetof(UWBP_ConstructionMenu_C, TB_ConstructionInProgress) == 0x000418, "Member 'UWBP_ConstructionMenu_C::TB_ConstructionInProgress' has a wrong offset!");

}

