#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CurrencyTiersItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CurrencyTiersItem.WBP_CurrencyTiersItem_C
// 0x0018 (0x03F0 - 0x03D8)
class UWBP_CurrencyTiersItem_C final : public UCurrencyTiersItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         Row1;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Row2;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_CurrencyTiersItem(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CurrencyTiersItem_C">();
	}
	static class UWBP_CurrencyTiersItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CurrencyTiersItem_C>();
	}
};
static_assert(alignof(UWBP_CurrencyTiersItem_C) == 0x000008, "Wrong alignment on UWBP_CurrencyTiersItem_C");
static_assert(sizeof(UWBP_CurrencyTiersItem_C) == 0x0003F0, "Wrong size on UWBP_CurrencyTiersItem_C");
static_assert(offsetof(UWBP_CurrencyTiersItem_C, UberGraphFrame) == 0x0003D8, "Member 'UWBP_CurrencyTiersItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CurrencyTiersItem_C, Row1) == 0x0003E0, "Member 'UWBP_CurrencyTiersItem_C::Row1' has a wrong offset!");
static_assert(offsetof(UWBP_CurrencyTiersItem_C, Row2) == 0x0003E8, "Member 'UWBP_CurrencyTiersItem_C::Row2' has a wrong offset!");

}

