#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CC_MainTabs

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CC_MainTabs.WBP_CC_MainTabs_C
// 0x0030 (0x0470 - 0x0440)
class UWBP_CC_MainTabs_C final : public UCC_MainTabs
{
public:
	class UWBP_CC_Tab_C*                          AppearanceButton;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               AppearancSubSelections;                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CC_Tab_C*                          ArchetypeButton;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CC_Tab_C*                          RaceButton;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CC_Tab_C*                          SculptButton;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonButton_C*                        SummonerButton;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CC_MainTabs_C">();
	}
	static class UWBP_CC_MainTabs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CC_MainTabs_C>();
	}
};
static_assert(alignof(UWBP_CC_MainTabs_C) == 0x000008, "Wrong alignment on UWBP_CC_MainTabs_C");
static_assert(sizeof(UWBP_CC_MainTabs_C) == 0x000470, "Wrong size on UWBP_CC_MainTabs_C");
static_assert(offsetof(UWBP_CC_MainTabs_C, AppearanceButton) == 0x000440, "Member 'UWBP_CC_MainTabs_C::AppearanceButton' has a wrong offset!");
static_assert(offsetof(UWBP_CC_MainTabs_C, AppearancSubSelections) == 0x000448, "Member 'UWBP_CC_MainTabs_C::AppearancSubSelections' has a wrong offset!");
static_assert(offsetof(UWBP_CC_MainTabs_C, ArchetypeButton) == 0x000450, "Member 'UWBP_CC_MainTabs_C::ArchetypeButton' has a wrong offset!");
static_assert(offsetof(UWBP_CC_MainTabs_C, RaceButton) == 0x000458, "Member 'UWBP_CC_MainTabs_C::RaceButton' has a wrong offset!");
static_assert(offsetof(UWBP_CC_MainTabs_C, SculptButton) == 0x000460, "Member 'UWBP_CC_MainTabs_C::SculptButton' has a wrong offset!");
static_assert(offsetof(UWBP_CC_MainTabs_C, SummonerButton) == 0x000468, "Member 'UWBP_CC_MainTabs_C::SummonerButton' has a wrong offset!");

}

