#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CitizenshipWindow

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CitizenshipWindow.WBP_CitizenshipWindow_C
// 0x0018 (0x0590 - 0x0578)
class UWBP_CitizenshipWindow_C final : public UCitizenshipWindow
{
public:
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   ScW_Content;                                       // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextButton_C*                    ShowAllButton;                                     // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubPanelIndicatorTextBlock;                        // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CitizenshipWindow_C">();
	}
	static class UWBP_CitizenshipWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CitizenshipWindow_C>();
	}
};
static_assert(alignof(UWBP_CitizenshipWindow_C) == 0x000008, "Wrong alignment on UWBP_CitizenshipWindow_C");
static_assert(sizeof(UWBP_CitizenshipWindow_C) == 0x000590, "Wrong size on UWBP_CitizenshipWindow_C");
static_assert(offsetof(UWBP_CitizenshipWindow_C, ScW_Content) == 0x000578, "Member 'UWBP_CitizenshipWindow_C::ScW_Content' has a wrong offset!");
static_assert(offsetof(UWBP_CitizenshipWindow_C, ShowAllButton) == 0x000580, "Member 'UWBP_CitizenshipWindow_C::ShowAllButton' has a wrong offset!");
static_assert(offsetof(UWBP_CitizenshipWindow_C, SubPanelIndicatorTextBlock) == 0x000588, "Member 'UWBP_CitizenshipWindow_C::SubPanelIndicatorTextBlock' has a wrong offset!");

}

