#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProgressionRecipesPanel

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ProgressionRecipesPanel.WBP_ProgressionRecipesPanel_C
// 0x0030 (0x03D8 - 0x03A8)
class UWBP_ProgressionRecipesPanel_C final : public UProgressionRecipesPanel
{
public:
	class UWBP_Accordion_C*                       GatheringAccordion_1;                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       GatheringAccordion_2;                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       GatheringAccordion_3;                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       GatheringAccordion_4;                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Accordion_C*                       InksAccordion;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   WBP_ScrollWindow;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ProgressionRecipesPanel_C">();
	}
	static class UWBP_ProgressionRecipesPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ProgressionRecipesPanel_C>();
	}
};
static_assert(alignof(UWBP_ProgressionRecipesPanel_C) == 0x000008, "Wrong alignment on UWBP_ProgressionRecipesPanel_C");
static_assert(sizeof(UWBP_ProgressionRecipesPanel_C) == 0x0003D8, "Wrong size on UWBP_ProgressionRecipesPanel_C");
static_assert(offsetof(UWBP_ProgressionRecipesPanel_C, GatheringAccordion_1) == 0x0003A8, "Member 'UWBP_ProgressionRecipesPanel_C::GatheringAccordion_1' has a wrong offset!");
static_assert(offsetof(UWBP_ProgressionRecipesPanel_C, GatheringAccordion_2) == 0x0003B0, "Member 'UWBP_ProgressionRecipesPanel_C::GatheringAccordion_2' has a wrong offset!");
static_assert(offsetof(UWBP_ProgressionRecipesPanel_C, GatheringAccordion_3) == 0x0003B8, "Member 'UWBP_ProgressionRecipesPanel_C::GatheringAccordion_3' has a wrong offset!");
static_assert(offsetof(UWBP_ProgressionRecipesPanel_C, GatheringAccordion_4) == 0x0003C0, "Member 'UWBP_ProgressionRecipesPanel_C::GatheringAccordion_4' has a wrong offset!");
static_assert(offsetof(UWBP_ProgressionRecipesPanel_C, InksAccordion) == 0x0003C8, "Member 'UWBP_ProgressionRecipesPanel_C::InksAccordion' has a wrong offset!");
static_assert(offsetof(UWBP_ProgressionRecipesPanel_C, WBP_ScrollWindow) == 0x0003D0, "Member 'UWBP_ProgressionRecipesPanel_C::WBP_ScrollWindow' has a wrong offset!");

}

