#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapPaint

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_MapPaint.WBP_MapPaint_C.OnPaint
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_MapPaint_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapRect                               CallFunc_Array_Get_Item;                           // 0x0048(0x0058)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0118(0x0018)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_4;               // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_5;               // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_6;               // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_7;               // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawLine_Thickness_ImplicitCast;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawLine_Thickness_ImplicitCast_1;        // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawLine_Thickness_ImplicitCast_2;        // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawLine_Thickness_ImplicitCast_3;        // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapPaint_C_OnPaint) == 0x000008, "Wrong alignment on WBP_MapPaint_C_OnPaint");
static_assert(sizeof(WBP_MapPaint_C_OnPaint) == 0x0001A0, "Wrong size on WBP_MapPaint_C_OnPaint");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, Context) == 0x000000, "Member 'WBP_MapPaint_C_OnPaint::Context' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WBP_MapPaint_C_OnPaint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, Temp_int_Array_Index_Variable) == 0x000040, "Member 'WBP_MapPaint_C_OnPaint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000A0, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_BreakVector2D_X) == 0x0000A8, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_BreakVector2D_Y) == 0x0000B0, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000B8, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_MakeVector2D_ReturnValue) == 0x0000C8, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x0000D8, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000E8, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000F8, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_BreakVector2D_X_1) == 0x000108, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_BreakVector2D_Y_1) == 0x000110, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_Conv_StringToText_ReturnValue) == 0x000118, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_MakeVector2D_ReturnValue_2) == 0x000130, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_MakeVector2D_ReturnValue_3) == 0x000140, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_MakeVector2D_ReturnValue_4) == 0x000150, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_MakeVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_MakeVector2D_ReturnValue_5) == 0x000160, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_MakeVector2D_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_MakeVector2D_ReturnValue_6) == 0x000170, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_MakeVector2D_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_MakeVector2D_ReturnValue_7) == 0x000180, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_MakeVector2D_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_DrawLine_Thickness_ImplicitCast) == 0x000190, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_DrawLine_Thickness_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_DrawLine_Thickness_ImplicitCast_1) == 0x000194, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_DrawLine_Thickness_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_DrawLine_Thickness_ImplicitCast_2) == 0x000198, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_DrawLine_Thickness_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_MapPaint_C_OnPaint, CallFunc_DrawLine_Thickness_ImplicitCast_3) == 0x00019C, "Member 'WBP_MapPaint_C_OnPaint::CallFunc_DrawLine_Thickness_ImplicitCast_3' has a wrong offset!");

}

