#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CC_ArchetypeSelection

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CC_ArchetypeSelection.WBP_CC_ArchetypeSelection_C
// 0x0028 (0x0340 - 0x0318)
class UWBP_CC_ArchetypeSelection_C final : public UCC_ArchetypeSelection
{
public:
	class UWBP_ScrollWindow_CC_C*                 ContentScrollBox;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_PanelVignette;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    RaceSubheaderTextBlock_1;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CC_ArchetypeTrait_C*               WBP_CC_ArchetypeTrait;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CC_ArchetypeTrait_C*               WBP_CC_ArchetypeTrait_1;                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CC_ArchetypeSelection_C">();
	}
	static class UWBP_CC_ArchetypeSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CC_ArchetypeSelection_C>();
	}
};
static_assert(alignof(UWBP_CC_ArchetypeSelection_C) == 0x000008, "Wrong alignment on UWBP_CC_ArchetypeSelection_C");
static_assert(sizeof(UWBP_CC_ArchetypeSelection_C) == 0x000340, "Wrong size on UWBP_CC_ArchetypeSelection_C");
static_assert(offsetof(UWBP_CC_ArchetypeSelection_C, ContentScrollBox) == 0x000318, "Member 'UWBP_CC_ArchetypeSelection_C::ContentScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_CC_ArchetypeSelection_C, IMG_PanelVignette) == 0x000320, "Member 'UWBP_CC_ArchetypeSelection_C::IMG_PanelVignette' has a wrong offset!");
static_assert(offsetof(UWBP_CC_ArchetypeSelection_C, RaceSubheaderTextBlock_1) == 0x000328, "Member 'UWBP_CC_ArchetypeSelection_C::RaceSubheaderTextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_CC_ArchetypeSelection_C, WBP_CC_ArchetypeTrait) == 0x000330, "Member 'UWBP_CC_ArchetypeSelection_C::WBP_CC_ArchetypeTrait' has a wrong offset!");
static_assert(offsetof(UWBP_CC_ArchetypeSelection_C, WBP_CC_ArchetypeTrait_1) == 0x000338, "Member 'UWBP_CC_ArchetypeSelection_C::WBP_CC_ArchetypeTrait_1' has a wrong offset!");

}

