#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DragDropChatTab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DragDropChatTab.WBP_DragDropChatTab_C.ExecuteUbergraph_WBP_DragDropChatTab
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_DragDropChatTab_C_ExecuteUbergraph_WBP_DragDropChatTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00D0)()
};
static_assert(alignof(WBP_DragDropChatTab_C_ExecuteUbergraph_WBP_DragDropChatTab) == 0x000010, "Wrong alignment on WBP_DragDropChatTab_C_ExecuteUbergraph_WBP_DragDropChatTab");
static_assert(sizeof(WBP_DragDropChatTab_C_ExecuteUbergraph_WBP_DragDropChatTab) == 0x0000E0, "Wrong size on WBP_DragDropChatTab_C_ExecuteUbergraph_WBP_DragDropChatTab");
static_assert(offsetof(WBP_DragDropChatTab_C_ExecuteUbergraph_WBP_DragDropChatTab, EntryPoint) == 0x000000, "Member 'WBP_DragDropChatTab_C_ExecuteUbergraph_WBP_DragDropChatTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DragDropChatTab_C_ExecuteUbergraph_WBP_DragDropChatTab, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_DragDropChatTab_C_ExecuteUbergraph_WBP_DragDropChatTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DragDropChatTab_C_ExecuteUbergraph_WBP_DragDropChatTab, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'WBP_DragDropChatTab_C_ExecuteUbergraph_WBP_DragDropChatTab::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

}

