#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerHousingDebugUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerHousingDebugUI.WBP_PlayerHousingDebugUI_C
// 0x0020 (0x0360 - 0x0340)
class UWBP_PlayerHousingDebugUI_C final : public UPlayerHousingUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             LoadPrefabButtonText;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ReturnItemsButtonText;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SavePrefabButtonText;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_WBP_PlayerHousingDebugUI(int32 EntryPoint);
	void Construct();
	void BndEvt__PlayerHousingUI_PropListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerHousingDebugUI_C">();
	}
	static class UWBP_PlayerHousingDebugUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerHousingDebugUI_C>();
	}
};
static_assert(alignof(UWBP_PlayerHousingDebugUI_C) == 0x000008, "Wrong alignment on UWBP_PlayerHousingDebugUI_C");
static_assert(sizeof(UWBP_PlayerHousingDebugUI_C) == 0x000360, "Wrong size on UWBP_PlayerHousingDebugUI_C");
static_assert(offsetof(UWBP_PlayerHousingDebugUI_C, UberGraphFrame) == 0x000340, "Member 'UWBP_PlayerHousingDebugUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerHousingDebugUI_C, LoadPrefabButtonText) == 0x000348, "Member 'UWBP_PlayerHousingDebugUI_C::LoadPrefabButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerHousingDebugUI_C, ReturnItemsButtonText) == 0x000350, "Member 'UWBP_PlayerHousingDebugUI_C::ReturnItemsButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerHousingDebugUI_C, SavePrefabButtonText) == 0x000358, "Member 'UWBP_PlayerHousingDebugUI_C::SavePrefabButtonText' has a wrong offset!");

}

