#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DodgeRadial

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_DodgeRadial.WBP_DodgeRadial_C.ExecuteUbergraph_WBP_DodgeRadial
// 0x0068 (0x0068 - 0x0000)
struct WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             UniqueObjectNameForCooking_OutputDelegate;         // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAoCPlayerController*                   K2Node_DynamicCast_AsAo_CPlayer_Controller;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter*                         CallFunc_GetBaseCharacter_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAoCStatsComponent*                     CallFunc_GetStatsComponent_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameStat_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial) == 0x000008, "Wrong alignment on WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial");
static_assert(sizeof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial) == 0x000068, "Wrong size on WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial");
static_assert(offsetof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial, EntryPoint) == 0x000000, "Member 'WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial, UniqueObjectNameForCooking_OutputDelegate) == 0x000010, "Member 'WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial::UniqueObjectNameForCooking_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial, K2Node_DynamicCast_AsAo_CPlayer_Controller) == 0x000020, "Member 'WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial::K2Node_DynamicCast_AsAo_CPlayer_Controller' has a wrong offset!");
static_assert(offsetof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial, CallFunc_GetBaseCharacter_ReturnValue) == 0x000038, "Member 'WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial::CallFunc_GetBaseCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial, CallFunc_GetStatsComponent_ReturnValue) == 0x000040, "Member 'WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial::CallFunc_GetStatsComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial, CallFunc_GetGameStat_ReturnValue) == 0x000048, "Member 'WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial::CallFunc_GetGameStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial, CallFunc_SetValue_InValue_ImplicitCast) == 0x000060, "Member 'WBP_DodgeRadial_C_ExecuteUbergraph_WBP_DodgeRadial::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");

}

