#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LootWindowFrame

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LootWindowFrame.WBP_LootWindowFrame_C
// 0x0018 (0x0718 - 0x0700)
class UWBP_LootWindowFrame_C final : public UAoCWindow
{
public:
	class UWidgetAnimation*                       WindowOpenClose;                                   // 0x0700(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 HeaderPattern;                                     // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonIconButton_C*                    LootSettingsButton;                                // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LootWindowFrame_C">();
	}
	static class UWBP_LootWindowFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LootWindowFrame_C>();
	}
};
static_assert(alignof(UWBP_LootWindowFrame_C) == 0x000008, "Wrong alignment on UWBP_LootWindowFrame_C");
static_assert(sizeof(UWBP_LootWindowFrame_C) == 0x000718, "Wrong size on UWBP_LootWindowFrame_C");
static_assert(offsetof(UWBP_LootWindowFrame_C, WindowOpenClose) == 0x000700, "Member 'UWBP_LootWindowFrame_C::WindowOpenClose' has a wrong offset!");
static_assert(offsetof(UWBP_LootWindowFrame_C, HeaderPattern) == 0x000708, "Member 'UWBP_LootWindowFrame_C::HeaderPattern' has a wrong offset!");
static_assert(offsetof(UWBP_LootWindowFrame_C, LootSettingsButton) == 0x000710, "Member 'UWBP_LootWindowFrame_C::LootSettingsButton' has a wrong offset!");

}

