#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BotTeleportLocationWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BotTeleportLocationWidget.WBP_BotTeleportLocationWidget_C
// 0x0048 (0x0338 - 0x02F0)
class UWBP_BotTeleportLocationWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             LocationText;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RemoveButton;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TagText;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FBotTeleportLocation                   LocationData;                                      // 0x0310(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetData(const struct FBotTeleportLocation& InData);
	void ExecuteUbergraph_WBP_BotTeleportLocationWidget(int32 EntryPoint);
	void BndEvt__RemoveButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BotTeleportLocationWidget_C">();
	}
	static class UWBP_BotTeleportLocationWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BotTeleportLocationWidget_C>();
	}
};
static_assert(alignof(UWBP_BotTeleportLocationWidget_C) == 0x000008, "Wrong alignment on UWBP_BotTeleportLocationWidget_C");
static_assert(sizeof(UWBP_BotTeleportLocationWidget_C) == 0x000338, "Wrong size on UWBP_BotTeleportLocationWidget_C");
static_assert(offsetof(UWBP_BotTeleportLocationWidget_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_BotTeleportLocationWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BotTeleportLocationWidget_C, LocationText) == 0x0002F8, "Member 'UWBP_BotTeleportLocationWidget_C::LocationText' has a wrong offset!");
static_assert(offsetof(UWBP_BotTeleportLocationWidget_C, RemoveButton) == 0x000300, "Member 'UWBP_BotTeleportLocationWidget_C::RemoveButton' has a wrong offset!");
static_assert(offsetof(UWBP_BotTeleportLocationWidget_C, TagText) == 0x000308, "Member 'UWBP_BotTeleportLocationWidget_C::TagText' has a wrong offset!");
static_assert(offsetof(UWBP_BotTeleportLocationWidget_C, LocationData) == 0x000310, "Member 'UWBP_BotTeleportLocationWidget_C::LocationData' has a wrong offset!");

}

