#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JournalAccordion

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.ExecuteUbergraph_WBP_JournalAccordion
// 0x0028 (0x0028 - 0x0000)
struct WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_Story_Arc_Type_Icon;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Chapter_Text;                   // 0x0010(0x0018)()
};
static_assert(alignof(WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion) == 0x000008, "Wrong alignment on WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion");
static_assert(sizeof(WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion) == 0x000028, "Wrong size on WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion");
static_assert(offsetof(WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion, EntryPoint) == 0x000000, "Member 'WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion, K2Node_CustomEvent_Story_Arc_Type_Icon) == 0x000008, "Member 'WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion::K2Node_CustomEvent_Story_Arc_Type_Icon' has a wrong offset!");
static_assert(offsetof(WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion, K2Node_CustomEvent_Chapter_Text) == 0x000010, "Member 'WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion::K2Node_CustomEvent_Chapter_Text' has a wrong offset!");

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.GetBreadcrumbWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_JournalAccordion_C_GetBreadcrumbWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JournalAccordion_C_GetBreadcrumbWidget) == 0x000008, "Wrong alignment on WBP_JournalAccordion_C_GetBreadcrumbWidget");
static_assert(sizeof(WBP_JournalAccordion_C_GetBreadcrumbWidget) == 0x000008, "Wrong size on WBP_JournalAccordion_C_GetBreadcrumbWidget");
static_assert(offsetof(WBP_JournalAccordion_C_GetBreadcrumbWidget, ReturnValue) == 0x000000, "Member 'WBP_JournalAccordion_C_GetBreadcrumbWidget::ReturnValue' has a wrong offset!");

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.GetButtonContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_JournalAccordion_C_GetButtonContainer final
{
public:
	class UPanelWidget*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JournalAccordion_C_GetButtonContainer) == 0x000008, "Wrong alignment on WBP_JournalAccordion_C_GetButtonContainer");
static_assert(sizeof(WBP_JournalAccordion_C_GetButtonContainer) == 0x000008, "Wrong size on WBP_JournalAccordion_C_GetButtonContainer");
static_assert(offsetof(WBP_JournalAccordion_C_GetButtonContainer, ReturnValue) == 0x000000, "Member 'WBP_JournalAccordion_C_GetButtonContainer::ReturnValue' has a wrong offset!");

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.GetEvenButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_JournalAccordion_C_GetEvenButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JournalAccordion_C_GetEvenButtonStyle) == 0x000008, "Wrong alignment on WBP_JournalAccordion_C_GetEvenButtonStyle");
static_assert(sizeof(WBP_JournalAccordion_C_GetEvenButtonStyle) == 0x000008, "Wrong size on WBP_JournalAccordion_C_GetEvenButtonStyle");
static_assert(offsetof(WBP_JournalAccordion_C_GetEvenButtonStyle, ReturnValue) == 0x000000, "Member 'WBP_JournalAccordion_C_GetEvenButtonStyle::ReturnValue' has a wrong offset!");

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.GetOddButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_JournalAccordion_C_GetOddButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JournalAccordion_C_GetOddButtonStyle) == 0x000008, "Wrong alignment on WBP_JournalAccordion_C_GetOddButtonStyle");
static_assert(sizeof(WBP_JournalAccordion_C_GetOddButtonStyle) == 0x000008, "Wrong size on WBP_JournalAccordion_C_GetOddButtonStyle");
static_assert(offsetof(WBP_JournalAccordion_C_GetOddButtonStyle, ReturnValue) == 0x000000, "Member 'WBP_JournalAccordion_C_GetOddButtonStyle::ReturnValue' has a wrong offset!");

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.Set Chapter Text
// 0x0018 (0x0018 - 0x0000)
struct WBP_JournalAccordion_C_Set_Chapter_Text final
{
public:
	class FText                                   Chapter_Text;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_JournalAccordion_C_Set_Chapter_Text) == 0x000008, "Wrong alignment on WBP_JournalAccordion_C_Set_Chapter_Text");
static_assert(sizeof(WBP_JournalAccordion_C_Set_Chapter_Text) == 0x000018, "Wrong size on WBP_JournalAccordion_C_Set_Chapter_Text");
static_assert(offsetof(WBP_JournalAccordion_C_Set_Chapter_Text, Chapter_Text) == 0x000000, "Member 'WBP_JournalAccordion_C_Set_Chapter_Text::Chapter_Text' has a wrong offset!");

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.Set Story Arc Type Icon
// 0x0008 (0x0008 - 0x0000)
struct WBP_JournalAccordion_C_Set_Story_Arc_Type_Icon final
{
public:
	class UTexture2D*                             Story_Arc_Type_Icon;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JournalAccordion_C_Set_Story_Arc_Type_Icon) == 0x000008, "Wrong alignment on WBP_JournalAccordion_C_Set_Story_Arc_Type_Icon");
static_assert(sizeof(WBP_JournalAccordion_C_Set_Story_Arc_Type_Icon) == 0x000008, "Wrong size on WBP_JournalAccordion_C_Set_Story_Arc_Type_Icon");
static_assert(offsetof(WBP_JournalAccordion_C_Set_Story_Arc_Type_Icon, Story_Arc_Type_Icon) == 0x000000, "Member 'WBP_JournalAccordion_C_Set_Story_Arc_Type_Icon::Story_Arc_Type_Icon' has a wrong offset!");

}

