#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ResourceDropdown

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ResourceDropdown.WBP_ResourceDropdown_C
// 0x0028 (0x0318 - 0x02F0)
class UWBP_ResourceDropdown_C final : public UUserWidget
{
public:
	class UImage*                                 ArrowIcon;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonButton_C*                        DropdownButton;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        ItemIcon;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    ResourceName;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ResourceDropdown_C">();
	}
	static class UWBP_ResourceDropdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ResourceDropdown_C>();
	}
};
static_assert(alignof(UWBP_ResourceDropdown_C) == 0x000008, "Wrong alignment on UWBP_ResourceDropdown_C");
static_assert(sizeof(UWBP_ResourceDropdown_C) == 0x000318, "Wrong size on UWBP_ResourceDropdown_C");
static_assert(offsetof(UWBP_ResourceDropdown_C, ArrowIcon) == 0x0002F0, "Member 'UWBP_ResourceDropdown_C::ArrowIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ResourceDropdown_C, DropdownButton) == 0x0002F8, "Member 'UWBP_ResourceDropdown_C::DropdownButton' has a wrong offset!");
static_assert(offsetof(UWBP_ResourceDropdown_C, ItemIcon) == 0x000300, "Member 'UWBP_ResourceDropdown_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ResourceDropdown_C, MenuAnchor) == 0x000308, "Member 'UWBP_ResourceDropdown_C::MenuAnchor' has a wrong offset!");
static_assert(offsetof(UWBP_ResourceDropdown_C, ResourceName) == 0x000310, "Member 'UWBP_ResourceDropdown_C::ResourceName' has a wrong offset!");

}

