#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterStatsContainer

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterStatsContainer.WBP_CharacterStatsContainer_C
// 0x0030 (0x0328 - 0x02F8)
class UWBP_CharacterStatsContainer_C final : public UBaseAlternatingBorderContainer
{
public:
	class UWBP_CharacterStatItem_C*               WBP_CharacterStatItem;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterStatItem_C*               WBP_CharacterStatItem_1;                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterStatItem_C*               WBP_CharacterStatItem_2;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterStatItem_C*               WBP_CharacterStatItem_3;                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterStatItem_C*               WBP_CharacterStatItem_4;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterStatItem_C*               WBP_CharacterStatItem_5;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterStatsContainer_C">();
	}
	static class UWBP_CharacterStatsContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterStatsContainer_C>();
	}
};
static_assert(alignof(UWBP_CharacterStatsContainer_C) == 0x000008, "Wrong alignment on UWBP_CharacterStatsContainer_C");
static_assert(sizeof(UWBP_CharacterStatsContainer_C) == 0x000328, "Wrong size on UWBP_CharacterStatsContainer_C");
static_assert(offsetof(UWBP_CharacterStatsContainer_C, WBP_CharacterStatItem) == 0x0002F8, "Member 'UWBP_CharacterStatsContainer_C::WBP_CharacterStatItem' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterStatsContainer_C, WBP_CharacterStatItem_1) == 0x000300, "Member 'UWBP_CharacterStatsContainer_C::WBP_CharacterStatItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterStatsContainer_C, WBP_CharacterStatItem_2) == 0x000308, "Member 'UWBP_CharacterStatsContainer_C::WBP_CharacterStatItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterStatsContainer_C, WBP_CharacterStatItem_3) == 0x000310, "Member 'UWBP_CharacterStatsContainer_C::WBP_CharacterStatItem_3' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterStatsContainer_C, WBP_CharacterStatItem_4) == 0x000318, "Member 'UWBP_CharacterStatsContainer_C::WBP_CharacterStatItem_4' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterStatsContainer_C, WBP_CharacterStatItem_5) == 0x000320, "Member 'UWBP_CharacterStatsContainer_C::WBP_CharacterStatItem_5' has a wrong offset!");

}

