#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RespawnAlert

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RespawnAlert.WBP_RespawnAlert_C
// 0x0040 (0x0638 - 0x05F8)
class UWBP_RespawnAlert_C final : public URespawnAlert
{
public:
	class UAoCCommonTextBlock*                    CorruptionMessage;                                 // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextButton_C*                    DeathSummaryButton;                                // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LocationsContainer;                                // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LocationsMap;                                      // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ConfirmationButtonBar_C*           ResurrectConfirmationBar;                          // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextButton_C*                    ReviveAtHomeButton;                                // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReviveBarFrame;                                    // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ReviveProgressBar;                                 // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RespawnAlert_C">();
	}
	static class UWBP_RespawnAlert_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RespawnAlert_C>();
	}
};
static_assert(alignof(UWBP_RespawnAlert_C) == 0x000008, "Wrong alignment on UWBP_RespawnAlert_C");
static_assert(sizeof(UWBP_RespawnAlert_C) == 0x000638, "Wrong size on UWBP_RespawnAlert_C");
static_assert(offsetof(UWBP_RespawnAlert_C, CorruptionMessage) == 0x0005F8, "Member 'UWBP_RespawnAlert_C::CorruptionMessage' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnAlert_C, DeathSummaryButton) == 0x000600, "Member 'UWBP_RespawnAlert_C::DeathSummaryButton' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnAlert_C, LocationsContainer) == 0x000608, "Member 'UWBP_RespawnAlert_C::LocationsContainer' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnAlert_C, LocationsMap) == 0x000610, "Member 'UWBP_RespawnAlert_C::LocationsMap' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnAlert_C, ResurrectConfirmationBar) == 0x000618, "Member 'UWBP_RespawnAlert_C::ResurrectConfirmationBar' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnAlert_C, ReviveAtHomeButton) == 0x000620, "Member 'UWBP_RespawnAlert_C::ReviveAtHomeButton' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnAlert_C, ReviveBarFrame) == 0x000628, "Member 'UWBP_RespawnAlert_C::ReviveBarFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RespawnAlert_C, ReviveProgressBar) == 0x000630, "Member 'UWBP_RespawnAlert_C::ReviveProgressBar' has a wrong offset!");

}

