#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActiveCommissionCardThumb

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActiveCommissionCardThumb.WBP_ActiveCommissionCardThumb_C
// 0x0078 (0x0368 - 0x02F0)
class UWBP_ActiveCommissionCardThumb_C final : public UUserWidget
{
public:
	class UImage*                                 BaseBackgroundImage;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    CommissionNameTextBlock;                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CommissionOverlay;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CommissionTypeIcon;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EmptySlotOverlay;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    LevelTextBlock;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainOverlay;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityBackgroundImage;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityBorder;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatusImage;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               StatusOverlay;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    StatusTextBlock;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon;                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon_1;                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ActiveCommissionCardThumb_C">();
	}
	static class UWBP_ActiveCommissionCardThumb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActiveCommissionCardThumb_C>();
	}
};
static_assert(alignof(UWBP_ActiveCommissionCardThumb_C) == 0x000008, "Wrong alignment on UWBP_ActiveCommissionCardThumb_C");
static_assert(sizeof(UWBP_ActiveCommissionCardThumb_C) == 0x000368, "Wrong size on UWBP_ActiveCommissionCardThumb_C");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, BaseBackgroundImage) == 0x0002F0, "Member 'UWBP_ActiveCommissionCardThumb_C::BaseBackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, Button) == 0x0002F8, "Member 'UWBP_ActiveCommissionCardThumb_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, CommissionNameTextBlock) == 0x000300, "Member 'UWBP_ActiveCommissionCardThumb_C::CommissionNameTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, CommissionOverlay) == 0x000308, "Member 'UWBP_ActiveCommissionCardThumb_C::CommissionOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, CommissionTypeIcon) == 0x000310, "Member 'UWBP_ActiveCommissionCardThumb_C::CommissionTypeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, EmptySlotOverlay) == 0x000318, "Member 'UWBP_ActiveCommissionCardThumb_C::EmptySlotOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, LevelTextBlock) == 0x000320, "Member 'UWBP_ActiveCommissionCardThumb_C::LevelTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, MainOverlay) == 0x000328, "Member 'UWBP_ActiveCommissionCardThumb_C::MainOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, RarityBackgroundImage) == 0x000330, "Member 'UWBP_ActiveCommissionCardThumb_C::RarityBackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, RarityBorder) == 0x000338, "Member 'UWBP_ActiveCommissionCardThumb_C::RarityBorder' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, StatusImage) == 0x000340, "Member 'UWBP_ActiveCommissionCardThumb_C::StatusImage' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, StatusOverlay) == 0x000348, "Member 'UWBP_ActiveCommissionCardThumb_C::StatusOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, StatusTextBlock) == 0x000350, "Member 'UWBP_ActiveCommissionCardThumb_C::StatusTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, WBP_RewardContainerIcon) == 0x000358, "Member 'UWBP_ActiveCommissionCardThumb_C::WBP_RewardContainerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveCommissionCardThumb_C, WBP_RewardContainerIcon_1) == 0x000360, "Member 'UWBP_ActiveCommissionCardThumb_C::WBP_RewardContainerIcon_1' has a wrong offset!");

}

