#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CombatTooltipGenerator

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "Engine_structs.hpp"
#include "DesignDataPlugin_structs.hpp"


namespace SDK::Params
{

// Function WBP_CombatTooltipGenerator.WBP_CombatTooltipGenerator_C.RecurseFindRecord
// 0x3E028 (0x3E028 - 0x0000)
struct WBP_CombatTooltipGenerator_C_RecurseFindRecord final
{
public:
	class FString                                 Input;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FAoCAbilityRecord                      AbilityRecord;                                     // 0x0010(0x1020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FAbilityHitRecord                      HitRecord;                                         // 0x1030(0x0A30)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEffectRecord                          EffectRecord;                                      // 0x1A60(0x0788)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FStatModRecord                         StatModRecord;                                     // 0x21E8(0x0110)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLingeringEffectRecord                 LingeringEffectRecord;                             // 0x22F8(0x03B8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FProjectileRecord                      ProjectileRecord;                                  // 0x26B0(0x0460)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FReactionRecord                        ReactionRecord;                                    // 0x2B10(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FAbilityHitRecord                      Hit;                                               // 0x2BD0(0x0A30)(Parm, OutParm)
	struct FEffectRecord                          Effect;                                            // 0x3600(0x0788)(Parm, OutParm)
	struct FStatModRecord                         StatMod;                                           // 0x3D88(0x0110)(Parm, OutParm)
	struct FLingeringEffectRecord                 LingeringEffect;                                   // 0x3E98(0x03B8)(Parm, OutParm)
	struct FProjectileRecord                      Projectile;                                        // 0x4250(0x0460)(Parm, OutParm)
	struct FReactionRecord                        reaction;                                          // 0x46B0(0x00C0)(Parm, OutParm)
	class FString                                 rest;                                              // 0x4770(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 argDelim;                                          // 0x4780(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 typeDelim;                                         // 0x4790(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x47A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 argers;                                            // 0x47B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue;          // 0x47C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue_1;        // 0x47C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue_2;        // 0x47C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue_3;        // 0x47C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue_4;        // 0x47C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue_5;        // 0x47C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue_6;        // 0x47C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C7[0x1];                                     // 0x47C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDelimRest_left;                        // 0x47C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDelimRest_rest;                        // 0x47D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAbilityHitRecord                      K2Node_MakeStruct_AbilityHitRecord;                // 0x47E8(0x0A30)()
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x5218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x5228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5229[0x3];                                     // 0x5229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x522C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x5230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x5231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5232[0x6];                                     // 0x5232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue;           // 0x5238(0x0A30)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x5C68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C69[0x7];                                     // 0x5C69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit;                    // 0x5C70(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect;                 // 0x66A0(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod;                // 0x6E28(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect;        // 0x6F38(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile;             // 0x72F0(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction;               // 0x7750(0x00C0)()
	bool                                          CallFunc_IsNumeric_ReturnValue;                    // 0x7810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x7811(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7812[0x6];                                     // 0x7812(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x7818(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x7828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7829[0x3];                                     // 0x7829(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x782C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x7830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7831[0x7];                                     // 0x7831(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReactionRecord                        CallFunc_GetReactionRecordByGuid_ReturnValue;      // 0x7838(0x00C0)(ConstParm)
	bool                                          CallFunc_Contains_ReturnValue_3;                   // 0x78F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78F9[0x7];                                     // 0x78F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_1;                  // 0x7900(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_1;               // 0x8330(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_1;              // 0x8AB8(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_1;      // 0x8BC8(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_1;           // 0x8F80(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_1;             // 0x93E0(0x00C0)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x94A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_1;                  // 0x94A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x94A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x94A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94A4[0x4];                                     // 0x94A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDelimRest_left_1;                      // 0x94A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDelimRest_rest_1;                      // 0x94B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_2;                    // 0x94C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x94D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_2;           // 0x94E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94E4[0x4];                                     // 0x94E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReactionRecord                        CallFunc_GetReactionRecordByName_ReturnValue;      // 0x94E8(0x00C0)(ConstParm)
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_2;                  // 0x95A8(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_2;               // 0x9FD8(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_2;              // 0xA760(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_2;      // 0xA870(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_2;           // 0xAC28(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_2;             // 0xB088(0x00C0)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0xB148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B149[0x7];                                     // 0xB149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectRecord                          CallFunc_GetEffectRecordByGuid_ReturnValue;        // 0xB150(0x0788)(ConstParm)
	bool                                          CallFunc_Contains_ReturnValue_4;                   // 0xB8D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_2;                  // 0xB8D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0xB8DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_5;                   // 0xB8DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0xB8DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8DD[0x3];                                     // 0xB8DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_3;                    // 0xB8E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_6;                   // 0xB8F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8F1[0x3];                                     // 0xB8F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_3;           // 0xB8F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0xB8F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_7;                   // 0xB8F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8FA[0x6];                                     // 0xB8FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue_1;         // 0xB900(0x0A30)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0xC330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C331[0x7];                                     // 0xC331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_3;                  // 0xC338(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_3;               // 0xCD68(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_3;              // 0xD4F0(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_3;      // 0xD600(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_3;           // 0xD9B8(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_3;             // 0xDE18(0x00C0)()
	bool                                          CallFunc_IsNumeric_ReturnValue_3;                  // 0xDED8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0xDED9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DEDA[0x6];                                     // 0xDEDA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_4;                    // 0xDEE0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_8;                   // 0xDEF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DEF1[0x3];                                     // 0xDEF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_4;           // 0xDEF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_4;         // 0xDEF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_9;                   // 0xDEF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DEFA[0x6];                                     // 0xDEFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue_2;         // 0xDF00(0x0A30)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0xE930(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E931[0x7];                                     // 0xE931(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_4;                  // 0xE938(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_4;               // 0xF368(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_4;              // 0xFAF0(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_4;      // 0xFC00(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_4;           // 0xFFB8(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_4;             // 0x10418(0x00C0)()
	bool                                          CallFunc_IsNumeric_ReturnValue_4;                  // 0x104D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x104D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104DA[0x6];                                    // 0x104DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_5;                    // 0x104E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_10;                  // 0x104F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104F1[0x3];                                    // 0x104F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_5;           // 0x104F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_5;         // 0x104F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_11;                  // 0x104F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104FA[0x6];                                    // 0x104FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue_3;         // 0x10500(0x0A30)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x10F30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10F31[0x7];                                    // 0x10F31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_5;                  // 0x10F38(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_5;               // 0x11968(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_5;              // 0x120F0(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_5;      // 0x12200(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_5;           // 0x125B8(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_5;             // 0x12A18(0x00C0)()
	bool                                          CallFunc_IsNumeric_ReturnValue_5;                  // 0x12AD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x12AD9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12ADA[0x6];                                    // 0x12ADA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_6;                    // 0x12AE0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_12;                  // 0x12AF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12AF1[0x3];                                    // 0x12AF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_6;           // 0x12AF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_6;         // 0x12AF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_13;                  // 0x12AF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12AFA[0x6];                                    // 0x12AFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue_4;         // 0x12B00(0x0A30)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x13530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13531[0x7];                                    // 0x13531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_6;                  // 0x13538(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_6;               // 0x13F68(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_6;              // 0x146F0(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_6;      // 0x14800(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_6;           // 0x14BB8(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_6;             // 0x15018(0x00C0)()
	bool                                          CallFunc_IsNumeric_ReturnValue_6;                  // 0x150D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x150D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_150DA[0x6];                                    // 0x150DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_7;                    // 0x150E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_14;                  // 0x150F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_150F1[0x3];                                    // 0x150F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_7;           // 0x150F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_7;         // 0x150F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_15;                  // 0x150F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_150FA[0x6];                                    // 0x150FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue_5;         // 0x15100(0x0A30)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x15B30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B31[0x7];                                    // 0x15B31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_7;                  // 0x15B38(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_7;               // 0x16568(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_7;              // 0x16CF0(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_7;      // 0x16E00(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_7;           // 0x171B8(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_7;             // 0x17618(0x00C0)()
	bool                                          CallFunc_IsNumeric_ReturnValue_7;                  // 0x176D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x176D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_176DA[0x6];                                    // 0x176DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_8;                    // 0x176E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_16;                  // 0x176F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_176F1[0x3];                                    // 0x176F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_8;           // 0x176F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_8;         // 0x176F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_17;                  // 0x176F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_176FA[0x6];                                    // 0x176FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue_6;         // 0x17700(0x0A30)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x18130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18131[0x7];                                    // 0x18131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_8;                  // 0x18138(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_8;               // 0x18B68(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_8;              // 0x192F0(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_8;      // 0x19400(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_8;           // 0x197B8(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_8;             // 0x19C18(0x00C0)()
	bool                                          CallFunc_IsNumeric_ReturnValue_8;                  // 0x19CD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x19CD9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19CDA[0x6];                                    // 0x19CDA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_9;                    // 0x19CE0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_18;                  // 0x19CF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19CF1[0x3];                                    // 0x19CF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_9;           // 0x19CF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_9;         // 0x19CF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_19;                  // 0x19CF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19CFA[0x6];                                    // 0x19CFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectRecord                          CallFunc_GetEffectRecordByGuid_ReturnValue_1;      // 0x19D00(0x0788)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x1A488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_9;                  // 0x1A489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x1A48A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_1;        // 0x1A48B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A48C[0x4];                                    // 0x1A48C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDelimRest_left_2;                      // 0x1A490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDelimRest_rest_2;                      // 0x1A4A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x1A4B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatModRecord                         CallFunc_GetStatModRecordByName_ReturnValue;       // 0x1A4B8(0x0110)(ConstParm)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_2;        // 0x1A5C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5C9[0x7];                                    // 0x1A5C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_9;                  // 0x1A5D0(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_9;               // 0x1B000(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_9;              // 0x1B788(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_9;      // 0x1B898(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_9;           // 0x1BC50(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_9;             // 0x1C0B0(0x00C0)()
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_3;        // 0x1C170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_4;        // 0x1C171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C172[0x6];                                    // 0x1C172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDelimRest_left_3;                      // 0x1C178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDelimRest_rest_3;                      // 0x1C188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDelimRest_left_4;                      // 0x1C198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDelimRest_rest_4;                      // 0x1C1A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x1C1B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x1C1C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FProjectileRecord                      CallFunc_GetProjectileRecordByName_ReturnValue;    // 0x1C1C8(0x0460)(ConstParm)
	struct FLingeringEffectRecord                 CallFunc_GetLingeringEffectRecordByName_ReturnValue; // 0x1C628(0x03B8)(ConstParm)
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_10;                 // 0x1C9E0(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_10;              // 0x1D410(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_10;             // 0x1DB98(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_10;     // 0x1DCA8(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_10;          // 0x1E060(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_10;            // 0x1E4C0(0x00C0)()
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_11;                 // 0x1E580(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_11;              // 0x1EFB0(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_11;             // 0x1F738(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_11;     // 0x1F848(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_11;          // 0x1FC00(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_11;            // 0x20060(0x00C0)()
	class FString                                 CallFunc_GetDelimRest_left_5;                      // 0x20120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDelimRest_rest_5;                      // 0x20130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDelimRest_left_6;                      // 0x20140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDelimRest_rest_6;                      // 0x20150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x20160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_5;          // 0x20168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEffectRecord                          CallFunc_GetEffectRecordByName_ReturnValue;        // 0x20170(0x0788)(ConstParm)
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByName_ReturnValue;           // 0x208F8(0x0A30)(ConstParm)
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_12;                 // 0x21328(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_12;              // 0x21D58(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_12;             // 0x224E0(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_12;     // 0x225F0(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_12;          // 0x229A8(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_12;            // 0x22E08(0x00C0)()
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_13;                 // 0x22EC8(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_13;              // 0x238F8(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_13;             // 0x24080(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_13;     // 0x24190(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_13;          // 0x24548(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_13;            // 0x249A8(0x00C0)()
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_5;        // 0x24A68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A69[0x7];                                    // 0x24A69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_10;                   // 0x24A70(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_10;          // 0x24A80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_20;                  // 0x24A84(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_10;        // 0x24A85(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x24A86(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_10;                 // 0x24A87(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x24A88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A89[0x7];                                    // 0x24A89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatModRecord                         CallFunc_GetStatModRecordByGuid_ReturnValue;       // 0x24A90(0x0110)(ConstParm)
	bool                                          CallFunc_Contains_ReturnValue_21;                  // 0x24BA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24BA1[0x7];                                    // 0x24BA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_11;                   // 0x24BA8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_22;                  // 0x24BB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24BB9[0x3];                                    // 0x24BB9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_11;          // 0x24BBC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_11;        // 0x24BC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_23;                  // 0x24BC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24BC2[0x6];                                    // 0x24BC2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue_7;         // 0x24BC8(0x0A30)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x255F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255F9[0x7];                                    // 0x255F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_14;                 // 0x25600(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_14;              // 0x26030(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_14;             // 0x267B8(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_14;     // 0x268C8(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_14;          // 0x26C80(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_14;            // 0x270E0(0x00C0)()
	bool                                          CallFunc_IsNumeric_ReturnValue_11;                 // 0x271A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x271A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271A2[0x6];                                    // 0x271A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_12;                   // 0x271A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_24;                  // 0x271B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271B9[0x3];                                    // 0x271B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_12;          // 0x271BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_12;        // 0x271C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_25;                  // 0x271C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271C2[0x6];                                    // 0x271C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue_8;         // 0x271C8(0x0A30)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x27BF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27BF9[0x7];                                    // 0x27BF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_15;                 // 0x27C00(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_15;              // 0x28630(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_15;             // 0x28DB8(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_15;     // 0x28EC8(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_15;          // 0x29280(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_15;            // 0x296E0(0x00C0)()
	bool                                          CallFunc_IsNumeric_ReturnValue_12;                 // 0x297A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x297A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297A2[0x6];                                    // 0x297A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_13;                   // 0x297A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_26;                  // 0x297B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297B9[0x3];                                    // 0x297B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_13;          // 0x297BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_13;        // 0x297C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_27;                  // 0x297C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297C2[0x6];                                    // 0x297C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue_9;         // 0x297C8(0x0A30)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_13;               // 0x2A1F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1F9[0x7];                                    // 0x2A1F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_16;                 // 0x2A200(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_16;              // 0x2AC30(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_16;             // 0x2B3B8(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_16;     // 0x2B4C8(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_16;          // 0x2B880(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_16;            // 0x2BCE0(0x00C0)()
	bool                                          CallFunc_IsNumeric_ReturnValue_13;                 // 0x2BDA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x2BDA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BDA2[0x6];                                    // 0x2BDA2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_14;                   // 0x2BDA8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_28;                  // 0x2BDB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BDB9[0x3];                                    // 0x2BDB9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_14;          // 0x2BDBC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_14;        // 0x2BDC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_29;                  // 0x2BDC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BDC2[0x6];                                    // 0x2BDC2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue_10;        // 0x2BDC8(0x0A30)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_14;               // 0x2C7F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C7F9[0x7];                                    // 0x2C7F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_17;                 // 0x2C800(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_17;              // 0x2D230(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_17;             // 0x2D9B8(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_17;     // 0x2DAC8(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_17;          // 0x2DE80(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_17;            // 0x2E2E0(0x00C0)()
	bool                                          CallFunc_IsNumeric_ReturnValue_14;                 // 0x2E3A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x2E3A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E3A2[0x6];                                    // 0x2E3A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_15;                   // 0x2E3A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_30;                  // 0x2E3B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E3B9[0x3];                                    // 0x2E3B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_15;          // 0x2E3BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_15;        // 0x2E3C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_31;                  // 0x2E3C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E3C2[0x6];                                    // 0x2E3C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_GetHitRecordByGuid_ReturnValue_11;        // 0x2E3C8(0x0A30)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_15;               // 0x2EDF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EDF9[0x7];                                    // 0x2EDF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityHitRecord                      CallFunc_RecurseFindRecord_hit_18;                 // 0x2EE00(0x0A30)()
	struct FEffectRecord                          CallFunc_RecurseFindRecord_effect_18;              // 0x2F830(0x0788)()
	struct FStatModRecord                         CallFunc_RecurseFindRecord_statMod_18;             // 0x2FFB8(0x0110)()
	struct FLingeringEffectRecord                 CallFunc_RecurseFindRecord_lingeringEffect_18;     // 0x300C8(0x03B8)()
	struct FProjectileRecord                      CallFunc_RecurseFindRecord_projectile_18;          // 0x30480(0x0460)()
	struct FReactionRecord                        CallFunc_RecurseFindRecord_reaction_18;            // 0x308E0(0x00C0)()
	bool                                          CallFunc_IsNumeric_ReturnValue_15;                 // 0x309A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_15;                // 0x309A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309A2[0x6];                                    // 0x309A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_16;                   // 0x309A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_32;                  // 0x309B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309B9[0x3];                                    // 0x309B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_16;          // 0x309BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
