#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuyOrderFulfillmentDetails

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BuyOrderFulfillmentDetails.WBP_BuyOrderFulfillmentDetails_C
// 0x0020 (0x03F0 - 0x03D0)
class UWBP_BuyOrderFulfillmentDetails_C final : public UBuyOrderFulfillmentDetails
{
public:
	class UImage*                                 Currency1Icon;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextDropdown_C*                    RarityDropdown;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TB_TotalValue;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextDropdown_C*                    WBP_Dropdown;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BuyOrderFulfillmentDetails_C">();
	}
	static class UWBP_BuyOrderFulfillmentDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BuyOrderFulfillmentDetails_C>();
	}
};
static_assert(alignof(UWBP_BuyOrderFulfillmentDetails_C) == 0x000008, "Wrong alignment on UWBP_BuyOrderFulfillmentDetails_C");
static_assert(sizeof(UWBP_BuyOrderFulfillmentDetails_C) == 0x0003F0, "Wrong size on UWBP_BuyOrderFulfillmentDetails_C");
static_assert(offsetof(UWBP_BuyOrderFulfillmentDetails_C, Currency1Icon) == 0x0003D0, "Member 'UWBP_BuyOrderFulfillmentDetails_C::Currency1Icon' has a wrong offset!");
static_assert(offsetof(UWBP_BuyOrderFulfillmentDetails_C, RarityDropdown) == 0x0003D8, "Member 'UWBP_BuyOrderFulfillmentDetails_C::RarityDropdown' has a wrong offset!");
static_assert(offsetof(UWBP_BuyOrderFulfillmentDetails_C, TB_TotalValue) == 0x0003E0, "Member 'UWBP_BuyOrderFulfillmentDetails_C::TB_TotalValue' has a wrong offset!");
static_assert(offsetof(UWBP_BuyOrderFulfillmentDetails_C, WBP_Dropdown) == 0x0003E8, "Member 'UWBP_BuyOrderFulfillmentDetails_C::WBP_Dropdown' has a wrong offset!");

}

