#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CurrentWarSummaryItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CurrentWarSummaryItem.WBP_CurrentWarSummaryItem_C
// 0x0030 (0x0350 - 0x0320)
class UWBP_CurrentWarSummaryItem_C final : public UCurrentWarSummaryItem
{
public:
	class UImage*                                 AttackerNodeIcon;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DefenderNodeIcon;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    EventInfoTextBlock;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    EventPOILocation;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    NextEventIndicator;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAoCCommonTextBlock*                    PhaseStatusTextBlock;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CurrentWarSummaryItem_C">();
	}
	static class UWBP_CurrentWarSummaryItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CurrentWarSummaryItem_C>();
	}
};
static_assert(alignof(UWBP_CurrentWarSummaryItem_C) == 0x000008, "Wrong alignment on UWBP_CurrentWarSummaryItem_C");
static_assert(sizeof(UWBP_CurrentWarSummaryItem_C) == 0x000350, "Wrong size on UWBP_CurrentWarSummaryItem_C");
static_assert(offsetof(UWBP_CurrentWarSummaryItem_C, AttackerNodeIcon) == 0x000320, "Member 'UWBP_CurrentWarSummaryItem_C::AttackerNodeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CurrentWarSummaryItem_C, DefenderNodeIcon) == 0x000328, "Member 'UWBP_CurrentWarSummaryItem_C::DefenderNodeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CurrentWarSummaryItem_C, EventInfoTextBlock) == 0x000330, "Member 'UWBP_CurrentWarSummaryItem_C::EventInfoTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_CurrentWarSummaryItem_C, EventPOILocation) == 0x000338, "Member 'UWBP_CurrentWarSummaryItem_C::EventPOILocation' has a wrong offset!");
static_assert(offsetof(UWBP_CurrentWarSummaryItem_C, NextEventIndicator) == 0x000340, "Member 'UWBP_CurrentWarSummaryItem_C::NextEventIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_CurrentWarSummaryItem_C, PhaseStatusTextBlock) == 0x000348, "Member 'UWBP_CurrentWarSummaryItem_C::PhaseStatusTextBlock' has a wrong offset!");

}

