#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BetaIDDisplay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_BetaIDDisplay.WBP_BetaIDDisplay_C.ExecuteUbergraph_WBP_BetaIDDisplay
// 0x0070 (0x0070 - 0x0000)
struct WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay) == 0x000008, "Wrong alignment on WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay");
static_assert(sizeof(WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay) == 0x000070, "Wrong size on WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay");
static_assert(offsetof(WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay, EntryPoint) == 0x000000, "Member 'WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay, Temp_int_Variable) == 0x000004, "Member 'WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay, Temp_struct_Variable) == 0x000008, "Member 'WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay, Temp_struct_Variable_2) == 0x000028, "Member 'WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay, Temp_struct_Variable_3) == 0x000038, "Member 'WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x000048, "Member 'WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000050, "Member 'WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay, K2Node_Select_Default) == 0x000060, "Member 'WBP_BetaIDDisplay_C_ExecuteUbergraph_WBP_BetaIDDisplay::K2Node_Select_Default' has a wrong offset!");

}

