#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SearchField

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SearchField.WBP_SearchField_C
// 0x0018 (0x0350 - 0x0338)
class UWBP_SearchField_C final : public USearchField
{
public:
	class UCommonButton_C*                        ClearTextButton;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SearchButtonIcon;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SearchFieldIcon;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SearchField_C">();
	}
	static class UWBP_SearchField_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SearchField_C>();
	}
};
static_assert(alignof(UWBP_SearchField_C) == 0x000008, "Wrong alignment on UWBP_SearchField_C");
static_assert(sizeof(UWBP_SearchField_C) == 0x000350, "Wrong size on UWBP_SearchField_C");
static_assert(offsetof(UWBP_SearchField_C, ClearTextButton) == 0x000338, "Member 'UWBP_SearchField_C::ClearTextButton' has a wrong offset!");
static_assert(offsetof(UWBP_SearchField_C, SearchButtonIcon) == 0x000340, "Member 'UWBP_SearchField_C::SearchButtonIcon' has a wrong offset!");
static_assert(offsetof(UWBP_SearchField_C, SearchFieldIcon) == 0x000348, "Member 'UWBP_SearchField_C::SearchFieldIcon' has a wrong offset!");

}

