#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponCombo_RngWnd_Projectile

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponCombo_RngWnd_Projectile.WeaponCombo_RngWnd_Projectile_C
// 0x0018 (0x05B0 - 0x0598)
class AWeaponCombo_RngWnd_Projectile_C : public AAoCAbilityProjectile
{
public:
	class UParticleSystemComponent*               ParticleSystem2;                                   // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem1;                                   // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponCombo_RngWnd_Projectile_C">();
	}
	static class AWeaponCombo_RngWnd_Projectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeaponCombo_RngWnd_Projectile_C>();
	}
};
static_assert(alignof(AWeaponCombo_RngWnd_Projectile_C) == 0x000008, "Wrong alignment on AWeaponCombo_RngWnd_Projectile_C");
static_assert(sizeof(AWeaponCombo_RngWnd_Projectile_C) == 0x0005B0, "Wrong size on AWeaponCombo_RngWnd_Projectile_C");
static_assert(offsetof(AWeaponCombo_RngWnd_Projectile_C, ParticleSystem2) == 0x000598, "Member 'AWeaponCombo_RngWnd_Projectile_C::ParticleSystem2' has a wrong offset!");
static_assert(offsetof(AWeaponCombo_RngWnd_Projectile_C, Audio) == 0x0005A0, "Member 'AWeaponCombo_RngWnd_Projectile_C::Audio' has a wrong offset!");
static_assert(offsetof(AWeaponCombo_RngWnd_Projectile_C, ParticleSystem1) == 0x0005A8, "Member 'AWeaponCombo_RngWnd_Projectile_C::ParticleSystem1' has a wrong offset!");

}

