#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WmfMediaFactory

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class WmfMediaFactory.WmfMediaSettings
// 0x0008 (0x0050 - 0x0048)
class UWmfMediaSettings final : public UObject
{
public:
	bool                                          AllowNonStandardCodecs;                            // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LowLatency;                                        // 0x0049(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NativeAudioOut;                                    // 0x004A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HardwareAcceleratedVideoDecoding;                  // 0x004B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WmfMediaSettings">();
	}
	static class UWmfMediaSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWmfMediaSettings>();
	}
};
static_assert(alignof(UWmfMediaSettings) == 0x000008, "Wrong alignment on UWmfMediaSettings");
static_assert(sizeof(UWmfMediaSettings) == 0x000050, "Wrong size on UWmfMediaSettings");
static_assert(offsetof(UWmfMediaSettings, AllowNonStandardCodecs) == 0x000048, "Member 'UWmfMediaSettings::AllowNonStandardCodecs' has a wrong offset!");
static_assert(offsetof(UWmfMediaSettings, LowLatency) == 0x000049, "Member 'UWmfMediaSettings::LowLatency' has a wrong offset!");
static_assert(offsetof(UWmfMediaSettings, NativeAudioOut) == 0x00004A, "Member 'UWmfMediaSettings::NativeAudioOut' has a wrong offset!");
static_assert(offsetof(UWmfMediaSettings, HardwareAcceleratedVideoDecoding) == 0x00004B, "Member 'UWmfMediaSettings::HardwareAcceleratedVideoDecoding' has a wrong offset!");

}

